{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-chime-rigdzin/beautiful-adornment-of-faith-prayer-tsultrim-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་དམ་པ་ཚུལ་ཁྲིམས་བློ་གྲོས་མཆོག་གི་གསོལ་འདེབས་དད་པའི་མཛེས་རྒྱན་བཞུགས།",
    "en": "A Prayer to the Sublime Khenchen Tsultrim Lodrö"
  },
  "text": [
    {
      "bo": "མདོ་སྔགས་ཆོས་ཀྱི་ཆུ་བོ་མ་ལུས་པ། །",
      "en": "All the rivers of  sūtra and mantra Dharma",
      "en-trans": "do ngak chö kyi chuwo malüpa"
    },
    {
      "bo": "མཁྱེན་པའི་རྒྱ་མཚོ་གཅིག་ཏུ་འཁྱིལ་བ་ཡི། །",
      "en": "Flow into the single ocean of your wisdom—",
      "en-trans": "khyenpé gyatso chik tu khyilwa yi"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་དངོས་མི་ཕམ་རྒྱ་མཚོ་ལ། །",
      "en": "Mipham Gyatso, Mañjughoṣa in person,",
      "en-trans": "jampal yang ngö mipam gyatso la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས། །",
      "en": "To you I pray: look on me with eyes of wisdom!",
      "en-trans": "solwa deb so yeshe chen gyi zik"
    },
    {
      "bo": "མགོན་དེའི་ཐུགས་ཀའི་དམར་སེར་དྷཱི་ཡིག་གི །",
      "en": "From the orange syllabledhīḥat the lord’s enlightened heart,",
      "en-trans": "gön dé tukké marser dhi yik gi"
    },
    {
      "bo": "འཕྲིན་ལས་འོད་ཟེར་གདུལ་བྱའི་དཔལ་དུ་ཤར། །",
      "en": "Light rays of activity shine as the splendour of those to be tamed.",
      "en-trans": "trinlé özer duljé pal du shar"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ཡིད་བཞིན་ནོར་བུ་ཡི། །",
      "en": "Like a wish-fulfilling jewel that makes all connections meaningful—",
      "en-trans": "dreltsé dönden yizhin norbu yi"
    },
    {
      "bo": "བྱིན་རླབས་འོད་ཀྱིས་ཚེ་རབས་ཀུན་ཏུ་སྐྱོངས། །",
      "en": "May the light of blessings nurture me throughout all my lives.",
      "en-trans": "jinlab ö kyi tserab küntu kyong"
    },
    {
      "bo": "རྣམ་དག་ཚུལ་ཁྲིམས་དཔག་བསམ་ལྗོན་པ་ལ། །",
      "en": "Upon the wish-fulfilling tree of pure ethical discipline,",
      "en-trans": "namdak tsultrim paksam jönpa la"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་བློ་གྲོས་ཡལ་འདབ་རྒྱས། །",
      "en": "The branches and leaves of intelligence born of study, reflection and meditation bloom.",
      "en-trans": "tö sam gompé lodrö yaldab gyé"
    },
    {
      "bo": "གངས་ལྗོངས་འཆི་མེད་ལྷ་ཡི་སྐྱེད་ཚལ་གྱི། །",
      "en": "To the protector of beings in the Snowy Land,",
      "en-trans": "gangjong chimé lha yi kyetsal gyi"
    },
    {
      "bo": "ལྟོས་བཅས་འགྲོ་བའི་མགོན་དེར་གསོལ་བ་འདེབས། །",
      "en": "Pleasure grove of the immortal gods, I pray.",
      "en-trans": "tö ché drowé gön der solwa deb"
    },
    {
      "bo": "ཡོན་ཏན་ལང་ཚོ་གཞན་དང་མི་མཉམ་པའི། །",
      "en": "With youthful qualities and enlightened resolve unmatched by others,",
      "en-trans": "yönten langtso zhen dang mi nyampé"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་དུས་བབས་པདྨ་དཀར་པོ་ཁྱེད། །",
      "en": "The time came for you, like a white lotus,",
      "en-trans": "tukkyé dü bab pema karpo khyé"
    },
    {
      "bo": "མདོ་ཁམས་ཏྲེ་ཤོད་འཛིན་མའི་བསོད་ནམས་ཀྱིས། །",
      "en": "To take birth, through the merit of the world, in Treshö, Dokham,",
      "en-trans": "dokham tré shö dzinmé sönam kyi"
    },
    {
      "bo": "ཐུབ་བསྟན་སྨན་ལྗོངས་མཛེས་པའི་རྒྱན་དུ་འཁྲུངས། །",
      "en": "An ornament beautifying the medicinal valley of Buddha’s teachings.",
      "en-trans": "tubten men jong dzepé gyen du trung"
    },
    {
      "bo": "གསང་ཆེན་དབེན་པའི་རི་ངོགས་ཉམས་དགའ་བར། །",
      "en": "On the pleasant slopes of the mountain of great secret solitude,",
      "en-trans": "sang chen wenpé ri ngok nyamgawar"
    },
    {
      "bo": "སྐྱབས་མཆོག་བླ་མ་འཇམ་པའི་རྡོ་རྗེའི་ཞབས། །",
      "en": "You served the supreme refuge, the guru Mañjuvajra,",
      "en-trans": "kyab chok lama jampé dorjé zhab"
    },
    {
      "bo": "མཉེས་པ་གསུམ་གྱིས་བསྟེན་ནས་ཐུགས་དགོངས་ལོན། །",
      "en": "Delighting him in the three ways and receiving instructions,",
      "en-trans": "nyepa sum gyi ten né tukgong lön"
    },
    {
      "bo": "ཤེས་བྱའི་ཆོས་ལ་རྨོངས་པ་མཐའ་ནས་སངས། །",
      "en": "So that delusion regarding knowable phenomena was entirely dispelled.",
      "en-trans": "shejé chö la mongpa ta né sang"
    },
    {
      "bo": "མགོན་དེའི་སྒྲིབ་མེད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས། །",
      "en": "That protector, in his wisdom of unobstructed knowledge,",
      "en-trans": "gön dé dribmé khyenpé yeshe kyi"
    },
    {
      "bo": "འབྱུང་འགྱུར་བསྟན་འགྲོའི་དཔལ་དུ་ཡོངས་གཟིགས་ནས། །",
      "en": "Saw that you would become a splendour for the teachings and beings,",
      "en-trans": "jung gyur ten drö pal du yong zik né"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་བདག་པོ་བསམ་ཡས་པ། །",
      "en": "An incredible master of the teachings of the Ancient Translations,",
      "en-trans": "ngagyur tenpé dakpo samyé pa"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་བློ་གྲོས་མཆོག་གི་མཚན་དེ་གསོལ། །",
      "en": "And named you Tsultrim Lodrö Chok—\"Disciplined Intellect Supreme\".",
      "en-trans": "tsultrim lodrö chok gi tsen dé sol"
    },
    {
      "bo": "གངས་དཀར་རི་བོས་བསྐོར་བའི་རྒྱལ་ཁམས་ནས། །",
      "en": "From the realm that is encircled by snowy mountains,",
      "en-trans": "gangkar riwö korwé gyalkham né"
    },
    {
      "bo": "བསླབ་གསུམ་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པ་ལས། །",
      "en": "The scent of your enlightened activity,",
      "en-trans": "lab sum yönten yongsu dzokpa lé"
    },
    {
      "bo": "འཕྲིན་ལས་དྲི་བསུང་གོ་ལའི་འགྲོས་དང་འབྲེལ། །",
      "en": "Emerging from the perfection of qualities of the three trainings,",
      "en-trans": "trinlé drisung golé drö dang drel"
    },
    {
      "bo": "ཤར་ནུབ་རྒྱ་མཚོ་ཆེན་པོའི་མཐའ་ལས་བརྒལ། །",
      "en": "Reaches the distant shores of great oceans, East and West.",
      "en-trans": "shar nub gyatso chenpö ta lé gal"
    },
    {
      "bo": "ངུར་སྨྲིག་རྒྱན་གྱིས་མཛེས་པའི་ཀུན་སྤྱོད་དག །",
      "en": "Your pure conduct enhances the beauty of the saffron robes,",
      "en-trans": "ngurmik gyen gyi dzepé künchö dak"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་ལ་ཕན་པའི་ལྷག་བསམ་གཙང་། །",
      "en": "Your pure altruistic concern is to benefit the teachings and beings,",
      "en-trans": "ten dang dro la penpé lhaksam tsang"
    },
    {
      "bo": "མདོ་སྔགས་ཤེས་བྱ་རིག་པའི་གནས་ལ་དབང་། །",
      "en": "You have mastered the topics of sūtra and mantra and scientific knowledge,",
      "en-trans": "do ngak sheja rigpé né la wang"
    },
    {
      "bo": "ཐར་བའི་ལམ་སྟོན་མཆོག་དེར་གསོལ་བ་འདེབས། །",
      "en": "And you are the supreme guide on the path to liberation—to you I pray.",
      "en-trans": "tarwé lam tön chok der solwa deb"
    },
    {
      "bo": "འཇིགས་རུང་ཁྲག་གི་ཡུར་ཆུ་བཞུར་ས་ན། །",
      "en": "With hands of compassion, countless times you have stayed",
      "en-trans": "jikrung trak gi yur chu zhur sa na"
    },
    {
      "bo": "སྡུག་བསྔལ་མཆི་མ་འཁྲིགས་པའི་སེམས་ཅན་གྱི། །",
      "en": "The knives of butchers would would cruelly steal the lives",
      "en-trans": "dukngal chima trikpé semchen gyi"
    },
    {
      "bo": "སྲོག་གི་གཤེད་དུ་བརྡར་བའི་རལ་གྲིའི་སོ། །",
      "en": "Of terrified creatures moved to tears by their misery",
      "en-trans": "sok gi shé du darwé raldri so"
    },
    {
      "bo": "སྙིང་རྗེའི་ཕྱག་གིས་བཀག་པའི་གྲངས་མི་ཟིན། །",
      "en": "In gruesome places where gutters overflow with blood.",
      "en-trans": "nyingjé chak gi kakpé drang mi zin"
    },
    {
      "bo": "མཐོན་པོའི་གསེར་ཁྲིའི་ཁ་ན་ཁྱེད་ཉིད་མེད། །",
      "en": "You do not sit upon lofty thrones of gold.",
      "en-trans": "tönpö ser tri kha na khyé nyimé"
    },
    {
      "bo": "འབྱོར་ཕྱུག་འདུ་ལོང་དབུས་ནས་ཁྱེད་མི་མཇལ། །",
      "en": "You are not found amidst the wealthy throng.",
      "en-trans": "jor chuk du long ü né khyé mi jal"
    },
    {
      "bo": "དམར་ནག་འདམ་རྫབ་གཡོ་བའི་ར་བ་ན། །",
      "en": "But within enclosures where mud runs darkly red,",
      "en-trans": "marnak damdzab yowé rawa na"
    },
    {
      "bo": "ཉམ་ཐག་འགྲོ་བ་འདྲེན་པའི་མགོན་དུ་རྟག །",
      "en": "You remain as a protector, a rescuer of tormented beings.",
      "en-trans": "nyamtak drowa drenpé gön du tak"
    },
    {
      "bo": "ལྷ་ཡིས་གནང་བའི་ངུར་སྨྲིག་ན་བཟའི་གོས། །",
      "en": "Your saffron robes, bestowed by the gods,",
      "en-trans": "lha yi nangwé ngurmik nazé gö"
    },
    {
      "bo": "འཚེ་མེད་དྲང་སྲོང་ཆེན་པོའི་ཆ་ལུགས་དེ། །",
      "en": "Are the attire of a great sage who does no harm.",
      "en-trans": "tsemé drangsong chenpö chaluk dé"
    },
    {
      "bo": "སྐྱབས་མེད་འགྲོ་བ་གང་ན་ཡོད་པའི་སར། །",
      "en": "Wherever there are beings who lack protection,",
      "en-trans": "kyabmé drowa gang na yöpé sar"
    },
    {
      "bo": "མཐོང་བ་ཁྱེད་འདྲའི་སྐུ་ལ་ལྷག་ཏུ་མཛའ། །",
      "en": "Seeing a form such as yours brings supreme joy.",
      "en-trans": "tongwa khyé dré ku la lhak tu dza"
    },
    {
      "bo": "རིང་པོའི་ལོ་ཟླའི་ཁྲོད་ཀྱི་ལུས་སེམས་ཀུན། །",
      "en": "For many years and months, your body and mind",
      "en-trans": "ringpö lodé trö kyi lü sem kün"
    },
    {
      "bo": "སྙིང་རྗེ་ཉག་མ་གཅིག་གིས་གསོས་པ་ཡི། །",
      "en": "Were nourished by compassion alone.",
      "en-trans": "nyingjé nyakma chik gi söpa yi"
    },
    {
      "bo": "སེམས་དཔའ་ཁྱེད་ཀྱི་ཕྱག་གི་བརྐྱང་བསྐུམ་ཡན། །",
      "en": "Bodhisattva, is there any act, even the motion of your arms,",
      "en-trans": "sempa khyé kyi chak gi kyangkum yen"
    },
    {
      "bo": "མཐའ་དག་འགྲོ་བའི་དོན་དུ་མ་གྱུར་གང་། །",
      "en": "That is not for the benefit of beings?",
      "en-trans": "tadak drowé döndu magyur gang"
    },
    {
      "bo": "དག་པ་ལྷ་ཡི་ཞིང་ནས་ཕེབས་ཚུལ་སོགས། །",
      "en": "How you descended from a divine pure realm and the like—",
      "en-trans": "dakpa lha yi zhing né peb tsul sok"
    },
    {
      "bo": "ལྐོག་གྱུར་སྐྱེས་རབས་མང་པོ་མི་ཤེས་ཀྱང་། །",
      "en": "The hidden details of your past lives may not be known,",
      "en-trans": "kokgyur kyerab mangpo mi shé kyang"
    },
    {
      "bo": "མངོན་གྱུར་ཡོན་ཏན་དེ་ཡིས་དད་གུས་འཕེལ། །",
      "en": "But your manifest qualities cause faith and reverence to grow.",
      "en-trans": "ngöngyur yönten dé yi dé gü pel"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "གངས་ཅན་བཅུ་ཕྲག་རིག་པའི་ཁང་བཟང་དེ། །",
      "en": "When the fine mansion of the ten sciences in this snowy land",
      "en-trans": "gangchen chu trak rigpé khang zang dé"
    },
    {
      "bo": "ཆར་དང་རླུང་གིས་འཐོར་ལ་ཉེ་བའི་དུས། །",
      "en": "Was about to be destroyed by fierce storms of rain and wind,",
      "en-trans": "char dang lung gi tor la nyewé dü"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་པའི་ཐབས་ཀྱིས་འཛིན་མཁས་ཁྱེད། །",
      "en": "You skilfully preserved it through explanation, debate, and composition—",
      "en-trans": "ché tsö tsompé tab kyi dzin khé khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ལུགས་གཉིས་མཛད་པ་གང་དང་གང་ལ་ཡང་། །",
      "en": "You are untainted by the slightest self-interest in whatever you do,",
      "en-trans": "luk nyi dzepa gang dang gangla yang"
    },
    {
      "bo": "རང་འདོད་ཉེས་པ་ཕྲ་མོས་མ་གོས་པར། །",
      "en": "Whether in the temporal or spiritual domains.",
      "en-trans": "rang dö nyepa tra mö magöpar"
    },
    {
      "bo": "སུ་ཡིས་བརྟགས་ཀྱང་སྐྱོན་དང་བྲལ་བ་ཁྱེད། །",
      "en": "Whoever examines you finds you free of any flaw.",
      "en-trans": "su yi tak kyang kyön dang dralwa khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོ་དག་པའི་ཞིང་དུ་ཕེབས། །",
      "en": "A king of Dharma, you have come to a pure realm,",
      "en-trans": "chö kyi gyalpo dakpé zhing du peb"
    },
    {
      "bo": "སྐལ་བཟང་སློབ་མའི་རེ་བའི་སེམས་ཀྱི་རྟེན། །",
      "en": "And provide support for the hopes of fortunate disciples.",
      "en-trans": "kalzang lobmé rewé sem kyi ten"
    },
    {
      "bo": "བསྟན་པའི་གཞི་མ་སྐྱོང་བའི་བརྒྱུད་འཛིན་ཁྱེད། །",
      "en": "Lineage-holder, who sustains the ground of the teachings,",
      "en-trans": "tenpé zhima kyongwé gyü dzin khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "བླུན་རྨོངས་གཅན་གཟན་གཏུམ་པོའི་འཚོ་བ་བཞིན། །",
      "en": "You spread the excellent tradition of pure vegetarianism",
      "en-trans": "lün mong chenzen tumpö tsowa zhin"
    },
    {
      "bo": "ཤ་ཁྲག་ཟས་ལ་རྔམ་པའི་ཡུལ་ལྗོངས་འདིར། །",
      "en": "In this land where everyone hungers for flesh and blood,",
      "en-trans": "sha trak zé la ngampé yul jong dir"
    },
    {
      "bo": "དཀར་ཟས་གཙང་མའི་སྲོལ་བཟང་སྤེལ་མཁན་ཁྱེད། །",
      "en": "Like ignorant, savage beasts craving their quarry.",
      "en-trans": "kar zetsang mé sol zang pel khen khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ཕྱི་ཡི་ལོངས་སྤྱོད་ཅི་ཙམ་འཕེལ་བ་བཞིན། །",
      "en": "The more outer possessions one accumulates,",
      "en-trans": "chi yi longchö chitsam pelwa zhin"
    },
    {
      "bo": "ནང་གི་ངེས་འབྱུང་ཤུགས་ཀྱིས་སྲབ་པའི་དུས། །",
      "en": "The more one’s inner renunciation fades.",
      "en-trans": "nang gi ngejung shuk kyi sabpé dü"
    },
    {
      "bo": "འཁོར་བའི་རང་མཚང་གཏིང་ནས་རིག་པ་ཁྱེད། །",
      "en": "You deeply understand such inherent faults of saṃsāra—",
      "en-trans": "khorwé rang tsang tingné rigpa khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ཐེག་ཆེན་ཆོས་ཀྱི་གྲལ་དུ་ཞུགས་ན་ཡང་། །",
      "en": "At a time when even among Mahāyāna practitioners",
      "en-trans": "tekchen chö kyi dral du zhuk na yang"
    },
    {
      "bo": "ཉམས་ལེན་གནད་ལ་སློབ་མཁན་ཉུང་བའི་དུས། །",
      "en": "Few people study the essential points of practice,",
      "en-trans": "nyamlen né la lob khen nyungwé dü"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་ཀྱིས་ཐུགས་རྒྱུད་གང་བ་ཁྱེད། །",
      "en": "You have filled your mindstream with bodhicitta—",
      "en-trans": "changchub sem kyi tukgyü gangwa khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru of unparalleled great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "མདོ་སྔགས་ཆོས་ཚུལ་རྒྱ་མཚོའི་ལམ་གྱི་གསང་། །",
      "en": "The secret of the oceanic path of sūtra and mantra teachings,",
      "en-trans": "do ngak chö tsul gyatsö lam gyi sang"
    },
    {
      "bo": "བློ་ལས་འདས་པ་ཆོས་ཉིད་ཟབ་མོའི་དོན། །",
      "en": "The profound meaning of reality beyond the ordinary mind,",
      "en-trans": "lo lé depa chönyi zabmö dön"
    },
    {
      "bo": "མཁྱེན་པའི་ཉི་མ་སྙིང་ནས་ཤར་བ་ཁྱེད། །",
      "en": "For you the sun of wisdom has dawned within the heart—",
      "en-trans": "khyenpé nyima nying né sharwa khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Incomparable guru of great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་གདམས་པའི་ཟབ་གནད་མི་ཤེས་པར། །",
      "en": "When there are those who collect empowerments and transmissions",
      "en-trans": "kyedzok dampé zab né mishepar"
    },
    {
      "bo": "དབང་ལུང་ཆོས་ཀྱི་ཐོབ་གྲངས་གསོག་པའི་དུས། །",
      "en": "Without knowing the profound points of generation and completion,",
      "en-trans": "wang lung chö kyi tob drang sokpé dü"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་པའི་གནད་གསང་སྟོན་མཁན་ཁྱེད། །",
      "en": "You reveal the secret keys to view, meditation and conduct,",
      "en-trans": "ta gom chöpé né sang tön khen khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Incomparable guru of great kindness, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ཐེག་པའི་ཡང་རྩེ་འོད་གསལ་རྫོགས་པ་ཆེའི། །",
      "en": "When the activity of the effortless path of the luminous Great Perfection,",
      "en-trans": "tekpé yangtsé ösal dzogpa ché"
    },
    {
      "bo": "རྩོལ་མེད་ལམ་གྱི་འཕྲིན་ལས་མྱུར་བའི་དུས། །",
      "en": "The pinnacle of all vehicles, is especially swift,",
      "en-trans": "tsolmé lam gyi trinlé nyurwé dü"
    },
    {
      "bo": "དོན་བརྒྱུད་བྱིན་རླབས་རྟོགས་པའི་འབྱུང་གནས་ཁྱེད། །",
      "en": "You are the source of the blessings and realization of the ultimate lineage—",
      "en-trans": "dön gyü jinlab tokpé jungné khyé"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Incomparable and most kind guru, to you I pray.",
      "en-trans": "tsungmé drinchen lamar solwa deb"
    },
    {
      "bo": "ཟབ་དགུའི་གདམས་ངག་མང་དུ་གནང་ན་ཡང་། །",
      "en": "Although you have given many profound instructions,",
      "en-trans": "zab gü damngak mangdu nang na yang"
    },
    {
      "bo": "འདོད་འབྱུང་ནོར་བུ་འདྲ་བའི་བྱང་ཆུབ་སེམས། །",
      "en": "I find it hard to employ the wish-fulfilling jewel of bodhicitta",
      "en-trans": "dö jung norbu drawé changchub sem"
    },
    {
      "bo": "བདག་འཛིན་སེམས་ཀྱི་གཉེན་པོར་འགྲོ་དཀའ་བས། །",
      "en": "As an antidote to my inveterate self-clinging.",
      "en-trans": "dakdzin sem kyi nyenpor dro kawé"
    },
    {
      "bo": "ད་དུང་ཐུགས་རྗེས་སྐྱོངས་ཤིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, please continue to care for me with your compassion.",
      "en-trans": "dadung tukjé kyong shik lama jé"
    },
    {
      "bo": "གོམས་པའི་དབང་གིས་གང་སར་རྒྱུག་པ་ཡི། །",
      "en": "Through the force of habit, my thoughts run amok,",
      "en-trans": "gompé wang gi gang sar gyukpa yi"
    },
    {
      "bo": "རྟ་རྒོད་ལོང་བ་འདྲ་བའི་རྣམ་རྟོག་འདི། །",
      "en": "Like a wild horse, who has been blind since birth.",
      "en-trans": "ta gö longwa drawé namtok di"
    },
    {
      "bo": "མཉམ་པར་བཞག་ཀྱང་བཀོལ་དུ་མི་བཏུབ་པས།",
      "en": "Even when I rest evenly, I cannot make my mind comply—",
      "en-trans": "nyampar zhak kyang kol du mi tubpé"
    },
    {
      "bo": "བྱིན་རླབས་ཞགས་པས་ཆོངས་ཤིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, catch me with the lasso of your blessings!",
      "en-trans": "jinlab zhakpé chong shik lama jé"
    },
    {
      "bo": "ཐེ་ཚོམ་མུན་པ་མཐའ་ནས་སངས་བ་ཡི། །",
      "en": "That I might dispel entirely the darkness of doubt,",
      "en-trans": "tetsom münpa ta né sangwa yi"
    },
    {
      "bo": "ཉ་གང་ཟླ་བ་འདྲ་བའི་རྟོགས་པ་ཞིག །",
      "en": "With realization that is as bright as the full moon",
      "en-trans": "nyagang dawa drawé tokpa zhik"
    },
    {
      "bo": "མྱུར་དུ་སེམས་ཀྱི་ནམ་མཁར་ཤར་བ་ལ། །",
      "en": "Arising suddenly within the skyscape of my mind—",
      "en-trans": "nyurdu sem kyi namkhar sharwa la"
    },
    {
      "bo": "བཙན་ཐབས་དགོངས་པ་སྤོར་ཅིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, please transmit your realization with force!",
      "en-trans": "tsentab gongpa por chik lama jé"
    },
    {
      "bo": "བར་ཆད་འཕྲང་ལས་བཟུར་ཐབས་མི་ཤེས་པའི། །",
      "en": "Not knowing how to avoid obstacles on the way,",
      "en-trans": "barché trang lé zur tab mishepé"
    },
    {
      "bo": "ལམ་ཁའི་སྲིན་བུ་འདྲ་བའི་རྨོངས་པ་བདག །",
      "en": "In my ignorance, I’m like a tiny insect on the road.",
      "en-trans": "lamkhé sinbu drawé mongpa dak"
    },
    {
      "bo": "འགལ་རྐྱེན་ལོག་པའི་ལམ་དུ་འགྲོ་སྲིད་ན། །",
      "en": "If I should ever go astray through adversity,",
      "en-trans": "galkyen lokpé lam du dro si na"
    },
    {
      "bo": "བརྩེ་བའི་ཕྱག་གིས་སྐྱོབས་ཤིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, rescue me with hands of love!",
      "en-trans": "tsewé chak gi kyob shik lama jé"
    },
    {
      "bo": "ནམ་འོང་འདིར་འོང་ཆ་འཇོག་མེད་པ་ཡི། །",
      "en": "We cannot predict when and where he will strike—",
      "en-trans": "nam ong dir ong cha jok mepa yi"
    },
    {
      "bo": "ནམ་མཁའི་ཐོག་དང་འདྲ་བའི་འཆི་བདག་བདུད། །",
      "en": "The demon Yama is like a bolt of thunder in the sky.",
      "en-trans": "namkhé tok dang drawé chidak dü"
    },
    {
      "bo": "ཉམ་ཆུང་སྲོག་གི་གཤེད་དུ་བབ་པའི་ཉིན། །",
      "en": "Now, when we are vulnerable and our lives in peril,",
      "en-trans": "nyamchung sok gi shé du babpé nyin"
    },
    {
      "bo": "འདྲེན་པའི་དེད་དཔོན་མཛོད་ཅིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, be the one who guides us at the helm!",
      "en-trans": "drenpé depön dzö chik lama jé"
    },
    {
      "bo": "འདི་དང་ཕྱི་མ་བར་དོའི་གནས་སྐབས་དང་། །",
      "en": "In this life, the next life, and the bardo state,",
      "en-trans": "di dang chima bardö nekab dang"
    },
    {
      "bo": "སྐྱིད་སྡུག་ལེགས་ཉེས་ལས་བསྐོས་གར་བབས་ཀྱང་། །",
      "en": "In happiness and sorrow, good and bad, whatever befalls us,",
      "en-trans": "kyiduk leknyé lé kö gar bab kyang"
    },
    {
      "bo": "མགོན་པོ་གང་ལས་སྐྱབས་གཞན་མི་འདུག་པས། །",
      "en": "We have no other source of refuge but you, O protector.",
      "en-trans": "gönpo ganglé kyab zhen mi dukpé"
    },
    {
      "bo": "འབྲལ་མེད་ཐུགས་རྗེས་གཟིགས་ཤིག་བླ་མ་རྗེ། །",
      "en": "Lord guru, look on us with your compassion, never parting!",
      "en-trans": "dralmé tukjé zik shik lama jé"
    },
    {
      "bo": "མཁྱེན་རྟོགས་འོད་ཀྱིས་མཛེས་པའི་ཟླ་བ་དེ། །",
      "en": "A moon, beautified by the light of knowledge and realization,",
      "en-trans": "khyen tok ö kyi dzepé dawa dé"
    },
    {
      "bo": "གང་དུ་སོང་ཡང་ཀུན་གྱི་གཙུག་གི་རྒྱན། །",
      "en": "Wherever you may go, you are the crowning glory of all.",
      "en-trans": "gangdu song yang kün gyi tsuk gi gyen"
    },
    {
      "bo": "ང་ཅག་ལྟོས་བཅས་སྐྱེ་འགྲོའི་སྐྱབས་གནས་སུ། །",
      "en": "As you are the source of refuge for all of us living beings,",
      "en-trans": "ngachak tö ché kyendrö kyabné su"
    },
    {
      "bo": "བསྐལ་བ་རྒྱ་མཚོའི་བར་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "May your lotus feet remain steadfast for an ocean of aeons!",
      "en-trans": "kalwa gyatsö bardu zhabten shok"
    },
    {
      "bo": "བྱིས་པས་ཐོག་མའི་ཤེས་བྱ་སློབ་ཚུལ་ནས། །",
      "en": "From the first lessons that must be learned as a child",
      "en-trans": "jipé tokmé sheja lob tsul né"
    },
    {
      "bo": "རྒན་པོས་ཕྱི་མའི་འགྲོ་ཆས་སྒྲུབ་ཚུལ་སོགས། །",
      "en": "To how the elderly prepare for their journey beyond life,",
      "en-trans": "genpö chimé dro ché drub tsul sok"
    },
    {
      "bo": "ལུགས་གཉིས་བླང་དོར་སྟོན་པའི་དེད་དཔོན་ཁྱེད། །",
      "en": "You are a guide to dos and don’ts, both spiritual and secular.",
      "en-trans": "luk nyi langdor tönpé depön khyé"
    },
    {
      "bo": "དུས་མཐའི་འགྲོ་བའི་སྒྲོན་མེར་ཞབས་བརྟན་ཤོག །",
      "en": "As a lamp for beings in this final age, may you live long!",
      "en-trans": "dü té drowé drönmer zhabten shok"
    },
    {
      "bo": "ངན་སྤྱོད་སྣ་དགུས་མ་མོ་འཁྲུགས་པ་ལས། །",
      "en": "When all manner of negative conduct disturbs themamos,",
      "en-trans": "ngen chö na gü mamo trukpa lé"
    },
    {
      "bo": "བཅོས་མེད་ནད་ཀྱིས་འཛམ་གླིང་ཕོངས་བའི་དུས། །",
      "en": "Who then inflict their incurable disease upon the world,",
      "en-trans": "chömé né kyi dzamling pongwé dü"
    },
    {
      "bo": "འབད་པ་བརྒྱ་ཡིས་འགོག་པའི་ལྷག་བསམ་ཅན། །",
      "en": "Your noble intention is to make every effort to prevent this.",
      "en-trans": "bepa gya yi gokpé lhaksam chen"
    },
    {
      "bo": "མགོན་མེད་སྐྱེ་བོའི་གཉེན་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "May you live long, a friend to those who lack protection!",
      "en-trans": "gönmé kyewö nyen du zhabten shok"
    },
    {
      "bo": "འདྲ་མིན་སྐད་དང་ཡིག་རིགས་འདྲེས་པ་ལས། །",
      "en": "As the corruption of various languages and scripts",
      "en-trans": "dra min ké dang yik rik drepa lé"
    },
    {
      "bo": "ལུགས་གཉིས་སྲོལ་ཁའི་རྨང་རྡོ་བཤིག་པས་ན། །",
      "en": "Erodes the foundation stone of the two traditions,",
      "en-trans": "luk nyi sol khé mang do shikpé na"
    },
    {
      "bo": "རང་སྐད་གཙང་མའི་ཆུ་རྒྱུན་མཐུད་པའི་མགོན། །",
      "en": "Protector, you preserve the stream of linguistic purity.",
      "en-trans": "rang ké tsangmé chugyün tüpé gön"
    },
    {
      "bo": "བཅུ་ཕྲག་རིག་པའི་བདག་པོར་ཞབས་བརྟན་ཤོག །",
      "en": "Master of the ten sciences, may your life remain secure.",
      "en-trans": "chu trak rigpé dakpor zhabten shok"
    },
    {
      "bo": "གངས་ལྗོངས་མདོ་སྔགས་ཆོས་ཀྱི་དགའ་ཚལ་དེ། །",
      "en": "When the Dharma grove of sūtra and mantra in the Land of Snows",
      "en-trans": "gangjong do ngak chö kyi gatsal dé"
    },
    {
      "bo": "ཟུངས་ཟད་ནད་པ་བཞིན་དུ་གྱུར་དུས་འདིར། །",
      "en": "Has diminished, like a sick person devoid of physical strength,",
      "en-trans": "zung zé nepa zhindu gyur dü dir"
    },
    {
      "bo": "སྣ་ཚོགས་ཐབས་ཀྱིས་འབད་པའི་བསྟན་འཛིན་མཆོག །",
      "en": "May this supreme holder of the teachings, who employs varied means,",
      "en-trans": "natsok tab kyi bepé tendzin chok"
    },
    {
      "bo": "ཐུབ་བསྟན་མཛེས་པའི་རྒྱན་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "Live long as an ornament who beautifies Buddha’s teachings.",
      "en-trans": "tubten dzepé gyen du zhabten shok"
    },
    {
      "bo": "གནའ་དེང་རིག་པའི་མཐའ་རྒྱ་མ་ཆོད་པར། །",
      "en": "When there are few who know ancient and modern sciences,",
      "en-trans": "na deng rigpé ta gyama chöpar"
    },
    {
      "bo": "ཐོས་ཆུང་ལོག་པར་སྨྲ་བ་མང་བའི་དུས། །",
      "en": "And there are many who, with little learning, speak falsely,",
      "en-trans": "tö chung lokpar mawa mangwé dü"
    },
    {
      "bo": "ཡིན་མིན་དྲང་ཤན་འབྱེད་ལ་ཚངས་པའི་ཐིག །",
      "en": "You are the true gauge of what is true and what is not.",
      "en-trans": "yin min drang shenjé la tsangpé tik"
    },
    {
      "bo": "ལེགས་བཤད་རྒྱ་མཚོའི་གཏེར་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "May you live long, a treasury of ocean-like eloquence.",
      "en-trans": "lek shé gyatsö ter du zhabten shok"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་དངོས་བློ་གྲོས་མཚུངས་མེད་རྗེའི། །",
      "en": "Lord Lodrö Tsungmé, 'Peerless Intellect’, was Mañjughoṣa in person,",
      "en-trans": "jampal yang ngö lodrö tsungmé jé"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་མཛད་འཕྲིན་ནམ་མཁའི་མཐའ་དང་མཉམ། །",
      "en": "Whose enlightened resolve and activity were as vast as space itself,",
      "en-trans": "tukkyé dzetrin namkhé ta dang nyam"
    },
    {
      "bo": "འཕྲིན་ལས་གང་སར་སྤེལ་བའི་བྱེད་པོ་ཁྱེད། །",
      "en": "And you are working to further his activity wherever you go.",
      "en-trans": "trinlé gang sar pelwé jepo khyé"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་བའི་དཔལ་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "May you live long, splendour of the teachings and beings!",
      "en-trans": "ten dang drowé pal du zhabten shok"
    },
    {
      "bo": "བདག་སོགས་ཆོས་མེད་འཁོར་བའི་སེམས་ཅན་ལ། །",
      "en": "For me and all other beings in saṃsāra, devoid of Dharma,",
      "en-trans": "dak sok chömé khorwé semchen la"
    },
    {
      "bo": "བླང་དོར་ལམ་གྱི་སྣང་བ་གསལ་བ་ཡི། །",
      "en": "You are the sun that shines upon the crowns of our heads,",
      "en-trans": "langdor lam gyi nangwa salwa yi"
    },
    {
      "bo": "སྤྱི་བོའི་གཙུག་གི་ཉི་མ་ཁྱེད་ཡིན་པས། །",
      "en": "And sheds light on the path of adopting and avoiding.",
      "en-trans": "chiwö tsuk gi nyima khyé yinpé"
    },
    {
      "bo": "ཐར་འདོད་དད་པའི་རྟེན་དུ་ཞབས་བརྟན་ཤོག །",
      "en": "May you live long, a support for all with faith who yearn for liberation.",
      "en-trans": "tar dö depé ten du zhabten shok"
    },
    {
      "bo": "བསླུ་མེད་རིན་ཆེན་གསུམ་གྱི་བདེན་པ་དང་། །",
      "en": "Through the infallible truth of the precious Three Jewels,",
      "en-trans": "lumé rinchen sum gyi denpa dang"
    },
    {
      "bo": "རྩ་གསུམ་དམ་ཅན་སྲུང་མའི་བྱིན་རླབས་ཀྱིས། །",
      "en": "And the blessings of the Three Roots and oath-bound guardians,",
      "en-trans": "tsa sum damchen sungmé jinlab kyi"
    },
    {
      "bo": "མཚུངས་མེད་བླ་མའི་ཞབས་པད་ཡུན་བརྟན་ཞིང་། །",
      "en": "May the lotus feet of this incomparable guru remain steadfast,",
      "en-trans": "tsungmé lamé zhabpé yünten zhing"
    },
    {
      "bo": "མཛད་འཕྲིན་སྣང་བས་ཞིང་འདི་མཛེས་གྱུར་ཅིག །",
      "en": "And may the light of his enlightened deeds beautify this world.",
      "en-trans": "dzetrin nangwé zhing di dzé gyur chik"
    }
  ]
}