{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenchen-ngawang-palzang/prayer-this-life-next-bardo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འདི་ཕྱི་བར་དོ་གསུམ་དུ་སྐྱོབ་པའི་གསོལ་འདེབས།",
    "en": "Prayer for this Life, the Next and the Bardos"
  },
  "text": [
    {
      "bo": "ས་མཆོག་དཀྱིལ་འཁོར་མངོན་གྱུར་བཱི་མ་ལ། །",
      "en": "Vimalamitra, who realized the maṇḍala of the supreme state,",
      "en-trans": "sa chok kyilkhor ngöngyur bi ma la"
    },
    {
      "bo": "ཀུན་བཟང་ཆོས་སྐུའི་སྟོན་པ་ཀློང་ཆེན་པ། །",
      "en": "Longchenpa, who revealed the dharmakāya Samantabhadra,",
      "en-trans": "kunzang chökü tönpa longchenpa"
    },
    {
      "bo": "པདྨ་ལས་འབྲེལ་རྩལ་ལ་གསོལ་བ་འདེབས། །",
      "en": "And Pema Ledrel Tsal, to you I pray:",
      "en-trans": "pema ledrel tsal la solwa deb"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོ་གསུམ་ལ་ཐུགས་རྗེས་བཟུང༌། །",
      "en": "Hold me with compassion in this life, the next, and the bardo state!",
      "en-trans": "di chi bardo sum la tukjé zung"
    },
    {
      "bo": "བར་དོ་དང་པོའི་འོད་གསལ་ཤར་བའི་ཚེ། །",
      "en": "When the luminosity of the first bardo state arises,",
      "en-trans": "bardo dangpö ösal sharwé tsé"
    },
    {
      "bo": "ངོ་ཤེས་རྩལ་རྫོགས་བརྟན་པ་ཐོབ་ནས་ཀྱང༌། །",
      "en": "May I recognise it, perfect the strength and gain stability,",
      "en-trans": "ngoshé tsal dzok tenpa tob né kyang"
    },
    {
      "bo": "ཁྱད་ཆོས་དྲུག་ལྡན་དབྱིངས་སུ་བྱང་ཆུབ་ནས། །",
      "en": "Then, awakening in basic space with its six special features,1",
      "en-trans": "khyechö drukden ying su changchub né"
    },
    {
      "bo": "གཞོན་ནུ་བུམ་སྐུར་བརྟན་པ་ཐོབ་པར་ཤོག །",
      "en": "May I gain stability in the youthful vase body!",
      "en-trans": "zhönnu bumkur tenpa tobpar shok"
    },
    {
      "bo": "རིག་རྩལ་ལོངས་སྐུའི་སྣང་ཆ་ཤར་བའི་ཚེ། །",
      "en": "When the saṃbhogakāya appearances that are rigpa's expression arise,",
      "en-trans": "riktsal longkü nangcha sharwé tsé"
    },
    {
      "bo": "མ་པང་བུ་འཇུག་ལྟ་བུའི་གདེང་ཐོབ་ཅིང༌། །",
      "en": "May I find certainty, just like a child entering its mother's lap,",
      "en-trans": "ma pang bu juk tabü deng tob ching"
    },
    {
      "bo": "འོད་དང་རིག་པ་འཇུག་པའི་གནད་མཐོང་ནས། །",
      "en": "And, realizing the key point of engaging with lights and awareness,",
      "en-trans": "ö dang rigpa jukpé né tong né"
    },
    {
      "bo": "ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་རུ་སངས་རྒྱས་ཤོག །",
      "en": "May I attain buddhahood in saṃbhogakāya form!",
      "en-trans": "longchö dzokpé ku ru sangye shok"
    },
    {
      "bo": "རྣམ་སྨིན་སྲིད་པ་བར་དོ་ཤར་བའི་དུས། །",
      "en": "When the karmic bardo of becoming arises,",
      "en-trans": "nammin sipa bardo sharwé dü"
    },
    {
      "bo": "མ་སྒོམ་སངས་རྒྱས་ཆོས་ལྔའི་ལམ་བརྟེན་ནས། །",
      "en": "Then, through relying upon the five means of enlightenment without meditation,",
      "en-trans": "ma gom sangye chö ngé lam ten né"
    },
    {
      "bo": "རྣམ་གྲོལ་དབུགས་ཆེན་འབྱིན་པའི་ཞིང་ཁམས་སུ། །",
      "en": "In a pure realm where the great relief of liberation is assured,",
      "en-trans": "namdrol wuk chen jinpé zhingkham su"
    },
    {
      "bo": "སྐྱེ་བ་གཅིག་གིས་སངས་རྒྱས་ཐོབ་པར་ཤོག །",
      "en": "May I attain buddhahood in a single lifetime!",
      "en-trans": "kyewa chik gi sangye tobpar shok"
    }
  ]
}