{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dezhung-tulku-ajam/prayer-to-ngawang-lekpa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལེགས་པ་རིན་པོ་ཆེའི་གསོལ་འདེབས།",
    "en": "Prayer to Lekpa Rinpoche"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་རྒྱལ་བའི་ཡེ་ཤེས་སྒྱུ་མའི་འཕྲུལ། །",
      "en": "Illusory manifestation of the wisdom of victors, past, present and future,",
      "en-trans": "dü sum gyalwé yeshe gyumé trul"
    },
    {
      "bo": "བདུད་འདུལ་མཐུ་ཆེན་རྡོ་རྗེ་ནག་པོ་ཆེ། །",
      "en": "Mighty tamer of demonic forces, Vajra Mahākāla,",
      "en-trans": "düdul tuchen dorjé nakpo ché"
    },
    {
      "bo": "དེང་འདིར་བདག་གི་མགོན་གཅིག་ཆོས་ཀྱི་རྗེ། །",
      "en": "Appearing here and now as my sole protector, Lord of Dharma—",
      "en-trans": "dengdir dak gi gön chik chö kyi jé"
    },
    {
      "bo": "ངག་དབང་ལེགས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Ngawang Lekpa, at your feet I pray.",
      "en-trans": "ngawang lekpé zhab la solwa deb"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་རྣམ་པར་ཐར་པ་ལ། །",
      "en": "May any thought that conceives of some fault",
      "en-trans": "jetsün lamé nampar tarpa la"
    },
    {
      "bo": "སྐྱོན་དུ་འཛིན་པའི་རྟོག་པ་མི་སྐྱེས་ཞིང་། །",
      "en": "In the lifestyle or activity of the noble guru never arise.",
      "en-trans": "kyön du dzinpé tokpa mi kyé zhing"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་པར་མཐོང་བའི་མོས་གུས་ཀྱིས། །",
      "en": "May I see whatever he does in a positive light, and",
      "en-trans": "chi dzé lekpar tongwé mögü kyi"
    },
    {
      "bo": "བྱིན་རླབས་སེམས་ལ་འཇུག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Through such devotion, may his blessings infuse my mind.",
      "en-trans": "jinlab sem la jukpar jingyi lob"
    },
    {
      "bo": "བླ་མ་མཆོག་གསུམ་ལྷ་ཡི་བྱིན་མཐུ་དང་། །",
      "en": "Through the power and blessings of the gurus, Three Jewels and deities,",
      "en-trans": "lama chok sum lha yi jin tu dang"
    },
    {
      "bo": "དམ་ཅན་སྲུང་མ་རྒྱ་མཚོའི་མཐུ་སྟོབས་ཀྱིས། །",
      "en": "And the mighty strength of an ocean of oath-bound dharma guardians,",
      "en-trans": "damchen sungma gyatsö tutob kyi"
    },
    {
      "bo": "དཔལ་མགོན་བླ་མའི་ཞབས་པད་བརྟན་པ་དང་། །",
      "en": "May the life of this glorious protector guru remain secure,",
      "en-trans": "palgön lamé zhabpé tenpa dang"
    },
    {
      "bo": "འཕྲིན་ལས་དར་ཞིང་རྒྱས་པར་མཛད་དུ་གསོལ། །",
      "en": "And may his enlightened activity flourish and spread.",
      "en-trans": "trinlé dar zhing gyepar dzé du sol"
    }
  ]
}