{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/fifteenth-karmapa-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཔལ་ལྡན་ཀརྨ་བཅོ་ལྔ་པ་ཆེན་པོ་ལ་གསོལ་བ་འདེབས་པ་གྲུབ་གཉིས་མཆོག་སྟེར།",
    "en": "Bestower of Supreme Twofold Attainment"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་བཅས་ཀུན་གྱི་ཕྲིན་ལས་བདག །",
      "en": "Master of the activity of all the victorious ones and their heirs,",
      "en-trans": "gyalwa sé ché kün gyi trinlé dak"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་གསུམ་གཅིག་ཏུ་བསྡུས་པའི་གཟུགས། །",
      "en": "Single embodiment of threefold knowledge, love and power,",
      "en-trans": "khyen tsé nü sum chik tu düpé zuk"
    },
    {
      "bo": "མི་བསྐྱོད་མཐོན་མཐིང་ཅོད་པཎ་འཆང་བ་ཆེ། །",
      "en": "Great holder of the deep blue crown of Akṣobhya,",
      "en-trans": "mi kyö tönting chö pen changwa ché"
    },
    {
      "bo": "དཔལ་ལྡན་ཀརྨ་པ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Glorious Karmapa, to you I pray.",
      "en-trans": "palden karma pa la solwa deb"
    },
    {
      "bo": "དེ་བཞིན་གཤེགས་པ་ཀུན་གྱི་གསང་བའི་མཛོད། །",
      "en": "Secret treasury of all the tathāgatas,",
      "en-trans": "dezhin shekpa kün gyi sangwé dzö"
    },
    {
      "bo": "མཁའ་ཁྱབ་མཁའ་ཡི་རྡོ་རྗེའི་བདག་ཉིད་ཅན། །",
      "en": "Whose character is the pervasive vajra of space,",
      "en-trans": "khakhyab kha yi dorjé daknyi chen"
    },
    {
      "bo": "རྫོགས་པའི་སངས་རྒྱས་མི་ཡི་གཟུགས་འཛིན་པ། །",
      "en": "Perfectly awakened buddha in human form,",
      "en-trans": "dzokpé sangye mi yi zukdzin pa"
    },
    {
      "bo": "རང་བྱུང་རྟག་པའི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Rangjung Takpé Dorje, to you I pray.",
      "en-trans": "rangjung takpé dorjér solwa deb"
    },
    {
      "bo": "ཡེ་ཤེས་རྒྱ་མཚོ་ཆེ་ལ་དབང་འབྱོར་ཞིང་། །",
      "en": "With command of a vast ocean of wisdom,",
      "en-trans": "yeshe gyatso ché la wangjor zhing"
    },
    {
      "bo": "ཕྲིན་ལས་རྒྱ་མཚོས་འཁོར་བ་མ་སྟོང་བར། །",
      "en": "Through oceanic activity, until saṃsāra is empty,",
      "en-trans": "trinlé gyatsö khorwa matongwar"
    },
    {
      "bo": "སེམས་ཅན་རྒྱ་མཚོ་ཡོངས་སུ་སྨིན་པར་བྱེད། །",
      "en": "You fully ripen an ocean of sentient beings,",
      "en-trans": "semchen gyatso yongsu minpar jé"
    },
    {
      "bo": "ལྷན་སྐྱེས་བདེ་བའི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Lhenkyé Dewé Dorje, to you I pray.",
      "en-trans": "lhenkyé dewé dorjér solwa deb"
    },
    {
      "bo": "གང་ལ་གསོལ་འདེབས་དེ་ལ་དེར་བྱིན་རློབས། །",
      "en": "Whoever prays to you receives blessings there and then.",
      "en-trans": "gangla soldeb dé la der jin lob"
    },
    {
      "bo": "ཐུགས་རྗེ་ཐོགས་མེད་ནམ་མཁའི་གློག་ལྟར་མྱུར། །",
      "en": "Your compassion is unobstructed, like lightning in the sky.",
      "en-trans": "tukjé tokmé namkhé lok tar nyur"
    },
    {
      "bo": "མགོན་པོ་སྤྱན་རས་གཟིགས་དང་དབྱེར་མི་བྱེད། །",
      "en": "You are inseparable from the protector Avalokiteśvara,",
      "en-trans": "gönpo chenrezik dang yer mi jé"
    },
    {
      "bo": "ཁྱབ་བདག་ཀརྨ་པ་ལ་གསོལ་བ་འདེབས། །",
      "en": "All-pervasive sovereign, Karmapa, to you I pray.",
      "en-trans": "khyabdak karma pa la solwa deb"
    },
    {
      "bo": "བདག་གི་སྒོ་གསུམ་དད་པའི་ཞིང་ས་རུ། །",
      "en": "Upon the field of my devoted body, speech and mind,",
      "en-trans": "dak gi go sum depé zhingsa ru"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་བྱིན་བརླབས་ཆར་རྒྱུན་འབེབས། །",
      "en": "Shower down the rain of the glorious guru’s blessings.",
      "en-trans": "palden lamé jinlab char gyün beb"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་ཀྱི་མྱུ་གུ་སྨིན་པའི་རྩེར། །",
      "en": "Upon the burgeoning shoots of my awakening mind,",
      "en-trans": "changchub sem kyi nyugu minpé tser"
    },
    {
      "bo": "བླ་མ་སྐུ་བཞིའི་འབྲས་བཟང་སྨིན་པར་ཤོག །",
      "en": "Let ripen the excellent fruit of the guru’s four kāyas.",
      "en-trans": "lama ku zhi dré zang minpar shok"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་དཔལ་ལྡན་ཀརྨ་པའི། །",
      "en": "In all my lives, may the glorious Karmapa,",
      "en-trans": "tserab küntu palden karma pé"
    },
    {
      "bo": "ཞབས་སེན་རྡུལ་བྲལ་པདྨ་དཀར་པོ་དེ། །",
      "en": "His feet gracing an immaculate white lotus,",
      "en-trans": "zhab sen duldral pema karpo dé"
    },
    {
      "bo": "ཚངས་གནས་འཁོར་ལོའི་རྒྱན་དུ་ཐོབ་པ་དང་། །",
      "en": "Adorn the chakra, Brahma’s abode, at my crown,",
      "en-trans": "tsang né khorlö gyen du tobpa dang"
    },
    {
      "bo": "ཡེ་ཤེས་དགོངས་བརྒྱུད་འཕོ་བའི་དབང་བསྐུར་སྩོལ། །",
      "en": "And grant empowerment through the transference of wisdom realization.",
      "en-trans": "yeshe gonggyü powé wangkur tsol"
    },
    {
      "bo": "གང་གི་གསང་གསུམ་ཡིད་ལ་བྱེད་པའི་མཐུས། །",
      "en": "Through the power of bringing to mind your three secrets,1",
      "en-trans": "gang gi sang sum yi la jepé tü"
    },
    {
      "bo": "བདག་རྒྱུད་སྨིན་ཅིང་གྲོལ་བའི་དཔལ་ཐོབ་ནས། །",
      "en": "May I gain the splendour of a ripened and liberated mind,",
      "en-trans": "dak gyü min ching drolwé pal tob né"
    },
    {
      "bo": "ཕྲིན་ལས་མི་ཟད་ནམ་མཁའི་རྗེས་འགྲོ་བས། །",
      "en": "And, through emulating activity that is as infinite as space,",
      "en-trans": "trinlé mizé namkhé jé drowé"
    },
    {
      "bo": "བསྟན་འགྲོའི་དོན་ཆེན་འགྲུབ་པའི་བཀྲ་ཤིས་ཤོག །",
      "en": "Auspiciously bring vast benefit to the teachings and beings.",
      "en-trans": "ten drö dön chen drubpé tashi shok"
    }
  ]
}