{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/orgyen-tobgyal-rinpoche/prayer-khandro-tsering-chodron",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁའ་འགྲོ་ཚེ་རིང་ཆོས་སྒྲོན་མཆོག་གི་གསོལ་འདེབས།",
    "en": "Prayer to Khandro Tsering Chödrön"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་ར་ཝེ།",
      "en": "Homage to the lama!",
      "en-trans": "namo gurawé"
    },
    {
      "bo": "ཕྱི་ལྟར་ཚངས་པའི་བུ་མོ་དབྱངས་ཅན་མ།  །",
      "en": "Outwardly, you are Sarasvatī, the daughter of Brahmā,",
      "en-trans": "chitar tsangpé bumo yangchenma"
    },
    {
      "bo": "ནང་ལྟར་ཨ་རྱཏ་རེ་མི་མོའི་གཟུགས།  །",
      "en": "Inwardly, you are the youthful lady Tārā,",
      "en-trans": "nangtar arya taré mimö zuk"
    },
    {
      "bo": "གསང་བ་ལྷན་སྐྱེས་བཛྲ་བཱ་ར་ཧི།  །",
      "en": "Secretly, you are the innate Vajravārāhī,",
      "en-trans": "sangwa lhenkyé benza barahi"
    },
    {
      "bo": "ཀུན་འདུས་ལྭ་དཀར་ཌཱཀི་རྒྱལ་འགྱུར་ཅིག  །",
      "en": "You who embody them all—ḍākinī of the Lakar family—may you reign supreme!",
      "en-trans": "kündü lakar daki gyal gyur chik"
    },
    {
      "bo": "ཨོ་རྒྱན་དུས་གསུམ་མཁྱེན་པའི་རྡོ་རྗེའི་བཀའ།  །",
      "en": "The great master of Orgyen knows all past, present and future, and with his vajra words",
      "en-trans": "orgyen dü sum khyenpé dorjé ka"
    },
    {
      "bo": "གཏེར་འབྱིན་སྒྲུབ་པའི་འཁོར་ལོའི་སྒྱུར་རྣམས་ཀྱིས།  །",
      "en": "The revealers of the terma treasures, those universal kings of realization,",
      "en-trans": "ter jin drubpé khorlö gyur nam kyi"
    },
    {
      "bo": "ཤེལ་དཀར་རྡོ་རྗེ་མཚོ་ཡི་རྣམ་སྤྲུལ་དུ།  །",
      "en": "Have praised you in their predictions, undisputed,",
      "en-trans": "shelkar dorjé tso yi namtrul du"
    },
    {
      "bo": "རྩོད་མེད་ལུང་གིས་སྔགས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "As the emanation of Shelkar Dorje Tso1—and so to you I pray!",
      "en-trans": "tsömé lung gi ngak la solwa deb"
    },
    {
      "bo": "རྡོ་རྗེ་ལུང་གིས་ཟིན་པ་ཇི་བཞིན་དུ།  །",
      "en": "Just as they foretold in their vajra prophecies,",
      "en-trans": "dorjé lung gi zinpa jizhin du"
    },
    {
      "bo": "ཐབས་མཆོག་པདྨ་ཡེ་ཤེས་རྡོ་རྗེ་ཡི།  །",
      "en": "You joined Padma Yeshe Dorje,2supreme embodiment of skilful means,",
      "en-trans": "tab chok pema yeshe dorjé yi"
    },
    {
      "bo": "ཤེས་རབ་སྟོང་པའི་ཕྱག་རྒྱར་ཉམས་སྦྱོར་བའི།  །",
      "en": "As the consort symbolizing wisdom and emptiness—",
      "en-trans": "sherab tongpé chakgyar nyam jorwé"
    },
    {
      "bo": "བདེ་ཆེན་དགའ་བཞིའི་བདག་མོར་གསོལ་བ་འདེབས།  །",
      "en": "Lady of great bliss, granter of the four joys, to you I pray!",
      "en-trans": "dechen ga zhi dakmor solwa deb"
    },
    {
      "bo": "བླ་མ་ཡབ་ཡུམ་དབྱེར་མེད་མོས་གུས་ཀྱིས།  །",
      "en": "Moved by a devotion so deep that I perceive lama and consort as indivisible,",
      "en-trans": "lama yabyum yermé mögü kyi"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་བ་འདེབས་པའི་གང་ཟག་ལ།  །",
      "en": "From the core of my heart I pray: on such a person as me",
      "en-trans": "nying né solwa debpé gangzak la"
    },
    {
      "bo": "བདེ་སྟོང་ཙཎྜ་ལི་ཡི་རྒྱུད་བསྐུལ་ཏེ།  །",
      "en": "Grant your blessings, so that the bliss-emptiness ofcaṇḍāliis invoked,",
      "en-trans": "detong tsendali yi gyü kul té"
    },
    {
      "bo": "བདེ་དྲོད་ཡེ་ཤེས་འབར་བར་བྱིན་གྱི་རློབས།  །",
      "en": "And the blissful warmth and wisdom are set ablaze!",
      "en-trans": "dé drö yeshe barwar jin gyi lob"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་རླབས་ཀྱིས།  །",
      "en": "Through the blessings of such a prayer as this,",
      "en-trans": "detar solwa tabpé jinlab kyi"
    },
    {
      "bo": "བློ་སྣ་དམ་པའི་ཆོས་སུ་འགྲོ་བ་དང༌།  །",
      "en": "May my mind be turned towards the Dharma,",
      "en-trans": "lona dampé chö su drowa dang"
    },
    {
      "bo": "ཆོས་ཡང་ལམ་སློང་འཁྲུལ་སྣང་ཡེ་ཤེས་སུ།  །",
      "en": "May Dharma progress along the path, and, as delusory appearances",
      "en-trans": "chö yang lam long trulnang yeshe su"
    },
    {
      "bo": "དག་ནས་བྱང་ཆུབ་སེམས་མཆོག་སྦྱོང་བར་ཤོག  །",
      "en": "Are purified into wisdom, may I come to master the bodhicitta supreme!",
      "en-trans": "dak né changchub sem chok jongwar shok"
    },
    {
      "bo": "སྐྱེ་དང་ཚེ་རབས་ཀུན་ཏུ་ཐུགས་རྗེས་ཟུངས།  །",
      "en": "In this and all my future lives, hold me in your compassion!",
      "en-trans": "kyé dang tserab küntu tukjé zung"
    },
    {
      "bo": "དུས་དང་རྣམ་པ་ཀུན་ཏུ་བྱིན་གྱིས་རློབས།  །",
      "en": "At all times and in any situation, grant me your blessing, I pray!",
      "en-trans": "dü dang nampa küntu jingyi lob"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོའི་གནས་སྐབས་ཐམས་ཅད་དུ།  །",
      "en": "For in this life, the next and in the bardo state,",
      "en-trans": "dichi bardö nekab tamché du"
    },
    {
      "bo": "རེ་ས་ཁྱེད་ལས་མེད་དོ་རྗེ་བཙུན་མ།  །",
      "en": "O Jetsünma, there is no other source of hope for me but you!",
      "en-trans": "resa khyé le mé do jetsünma"
    }
  ]
}