{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/cloud-banks-of-blessings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "ཆོས་ཉིད་དགོངས་པའི་ཀློང་མཛོད་ལས༔ སྐྱེ་ཕྲེང་གསོལ་འདེབས་བསྡུས་པ་བྱིན་རླབས་སྤྲིན་ཕུང་བཞུགས༔",
    "en": "A Brief Prayer to the Garland of Successive Rebirths"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ཆོས་དབྱིངས་འདུས་མ་བྱས་པའི་མཁའ་ཀློང་ནས༔",
      "en": "Out of the uncompounded sky-like expanse of the dharmadhātu,",
      "en-trans": "chöying dü majépé kha long né"
    },
    {
      "bo": "གདངས་སྣང་མ་འགགས་སྟོང་གསལ་ཐུགས་རྗེའི་གར༔",
      "en": "Radiance arises unobstructedly as emptiness and clarity, the play of compassion,",
      "en-trans": "dang nang magak tong sal tukjé gar"
    },
    {
      "bo": "རྣམ་ཀུན་མཆོག་ལྡན་རྡོ་རྗེ་རྣལ་འབྱོར་མ༔",
      "en": "And Vajrayoginī, complete with the supreme of all features,",
      "en-trans": "namkün chokden dorjé naljorma"
    },
    {
      "bo": "གདུལ་བྱའི་སྣང་ངོར་ཆུ་ཟླའི་རྣམ་རོལ་གར༔",
      "en": "Manifests like the play of the moon in water, to all who need to be trained,",
      "en-trans": "duljé nang ngor chudé namrol gar"
    },
    {
      "bo": "གང་འདུལ་སྐུར་བཞེངས་མཛད་པ་མཐའ་ཡས་པ༔",
      "en": "Taking on infinite forms, according to what is most effective.",
      "en-trans": "gang dul kur zheng dzepa tayepa"
    },
    {
      "bo": "འགྲོ་ཁམས་ཡོངས་སྒྲོལ་མཆོག་ལ་གསོལ་བ་འདེབས༔",
      "en": "To the supreme liberator of beings in every realm, I pray!",
      "en-trans": "dro kham yong drol chok la solwa deb"
    },
    {
      "bo": "རྒྱ་གར་འཕགས་ཡུལ་གྲུབ་པའི་དབང་ཕྱུག་དཔལ༔",
      "en": "A glorious, accomplished master in the noble land of India",
      "en-trans": "gyagar pakyul drubpé wangchuk pal"
    },
    {
      "bo": "འབྱུང་ལྔར་དབང་ཐོབ་རོ་ལངས་དམར་མོ་དང༔",
      "en": "With power over the five elements, Red Vetala,1",
      "en-trans": "jung ngar wang tob rolang marmo dang"
    },
    {
      "bo": "རིམ་བརྒྱུད་བོད་ཡུལ་གུ་རུ་པད་འབྱུང་དྲུང༔",
      "en": "And then, in Tibet, before Guru Padmākara,",
      "en-trans": "rim gyü böyul guru pejung drung"
    },
    {
      "bo": "སྐུ་ཡི་གཟུངས་མ་ཤེལ་དཀར་རྡོ་རྗེ་མཚོ༔",
      "en": "His consort, Shelkar Dorje Tso,",
      "en-trans": "ku yi zungma shelkar dorjé tso"
    },
    {
      "bo": "མི་བརྗེད་གཟུངས་ཐོབ་དེ་ལ་གསོལ་བ་འདེབས༔",
      "en": "Who gained the power of unfailing memory—to you I pray!",
      "en-trans": "mi jé zung tob dé la solwa deb"
    },
    {
      "bo": "མཚོ་རྒྱལ་བྱིན་ཐོབ་ཟབ་པའི་གཏེར་ལ་དབང༔",
      "en": "With Tsogyal's blessings, you took charge of profound treasures,",
      "en-trans": "tsogyal jin tob zabpé ter la wang"
    },
    {
      "bo": "ཀུན་དགའ་འབུམ་མ་བྱང་ཆུབ་ཆོས་སྒྲོན་སོགས༔",
      "en": "And were Kunga Buma, Changchub Chödrön and the rest—",
      "en-trans": "künga bumma changchub chödrön sok"
    },
    {
      "bo": "སྐུ་ཕྲེང་རིམ་པར་བརྒྱུད་ལ་གསོལ་བ་འདེབས༔",
      "en": "To this garland of successive rebirths, I pray!",
      "en-trans": "ku treng rimpar gyü la solwa deb"
    },
    {
      "bo": "བོད་ཡུལ་དབུས་སུ་སྦས་པའི་རྣལ་འབྱོར་པ༔",
      "en": "In the heart of Tibet you were a hidden yoginī,2",
      "en-trans": "böyul ü su bepé naljorpa"
    },
    {
      "bo": "ཐ་མལ་ཚུལ་འཛིན་ཟབ་པའི་གཏེར་ལ་དབང༔",
      "en": "Appearing ordinary and with mastery of profound treasures,",
      "en-trans": "tamal tsul dzin zabpé ter la wang"
    },
    {
      "bo": "སྣ་ཚོགས་ཐབས་ཀྱིས་གཏེར་གཉིས་གདུལ་བྱ་སྐྱོང༔",
      "en": "Nurturing, through various means, disciples and the two forms of terma,",
      "en-trans": "natsok tab kyi ter nyi dulja kyong"
    },
    {
      "bo": "གང་འབྲེལ་པདྨ་འོད་ཀྱི་ཞིང་དུ་འདྲེན༔",
      "en": "And leading everyone with a connection to the realm of Lotus Light—",
      "en-trans": "gang drel pema ö kyi zhing du dren"
    },
    {
      "bo": "བདེ་ཆེན་བདེ་བའི་རྡོ་རྗེར་གསོལ་བ་འདེབས༔",
      "en": "Dechen Dewé Dorje, to you I pray!",
      "en-trans": "dechen dewé dorjér solwa deb"
    },
    {
      "bo": "འདི་ཕྱི་བར་གསུམ་འབྲལ་མེད་རྗེས་བཟུང་ནས༔",
      "en": "Care for me, without ever parting, in this life, the next, and the bardo states,",
      "en-trans": "di chi bar sum dralmé jezung né"
    },
    {
      "bo": "འོད་གསལ་རྫོགས་ཆེན་དགོངས་པ་མངོན་གྱུར་ཏེ༔",
      "en": "Lead me to realize the intent of the Luminous Great Perfection,",
      "en-trans": "ösal dzogchen gongpa ngöngyur té"
    },
    {
      "bo": "ཀ་དག་ཀུན་ཏུ་བཟང་པོར་བྱང་ཆུབ་ཤོག༔",
      "en": "And awaken as Samantabhadra, pure from the very beginning!",
      "en-trans": "kadak kuntuzangpor changchub shok"
    }
  ]
}