{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/prayer-to-chain-of-rebirths",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྐྱེ་ཕྲེང་གསོལ་འདེབས་ནི།",
    "en": "Prayer to the Chain of Rebirths"
  },
  "text": [
    {
      "bo": "སྔོན་ཚེ་འཕགས་ཡུལ་དགྲ་བཅོམ་ས་གི་ལྷ། །",
      "en": "In the past, in the noble land of India, you were the arhat Sagilha,",
      "en-trans": "ngön tsé pak yul drachom sa gi lha"
    },
    {
      "bo": "པདྨའི་སྤྱན་སྔར་རྡོ་རྗེ་བདུད་འཇོམས་རྗེ། །",
      "en": "In Padmasambhava’s presence, you were the lord Dorje Dudjom,",
      "en-trans": "pemé chen ngar dorje düdjom jé"
    },
    {
      "bo": "ས་སྐྱ་གོང་དུ་ཀུན་དགའ་རྒྱལ་མཚན་དཔལ། །",
      "en": "As the head of the Sakya, you were the glorious Kunga Gyaltsen,1",
      "en-trans": "sakya gong du kunga gyaltsen pal"
    },
    {
      "bo": "དགེ་ལྡན་གླིང་དུ་དགེ་ལེགས་དཔལ་བཟང་ཞབས། །",
      "en": "At Geden Ling, you were the noble Gelek Palzang,2",
      "en-trans": "genden ling du gelek palzang zhap"
    },
    {
      "bo": "མི་ཉག་ཡུལ་དུ་ཀུན་བཟང་ཆོས་གྲགས་སོགས། །",
      "en": "And in Minyak, you were Kunzang Chödrak—3",
      "en-trans": "minyak yul du kunzang chödrak sok"
    },
    {
      "bo": "མཁས་དང་གྲུབ་བརྙེས་དུ་མའི་ཚུལ་བཟུང་ནས། །",
      "en": "Taking the form of such learned and accomplished masters,",
      "en-trans": "khé dang drup nyé du mé tsul zung né"
    },
    {
      "bo": "ཐུབ་བསྟན་རྒྱས་པར་མཛད་ལ་གསོལ་བ་འདེབས། །",
      "en": "You spread the Buddha’s teachings—to you I pray!",
      "en-trans": "tupten gyépar dzé la solwa dep"
    },
    {
      "bo": "ད་ལྟ་བཤེས་གཉེན་མང་པོས་རྗེས་སུ་བཟུང་། །",
      "en": "Now, you have been cared for by many teachers,",
      "en-trans": "data shenyen mangpö jé su zung"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་སྦྱང་བ་གནད་དུ་བསྣུན། །",
      "en": "And applied the key points of study, reflection and meditation.",
      "en-trans": "tö sam gompé jangwa né du nün"
    },
    {
      "bo": "མི་ཕམ་རྒྱ་མཚོའི་བྱིན་རླབས་སྙིང་ལ་ཞུགས། །",
      "en": "The blessings of Mipham Gyatso have entered your heart,",
      "en-trans": "mipam gyatsö chinlap nying la zhuk"
    },
    {
      "bo": "བགྲང་ཡས་འགྲོ་དོན་མཛད་ལ་གསོལ་བ་འདེབས། །",
      "en": "And you bring benefit to countless beings—to you I pray!",
      "en-trans": "drang yé dro dön dzé la solwa dep"
    },
    {
      "bo": "མ་འོངས་རིགས་ལྡན་དྲག་པོའི་དམག་དཔོན་མཆོག །",
      "en": "In future, you will manifest as Karmavajra,",
      "en-trans": "ma ong rikden drakpö makpön chok"
    },
    {
      "bo": "ལས་ཀྱི་རྡོ་རྗེ་ལ་སོགས་སྤྲུལ་པ་ཡིས། །",
      "en": "The supreme commander to Kalkin Raudra Cakrin,4and so on,",
      "en-trans": "lekyi dorjé la sok trulpa yi"
    },
    {
      "bo": "ནམ་མཁའ་སྲིད་དུ་འགྲོ་བའི་དོན་མཛད་པའི། །",
      "en": "In this way, you will continue to work for beings for as long as space exists,",
      "en-trans": "namkha si du drowé dön dzépé"
    },
    {
      "bo": "སྐྱབས་གཅིག་བླ་མ་རྗེ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you, my only refuge, noble guru, I pray!",
      "en-trans": "kyab chik lama jé la solwa dep"
    },
    {
      "bo": "རང་དོན་ཐོས་བསམ་སྒོམ་པ་མཐའ་རུ་འཁྱོལ། །",
      "en": "Having reached the limit of one’s own benefit through study, reflection and meditation,",
      "en-trans": "rangdön tö sam gompa taru khyöl"
    },
    {
      "bo": "གཞན་དོན་འཆད་རྩོད་རྩོམ་པའི་ཕྲིན་ལས་རྒྱས། །",
      "en": "One acts for others’ sake, through explanation, debate and composition is extensive,",
      "en-trans": "zhen dön ché tsö tsompé trinlé gyé"
    },
    {
      "bo": "གཉིས་དོན་བཤད་སྒྲུབ་ལས་ཀྱི་སྲོལ་བཏོད་ནས། །",
      "en": "Having set out upon the path of twofold benefit through study, practice and activity,",
      "en-trans": "nyi dön shédrup lé kyi söl tö né"
    },
    {
      "bo": "འདྲེན་མཆོག་ཁྱེད་དང་དབྱེར་མེད་སངས་རྒྱས་ཤོག །",
      "en": "May I attain enlightenment inseparably from you, the supreme guide!",
      "en-trans": "dren chok khyé dang yermé sangyé shok"
    }
  ]
}