{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-trungpa-incarnations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཟུར་མང་དྲུང་རིན་པོ་ཆེའི་སྐྱེས་ཕྲེང་གསོལ་འདེབས་མོས་གུས་རྒྱ་མཚོའི་རླབས་ཕྲེང་ཞེས་བྱ་བ་བཞུགས་སོ།    །",
    "en": "A Prayer to the Garland of Zurmang Trungpa Rinpoche Incarnations"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om swasti"
    },
    {
      "bo": "དགའ་ལྡན་ལྷ་བརྒྱའི་བདག་པོ་མཆོག་གྱུར་པ།    །",
      "en": "Supreme sovereign of a hundred devas in Tuṣita,",
      "en-trans": "ganden lha gyé dakpo chokgyur pa"
    },
    {
      "bo": "བྱམས་པ་ཆེན་པོ་བྱམས་ཆེན་འགྲོ་བའི་མགོན།    །",
      "en": "Magnificent Maitreya, great loving guardian of beings,",
      "en-trans": "jampa chenpo jamchen drowé gön"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་ཚབ་རྒྱལ་སྲས་ཆེན་པོ་ནི།    །",
      "en": "Dharma regent, great heir to the conquerors,",
      "en-trans": "chökyi gyaltsab gyalsé chenpo ni"
    },
    {
      "bo": "མ་འོངས་སངས་རྒྱས་དེ་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Buddha of the future, to you I pray.",
      "en-trans": "ma ong sangye dé la solwa deb"
    },
    {
      "bo": "རྒྱལ་རིགས་ལས་འཁྲུངས་དགྱེས་རྡོར་གྲུབ་པ་བརྙེས།    །",
      "en": "Born into the warrior class, you won attainment through Hevajra,",
      "en-trans": "gyalrik lé trung gyé dor drubpa nyé"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོའི་སྤྱོད་པ་ཡིས།    །",
      "en": "And with the conduct of a great lord of yogis,",
      "en-trans": "naljor wangchuk chenpö chöpa yi"
    },
    {
      "bo": "ཕྱོགས་ལས་རྣམ་རྒྱལ་རྫུ་འཕྲུལ་སྟག་ལ་ཆིབ།    །",
      "en": "Miraculously riding upon a tiger, gained victory over all—",
      "en-trans": "chok lé namgyal dzutrul tak la chib"
    },
    {
      "bo": "ཌོམྦྷི་ཧེ་རུ་ཀ་ལ་གསོལ་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Ḍombī Heruka, at your feet I pray.",
      "en-trans": "dombhi heruka la sol la solwa deb"
    },
    {
      "bo": "འོད་གསལ་རྡོ་རྗེ་རྩེ་མོའི་ཁང་བཟང་དུ།    །",
      "en": "In the fine mansion of the Vajra Pinnacle of Clear Light,",
      "en-trans": "ösal dorjé tsemö khang zang du"
    },
    {
      "bo": "རིག་འཛིན་གྲུབ་པ་ཆེན་པོའི་སྐུར་བཞེངས་ཏེ།    །",
      "en": "You arose in the form of a greatly accomplished vidyādhara,",
      "en-trans": "rigdzin drubpa chenpö kur zheng té"
    },
    {
      "bo": "ཐེག་མཆོག་བསྟན་པ་ཉིན་མོར་བྱེད་པའི་མགོན།    །",
      "en": "A guardian of the sun-like teachings of the supreme vehicle—",
      "en-trans": "tek chok tenpa nyinmor jepé gön"
    },
    {
      "bo": "ཤྲཱི་སིང་ཧའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Śrī Siṃha, at your feet I pray.",
      "en-trans": "shiri singhé zhab la solwa deb"
    },
    {
      "bo": "ཨོ་རྒྱན་ཆེན་པོས་བྱིན་བརླབས་ཐུགས་ཀྱི་སྲས།    །",
      "en": "Heart son, blessed by the Great One of Oḍḍiyāna,1",
      "en-trans": "orgyen chenpö jinlab tuk kyi sé"
    },
    {
      "bo": "སྡིག་སྤྱོད་རྒྱལ་པོ་རྡོ་རྗེའི་མདའ་ཡིས་འབིག  །",
      "en": "Your vajra arrow struck the evil-doing king,",
      "en-trans": "dik chö gyalpo dorjé da yi bik"
    },
    {
      "bo": "ཕྱག་ན་རྡོ་རྗེ་མི་ཡི་བརྫུར་ཞུགས་པ།    །",
      "en": "For you were Vajrapāṇi himself in human guise—",
      "en-trans": "chak na dorjé mi yi dzur zhukpa"
    },
    {
      "bo": "དཔལ་གྱི་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Palgyi Dorje,2at your feet I pray.",
      "en-trans": "pal gyi dorjé zhab la solwa deb"
    },
    {
      "bo": "རླུང་སེམས་གཉིས་མེད་རྟོགས་པ་མངོན་དུ་གྱུར།    །",
      "en": "You realized the non-duality of wind-energy and mind,",
      "en-trans": "lungsem nyimé tokpa ngön du gyur"
    },
    {
      "bo": "འཁོར་འདས་ཆོས་ཀུན་རང་གྲོལ་ཕྱག་རྒྱ་ཆེར།    །",
      "en": "And self-liberated all the phenomena of saṃsāra and nirvāṇa as Mahāmudrā,",
      "en-trans": "khordé chö kün rangdrol chakgya cher"
    },
    {
      "bo": "ནམ་ཡང་མི་འདའ་གྲུ་གུ་རས་པ་ཞེས།    །",
      "en": "Never lapsing from that state—Drugu Repa,3",
      "en-trans": "namyang mi da drugu repa zhé"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Lord of siddhas, at your feet I pray.",
      "en-trans": "drubpé wangchuk chenpor solwa deb"
    },
    {
      "bo": "བླ་མ་མཆོག་བསྟེན་ཟབ་མོའི་གདམས་པ་ཐོབ།    །",
      "en": "You followed a supreme guru, received profound instructions,",
      "en-trans": "lama chok ten zabmö dampa tob"
    },
    {
      "bo": "ཇི་བཞིན་ཉམས་བླངས་སྣང་བ་ཆོས་སྐུར་འཆར།    །",
      "en": "Practised them precisely, so that appearances arose as dharmakāya;",
      "en-trans": "jizhin nyam lang nangwa chökur char"
    },
    {
      "bo": "རང་སེམས་སྐྱེ་མེད་ཆོས་སྐུ་མངོན་གྱུར་པ།    །",
      "en": "And your own mind, too, you realized as unborn dharmakāya—",
      "en-trans": "rangsem kyemé chöku ngöngyur pa"
    },
    {
      "bo": "ལྷོ་པ་སྒོམ་ཆུང་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Lhopa Gomchung,4at your feet I pray.",
      "en-trans": "lhopa gomchung zhab la solwa deb"
    },
    {
      "bo": "མྱོས་ཀྱི་རིགས་ལས་འཁྲུངས་པའི་རྒྱལ་བའི་སྲས།    །",
      "en": "Born into the Nyö clan as an heir to the victorious,",
      "en-trans": "nyö kyi rik lé trungpé gyalwé sé"
    },
    {
      "bo": "མདོ་སྔགས་མཁྱེན་རབ་དགོངས་པའི་རྩལ་ཆེན་རྫོགས།    །",
      "en": "Your power of realization was perfected in knowledge of sūtra and mantra,",
      "en-trans": "do ngak khyen rab gongpé tsal chen dzok"
    },
    {
      "bo": "མཁས་གྲུབ་རྒྱ་མཚོའི་གཙུག་ན་རབ་མཐོ་བ།    །",
      "en": "And you rose to the crest of an ocean of the learned and accomplished,",
      "en-trans": "khedrub gyatsö tsuk na rab towa"
    },
    {
      "bo": "མཐིང་མ་སངས་རྒྱས་གྲགས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Tingma Sangye Drak,5at your feet I pray.",
      "en-trans": "ting ma sangye drak la solwa deb"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་གྲུབ་ཆེན་བློ་གྲོས་རིན་ཆེན་གྱི།    །",
      "en": "Heart-son of Lodrö Rinchen, the great siddha of the practice lineage,",
      "en-trans": "drubgyü drubchen lodrö rinchen gyi"
    },
    {
      "bo": "ཐུགས་སྲས་ངེས་དོན་རྟོགས་པའི་བཀའ་བབས་ཆེ།    །",
      "en": "Through the great transmission of definitive realization,",
      "en-trans": "tuksé ngedön tokpé kabab ché"
    },
    {
      "bo": "བསྒོམ་མེད་ཆོས་སྐུའི་རྒྱལ་ས་རབ་བརྙེས་པ།    །",
      "en": "You attained the kingdom of dharmakāya beyond meditation—",
      "en-trans": "gommé chökü gyalsa rab nyepa"
    },
    {
      "bo": "ཀུན་དགའ་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Kunga Gyaltsen,6at your feet I pray.",
      "en-trans": "kün ga gyaltsen zhab la solwa deb"
    },
    {
      "bo": "ཚེར་ལུང་གནས་སུ་སྒྲུབ་པའི་རྒྱལ་མཚན་བཙུག  །",
      "en": "In Tserlung you planted the victory banner of accomplishment,",
      "en-trans": "tser lung né su drubpé gyaltsen tsuk"
    },
    {
      "bo": "མ་ཧཱ་ཀཱ་ལས་དགྱེས་ཞལ་ཡང་ཡང་བསྟན།    །",
      "en": "And Mahākāla repeatedly revealed to you his joyful face,",
      "en-trans": "mahakalé gyé zhal yangyang ten"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པ་རྒྱ་མཚོའི་མངའ་བདག་མཆོག  །",
      "en": "Supreme sovereign of oceanic power and capacity—",
      "en-trans": "tutob nüpa gyatsö ngadak chok"
    },
    {
      "bo": "ཀུན་དགའ་བཟང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Kunga Zangpo,7at your feet I pray.",
      "en-trans": "künga zangpö zhab la solwa deb"
    },
    {
      "bo": "ཕྱི་རུ་ཉན་ཐོས་སྤྱོད་པ་རབ་བསྐྱངས་ཤིང་།    །",
      "en": "Outwardly, you nurtured the conduct of a śrāvaka,",
      "en-trans": "chi ru nyentö chöpa rab kyang shing"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་གཉིས་ཐུགས་ལ་འབྱོངས།    །",
      "en": "Inwardly, you assimilated the two kinds of bodhicitta,",
      "en-trans": "nang du changchub sem nyi tuk la jong"
    },
    {
      "bo": "གསང་བ་འཁོར་འདས་ཆོས་ཀུན་དབུ་མར་སྡོམ།    །",
      "en": "Secretly, you bound the dharmas of saṃsāra and nirvāṇa within the central channel—",
      "en-trans": "sangwa khordé chö kün umar dom"
    },
    {
      "bo": "ཀུན་དགའ་འོད་ཟེར་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Kunga Özer,8at your feet I pray.",
      "en-trans": "künga özer zhab la solwa deb"
    },
    {
      "bo": "རབ་འབྱམས་ཤེས་བྱའི་ཆོས་ཀུན་ས་ལེར་གཟིགས།    །",
      "en": "You clearly perceived all knowable things in their infinity,",
      "en-trans": "rabjam shejé chö kün saler zik"
    },
    {
      "bo": "རྩ་རླུང་ཐིག་ལེའི་དྭངས་མ་གཡོ་མེད་འཆིང་།    །",
      "en": "And held fast the pure aspects of channels, energies and essences,",
      "en-trans": "tsa lung tiklé dangma yomé ching"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པ་གྲུབ་པའི་ཁྱུ་མཆོག་ཆེ།    །",
      "en": "Great leader among the siddhas of Cakrasaṃvara—",
      "en-trans": "khorlo dompa drubpé khyuchok ché"
    },
    {
      "bo": "ཀུན་དགའ་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Kunga Namgyal,9at your feet I pray.",
      "en-trans": "künga namgyal zhab la solwa deb"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་རྒྱ་མཚོའི་དབུས་ན་རབ་མཐོ་ཞིང་།    །",
      "en": "Pre-eminent amidst the oceanic lineage of practice,",
      "en-trans": "drubgyü gyatsö ü na rab to zhing"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་མཐར་སོན་དེ་ཉིད་བརྙེས།    །",
      "en": "You perfected study, contemplation and meditation, realized suchness,",
      "en-trans": "tö sam gompé tar sön denyi nyé"
    },
    {
      "bo": "ཡང་དག་ཡེ་ཤེས་གྲུབ་པའི་ཕུལ་བྱུང་བ།    །",
      "en": "And acquired the most excellent attainment of perfect wisdom—",
      "en-trans": "yangdak yeshe drubpé puljungwa"
    },
    {
      "bo": "བསྟན་པ་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Tenpa Namgyal,10at your feet I pray.",
      "en-trans": "tenpa namgyal zhab la solwa deb"
    },
    {
      "bo": "བཀའ་བཞི་བརྒྱུད་པའི་ཆུ་ཀླུང་ཇི་སྙེད་པ།    །",
      "en": "All the rivers of the lineage of fourfold transmission11merged",
      "en-trans": "ka zhi gyüpé chulung jinyepa"
    },
    {
      "bo": "ཐུགས་མཚོར་བསྐྱིལ་ནས་གདུལ་བྱ་སྨིན་མཛད་ཅིང་།    །",
      "en": "Within the ocean of your mind and your brought disciples to maturity,",
      "en-trans": "tuk tsor kyil né dulja min dzé ching"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་མངོན་རྟགས་མཐོན་པོར་གཤེགས།    །",
      "en": "Arriving at the highest realization of the paths and stages—",
      "en-trans": "sa dang lam gyi ngön tak tönpor shek"
    },
    {
      "bo": "བསྟན་འཛིན་ཆོས་ཀྱི་རྒྱ་མཚོར་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Tendzin Chökyi Gyatso,12at your feet I pray.",
      "en-trans": "tendzin chökyi gyatsor la solwa deb"
    },
    {
      "bo": "སྙན་བརྒྱུད་གདམས་པའི་གཏེར་ལ་དབང་འབྱོར་ཞིང་།    །",
      "en": "You acquired the treasure-like instructions of the aural lineage,",
      "en-trans": "nyengyü dampé ter la wangjor zhing"
    },
    {
      "bo": "གྲུབ་གཉིས་ནོར་བུའི་རྒྱལ་མཚན་བསྒྲེངས་མཛད་པ།    །",
      "en": "Raised the jewelled victory banner of the two kinds of siddhi,",
      "en-trans": "drub nyi norbü gyaltsen dreng dzepa"
    },
    {
      "bo": "སྐལ་ལྡན་སྐུ་བཞིའི་ལམ་བཟང་བཀྲི་བའི་གཉེན།    །",
      "en": "And guided the fortunate along the excellent path to the four kāyas—",
      "en-trans": "kalden ku zhi lamzang triwé nyen"
    },
    {
      "bo": "འཇམ་དཔལ་ཆོས་ཀྱི་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །",
      "en": "Jampal Chökyi Gyatso,13at your feet I pray.",
      "en-trans": "jampal chökyi gyatsor solwa deb"
    },
    {
      "bo": "ཀརྨ་བཀའ་བརྒྱུད་བསྟན་འཛིན་བྱེ་བའི་ཕུལ།    །",
      "en": "Foremost among millions of holders of the Karma Kagyü teachings,",
      "en-trans": "karma kagyü tendzin jewé pul"
    },
    {
      "bo": "ཟབ་གསང་གྲུབ་པའི་ལམ་རྟགས་མངོན་དུ་གྱུར།    །",
      "en": "You actualized the signs of the path to accomplishing the profound secret,",
      "en-trans": "zabsang drubpé lam tak ngön du gyur"
    },
    {
      "bo": "གཞན་ཕན་ཕྲིན་ལས་རྩལ་ཤུགས་རབ་འཆང་བ།    །",
      "en": "And held the perfect strength to act for the benefit of beings—",
      "en-trans": "zhenpen trinlé tsalshuk rab changwa"
    },
    {
      "bo": "འགྱུར་མེད་བསྟན་འཕེལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Gyurme Tenpel,14at your feet I pray.",
      "en-trans": "gyurmé tenpel zhab la solwa deb"
    },
    {
      "bo": "ཀརྨ་པ་ཡི་ཐུགས་ཀྱི་སྲས་སུ་གྱུར།    །",
      "en": "You became the heart-son of the Karmapa,",
      "en-trans": "karma pa yi tuk kyi sé su gyur"
    },
    {
      "bo": "ངེས་དོན་བདེན་པ་ཇི་བཞིན་གཟིགས་པའི་སྤྱན།    །",
      "en": "With your vision that perfectly beheld the truth of the definitive meaning,",
      "en-trans": "ngedön denpa jizhin zikpé chen"
    },
    {
      "bo": "ཆོས་ཀྱི་དབང་ཕྱུག་སྙན་བརྒྱུད་སྨིན་གྲོལ་སྤེལ།    །",
      "en": "Lord of Dharma, you propagated the aural lineage that matures and liberates—",
      "en-trans": "chökyi wangchuk nyengyü mindrol pel"
    },
    {
      "bo": "བསྟན་པ་མཐའ་རྒྱས་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Tenpa Tagyé,15at your feet I pray.",
      "en-trans": "tenpa tagyé zhab la solwa deb"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མའི་ཐུགས་ཀྱི་སྲས་གཅིག་པུ།    །",
      "en": "One and only heart-son of the Mañjughoṣa guru,16",
      "en-trans": "jamyang lamé tuk kyi sé chikpu"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པའི་ཁྱུ་མཆོག་རླབས་པོ་ཆེ།    །",
      "en": "Sublime leader of the learned and accomplished,",
      "en-trans": "khé dang drubpé khyuchok labpo ché"
    },
    {
      "bo": "ཀརྨ་སྙན་བརྒྱུད་བསྟན་པའི་སྲོག་འཛིན་པ།    །",
      "en": "Holder of the vital of the aural transmission of Karma Kagyü—",
      "en-trans": "karma nyengyü tenpé sokdzin pa"
    },
    {
      "bo": "ཆོས་ཀྱི་ཉིན་བྱེད་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Chökyi Nyinché,17at your feet I pray.",
      "en-trans": "chökyi nyinjé zhab la solwa deb"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཀུན་དགའ་ལེགས་པ་སོགས།    །",
      "en": "In your mind you recalled previous states in the play of rebirth,",
      "en-trans": "naljor wangchuk kün ga lekpa sok"
    },
    {
      "bo": "གསར་རྙིང་མཁས་གྲུབ་སྐྱེ་བའི་ཟློས་གར་དུ།    །",
      "en": "As learned and accomplished masters of Old and New Schools,",
      "en-trans": "sar nying khedrub kyewé dögar du"
    },
    {
      "bo": "སྔོན་གནས་རྗེས་སུ་དྲན་པའི་ཐུགས་མངའ་བ།    །",
      "en": "Including as the lord of yogis, Kunga Lekpa—",
      "en-trans": "ngön né jesu drenpé tuk ngawa"
    },
    {
      "bo": "ཁྱབ་བདག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "Glorious, all-encompassing guru, to you I pray.",
      "en-trans": "khyabdak palden lamar solwa deb"
    },
    {
      "bo": "རྒྱལ་སྲས་སྙིང་རྗེའི་ཟླ་བ་ཆེན་པོ་ནི།    །",
      "en": "Conquerors’ heir, great moon of compassion,",
      "en-trans": "gyalsé nyingjé dawa chenpo ni"
    },
    {
      "bo": "བྱང་ཆུབ་རིགས་ཀྱི་ནུས་པ་ཡོངས་སུ་རྒྱས།    །",
      "en": "In whom the potential of the enlightened family is fully present,",
      "en-trans": "changchub rik kyi nüpa yongsu gyé"
    },
    {
      "bo": "ཐེག་ཆེན་རྒྱལ་བའི་ལམ་བཟང་བསྟེན་མཁས་པ།    །",
      "en": "Skilled follower of the Great Vehicle’s excellent path to victory—",
      "en-trans": "tekchen gyalwé lamzang ten khepa"
    },
    {
      "bo": "ཀརྨ་ཕྲིན་ལས་ཀུན་ཁྱབ་ཞབས་བརྟན་གསོལ།    །",
      "en": "Karma Trinlé Kunkhyab,18I pray that your life may remain secure.",
      "en-trans": "karma trinlé künkhyab zhabten sol"
    },
    {
      "bo": "དེ་ལྟར་རྩ་བརྒྱུད་བླ་མའི་ཚོགས་རྣམས་ལ།    །",
      "en": "Thus, before this assembly of root and lineage gurus,",
      "en-trans": "detar tsa gyü lamé tsok nam la"
    },
    {
      "bo": "གུས་པས་ཕྱག་འཚལ་མཆོད་འབུལ་སྡིག་ལྟུང་བཤགས།    །",
      "en": "I devotedly pay homage, make offerings, confess my misdeeds and downfalls,",
      "en-trans": "güpé chaktsal chö bul diktung shak"
    },
    {
      "bo": "དགེ་ལ་ཡི་རངས་ཆོས་འཁོར་བསྐོར་བར་བསྐུལ།    །",
      "en": "Rejoice in virtue, request the turning of the Wheel of Dharma,",
      "en-trans": "gé la yirang chökhor korwar kul"
    },
    {
      "bo": "མྱ་ངན་མི་འདའ་བཞུགས་གསོལ་དགེ་ཚོགས་བསྔོ།    །",
      "en": "Beseech you not to pass into nirvāṇa but remain, and dedicate stores of virtue.",
      "en-trans": "nya ngen mi da zhuk sol gé tsok ngo"
    },
    {
      "bo": "འགྲོ་ཚོགས་ནམ་མཁའི་ཕ་མཐར་གཏུག་པ་རྣམས།    །",
      "en": "May the hosts of beings who extend even unto the limits of space",
      "en-trans": "dro tsok namkhé patar tukpa nam"
    },
    {
      "bo": "སྒྲིབ་སྦྱང་ཚོགས་རྫོགས་སྐུ་བཞིའི་གོ་འཕང་ཐོབ།    །",
      "en": "Purify obscurations, perfect the accumulations, and attain the four kāyas.",
      "en-trans": "drib jang tsok dzok ku zhi gopang tob"
    },
    {
      "bo": "བདག་གཞན་དེང་ནས་བྱང་ཆུབ་སྙིང་པོའི་བར།    །",
      "en": "From now until I and others reach the essence of awakening,",
      "en-trans": "dakzhen deng né changchub nyingpö bar"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མས་འབྲལ་མེད་རྗེས་འཛིན་ཤོག  །",
      "en": "May the glorious guru guide us without ever parting!",
      "en-trans": "palden lamé dralmé jedzin shok"
    }
  ]
}