{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shechen-rabjam-rinpoche/shechen-rabjam-incarnations-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཞེ་ཆེན་རབ་འབྱམས་སྐུ་ཕྲེང་རིམ་བྱོན་གྱི་གསོལ་འདེབས་དང་བའི་པདྨོ་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "A Supplication to the Successive Lives of Shechen Rabjam"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱི་བརྗིད། །",
      "en": "You perfected the four aspirations1and blaze with the majesty of the two accumulations,",
      "en-trans": "mönlam zhi drub tsok nyi pal gyi ji"
    },
    {
      "bo": "བདེ་གཤེགས་ཤར་ལྷོའི་ཞིང་མགོན་མྱ་ངན་མེད། །",
      "en": "Aśokaśrī, sugata of the south-easterly buddhafield,",
      "en-trans": "deshek sharlhö zhing gön nya ngen mé"
    },
    {
      "bo": "མཐའ་ཡས་སེམས་ཅན་དུག་གསུམ་ཞི་མཛད་ཅིང་། །",
      "en": "You who pacify the three poisons of infinite beings,",
      "en-trans": "tayé semchen duk sum zhidzé ching"
    },
    {
      "bo": "མཁའ་ཁྱབ་འགྲོ་བའི་མགོན་གྱུར་གསོལ་བ་འདེབས། །",
      "en": "Protector for all throughout the reaches of space, I supplicate you.",
      "en-trans": "khakhyab drowé gön gyur solwa deb"
    },
    {
      "bo": "མ་ལ་ཡ་རྩེར་གསང་བའི་བདག་པོ་ལས། །",
      "en": "At the peak of Mount Malaya, you received from Vajrapāṇi, Holder of Secrets,",
      "en-trans": "ma la ya tser sangwé dakpo lé"
    },
    {
      "bo": "ཀུན་བཟང་དགོངས་བརྒྱུད་གསང་ཆེན་མཐའ་དག་ནོད། །",
      "en": "The teachings of the Great Secret, mind mandate of Samantabhadra,",
      "en-trans": "kunzang gonggyü sang chen tadak nö"
    },
    {
      "bo": "ལེགས་པར་བཀའ་བསྡུས་མ་ལུས་ཐུགས་སུ་ཆུད། །",
      "en": "And, realising it perfectly, became its custodian—",
      "en-trans": "lekpar ka dü malü tuk su chü"
    },
    {
      "bo": "གནོད་སྦྱིན་སྐར་མདའ་གདོང་ལ་གསོལ་བ་འདེབས། །",
      "en": "Yakṣa Ulkāmukha (Karda Dong), I supplicate you.",
      "en-trans": "nöjin karda dong la solwa deb"
    },
    {
      "bo": "འཇམ་དཔལ་རྣོན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་འཕྲུལ། །",
      "en": "Magical, illusory manifestation of Mañjuśrītikṣṇa,",
      "en-trans": "jampal nönpö yeshe gyumé trul"
    },
    {
      "bo": "བདེ་གཤེགས་སྐུ་ཡི་བཀའ་བབ་བཤེས་གཉེན་ཆེ། །",
      "en": "Great spiritual friend who held the transmission of the Sugata Body2",
      "en-trans": "deshek ku yi kabab shenyen ché"
    },
    {
      "bo": "འོད་གསལ་རྫོགས་ཆེན་སྡེ་གསུམ་བསྟན་པའི་སྲོལ། །",
      "en": "And arranged the teachings of the naturally luminous Great Perfection into three sections—3",
      "en-trans": "ösal dzogchen dé sum tenpé sol"
    },
    {
      "bo": "འབྱེད་མཁས་མཉྫུ་མི་ཏྲར་གསོལ་བ་འདེབས། །",
      "en": "Mañjuśrīmitra, I supplicate you.",
      "en-trans": "jé khé mandzu mi trar solwa deb"
    },
    {
      "bo": "འཛམ་བུའི་གླིང་འདིར་སྟོན་པའི་རིང་སྲེལ་དངོས། །",
      "en": "To house the sacred relics of the Teacher,",
      "en-trans": "dzambüling dir tönpé ring sel ngö"
    },
    {
      "bo": "བཞུགས་པའི་མཆོད་སྡོང་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞེངས། །",
      "en": "You built eighty-four thousand stūpas in this world",
      "en-trans": "zhukpé chö dong gyé tri zhi tong zheng"
    },
    {
      "bo": "སྟོན་པའི་མཛད་རྗེས་གནས་དང་བསྟན་དར་ཤུལ། །",
      "en": "And successfully sustained and spread his teachings—",
      "en-trans": "tönpé dzé jé né dang ten dar shul"
    },
    {
      "bo": "གསལ་མཛད་ཨ་ཤོ་ཀ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Great illuminator, Aśoka, I supplicate you.",
      "en-trans": "sal dzé a sho kala solwa deb"
    },
    {
      "bo": "བཙད་པོའི་རིགས་འཁྲུངས་པདྨའི་ཐུགས་ཀྱིས་ཟིན། །",
      "en": "Born into the family of the king and guided by Padmasambhava,",
      "en-trans": "tsepö rik trung pemé tuk kyi zin"
    },
    {
      "bo": "ལོ་པཎ་སྐྱེས་མཆོག་བསྙེན་བཀུར་དམ་ཆོས་བསྒྱུར། །",
      "en": "You honoured sublime lotsāwas and paṇḍitas, supported Dharma translation,",
      "en-trans": "lo pen kyechok nyenkur damchö gyur"
    },
    {
      "bo": "དགེ་བཅུའི་སྲོལ་བཟུང་བཀའ་གཙིགས་བྲིས་ཏེ་བཞག །",
      "en": "And wrote an edict to promote the ten virtuous deeds—",
      "en-trans": "gé chü sol zung ka tsik dri té zhak"
    },
    {
      "bo": "རྒྱལ་སྲས་སད་ན་ལེགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Prince Senalek, I supplicate you.",
      "en-trans": "gyalsé sé na lek la solwa deb"
    },
    {
      "bo": "པདྨས་རྗེས་བཟུང་གྲུབ་པའི་ས་མཐོར་གཤེགས། །",
      "en": "You followed Padmasambhava, reached a lofty stage of accomplishment,",
      "en-trans": "pemé jezung drubpé sa tor shek"
    },
    {
      "bo": "མདོ་དང་སྒྱུ་འཕྲུལ་ལ་སོགས་སྔགས་ཀྱི་གཞུང་། །",
      "en": "And translated various tantric scriptures, such as the Do and Magical Display,4",
      "en-trans": "do dang gyutrul lasok ngak kyi zhung"
    },
    {
      "bo": "རྣམ་མང་བསྒྱུར་མཛད་དོན་གྱི་ལོ་ཙཱ་བ། །",
      "en": "Genuine lotsāwa,",
      "en-trans": "nam mang gyur dzé dön gyi lotsawa"
    },
    {
      "bo": "རྨ་བན་རིན་ཆེན་མཆོག་ལ་གསོལ་བ་འདེབས། །",
      "en": "Monk of Ma, Rinchen Chok, I supplicate you.5",
      "en-trans": "ma ben rinchen chok la solwa deb"
    },
    {
      "bo": "ཐུབ་པའི་རྒྱལ་ཚབ་ཤཱནྟ་རཀྵི་ཏའི། །",
      "en": "The direct disciple of Śāntarakṣita, regent of the Muni,",
      "en-trans": "tubpé gyaltsab shanta rakshité"
    },
    {
      "bo": "དངོས་སློབ་གངས་ལྗོངས་རྒྱལ་བསྟན་རྙོགས་མ་ཀུན། །",
      "en": "A paṇḍita who used scripture and reasoning to eradicate",
      "en-trans": "ngölob gangjong gyalten nyok ma kün"
    },
    {
      "bo": "ལུང་དང་རིག་པས་བསལ་མཛད་པཎྜི་ཏ། །",
      "en": "Impurity from the Buddha's teaching in the Land of Snows—6",
      "en-trans": "lung dang rigpé sal dzé pandita"
    },
    {
      "bo": "པདྨའི་ངང་ཚུལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Kamalaśīla, at your feet I supplicate.",
      "en-trans": "pemé ngang tsul zhab la solwa deb"
    },
    {
      "bo": "དགྱེས་མཛད་ལོ་ཙཱས་རྗེས་བཟུང་ཕྱག་རྒྱ་ཆེ། །",
      "en": "You followed Hevajra Lotsāwa7and became",
      "en-trans": "gyé dzé lo tsé jezung chakgya ché"
    },
    {
      "bo": "གྲུབ་པའི་རྣལ་འབྱོར་སྒྲུབ་བརྒྱུད་བསྟན་པའི་རྒྱན། །",
      "en": "An accomplished yogin of Mahāmudrā, an ornament of the practice lineage's teaching,",
      "en-trans": "drubpé naljor drubgyü tenpé gyen"
    },
    {
      "bo": "གངས་ལྗོངས་གྲུབ་བརྒྱའི་གཙུག་ནོར་མི་ལ་རྗེ། །",
      "en": "And crown jewel among hundreds of practitioners in the Land of Snow,",
      "en-trans": "gangjong drub gyé tsuk nor mi la jé"
    },
    {
      "bo": "བཞད་པ་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Lordly Milarepa Shepé Dorje, at your feet I supplicate.",
      "en-trans": "zhepa dorjé zhab la solwa deb"
    },
    {
      "bo": "མཁྱེན་རབ་སྣང་བས་ཤེས་བྱའི་ཆོས་ཀུན་གཟིགས། །",
      "en": "With the light of intelligence you discerned all that can be known,",
      "en-trans": "khyen rab nangwé shejé chö künzik"
    },
    {
      "bo": "བརྩེ་ཆེན་ཐུགས་རྗེས་མཐའ་ཡས་གདུལ་བྱ་སྐྱོང་། །",
      "en": "With loving compassion you cared for countless disciples,",
      "en-trans": "tsé chen tukjé tayé dulja kyong"
    },
    {
      "bo": "མཁས་བཙུན་གྲུབ་པའི་གྲགས་སྙན་ཁྱབ་མཛད་པའི། །",
      "en": "And your reputation for learning and righteousness spread far and wide—",
      "en-trans": "khé tsün drubpé drak nyen khyab dzepé"
    },
    {
      "bo": "རོང་སྟོན་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Great Rongtön,8at your feet I supplicate.",
      "en-trans": "rong tön chenpö zhab la solwa deb"
    },
    {
      "bo": "ཟབ་གཏེར་བཀའ་བབ་ཕྱག་རྫོགས་བསྟན་པའི་བདག །",
      "en": "Holder of the transmission of profound termas, master of Dzogchen and Mahāmudrā,",
      "en-trans": "zabter kabab chakdzok tenpé dak"
    },
    {
      "bo": "འཇམ་དཔལ་ཁྲོས་པའི་ང་རོས་ལོག་སྲེད་སྡེ། །",
      "en": "Dharma-king of Drikung, who, with wrathful Mañjuśrī’s roar,",
      "en-trans": "jampal tröpé ngarö lok sé dé"
    },
    {
      "bo": "ཟིལ་གནོན་ཆོས་ཀྱི་རྒྱལ་པོ་འབྲི་གུང་པ། །",
      "en": "Overpowered all those whose attachment was misplaced—",
      "en-trans": "zilnön chö kyi gyalpo drigung pa"
    },
    {
      "bo": "རིན་ཆེན་ཕུན་ཚོགས་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Rinchen Puntsok,9at your feet I supplicate.",
      "en-trans": "rinchen püntsok zhab la solwa deb"
    },
    {
      "bo": "ཨོ་རྒྱན་བསྙེན་སྒྲུབ་བཀའ་བརྒྱུད་གོང་མའི་སྲོལ། །",
      "en": "You perfected the practice of approach and accomplishment from Orgyenpa and the early Kagyü tradition,10",
      "en-trans": "orgyen nyendrub kagyü gongmé sol"
    },
    {
      "bo": "ཉམས་བཞེས་མཐར་སོན་གྲུབ་པའི་བརྟུལ་ཞུགས་བསྐྱངས། །",
      "en": "And, cherishing the life of a yogin, displayed miracles",
      "en-trans": "nyam zhé tar sön drubpé tulzhuk kyang"
    },
    {
      "bo": "རྫུ་འཕྲུལ་མངའ་བརྙེས་བལ་བོད་ཆོས་ལ་བསྒྱུར། །",
      "en": "That brought Nepalis and Tibetans to the Dharma—",
      "en-trans": "dzutrul nga nyé bal bö chö la gyur"
    },
    {
      "bo": "དབུས་སྨྱོན་ཧེ་རུ་ཀ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Ü-nyön Heruka,11I supplicate you.",
      "en-trans": "ü nyön heruka la solwa deb"
    },
    {
      "bo": "འཇམ་དཔལ་མཁྱེན་རབ་ཉི་མ་ཐུགས་ལ་ཤར། །",
      "en": "The sun of Mañjuśrī’s intelligence arose in your mind,",
      "en-trans": "jampal khyen rab nyima tuk la shar"
    },
    {
      "bo": "ལུང་རིགས་སྨྲ་བའི་སེངྒེས་ལོག་སྨྲའི་ཚོགས། །",
      "en": "And, with the lion's roar of reasoning and scriptural citation,",
      "en-trans": "lung rik mawé sengé lok mé tsok"
    },
    {
      "bo": "ཟིལ་གནོན་མཁས་གྲུབ་དབང་ཕྱུག་རབ་འབྱམས་པ། །",
      "en": "You outshone those who harboured wrong views—master of learning and spiritual accomplishment,",
      "en-trans": "zilnön khedrub wangchuk rabjam pa"
    },
    {
      "bo": "བསྟན་པའི་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Rabjampa Tenpé Gyaltsen,12at your feet I supplicate.",
      "en-trans": "tenpé gyaltsen zhab la solwa deb"
    },
    {
      "bo": "དམ་པའི་ཚུལ་དགུས་ངེས་གསང་བསྟན་མཆོག་འཛིན། །",
      "en": "With the nine qualities of a sublime being,13you held the supreme teachings of the definitive secret,",
      "en-trans": "dampé tsul gü ngé sang ten chokdzin"
    },
    {
      "bo": "མཁྱེན་དང་བརྩེ་བའི་ཕྲིན་ལས་ཕ་མཐའ་བརྡལ། །",
      "en": "And, with your wise and loving activity, spread them far and wide—",
      "en-trans": "khyen dang tsewé trinlé pata dal"
    },
    {
      "bo": "ཀུན་བཟང་བསྟན་པའི་ཉི་མ་ཞེ་ཆེན་པ། །",
      "en": "Sun of the teachings of Samantabhadra,",
      "en-trans": "kunzang tenpé nyima zhé chenpa"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Nampar Gyalwa of Shechen,14at your feet I supplicate.",
      "en-trans": "nampar gyalwé zhab la solwa deb"
    },
    {
      "bo": "བསླབ་གསུམ་རྣམ་དག་མཁྱེན་བརྩེ་ནུས་པའི་གཏེར། །",
      "en": "Pure in the three higher trainings,15a veritable treasure of knowledge, love and ability,",
      "en-trans": "lab sum namdak khyen tsé nü pé ter"
    },
    {
      "bo": "སྨིན་གྲོལ་བདུད་རྩིས་སྐལ་བཟང་གདུལ་བྱའི་ཚོགས། །",
      "en": "With the nectar of maturation and liberation, you brought hosts of fortunate disciples",
      "en-trans": "mindrol dütsi kalzang duljé tsok"
    },
    {
      "bo": "ཡོངས་སྨིན་ངེས་པ་དོན་གྱི་རིག་པ་འཛིན། །",
      "en": "To spiritual maturity—awareness-holder of the definitive meaning,",
      "en-trans": "yong min ngepa dön gyi rigpa dzin"
    },
    {
      "bo": "དཔལ་འབྱོར་རྒྱ་མཚོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Paljor Gyatso,16at your feet I supplicate.",
      "en-trans": "paljor gyatsö zhab la solwa deb"
    },
    {
      "bo": "ཨོ་རྒྱན་ལུང་བསྟན་ཟབ་མོའི་གཏེར་ལ་དབང་། །",
      "en": "Prophesied by the master of Oḍḍiyāna as the owner of profound termas,",
      "en-trans": "orgyen lungten zabmö ter la wang"
    },
    {
      "bo": "བརྟུལ་ཞུགས་སྤྱོད་པས་སྦས་པའི་གནས་ཞལ་འབྱེད། །",
      "en": "You engaged in yogic conduct and revealed hidden lands.",
      "en-trans": "tulzhuk chöpé bepé né zhal jé"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་གདིང་ལྡན་སྔགས་སྤྱོད་གར་གྱི་དབང་། །",
      "en": "Lord of the dance, whose yogic conduct arose from deep confidence in the creation and completion phases,",
      "en-trans": "kyedzok dingden ngak chö gar gyi wang"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Chökyi Gyaltsen,17at your feet I supplicate.",
      "en-trans": "chö kyi gyaltsen zhab la solwa deb"
    },
    {
      "bo": "འཇམ་དཔལ་གཤིན་རྗེ་གཤེད་ཀྱིས་རྗེས་སུ་བཟུང་། །",
      "en": "Guided by Mañjuśrī-Yamāntaka,",
      "en-trans": "jampal shinjé shé kyi jesu zung"
    },
    {
      "bo": "གཞན་ཕན་བསྡུ་བཞིའི་ཕྲིན་ལས་བསམ་མི་ཁྱབ། །",
      "en": "Your altruistic activities, through the four means of gathering disciples, were inconceivable,18",
      "en-trans": "zhenpen du zhi trinlé sam mikhyab"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་འགྱུར་མེད་ངེས་དོན་གཟིགས། །",
      "en": "And, having perceived the unchanging truth, you brought benefit to all with a connection—",
      "en-trans": "dreltsé dönden gyurmé ngedön zik"
    },
    {
      "bo": "ཀུན་བཟང་བསྟན་པའི་ཉི་མར་གསོལ་བ་འདེབས། །",
      "en": "Kunzang Tenpé Nyima,19I supplicate you.",
      "en-trans": "kunzang tenpé nyimar solwa deb"
    },
    {
      "bo": "རླབས་ཆེན་རྒྱལ་བའི་སྲས་ཀྱི་སྤྱོད་པ་ཡིས། །",
      "en": "A friend, who through the magnificent conduct of a bodhisattva,",
      "en-trans": "lab chen gyalwé sé kyi chöpa yi"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཞིང་འདིར་སྣང་བའི་གཉེན། །",
      "en": "Caused the precious teachings of Buddha to illuminate this world,",
      "en-trans": "tenpa rinchen zhing dir nangwé nyen"
    },
    {
      "bo": "གདུལ་དཀའ་འདུལ་མཛད་གྲུབ་པའི་རྡོ་རྗེ་འཛིན། །",
      "en": "Accomplished vajra holder, subduer of the difficult-to-tame,",
      "en-trans": "dul ka dul dzé drubpé dorjé dzin"
    },
    {
      "bo": "བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Tenpé Nima,20at your feet I supplicate.",
      "en-trans": "tenpé nyimé zhab la solwa deb"
    },
    {
      "bo": "རིས་མེད་བསྟན་འགྲོའི་མགོན་གྱུར་གཏེར་ཆེན་རྗེ། །",
      "en": "Through the kindness of the gentle protector Rabsel Dawa,21",
      "en-trans": "rimé ten drö gön gyur terchen jé"
    },
    {
      "bo": "འཇམ་མགོན་རབ་གསལ་ཟླ་བའི་ཐུགས་བསྐྱེད་ཀྱིས། །",
      "en": "Treasure lord and unbiased protector of the teachings and beings,",
      "en-trans": "jam gön rabsal dawé tukkyé kyi"
    },
    {
      "bo": "ངེས་གྲོལ་སྔ་འགྱུར་བཤད་སྒྲུབ་ཆུ་གཏེར་ཆེའི། །",
      "en": "You became an excellent repository of the accomplishment and explanation of the Ancient Translations of definite freedom—",
      "en-trans": "ngé drol ngagyur shedrub chuter ché"
    },
    {
      "bo": "དབྱིག་འཛིན་ཆོས་ཀྱི་སེངྒེར་གསོལ་བ་འདེབས། །",
      "en": "Chökyi Senge,22at your feet I supplicate.",
      "en-trans": "yik dzin chö kyi sengér solwa deb"
    },
    {
      "bo": "དེ་ལྟར་མི་ཕྱེད་གུས་པས་གསོལ་བཏབ་མཐུས། །",
      "en": "Through the power of making this supplication with unshakeable devotion,",
      "en-trans": "detar miché güpé soltab tü"
    },
    {
      "bo": "ཚེ་རབས་ཕྲེང་བར་དམ་པའི་མགོན་རྣམས་ཀྱིས། །",
      "en": "May I be guided by the sublime protectors of this garland-like succession of lives",
      "en-trans": "tserab trengwar dampé gön nam kyi"
    },
    {
      "bo": "རྗེས་བཟུང་མཉེས་པ་གསུམ་གྱིས་ལེགས་བསྙེན་པས། །",
      "en": "And through serving them well through the three means of gratification,23",
      "en-trans": "jezung nyepa sum gyi lek nyenpé"
    },
    {
      "bo": "དོན་གཉིས་བསམ་ཀུན་ལྷུན་འགྲུབ་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that all my wishes and the twofold aims may be spontaneously fulfilled.",
      "en-trans": "dön nyi sam kün lhündrub jingyi lob"
    }
  ]
}