{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/khandro-tare-lhamo/khenpo-munsel-lives-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྐྱེ་འཕྲེང་གསོལ་འདེབས་རིན་ཆེན་འཕྲེང་མཛེས་བཞུགས་སོ།།"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷྱེཿ"
    },
    {
      "bo": "ཀ་དག་རང་བྱུང་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་༔"
    },
    {
      "bo": "རང་བཞིན་མ་འགགས་ཡེ་ཤེས་རིགས་ལྔའི་ཚོགས༔"
    },
    {
      "bo": "ཐུགས་རྗེའི་རོལ་རྩལ་རྒྱལ་ཀུན་ཡོངས་འདུས་པ༔"
    },
    {
      "bo": "ཁྱབ་བདག་མཉམ་མེད་བླ༵་མ༵་རི༵ན་པོ༵་ཆེ༵༔"
    },
    {
      "bo": "འགྲོ་བློའི་མ་རིག་མུ༵ན་པ་ཡོངས་སེ༵ལ་ཞིང་༔"
    },
    {
      "bo": "བཤད་སྒྲུབ་བསྟན་པའི་པད་ཚལ་བཞད་མཛད་པ༔"
    },
    {
      "bo": "སྨྲ་བའི་ཉི་མ་འཇིག༵ས་མེད་ཆོས༵་ཀྱི༵་དབ༵ང་༔"
    },
    {
      "bo": "བསྟན་པའི་རྩ་ལག་དེ་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སྔོན་ཚེ་སངས་རྒྱས་མཐོང་ན་དགའ་བའི་དྲུང་༔"
    },
    {
      "bo": "བྱང་སེམས་རིན༵་ཆེན༵་ཟླ༵་བ༵འི་འོ༵ད་ཅེས་བྱ༔"
    },
    {
      "bo": "ཐུབ་པའི་སྤྱན་སྔར་འཕ༵གས་པ༵་མ༵་ཕ༵མ་པ༵༔"
    },
    {
      "bo": "འཕགས་པའི་ཡུལ་དབུས་དྷརྨ༵་ཤྲི༵་གྲགས༔"
    },
    {
      "bo": "བལ་བོའི་ཡུལ་དུ་བཱི༵་མ༵་མ༵་ཏི༵་དང་༔"
    },
    {
      "bo": "དབུས་གཙང་ཁམས་སུ་ངག༵་དབ༵ང་བློ༵་གྲོས༵་རྗེ༔"
    },
    {
      "bo": "ཙི་ནའི་ཡུལ་དུ་ཐང༵་རྗེ༵་པད༵་མ༵་དཀར༔"
    },
    {
      "bo": "གངས་རིའི་ཁྲོད་དུ་དྲི༵་མེ༵ད་འོད༵་ཟེར༵་དང་༔"
    },
    {
      "bo": "དྭགས་པོར་ས་སྐྱོང་ཡུལ་འཆང་ཀི༵རྟི༵་ཤྲི༵༔"
    },
    {
      "bo": "ད་ལྟ་ཞིང་འདིའི་འགྲོ་ངོར་མི་ཡི་ཚུལ༔"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་འདྲེན་པའི་དབང་ཕྱུག་མཆོག༔"
    },
    {
      "bo": "དགེ་བའི་བཤེས་གཉེན་ཚུལ༵་ཁྲིམ༵ས་རྡོ༵་རྗེ༵འི་དཔལ༔"
    },
    {
      "bo": "འདི་འོག་བདེ༵་ཆེན༵་རི༵ག་པ༵འི་རྡོ༵་རྗེ་ཞེས༔"
    },
    {
      "bo": "མཐོང་ཐོས་དྲན་རེག་སྨིན་གྲོལ་ལམ་ལ་འགོད༔"
    },
    {
      "bo": "མ་འོངས་སང༵ས་རྒྱ༵ས་ཆོས༵་ཀྱི༵་བློ༵་གྲོས༵་ཅེས༔"
    },
    {
      "bo": "དུས་གསུམ་འགྲོ་འདྲེན་ཁྱེད་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སྐྱེ་ཀུན་འབྲལ་མེད་ཁྱོད་ཀྱིས་རྗེས་བཟུང་སྟེ༔"
    },
    {
      "bo": "སྨིན་གྲོལ་གདམས་པའི་ཡོན་ཏན་ལུས་ཟུངས་རྒྱས༔"
    },
    {
      "bo": "རྫོགས་པ་ཆེན་པོའི་གསང་ལམ་མཐར་ཕྱིན་ནས༔"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་སངས་རྒྱས་འཐོབ་གྱུར་ཅིག༔"
    }
  ]
}