{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/khenpo-chime-rigdzin/beautiful-adornment-of-faith-prayer-tsultrim-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་དམ་པ་ཚུལ་ཁྲིམས་བློ་གྲོས་མཆོག་གི་གསོལ་འདེབས་དད་པའི་མཛེས་རྒྱན་བཞུགས།"
  },
  "text": [
    {
      "bo": "མདོ་སྔགས་ཆོས་ཀྱི་ཆུ་བོ་མ་ལུས་པ། །"
    },
    {
      "bo": "མཁྱེན་པའི་རྒྱ་མཚོ་གཅིག་ཏུ་འཁྱིལ་བ་ཡི། །"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་དངོས་མི་ཕམ་རྒྱ་མཚོ་ལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས། །"
    },
    {
      "bo": "མགོན་དེའི་ཐུགས་ཀའི་དམར་སེར་དྷཱི་ཡིག་གི །"
    },
    {
      "bo": "འཕྲིན་ལས་འོད་ཟེར་གདུལ་བྱའི་དཔལ་དུ་ཤར། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ཡིད་བཞིན་ནོར་བུ་ཡི། །"
    },
    {
      "bo": "བྱིན་རླབས་འོད་ཀྱིས་ཚེ་རབས་ཀུན་ཏུ་སྐྱོངས། །"
    },
    {
      "bo": "རྣམ་དག་ཚུལ་ཁྲིམས་དཔག་བསམ་ལྗོན་པ་ལ། །"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་བློ་གྲོས་ཡལ་འདབ་རྒྱས། །"
    },
    {
      "bo": "གངས་ལྗོངས་འཆི་མེད་ལྷ་ཡི་སྐྱེད་ཚལ་གྱི། །"
    },
    {
      "bo": "ལྟོས་བཅས་འགྲོ་བའི་མགོན་དེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཡོན་ཏན་ལང་ཚོ་གཞན་དང་མི་མཉམ་པའི། །"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་དུས་བབས་པདྨ་དཀར་པོ་ཁྱེད། །"
    },
    {
      "bo": "མདོ་ཁམས་ཏྲེ་ཤོད་འཛིན་མའི་བསོད་ནམས་ཀྱིས། །"
    },
    {
      "bo": "ཐུབ་བསྟན་སྨན་ལྗོངས་མཛེས་པའི་རྒྱན་དུ་འཁྲུངས། །"
    },
    {
      "bo": "གསང་ཆེན་དབེན་པའི་རི་ངོགས་ཉམས་དགའ་བར། །"
    },
    {
      "bo": "སྐྱབས་མཆོག་བླ་མ་འཇམ་པའི་རྡོ་རྗེའི་ཞབས། །"
    },
    {
      "bo": "མཉེས་པ་གསུམ་གྱིས་བསྟེན་ནས་ཐུགས་དགོངས་ལོན། །"
    },
    {
      "bo": "ཤེས་བྱའི་ཆོས་ལ་རྨོངས་པ་མཐའ་ནས་སངས། །"
    },
    {
      "bo": "མགོན་དེའི་སྒྲིབ་མེད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས། །"
    },
    {
      "bo": "འབྱུང་འགྱུར་བསྟན་འགྲོའི་དཔལ་དུ་ཡོངས་གཟིགས་ནས། །"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་བདག་པོ་བསམ་ཡས་པ། །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་བློ་གྲོས་མཆོག་གི་མཚན་དེ་གསོལ། །"
    },
    {
      "bo": "གངས་དཀར་རི་བོས་བསྐོར་བའི་རྒྱལ་ཁམས་ནས། །"
    },
    {
      "bo": "བསླབ་གསུམ་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པ་ལས། །"
    },
    {
      "bo": "འཕྲིན་ལས་དྲི་བསུང་གོ་ལའི་འགྲོས་དང་འབྲེལ། །"
    },
    {
      "bo": "ཤར་ནུབ་རྒྱ་མཚོ་ཆེན་པོའི་མཐའ་ལས་བརྒལ། །"
    },
    {
      "bo": "ངུར་སྨྲིག་རྒྱན་གྱིས་མཛེས་པའི་ཀུན་སྤྱོད་དག །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་ལ་ཕན་པའི་ལྷག་བསམ་གཙང་། །"
    },
    {
      "bo": "མདོ་སྔགས་ཤེས་བྱ་རིག་པའི་གནས་ལ་དབང་། །"
    },
    {
      "bo": "ཐར་བའི་ལམ་སྟོན་མཆོག་དེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇིགས་རུང་ཁྲག་གི་ཡུར་ཆུ་བཞུར་ས་ན། །"
    },
    {
      "bo": "སྡུག་བསྔལ་མཆི་མ་འཁྲིགས་པའི་སེམས་ཅན་གྱི། །"
    },
    {
      "bo": "སྲོག་གི་གཤེད་དུ་བརྡར་བའི་རལ་གྲིའི་སོ། །"
    },
    {
      "bo": "སྙིང་རྗེའི་ཕྱག་གིས་བཀག་པའི་གྲངས་མི་ཟིན། །"
    },
    {
      "bo": "མཐོན་པོའི་གསེར་ཁྲིའི་ཁ་ན་ཁྱེད་ཉིད་མེད། །"
    },
    {
      "bo": "འབྱོར་ཕྱུག་འདུ་ལོང་དབུས་ནས་ཁྱེད་མི་མཇལ། །"
    },
    {
      "bo": "དམར་ནག་འདམ་རྫབ་གཡོ་བའི་ར་བ་ན། །"
    },
    {
      "bo": "ཉམ་ཐག་འགྲོ་བ་འདྲེན་པའི་མགོན་དུ་རྟག །"
    },
    {
      "bo": "ལྷ་ཡིས་གནང་བའི་ངུར་སྨྲིག་ན་བཟའི་གོས། །"
    },
    {
      "bo": "འཚེ་མེད་དྲང་སྲོང་ཆེན་པོའི་ཆ་ལུགས་དེ། །"
    },
    {
      "bo": "སྐྱབས་མེད་འགྲོ་བ་གང་ན་ཡོད་པའི་སར། །"
    },
    {
      "bo": "མཐོང་བ་ཁྱེད་འདྲའི་སྐུ་ལ་ལྷག་ཏུ་མཛའ། །"
    },
    {
      "bo": "རིང་པོའི་ལོ་ཟླའི་ཁྲོད་ཀྱི་ལུས་སེམས་ཀུན། །"
    },
    {
      "bo": "སྙིང་རྗེ་ཉག་མ་གཅིག་གིས་གསོས་པ་ཡི། །"
    },
    {
      "bo": "སེམས་དཔའ་ཁྱེད་ཀྱི་ཕྱག་གི་བརྐྱང་བསྐུམ་ཡན། །"
    },
    {
      "bo": "མཐའ་དག་འགྲོ་བའི་དོན་དུ་མ་གྱུར་གང་། །"
    },
    {
      "bo": "དག་པ་ལྷ་ཡི་ཞིང་ནས་ཕེབས་ཚུལ་སོགས། །"
    },
    {
      "bo": "ལྐོག་གྱུར་སྐྱེས་རབས་མང་པོ་མི་ཤེས་ཀྱང་། །"
    },
    {
      "bo": "མངོན་གྱུར་ཡོན་ཏན་དེ་ཡིས་དད་གུས་འཕེལ། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གངས་ཅན་བཅུ་ཕྲག་རིག་པའི་ཁང་བཟང་དེ། །"
    },
    {
      "bo": "ཆར་དང་རླུང་གིས་འཐོར་ལ་ཉེ་བའི་དུས། །"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་པའི་ཐབས་ཀྱིས་འཛིན་མཁས་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལུགས་གཉིས་མཛད་པ་གང་དང་གང་ལ་ཡང་། །"
    },
    {
      "bo": "རང་འདོད་ཉེས་པ་ཕྲ་མོས་མ་གོས་པར། །"
    },
    {
      "bo": "སུ་ཡིས་བརྟགས་ཀྱང་སྐྱོན་དང་བྲལ་བ་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོ་དག་པའི་ཞིང་དུ་ཕེབས། །"
    },
    {
      "bo": "སྐལ་བཟང་སློབ་མའི་རེ་བའི་སེམས་ཀྱི་རྟེན། །"
    },
    {
      "bo": "བསྟན་པའི་གཞི་མ་སྐྱོང་བའི་བརྒྱུད་འཛིན་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བླུན་རྨོངས་གཅན་གཟན་གཏུམ་པོའི་འཚོ་བ་བཞིན། །"
    },
    {
      "bo": "ཤ་ཁྲག་ཟས་ལ་རྔམ་པའི་ཡུལ་ལྗོངས་འདིར། །"
    },
    {
      "bo": "དཀར་ཟས་གཙང་མའི་སྲོལ་བཟང་སྤེལ་མཁན་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱི་ཡི་ལོངས་སྤྱོད་ཅི་ཙམ་འཕེལ་བ་བཞིན། །"
    },
    {
      "bo": "ནང་གི་ངེས་འབྱུང་ཤུགས་ཀྱིས་སྲབ་པའི་དུས། །"
    },
    {
      "bo": "འཁོར་བའི་རང་མཚང་གཏིང་ནས་རིག་པ་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐེག་ཆེན་ཆོས་ཀྱི་གྲལ་དུ་ཞུགས་ན་ཡང་། །"
    },
    {
      "bo": "ཉམས་ལེན་གནད་ལ་སློབ་མཁན་ཉུང་བའི་དུས། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་ཀྱིས་ཐུགས་རྒྱུད་གང་བ་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མདོ་སྔགས་ཆོས་ཚུལ་རྒྱ་མཚོའི་ལམ་གྱི་གསང་། །"
    },
    {
      "bo": "བློ་ལས་འདས་པ་ཆོས་ཉིད་ཟབ་མོའི་དོན། །"
    },
    {
      "bo": "མཁྱེན་པའི་ཉི་མ་སྙིང་ནས་ཤར་བ་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་གདམས་པའི་ཟབ་གནད་མི་ཤེས་པར། །"
    },
    {
      "bo": "དབང་ལུང་ཆོས་ཀྱི་ཐོབ་གྲངས་གསོག་པའི་དུས། །"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་པའི་གནད་གསང་སྟོན་མཁན་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐེག་པའི་ཡང་རྩེ་འོད་གསལ་རྫོགས་པ་ཆེའི། །"
    },
    {
      "bo": "རྩོལ་མེད་ལམ་གྱི་འཕྲིན་ལས་མྱུར་བའི་དུས། །"
    },
    {
      "bo": "དོན་བརྒྱུད་བྱིན་རླབས་རྟོགས་པའི་འབྱུང་གནས་ཁྱེད། །"
    },
    {
      "bo": "མཚུངས་མེད་དྲིན་ཆེན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟབ་དགུའི་གདམས་ངག་མང་དུ་གནང་ན་ཡང་། །"
    },
    {
      "bo": "འདོད་འབྱུང་ནོར་བུ་འདྲ་བའི་བྱང་ཆུབ་སེམས། །"
    },
    {
      "bo": "བདག་འཛིན་སེམས་ཀྱི་གཉེན་པོར་འགྲོ་དཀའ་བས། །"
    },
    {
      "bo": "ད་དུང་ཐུགས་རྗེས་སྐྱོངས་ཤིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "གོམས་པའི་དབང་གིས་གང་སར་རྒྱུག་པ་ཡི། །"
    },
    {
      "bo": "རྟ་རྒོད་ལོང་བ་འདྲ་བའི་རྣམ་རྟོག་འདི། །"
    },
    {
      "bo": "མཉམ་པར་བཞག་ཀྱང་བཀོལ་དུ་མི་བཏུབ་པས།"
    },
    {
      "bo": "བྱིན་རླབས་ཞགས་པས་ཆོངས་ཤིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "ཐེ་ཚོམ་མུན་པ་མཐའ་ནས་སངས་བ་ཡི། །"
    },
    {
      "bo": "ཉ་གང་ཟླ་བ་འདྲ་བའི་རྟོགས་པ་ཞིག །"
    },
    {
      "bo": "མྱུར་དུ་སེམས་ཀྱི་ནམ་མཁར་ཤར་བ་ལ། །"
    },
    {
      "bo": "བཙན་ཐབས་དགོངས་པ་སྤོར་ཅིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "བར་ཆད་འཕྲང་ལས་བཟུར་ཐབས་མི་ཤེས་པའི། །"
    },
    {
      "bo": "ལམ་ཁའི་སྲིན་བུ་འདྲ་བའི་རྨོངས་པ་བདག །"
    },
    {
      "bo": "འགལ་རྐྱེན་ལོག་པའི་ལམ་དུ་འགྲོ་སྲིད་ན། །"
    },
    {
      "bo": "བརྩེ་བའི་ཕྱག་གིས་སྐྱོབས་ཤིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "ནམ་འོང་འདིར་འོང་ཆ་འཇོག་མེད་པ་ཡི། །"
    },
    {
      "bo": "ནམ་མཁའི་ཐོག་དང་འདྲ་བའི་འཆི་བདག་བདུད། །"
    },
    {
      "bo": "ཉམ་ཆུང་སྲོག་གི་གཤེད་དུ་བབ་པའི་ཉིན། །"
    },
    {
      "bo": "འདྲེན་པའི་དེད་དཔོན་མཛོད་ཅིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "འདི་དང་ཕྱི་མ་བར་དོའི་གནས་སྐབས་དང་། །"
    },
    {
      "bo": "སྐྱིད་སྡུག་ལེགས་ཉེས་ལས་བསྐོས་གར་བབས་ཀྱང་། །"
    },
    {
      "bo": "མགོན་པོ་གང་ལས་སྐྱབས་གཞན་མི་འདུག་པས། །"
    },
    {
      "bo": "འབྲལ་མེད་ཐུགས་རྗེས་གཟིགས་ཤིག་བླ་མ་རྗེ། །"
    },
    {
      "bo": "མཁྱེན་རྟོགས་འོད་ཀྱིས་མཛེས་པའི་ཟླ་བ་དེ། །"
    },
    {
      "bo": "གང་དུ་སོང་ཡང་ཀུན་གྱི་གཙུག་གི་རྒྱན། །"
    },
    {
      "bo": "ང་ཅག་ལྟོས་བཅས་སྐྱེ་འགྲོའི་སྐྱབས་གནས་སུ། །"
    },
    {
      "bo": "བསྐལ་བ་རྒྱ་མཚོའི་བར་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "བྱིས་པས་ཐོག་མའི་ཤེས་བྱ་སློབ་ཚུལ་ནས། །"
    },
    {
      "bo": "རྒན་པོས་ཕྱི་མའི་འགྲོ་ཆས་སྒྲུབ་ཚུལ་སོགས། །"
    },
    {
      "bo": "ལུགས་གཉིས་བླང་དོར་སྟོན་པའི་དེད་དཔོན་ཁྱེད། །"
    },
    {
      "bo": "དུས་མཐའི་འགྲོ་བའི་སྒྲོན་མེར་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "ངན་སྤྱོད་སྣ་དགུས་མ་མོ་འཁྲུགས་པ་ལས། །"
    },
    {
      "bo": "བཅོས་མེད་ནད་ཀྱིས་འཛམ་གླིང་ཕོངས་བའི་དུས། །"
    },
    {
      "bo": "འབད་པ་བརྒྱ་ཡིས་འགོག་པའི་ལྷག་བསམ་ཅན། །"
    },
    {
      "bo": "མགོན་མེད་སྐྱེ་བོའི་གཉེན་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "འདྲ་མིན་སྐད་དང་ཡིག་རིགས་འདྲེས་པ་ལས། །"
    },
    {
      "bo": "ལུགས་གཉིས་སྲོལ་ཁའི་རྨང་རྡོ་བཤིག་པས་ན། །"
    },
    {
      "bo": "རང་སྐད་གཙང་མའི་ཆུ་རྒྱུན་མཐུད་པའི་མགོན། །"
    },
    {
      "bo": "བཅུ་ཕྲག་རིག་པའི་བདག་པོར་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "གངས་ལྗོངས་མདོ་སྔགས་ཆོས་ཀྱི་དགའ་ཚལ་དེ། །"
    },
    {
      "bo": "ཟུངས་ཟད་ནད་པ་བཞིན་དུ་གྱུར་དུས་འདིར། །"
    },
    {
      "bo": "སྣ་ཚོགས་ཐབས་ཀྱིས་འབད་པའི་བསྟན་འཛིན་མཆོག །"
    },
    {
      "bo": "ཐུབ་བསྟན་མཛེས་པའི་རྒྱན་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "གནའ་དེང་རིག་པའི་མཐའ་རྒྱ་མ་ཆོད་པར། །"
    },
    {
      "bo": "ཐོས་ཆུང་ལོག་པར་སྨྲ་བ་མང་བའི་དུས། །"
    },
    {
      "bo": "ཡིན་མིན་དྲང་ཤན་འབྱེད་ལ་ཚངས་པའི་ཐིག །"
    },
    {
      "bo": "ལེགས་བཤད་རྒྱ་མཚོའི་གཏེར་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་དངོས་བློ་གྲོས་མཚུངས་མེད་རྗེའི། །"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་མཛད་འཕྲིན་ནམ་མཁའི་མཐའ་དང་མཉམ། །"
    },
    {
      "bo": "འཕྲིན་ལས་གང་སར་སྤེལ་བའི་བྱེད་པོ་ཁྱེད། །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་བའི་དཔལ་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "བདག་སོགས་ཆོས་མེད་འཁོར་བའི་སེམས་ཅན་ལ། །"
    },
    {
      "bo": "བླང་དོར་ལམ་གྱི་སྣང་བ་གསལ་བ་ཡི། །"
    },
    {
      "bo": "སྤྱི་བོའི་གཙུག་གི་ཉི་མ་ཁྱེད་ཡིན་པས། །"
    },
    {
      "bo": "ཐར་འདོད་དད་པའི་རྟེན་དུ་ཞབས་བརྟན་ཤོག །"
    },
    {
      "bo": "བསླུ་མེད་རིན་ཆེན་གསུམ་གྱི་བདེན་པ་དང་། །"
    },
    {
      "bo": "རྩ་གསུམ་དམ་ཅན་སྲུང་མའི་བྱིན་རླབས་ཀྱིས། །"
    },
    {
      "bo": "མཚུངས་མེད་བླ་མའི་ཞབས་པད་ཡུན་བརྟན་ཞིང་། །"
    },
    {
      "bo": "མཛད་འཕྲིན་སྣང་བས་ཞིང་འདི་མཛེས་གྱུར་ཅིག །"
    }
  ]
}