{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/trulshik-rinpoche/prayer-for-translators",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལོ་ཙཱ་བའི་གསོལ་སྨོན་བཞུགས།",
    "en": "Prayer for Translators"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om swasti"
    },
    {
      "bo": "བསྐལ་བཟང་རྣམ་འདྲེན་སྟོན་པ་ཤཱཀྱའི་ཏོག །",
      "en": "Guide for this fortunate age, crowning glory of the Śākya clan,",
      "en-trans": "kalzang nam dren tönpa shakyé tok"
    },
    {
      "bo": "མཁན་སློབ་ཆོས་གསུམ་མེས་དབོན་རྣམ་པ་གསུམ། །",
      "en": "Khenpo Bodhisattva, Master Padmasambhava, Dharma-King Tri Songdetsen and the other two great ancestral rulers,",
      "en-trans": "khen lop chö sum mé wön nampa sum"
    },
    {
      "bo": "བསྟན་པའི་སྒྲོན་མེ་ཨ་ཏི་ཤ་ལ་སོགས། །",
      "en": "Beacon of the Buddhadharma, Atiśa, and the rest—",
      "en-trans": "tenpé drönmé ati sha la sok"
    },
    {
      "bo": "ཟླ་མེད་སྐྱེས་མཆོག་རྣམས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To all you peerless, most excellent of masters, we pray!",
      "en-trans": "da mé kyé chok nam la solwa dep"
    },
    {
      "bo": "འཕགས་བོད་ཐོག་མའི་ལོ་ཙཱ་ཐུ་མི་རྗེ། །",
      "en": "Thönmi Sambhoṭa, the first to translate from Sanskrit into Tibetan,",
      "en-trans": "pak bö tokmé lotsa tu mi jé"
    },
    {
      "bo": "ལོ་ཆེན་བཻ་རོ་གཉགས་ལོ་ཡེ་ཤེས་གཞོན། །",
      "en": "And the great lotsāwas Vairotsana, Nyak Jñānakumāra,",
      "en-trans": "lo chen bairo nyak lo yeshé zhön"
    },
    {
      "bo": "ཀ་བ་དཔལ་བརྩེགས་ལྕོག་རོ་ཀླུའི་རྒྱལ་མཚན། །",
      "en": "Kawa Paltsek, Chokro Lü’i Gyaltsen",
      "en-trans": "kawa pal tsek chok ro lü gyaltsen"
    },
    {
      "bo": "ཞང་སྟོན་སྣ་ནམ་རྣམས་ལ་གསོལ་བ་འདེབས། །",
      "en": "And Zhang Nanam Yeshe De, to you we pray!",
      "en-trans": "zhang tön nanam nam la solwa dep"
    },
    {
      "bo": "རིན་ཆེན་བཟང་པོ་བློ་ལྡན་ཤེས་རབ་དང༌། །",
      "en": "Rinchen Zangpo, Ngok Loden Sherab,",
      "en-trans": "rinchen zangpo loden sherab dang"
    },
    {
      "bo": "འབྲོམ་སྟོན་ལ་སོགས་སྨྲ་བའི་དབང་ཕྱུག་སྟེ། །",
      "en": "Dromtönpa Gyalwe Jungne and all the other powerful masters of speech,",
      "en-trans": "drom tön la sok mawé wangchuk té"
    },
    {
      "bo": "ལོ་ཙཱ་སྔ་ཕྱི་བགྲང་ཡས་རྣམ་ཐར་གྱི། །",
      "en": "Countlesslotsāwasof earlier and later times,",
      "en-trans": "lotsa nga chi drang yé namtar gyi"
    },
    {
      "bo": "བཀའ་དྲིན་དྲན་པས་སྙིང་ནས་གསོལ་བ་འདེབས། །",
      "en": "Bringing to mind your kindness, we pray to you from the depths of our hearts!",
      "en-trans": "kadrin drenpé nying né solwa dep"
    },
    {
      "bo": "བདག་ཅག་ལྔ་བདོའི་གང་ཟག་ལྷག་བསམ་ཁུལ། །",
      "en": "In this age of the five degenerations, people like us merely feign a pure motivation.",
      "en-trans": "dak chak nga dö gang zak lhak sam kül"
    },
    {
      "bo": "༧རྒྱལ་བའི་བཀའ་བསྟན་ཀུན་འབྱུང་འདྲེན་པ་དང༌། །",
      "en": "Now, as we translate into our own regional languages",
      "en-trans": "gyalwé ka ten kunjung drenpa dang"
    },
    {
      "bo": "དཀའ་ཐུབ་རིག་བྱེད་དབང་བསྒྱུར་ཐེག་པ་མཆོག །",
      "en": "The expressing words and the meaning conveyed in the statements of the Buddha,",
      "en-trans": "katub rigché wang gyur tekpa chok"
    },
    {
      "bo": "ཁྱད་པར་རིག་པ་འཛིན་པའི་སྡེ་སྣོད་དེ། །",
      "en": "The teachings of the vehicles leading from the origin, Vedic asceticism and supreme and powerful transformative methods,1",
      "en-trans": "khyepar rigpa dzinpé dé nö dé"
    },
    {
      "bo": "བཀའ་གཏེར་དག་སྣང་རྩ་གསུམ་ཆོས་སྐྱོང་གི །",
      "en": "And especially those of thepiṭakaof vidyādharas,",
      "en-trans": "ka ter dak nang tsa sum chökyong gi"
    },
    {
      "bo": "གསུང་རབ་ཡུལ་ལུང་སོ་སོའི་སྐད་ཡིག་ཏུ། །",
      "en": "The teachings ofkama,termaand pure visions,",
      "en-trans": "sungrab yul lung so sö ké yig tu"
    },
    {
      "bo": "རྗོད་བྱེད་སྒྲ་དང་བརྗོད་བྱའི་དོན་བསྒྱུར་ལ། །",
      "en": "And those related to the Three Roots and the dharmapālas,",
      "en-trans": "jö ché dra dang jö ché dön gyur la"
    },
    {
      "bo": "འགལ་རྐྱེན་བར་ཆད་མེད་ཅིང་བསམ་དགུ་འགྲུབ། །",
      "en": "May we be free from adverse circumstances and hindrances, and may all our pure aspirations be accomplished!",
      "en-trans": "galkyen barché mé ching sam gu drup"
    },
    {
      "bo": "སྔོན་བྱོན་ལོ་པཎ་རྣམས་ཀྱི་ཐུགས་བསྐྱེད་བཞིན། །",
      "en": "In keeping with the wishes of the great lotsāwas and paṇḍitas of the past,",
      "en-trans": "ngön chön lo pen nam kyi tuk kyé zhin"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་བ་ཡོངས་ལ་སྨན་ནས་ནི། །",
      "en": "May we bring benefit to the teachings of the Buddha and to all beings,",
      "en-trans": "ten dang drowa yong la men né ni"
    },
    {
      "bo": "འཛམ་བུ་གླིང་དུ་༧རྒྱལ་བསྟན་རིན་པོ་ཆེ། །",
      "en": "And may the precious Buddhadharma spread throughout the world,",
      "en-trans": "dzam bu ling du gyal ten rinpo ché"
    },
    {
      "bo": "ཡར་ངོའི་ཟླ་བས་ཀུན་ཁྱབ་བཀྲ་ཤིས་ཤོག། །།",
      "en": "Developing like the waxing moon, and bringing auspiciousness to all!",
      "en-trans": "yar ngö dawé kun khyab trashi shok"
    }
  ]
}