{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/eight-great-chariots-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྒྲུབ་བརྒྱུད་ཤིང་རྟ་ཆེན་པོ་བརྒྱད་ཀྱི་བསྟན་པ་དར་རྒྱས་ཀྱི་སྨོན་ལམ་བཀྲ་ཤིས་ཀུན་ཁྱབ་ཅེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "An Aspiration for the Spread of the Teachings of the Eight Great Chariots of the Practice Lineage"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བུདྡྷ་བྷོ་དྷི་ས་ཏྭ་ཡེ།",
      "en": "Namo guru-buddha-bodhisattvāya!",
      "en-trans": "namo guru buddha bodhisatvaye"
    },
    {
      "bo": "ཕྱོགས་དུས་རྒྱལ་བ་སྲས་བཅས་ཐུགས་བསྐྱེད་དང་། །",
      "en": "Buddhas and bodhisattvas throughout the whole of space and time, with your noble resolve,",
      "en-trans": "chok dü gyalwa sé ché tukkyé dang"
    },
    {
      "bo": "རྒྱ་བོད་རིག་འཛིན་གྲུབ་ཐོབ་རྒྱ་མཚོ་ཡི། །",
      "en": "And all you adepts and vidyādharas of India and Tibet in your oceanic immensity—",
      "en-trans": "gya bö rigdzin drubtob gyatso yi"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་ཐུགས་རྗེའི་རྩལ་ཕྱུངས་ལ། །",
      "en": "Let the compassion of your knowledge, love and power burst forth,",
      "en-trans": "khyen tsé nüpé tukjé tsal chung la"
    },
    {
      "bo": "རྣམ་དག་སྨོན་པའི་གནས་འདི་འགྲུབ་པར་མཛོད། །",
      "en": "And make these utterly pure aspirations of mine come true!",
      "en-trans": "namdak mönpé né di drubpar dzö"
    },
    {
      "bo": "རྩ་གསུམ་ཀུན་འདུས་པདྨ་འབྱུང་གནས་དང་། །",
      "en": "May the tradition of Padmākara, who embodies all Three Roots,",
      "en-trans": "tsa sum kündü pema jungné dang"
    },
    {
      "bo": "བསྟན་པའི་མངའ་བདག་མཁན་ཆེན་ཞི་བ་འཚོ། །",
      "en": "The great abbot Śāntarakṣita, sovereign of the teachings,",
      "en-trans": "tenpé ngadak khenchen zhiwatso"
    },
    {
      "bo": "ཆོས་རྒྱལ་ཚངས་པ་ལྷ་ཡི་མེ་ཏོག་གི །",
      "en": "And the Dharma-king Tsangpa Lhayi Metok,",
      "en-trans": "chögyal tsangpa lha yi metok gi"
    },
    {
      "bo": "རིང་ལུགས་བཀའ་གཏེར་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "The teachings of kama and terma, spread far and wide!",
      "en-trans": "ringluk kater tenpa gyé gyur chik"
    },
    {
      "bo": "གསུང་རབ་ཐམས་ཅད་གདམས་པར་ཤར་བ་ཡི། །",
      "en": "May the excellent tradition of pure view and conduct,",
      "en-trans": "sung rab tamché dampar sharwa yi"
    },
    {
      "bo": "བརྒྱུད་པ་གསུམ་ལྡན་ཇོ་བོ་བཀའ་གདམས་པའི། །",
      "en": "The threefold lineage of the Jowo Kadampa,",
      "en-trans": "gyüpa sumden jowo kadampé"
    },
    {
      "bo": "ལྟ་སྤྱོད་རྣམ་པར་དག་པའི་རྒྱུན་བཟང་འདི། །",
      "en": "In which all scriptures arise as personal instructions,",
      "en-trans": "tachö nampar dakpé gyün zang di"
    },
    {
      "bo": "བསྐལ་པའི་མཐར་ཡང་ནུབ་པར་མ་གྱུར་ཅིག །",
      "en": "Remain without decline until the aeon’s very end!",
      "en-trans": "kalpé tar yang nubpar magyur chik"
    },
    {
      "bo": "ཐུབ་བསྟན་མདོ་དང་སྔགས་ཀྱི་ཆོས་ཚུལ་རྣམས། །",
      "en": "May the precious Sakyapa teachings, perfectly complete,",
      "en-trans": "tubten do dang ngak kyi chö tsul nam"
    },
    {
      "bo": "མ་ནོར་ཇི་བཞིན་འབྱེད་ལ་བསྙེངས་བྲལ་བའི། །",
      "en": "Which are unerring and confident in their precise analysis",
      "en-trans": "manor jizhin jé la nyeng dralwé"
    },
    {
      "bo": "ཡོངས་རྫོགས་བསྟན་པའི་མངའ་བདག་ས་སྐྱ་པའི། །",
      "en": "Of the sūtra and mantra systems of Buddhadharma,",
      "en-trans": "yongdzok tenpé ngadak sakyapé"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཛཾ་གླིང་ཀུན་ཁྱབ་ཤོག །",
      "en": "Spread throughout the whole world of Jambudvīpa!",
      "en-trans": "tenpa rinchen dzam ling künkhyab shok"
    },
    {
      "bo": "དཔལ་ལྡན་རྡོ་རྗེ་འཆང་ནས་ལེགས་འོངས་པའི། །",
      "en": "May the supreme teachings of the definitive Mahāmudrā",
      "en-trans": "palden dorjé chang né lek ongpé"
    },
    {
      "bo": "བཀའ་བཞི་བརྒྱུད་པའི་སྔགས་རྒྱུད་རྒྱ་མཚོ་དང་། །",
      "en": "And oceanic tantras in the lineage of the four transmissions1",
      "en-trans": "ka zhi gyüpé ngak gyü gyatso dang"
    },
    {
      "bo": "ངེས་དོན་ཕྱག་རྒྱ་ཆེན་པོའི་བསྟན་པ་མཆོག །",
      "en": "That perfectly derive from the glorious Vajradhara",
      "en-trans": "ngedön chakgya chenpö tenpa chok"
    },
    {
      "bo": "མི་ནུབ་བཤད་དང་སྒྲུབ་པས་དར་རྒྱས་ཤོག །",
      "en": "Never wane but through teaching and practice spread far and wide!",
      "en-trans": "mi nub shé dang drubpé dargyé shok"
    },
    {
      "bo": "ཡེ་ཤེས་ཌཱ་ཀི་གཉིས་སོགས་འཕགས་ཡུལ་གྱི། །",
      "en": "May the ripening empowerments and liberating instructions",
      "en-trans": "yeshe daki nyi sok pakyul gyi"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པའི་ཐུགས་བཅུད་ཤངས་པ་རྗེ། །",
      "en": "Of the Golden Dharma of Khyungpo Naljor with its fivefold ultimate,",
      "en-trans": "khé dang drubpé tuk chü shangpa jé"
    },
    {
      "bo": "མཐར་ཐུག་ལྔ་ལྡན་ཁྱུང་པོ་རྣལ་འབྱོར་གྱི། །",
      "en": "The noble Shangpa, which is the heart essence of the learned and accomplished",
      "en-trans": "tartuk ngaden khyungpo naljor gyi"
    },
    {
      "bo": "གསེར་ཆོས་སྨིན་གྲོལ་དར་རྒྱས་ནུབ་མེད་ཤོག །",
      "en": "Of the noble land, such as the two wisdom ḍākinīs,2never wane but flourish!",
      "en-trans": "ser chö mindrol dargyé nubmé shok"
    },
    {
      "bo": "རྒྱུད་སྡེ་བཞི་ཡི་ཆུ་ཀླུང་འབུམ་ཕྲག་འཁྱིལ། །",
      "en": "May the teachings of both Jonang and Zhalu traditions,",
      "en-trans": "gyüdé zhi yi chulung bumtrak khyil"
    },
    {
      "bo": "རྡོ་རྗེའི་རྣལ་འབྱོར་ཡན་ལག་དྲུག་པ་ཡི། །",
      "en": "In which myriad rivers of the four classes of tantra merge,",
      "en-trans": "dorjé naljor yenlak drukpa yi"
    },
    {
      "bo": "གྲུབ་པའི་རྒྱལ་སར་འཛེགས་ལ་ཟླ་མེད་པ། །",
      "en": "The six branches of Vajra Yoga3",
      "en-trans": "drubpé gyalsar dzek la da mepa"
    },
    {
      "bo": "ཇོ་ཞལ་རྣམ་གཉིས་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "That lead matchlessly to the royal seat of accomplishment, thrive!",
      "en-trans": "jo zhal nam nyi tenpa gyé gyur chik"
    },
    {
      "bo": "ཨཱ་ལི་ཀཱ་ལི་ཆུ་ཀླུང་ཆེན་པོ་ཡི། །",
      "en": "May the instructions for pacifying suffering which derive",
      "en-trans": "ali kali chulung chenpo yi"
    },
    {
      "bo": "རྒྱུད་ཀྱི་གདམས་པ་སྡུག་བསྔལ་ཞི་བྱེད་དང་། །",
      "en": "From the tantraGreat River of Vowels and Consonants (Āli Kāli),",
      "en-trans": "gyü kyi dampa dukngal zhijé dang"
    },
    {
      "bo": "ཡུམ་དོན་ཟབ་མོ་མ་གཅིག་ལབ་སྒྲོན་གྱི། །",
      "en": "And the practice of Severance, which is the profound import of the Mother Prajñāpāramitā,",
      "en-trans": "yum dön zabmo machik lab drön gyi"
    },
    {
      "bo": "ཐུགས་མཛོད་གཅོད་ཡུལ་ཉམས་ལེན་དར་རྒྱས་ཤོག །",
      "en": "And heart treasure of Machik Labdrön, spread far and wide!",
      "en-trans": "tuk dzö chö yul nyamlen dargyé shok"
    },
    {
      "bo": "དབེན་གསུམ་བསྟེན་ནས་སྒོ་གསུམ་རྡོ་རྗེ་གསུམ། །",
      "en": "May the unsurpassed practice of the perfection phase,",
      "en-trans": "wen sum ten né go sum dorjé sum"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་གྲུབ་ཐོབ་ཆེན་པོ་ཨོ་རྒྱན་པའི། །",
      "en": "The heart-essence of the great adept Orgyenpa,",
      "en-trans": "nyendrub drubtob chenpo orgyen pé"
    },
    {
      "bo": "ཐུགས་ཀྱི་ཐིག་ལེ་བླ་མེད་རྫོགས་རིམ་གྱི། །",
      "en": "The approach and accomplishment of the three vajras for the three doors",
      "en-trans": "tuk kyi tiklé lamé dzokrim gyi"
    },
    {
      "bo": "ཉམས་ལེན་ནུབ་མེད་སླར་ཡང་འཕེལ་རྒྱས་ཤོག །",
      "en": "Based on threefold isolation, fade no further but expand and spread again!",
      "en-trans": "nyamlen nubmé lar yang pelgyé shok"
    },
    {
      "bo": "གཞན་ཡང་ཚེམ་བུ་པ་དང་མི་ཏྲ་སོགས། །",
      "en": "In addition, may the other excellent streams of teaching that exist,",
      "en-trans": "zhenyang tsembu pa dang mitra sok"
    },
    {
      "bo": "ཁྲིད་ཕྲན་བརྒྱུད་པའི་བླ་མ་ཐམས་ཅད་ཀྱི། །",
      "en": "Among all the gurus of various lineages of minor instruction,",
      "en-trans": "tri tren gyüpé lama tamché kyi"
    },
    {
      "bo": "གདམས་ངག་རྒྱུན་བཟང་ཇི་སྙེད་ཡོད་པ་རྣམས། །",
      "en": "Such as those from Kantalipa and Mitrayogin, all endure,",
      "en-trans": "damngak gyün zang jinyé yöpa nam"
    },
    {
      "bo": "ཐོས་བསམ་བསྒོམ་པས་ཡུན་དུ་གནས་པར་ཤོག །",
      "en": "Upheld forever more by study, contemplation and meditation.",
      "en-trans": "tö sam gompé yündu nepar shok"
    },
    {
      "bo": "གངས་ལྗོངས་བཤད་སྒྲུབ་ལམ་སྲོལ་མ་ལུས་པའི། །",
      "en": "May those who gather to study and practice the dharma treasuries",
      "en-trans": "gangjong shedrub lam sol malüpé"
    },
    {
      "bo": "བཀའ་བབས་གསང་ཆེན་ཆོས་ཀྱི་བསྡུ་བ་པོ། །",
      "en": "Of the Jamgön gurus, the bodhisattvas of the three families,",
      "en-trans": "kabab sang chen chö kyi duwa po"
    },
    {
      "bo": "འཇམ་མགོན་བླ་མ་རིགས་གསུམ་སེམས་དཔའ་ཡི། །",
      "en": "Compilers of the great secret dharma of special transmissions",
      "en-trans": "jamgön lama rik sum sempa yi"
    },
    {
      "bo": "ཆོས་མཛོད་བཤད་དང་སྒྲུབ་པའི་འདུས་ཚོགས་ཀྱིས། །",
      "en": "From all traditions of study and practice in the Land of Snows,",
      "en-trans": "chö dzö shé dang drubpé dü tsok kyi"
    },
    {
      "bo": "འཛིན་མའི་ཁྱོན་ཀུན་ཐམས་ཅད་ཁྱབ་པ་དང་། །",
      "en": "Increase and fill each and every corner of this world;",
      "en-trans": "dzinmé khyön kün tamché khyabpa dang"
    },
    {
      "bo": "ནག་ཕྱོགས་དུས་ཀྱི་རྒུད་པ་ཀུན་ཞི་ནས། །",
      "en": "May all the troubles of this dark age be pacified;",
      "en-trans": "nakchok dü kyi güpa kün zhi né"
    },
    {
      "bo": "བསྟན་དང་བསྟན་འཛིན་དབུ་འཕང་སྲིད་རྩེར་མཐོ། །",
      "en": "May the teachings and their holders be exalted unto the very peak of existence,",
      "en-trans": "ten dang tendzin upang sitser to"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་ཤིང་རྟ་ཆེ་བརྒྱད་རྒྱས་གྱུར་ཅིག །",
      "en": "And may the eight great chariots of the practice lineage spread far and wide.",
      "en-trans": "drubgyü shingta ché gyé gyé gyur chik"
    }
  ]
}