{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/aspiration-from-vajravarahi-five-cycle",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅༔ སྒྲུབ་ཐབས་སྐོར་ལྔའི་ཕག་མོའི་ཚོགས་མཆོད་ལས་ཕྱུང་བའི་སྨོན་ལམ།",
    "en": "Aspiration Prayer from the Vajravārāhī Feast Offering"
  },
  "text": [
    {
      "bo": "ཧོ༔ རབ་འབྱམས་དཀྱིལ་འཁོར་ལྷ་ཚོགས་དགོངས་སུ་གསོལ༔",
      "en": "Hoḥ!Infinite maṇḍala deities, turn your attention towards us!",
      "en-trans": "ho, rabjam kyilkhor lhatsok gong su sol"
    },
    {
      "bo": "བདག་ཅག་རྣལ་འབྱོར་མཆེད་དང་ལྕམ་དྲལ་གྱིས༔",
      "en": "Through the power of this great samaya offering",
      "en-trans": "dakchak naljor ché dang chamdral gyi"
    },
    {
      "bo": "དམ་ཚིག་ཆེན་པོའི་མཆོད་པ་ཕུལ་བའི་མཐུས༔",
      "en": "Presented by us, the yogis and yoginīs, brothers and sisters,",
      "en-trans": "damtsik chenpö chöpa pulwé tü"
    },
    {
      "bo": "ཉམས་ཆག་རྟོག་སྒྲིབ་མུན་པ་དབྱིངས་སུ་སངས༔",
      "en": "May the darkness of impairments and breakages of samaya, thoughts and obscurations be cleared away in basic space.",
      "en-trans": "nyamchak tok drib münpa ying su sang"
    },
    {
      "bo": "མཆོག་ཐུན་དངོས་གྲུབ་ཡེ་ཤེས་སྣང་བ་རྒྱས༔",
      "en": "May the light of wisdom and siddhis—both common and supreme—expand.",
      "en-trans": "choktün ngödrub yeshe nangwa gyé"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་མཁའ་འགྲོས་རྗེས་བཟུང་ནས༔",
      "en": "May we be guided by the gurus, yidams, and ḍākinīs,",
      "en-trans": "lama yidam khandrö jezung né"
    },
    {
      "bo": "རྡོ་རྗེའི་ལམ་ལས་རྣམ་གྲོལ་འབྲས་བུའི་མཆོག༔",
      "en": "And accomplish effortlessly within this very lifetime",
      "en-trans": "dorjé lam lé namdrol drebü chok"
    },
    {
      "bo": "དཀའ་བ་མེད་པར་ཚེ་འདིར་འགྲུབ་པར་ཤོག༔",
      "en": "The supreme fruition, liberation, through the vajra path.",
      "en-trans": "kawa mepar tsé dir drubpar shok"
    },
    {
      "bo": "ནམ་ཞིག་མི་རྟག་སྐྱེ་འཆི་བྱུང་སྲིད་ཚེ༔",
      "en": "Whenever impermanence and death should befall us,",
      "en-trans": "namzhik mi tak kyechi jung si tsé"
    },
    {
      "bo": "ཡེ་ཤེས་སྒྲོན་མེའི་སྣང་བས་ཤུལ་མཚོན་ཏེ༔",
      "en": "May the luminous lamp of pristine wisdom show the way,",
      "en-trans": "yeshe drönmé nangwé shul tsön té"
    },
    {
      "bo": "འོག་མིན་བདེ་ཆེན་ཞིང་དུ་དབུགས་ཕྱུང་ནས༔",
      "en": "So that we find relief in Akaniṣṭha, the land of great bliss,",
      "en-trans": "womin dechen zhing du uk chung né"
    },
    {
      "bo": "ཕྱམ་གཅིག་ལྷན་སྐྱེས་ཡེ་ཤེས་སྐུ་འགྲུབ་ཤོག༔",
      "en": "And there accomplish, all together, the kāya of co-emergent wisdom.",
      "en-trans": "chamchik lhenkyé yeshe ku drub shok"
    }
  ]
}