{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fifteenth-karmapa/aspiration-for-countrys-welfare",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་ཁམས་བདེ་བའི་སྨོན་ལམ། །",
    "en": "Aspiration for the Country’s Welfare"
  },
  "text": [
    {
      "bo": "འགྲོ་བའི་སྐྱབས་མགོན་ཨོ་རྒྱན་རིན་པོ་ཆེ། །",
      "en": "Supreme protector of sentient beings, Orgyen Rinpoche,",
      "en-trans": "drowé kyab gön orgyen rinpoche"
    },
    {
      "bo": "རིག་འཛིན་མཁའ་འགྲོའི་ཚོགས་དང་བཅས་པ་ལ། །",
      "en": "Together with the assembly of vidyādharas and ḍākinīs—",
      "en-trans": "rigdzin khandrö tsok dang chepa la"
    },
    {
      "bo": "བདག་སོགས་རྩེ་གཅིག་གུས་པས་གསོལ་བ་འདེབས། །",
      "en": "To you we pray with one-pointed devotion!",
      "en-trans": "dak sok tsé chik güpé solwa deb"
    },
    {
      "bo": "ཞལ་བཞེས་བཞིན་དུ་དབྱིངས་ནས་བརྩེར་དགོངས་ལ། །",
      "en": "As you promised, consider us lovingly from the absolute expanse!",
      "en-trans": "zhalzhé zhindu ying né tser gong la"
    },
    {
      "bo": "ཉམས་ཐག་འགྲོ་ལ་ཐུགས་རྗེས་གཟིགས་སུ་གསོལ། །",
      "en": "Look upon us, exhausted beings, with compassion!",
      "en-trans": "nyam tak dro la tukjé zik su sol"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཨོ་རྒྱན་རིན་པོ་ཆེ། །",
      "en": "We pray to you, Orgyen Rinpoche:",
      "en-trans": "solwa deb so orgyen rinpoche"
    },
    {
      "bo": "རྐྱེན་ངན་ཟློག་ཅིག་མ་དང་མཁའ་འགྲོའི་ཚོགས། །",
      "en": "Dispel adversity and pacify all discord",
      "en-trans": "kyen ngen dok chik ma dang khandrö tsok"
    },
    {
      "bo": "མི་མཐུན་དུས་ཀྱི་རྒུད་པ་ཀུན་ཞི་ཞིང་། །",
      "en": "From mātṛkās and ḍākinīs and degenerations of the age;",
      "en-trans": "mitün dü kyi güpa kün zhi zhing"
    },
    {
      "bo": "ཕྱི་ནང་སྣོད་བཅུད་འབྱོར་པ་རབ་ཏུ་རྒྱས། །",
      "en": "Increase prosperity in the environment and among its inhabitants;",
      "en-trans": "chinang nöchü jorpa rabtu gyé"
    },
    {
      "bo": "དུས་འཁྲུགས་ནད་རིམས་ས་གཡོས་འབུ་སྲིན་སོགས། །",
      "en": "Conflict, epidemics, earthquakes, plagues of vermin and so forth,",
      "en-trans": "dü truk né rim sayö busin sok"
    },
    {
      "bo": "གཟུགས་ཅན་གཟུགས་མེད་བསམ་སྦྱོར་ངན་པའི་དཔལ། །",
      "en": "Evil thoughts and actions among those with and without form—",
      "en-trans": "zukchen zukmé samjor ngenpé pal"
    },
    {
      "bo": "མི་མཐུན་ཕྱོགས་ཀུན་ཞི་བར་མཛད་དུ་གསོལ། །",
      "en": "Please pacify all such forms of adversity!",
      "en-trans": "mitün chok kün zhiwar dzé du sol"
    },
    {
      "bo": "བསྟན་པ་དར་ཞིང་བསྟན་འཛིན་སྐུ་ཚེ་བརྟན། །",
      "en": "May the teachings spread and the holders have long lives,",
      "en-trans": "tenpa dar zhing tendzin kutsé ten"
    },
    {
      "bo": "འཇིག་རྟེན་བདེ་སྐྱིད་དཔལ་གྱིས་གང་བར་ཤོག །",
      "en": "And may the splendour of joy and happiness fill the world!",
      "en-trans": "jikten dekyi pal gyi gangwar shok"
    }
  ]
}