{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/bardo-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བར་དོའི་སྨོན་ལམ་དྲན་པའི་གསོས་འདེབས་འཁྲུལ་སྣང་གདུང་སེལ་ཞེས་བྱ་བ་བཞུགས་སོ།  །",
    "en": "An Aspiration for the Bardos"
  },
  "text": [
    {
      "bo": "དཔལ་ལྡན་བླ་མ་རྒྱལ་བ་སྲས་དང་བཅས་པ་རྣམས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ལོ།  །",
      "en": "At the feet of the glorious guru, the victorious ones and their heirs, we pay homage.",
      "en-trans": "palden lama gyalwa sé dang chepa nam kyi zhab la chaktsal lo"
    },
    {
      "bo": "བརྩེ་བ་ཆེན་པོས་དུས་ཐམས་ཅད་དུ་རྗེས་སུ་བཟུང་ཞིང་འདི་ཕྱི་བར་དོའི་འཁྲུལ་སྣང་འཇིགས་སྐྲག་ཐམས་ཅད་ལས་དབུགས་དབྱུང་ཞིང་བར་དོ་རང་ངོ་ཤེས་པ་དང་།  དག་པའི་ཞིང་དུ་འདྲེན་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།  །",
      "en": "Care for me at all times with your magnificent love, alleviate all the terrors of deluded perception during this life, the next and the bardo states, inspire us to recognise the bardos and lead us to a pure realm, we pray.",
      "en-trans": "tsewa chenpö dü tamché du jesu zung zhing di chiwar dö trulnang jiktrak tamché lé ukyung zhing bardo rang ngoshepa dang dakpé zhing du drenpar jingyi lab tu sol"
    },
    {
      "bo": "སྲིད་པའི་ཚ་གདུང་ཀུན་ལས་སྐྱོབ་མཛད་ཅིང་།  །",
      "en": "You protect from all the torridity and torment of conditioned existence,",
      "en-trans": "sipé tsadung kün lé kyob dzé ching"
    },
    {
      "bo": "དྲན་པ་ཙམ་གྱིས་ངན་སོང་སྒོ་འགེགས་པ།  །",
      "en": "And the mere thought of you closes the door to lower realms,",
      "en-trans": "drenpa tsam gyi ngensong go gekpa"
    },
    {
      "bo": "ཐར་པའི་ལམ་སྟོན་དྲིན་ཅན་ཆོས་ཀྱི་རྗེ།  །",
      "en": "Revealer of the path to liberation, gracious lord of Dharma,",
      "en-trans": "tarpé lam tön drinchen chö kyi jé"
    },
    {
      "bo": "འདྲེན་མཆོག་སྐྱབས་ཀུན་འདུས་ཞལ་ཆེན་པོ་མཁྱེན།  །",
      "en": "Supreme guide, great face and embodiment of all sources of refuge, care for us!",
      "en-trans": "dren chok kyab kündü zhal chenpo khyen"
    },
    {
      "bo": "བདག་ཅག་རྩེ་གཅིག་མོས་གུས་ཤུགས་དྲག་པོས།  །",
      "en": "As we pray to you with ardent, single-pointed devotion",
      "en-trans": "dakchak tsechik mögü shuk drakpö"
    },
    {
      "bo": "ཁ་ཞེ་ངོས་ལྐོག་མེད་པར་གསོལ་འདེབས་ན།  །",
      "en": "And without the slightest duplicity or hypocrisy,",
      "en-trans": "khazhé ngö kok mepar soldeb na"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོ་ཀུན་ཏུ་ཐུགས་རྗེས་གཟིགས།  །",
      "en": "Look upon us with compassion in this life, the next and throughout the bardo states.",
      "en-trans": "di chi bardo küntu tukjé zik"
    },
    {
      "bo": "བསླུ་མེད་སྐྱབས་ཀྱི་སྙིང་པོ་བླ་མ་མཁྱེན།  །",
      "en": "Guru, essence of unfailing refuge, care for us!",
      "en-trans": "lumé kyab kyi nyingpo lama khyen"
    },
    {
      "bo": "འཆི་བའི་ཚེ་ན་གནད་གཅོད་མི་འབྱུང་ཞིང་།  །",
      "en": "When it comes time to die, may we not experience a sudden, painful end,",
      "en-trans": "chiwé tsé na néchö minjung zhing"
    },
    {
      "bo": "ཤེས་པ་རང་ས་ཟིན་ཅིང་བླ་མ་ལ།  །",
      "en": "But instead hold the natural state of awareness",
      "en-trans": "shepa rang sa zin ching lama la"
    },
    {
      "bo": "དད་མོས་གདུང་བས་གསོལ་བ་འདེབས་བཞིན་དུ།  །",
      "en": "And pray to the guru with yearning faith and devotion,",
      "en-trans": "dé mö dungwé solwa deb zhindu"
    },
    {
      "bo": "འཆི་ཁའི་གདམས་པ་ལམ་དུ་ལོངས་པར་ཤོག  །",
      "en": "While we practically apply the instructions for the moment of death.",
      "en-trans": "chikhé dampa lam du longpar shok"
    },
    {
      "bo": "དེ་ལྟར་མཉམ་རྗེས་ཀུན་ཏུ་དྲན་ཤེས་ཀྱི།  །",
      "en": "Holding the hook of mindfulness and vigilance during meditation and thereafter,",
      "en-trans": "detar nyamjé küntu dren shé kyi"
    },
    {
      "bo": "ལྕགས་ཀྱུས་བཟུང་ནས་འཁྲུལ་སྣང་འདི་དག་རྣམས།  །",
      "en": "May we recognise all these deluded perceptions",
      "en-trans": "chakkyü zung né trulnang didak nam"
    },
    {
      "bo": "བར་དོའི་སྣང་བ་ཡིན་པའི་འདུ་ཤེས་ཀྱིས།  །",
      "en": "As the appearances of the intermediate state",
      "en-trans": "bardö nangwa yinpé dushé kyi"
    },
    {
      "bo": "སྐྱེ་ཤི་བར་དོ་ལམ་དུ་ཁྱེར་བར་ཤོག  །",
      "en": "And thus apply the path to the bardo of birth and death.",
      "en-trans": "kyeshi bardo lam du khyerwar shok"
    },
    {
      "bo": "སྣོད་བཅུད་སྣང་བ་ཇི་ལྟར་ཤར་བ་རྣམས།  །",
      "en": "No matter how these appearances of outer world and inhabitants may arise,",
      "en-trans": "nöchü nangwa jitar sharwa nam"
    },
    {
      "bo": "ཤར་ཡང་བདེན་པས་སྟོང་པའི་རང་བཞིན་དུ།  །",
      "en": "They are by nature empty.",
      "en-trans": "shar yang denpé tongpé rangzhin du"
    },
    {
      "bo": "ཤེས་ནས་ཡི་དམ་ལྷ་དང་ཡེ་ཤེས་སུ།  །",
      "en": "Recognising this and transforming them into yidam deities and wisdom,",
      "en-trans": "shé né yidam lha dang yeshe su"
    },
    {
      "bo": "བསྒྱུར་བས་རྨི་ལམ་བར་དོ་ལམ་བྱེད་ཤོག  །",
      "en": "May we apply the path to the bardo of dream.",
      "en-trans": "gyurwé milam bardo lam jé shok"
    },
    {
      "bo": "ཚེ་འདིའི་སྣང་བ་ནུབ་པར་ཉེ་བ་ན།  །",
      "en": "When the appearances of this life are about to fade away,",
      "en-trans": "tsé di nangwa nubpar nyewa na"
    },
    {
      "bo": "རླུང་ལྔ་ཐིམ་ཞིང་འཁོར་ལོ་ལྔ་ཞིག་པས།  །",
      "en": "The five winds will dissolve, the five chakras disintegrate.",
      "en-trans": "lung nga tim zhing khorlo nga zhikpé"
    },
    {
      "bo": "ལུས་ཀྱི་སྟོབས་ཉམས་ངག་གི་སྒྲ་མི་གསལ།  །",
      "en": "Physical strength will diminish, the sound of voices grow unclear,",
      "en-trans": "lü kyi tob nyam ngak gi dra mi sal"
    },
    {
      "bo": "དྲན་ཉམས་ཤེས་པ་ཟ་ཟིར་འཕྱོ་བ་དང་།  །",
      "en": "Memory will deteriorate and consciousness become dim.",
      "en-trans": "dren nyam shepa zazir chowa dang"
    },
    {
      "bo": "དབང་ཤེས་ཐིམ་ཞིང་འདོད་ཡོན་རོ་མི་མྱོང་།  །",
      "en": "Sensory awareness will fade and objects become imperceptible.",
      "en-trans": "wangshé tim zhing döyön ro mi nyong"
    },
    {
      "bo": "དུ་བ་སྨིག་རྒྱུ་མེ་ཁྱེར་མར་མེ་ཡི།  །",
      "en": "Then may we recognise the signs—",
      "en-trans": "duwa mikgyu mekhyer marmé yi"
    },
    {
      "bo": "སྣང་བའི་རྟགས་རྣམས་རང་ངོ་ཤེས་པ་དང་།  །",
      "en": "Of smoke, haze, fireflies, and lamps—",
      "en-trans": "nangwé tak nam rang ngoshepa dang"
    },
    {
      "bo": "འདའ་ཀ་གསུམ་གྱི་གདམས་པ་ལམ་བྱེད་ཤོག  །",
      "en": "And apply the instruction of the triple moment of passing.1",
      "en-trans": "daka sum gyi dampa lam jé shok"
    },
    {
      "bo": "ཕྲ་བའི་ཐིམ་རིམ་སྣང་མཆེད་ཐོབ་གསུམ་སྟེ།  །",
      "en": "The subtle stages of dissolution are appearance, increase and attainment.",
      "en-trans": "trawé timrim nang ché tob sum té"
    },
    {
      "bo": "འདི་ལྟར་རྣམ་ཤེས་སྣང་བ་ལ་ཐིམ་ཚེ།  །",
      "en": "When consciousness dissolves into appearance,",
      "en-trans": "ditar namshé nangwa la tim tsé"
    },
    {
      "bo": "དཀར་ཆ་ཐུར་བབ་དཀར་ལམ་འཆར་བ་དང་།  །",
      "en": "The white element descends and there is total whiteness.",
      "en-trans": "kar cha tur bab karlam charwa dang"
    },
    {
      "bo": "འདོད་ཆགས་ལས་གྱུར་རྟོག་པ་བཞི་བཅུ་འགགས།  །",
      "en": "The thirty-three thought-states associated with anger cease.2",
      "en-trans": "döchak lé gyur tokpa zhibchu gak"
    },
    {
      "bo": "དེ་ཚེ་སྣང་བའི་ཡེ་ཤེས་ངོས་ཟིན་ཤོག  །",
      "en": "At that time may we recognise the wisdom of appearance.",
      "en-trans": "detsé nangwé yeshe ngö zin shok"
    },
    {
      "bo": "དེ་ནས་སྣང་བ་མཆེད་པ་ལ་ཐིམ་ཚེ།  །",
      "en": "Then when appearance dissolves into increase,",
      "en-trans": "dené nangwa chepa la tim tsé"
    },
    {
      "bo": "དམར་ཆ་གྱེན་གཡོས་དམར་ལམ་སྣང་བ་འཆར།  །",
      "en": "The red element ascends and there is an experience of total redness.",
      "en-trans": "mar cha gyen yö marlam nangwa char"
    },
    {
      "bo": "ཞེ་སྡང་ལས་གྱུར་རྟོག་པ་སོ་གསུམ་འགགས།  །",
      "en": "The forty thought-states associated with desire cease.",
      "en-trans": "zhedang lé gyur tokpa so sum gak"
    },
    {
      "bo": "མཆེད་པའི་ཡེ་ཤེས་རང་ངོ་ཤེས་པར་ཤོག  །",
      "en": "Then may we recognise the wisdom of increase.",
      "en-trans": "chepé yeshe rang ngoshepar shok"
    },
    {
      "bo": "དེ་ནས་དཀར་དམར་བར་དུ་རྣམ་ཤེས་བརྒྱལ།  །",
      "en": "Then, between whiteness and redness consciousness is lost.",
      "en-trans": "dené kar mar bardu namshé gyal"
    },
    {
      "bo": "གཏི་མུག་ལས་གྱུར་རྟོག་པ་བདུན་འགགས་ཏེ།  །",
      "en": "The seven thought-states associated with delusion cease,",
      "en-trans": "timuk lé gyur tokpa dün gak té"
    },
    {
      "bo": "ནག་ལམ་བརྒྱལ་བར་ཕྱོགས་པ་དེ་ཡི་ཚེ།  །",
      "en": "And there is a vision of blackness, approaching unconsciousness.",
      "en-trans": "naklam gyalwar chokpa dé yi tsé"
    },
    {
      "bo": "ཐོབ་པའི་ཡེ་ཤེས་རང་ངོ་ཟིན་པར་ཤོག  །",
      "en": "At that time may we recognise the wisdom of attainment.",
      "en-trans": "tobpé yeshe rang ngo zinpar shok"
    },
    {
      "bo": "དེ་ནས་ཉེར་ཐོབ་གཞི་ཡི་འོད་གསལ་ནི།  །",
      "en": "Then, when the ground luminosity of near-attainment dawns,",
      "en-trans": "dené nyertob zhi yi ösal ni"
    },
    {
      "bo": "བློ་ཡི་ཡུལ་འདས་སྟོན་གནམ་དྭངས་པ་ལྟར།  །",
      "en": "Beyond ordinary mental objects and clear as an autumn sky,",
      "en-trans": "lo yi yul dé tön nam dangpa tar"
    },
    {
      "bo": "འཆར་ཚེ་ལམ་གྱི་འོད་གསལ་བུ་ལྟ་བུ།  །",
      "en": "May the child-like path luminosity",
      "en-trans": "char tsé lam gyi ösal bu tabu"
    },
    {
      "bo": "གཞི་ཡི་འོད་གསལ་མ་དང་འཕྲད་པར་ཤོག  །",
      "en": "Meet the mother that is the clear light of the ground.",
      "en-trans": "zhi yi ösalma dang trepar shok"
    },
    {
      "bo": "གལ་ཏེ་དུས་དེར་གོམས་འདྲིས་ཆུང་བ་ཡིས།  །",
      "en": "If, due to our weak familiarity at that stage,",
      "en-trans": "galté dü der gom dri chungwa yi"
    },
    {
      "bo": "རང་ངོ་མ་ཤེས་དེ་ཡི་མོད་ཉིད་ལ།  །",
      "en": "We fail in recognition, then, in an instant,",
      "en-trans": "rang ngoma shé dé yi mö nyi la"
    },
    {
      "bo": "སྲིད་པ་བར་དོའི་སྣང་བ་ཤར་བ་ན།  །",
      "en": "The appearances of the bardo of becoming will dawn,",
      "en-trans": "sipa bardö nangwa sharwa na"
    },
    {
      "bo": "འཇིགས་པའི་སྒྲ་བཞི་ཉམ་ངའི་གཡང་ས་གསུམ།  །",
      "en": "And when the four dreadful sounds, three terrifying abysses,",
      "en-trans": "jikpé dra zhi nyam ngé yangsa sum"
    },
    {
      "bo": "མ་ངེས་རྟགས་དྲུག་སྣོམ་བྱ་ཤར་བའི་ཚེ།  །",
      "en": "And six uncertain experiences arise,",
      "en-trans": "ma ngé tak druk nomja sharwé tsé"
    },
    {
      "bo": "བླ་མ་ལྷ་དང་ལྟ་བ་རྗེས་དྲན་ནས།  །",
      "en": "May we recollect the guru, the deity and the view,",
      "en-trans": "lama lha dang tawa jedren né"
    },
    {
      "bo": "དག་པ་མཁའ་སྤྱོད་ཞིང་དུ་སྐྱེ་བར་ཤོག  །",
      "en": "And take rebirth in a pure celestial realm.",
      "en-trans": "dakpa khachö zhing du kyewar shok"
    },
    {
      "bo": "གལ་ཏེ་སྐྱེ་གནས་འཛིན་པར་གྱུར་ནའང་།  །",
      "en": "Even if we are connected to a place of birth,",
      "en-trans": "galté kyené dzinpar gyur na ang"
    },
    {
      "bo": "མངལ་སྒོ་ངན་པ་དགག་ཅིང་ཆོས་ལྡན་གྱི།  །",
      "en": "May we close the womb-door of any lesser form of rebirth",
      "en-trans": "ngal go ngenpa gak ching chöden gyi"
    },
    {
      "bo": "རྟེན་བཟང་བཙལ་ནས་ཁམས་དྲུག་ལྡན་པའི་ལུས།  །",
      "en": "And seek the excellent support of a dharma practitioner.",
      "en-trans": "ten zang tsal né kham druk denpé lü"
    },
    {
      "bo": "ཐོབ་ནས་སྐྱེས་མ་ཐག་པ་དེ་ཉིད་དུ།  །",
      "en": "May we gain a form complete with the six elements",
      "en-trans": "tob né kyé matakpa denyi du"
    },
    {
      "bo": "དགེ་བའི་བཤེས་དང་མཇལ་ནས་དམ་པའི་ཆོས།  །",
      "en": "And meet a spiritual guide as soon as we are reborn,",
      "en-trans": "geweshé dang jal né dampé chö"
    },
    {
      "bo": "མ་ནོར་ཚུལ་བཞིན་སྤྱོད་པ་ཉིད་གྱུར་ཅིག  །",
      "en": "So that we may practise the sacred Dharma authentically, without error.",
      "en-trans": "manor tsulzhin chöpa nyi gyur chik"
    },
    {
      "bo": "མདོར་ན་སྐྱེ་དང་ཚེ་རབས་ཐམས་ཅད་དུ།  །",
      "en": "In short, in all future lives and rebirths",
      "en-trans": "dorna kyé dang tserab tamché du"
    },
    {
      "bo": "རྒྱལ་བས་བསྔགས་པའི་ལམ་ལ་རབ་ཞུགས་ཏེ།  །",
      "en": "May we follow the path praised by the victorious ones,",
      "en-trans": "gyalwé ngakpé lam la rab zhuk té"
    },
    {
      "bo": "ཐེག་ཆེན་མདོ་སྔགས་ཆོས་ལ་ལོངས་སྤྱོད་ནས།  །",
      "en": "Savour the sūtra and mantra Dharma of the Great Vehicle,",
      "en-trans": "tekchen do ngak chö la longchö né"
    },
    {
      "bo": "སྐུ་བཞིའི་འབྲས་བུ་མངོན་དུ་ཐོབ་པར་ཤོག  །",
      "en": "And realize the fruition of the four kāyas.",
      "en-trans": "ku zhi drebu ngön du tobpar shok"
    }
  ]
}