{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sakya-pandita/aspiration-while-prostrating",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཕྱག་འཚལ་སྐབས་འདོན་རྒྱུའི་སྨོན་ཚིག",
    "en": "Verses of Aspiration to Recite While Prostrating"
  },
  "text": [
    {
      "bo": "བདག་གིས་མཆོག་གསུམ་དམ་པར་ཕྱག་འཚལ་བས། །",
      "en": "Through offering prostration before the supreme Three Jewels,",
      "en-trans": "dak gi chok sum dampar chaktsalwé"
    },
    {
      "bo": "བདག་དང་འགྲོ་ཀུན་སྡིག་སྒྲིབ་དག་པར་ཤོག །",
      "en": "May my own and all other beings’ misdeeds and obscurations be purified!",
      "en-trans": "dak dang dro kün dikdrib dakpar shok"
    },
    {
      "bo": "ལག་གཉིས་མཉམ་པར་ཐལ་མོ་སྦྱར་བ་ཡིས། །",
      "en": "May joining the palms of my two hands together",
      "en-trans": "lak nyi nyampar talmo jarwa yi"
    },
    {
      "bo": "ཐབས་དང་ཤེས་རབ་ཟུང་འཇུག་ཐོབ་པར་ཤོག །",
      "en": "Cause us to gain the perfect unity of skilful means and wisdom!",
      "en-trans": "tab dang sherab zungjuk tobpar shok"
    },
    {
      "bo": "ཐལ་མོ་སྤྱི་བོའི་གཙུག་ཏུ་སྦྱར་བ་ཡིས།  །",
      "en": "May joining my hands at the crown of my head",
      "en-trans": "talmo chiwö tsuk tu jarwa yi"
    },
    {
      "bo": "འོག་མིན་དགའ་ལྡན་གནས་སུ་བགྲོད་པར་ཤོག །",
      "en": "Cause us to travel to the heaven of Akaniṣṭha!",
      "en-trans": "womin ganden né su dröpar shok"
    },
    {
      "bo": "ཐལ་མོ་སྨིན་མཚམས་དཔྲལ་བར་སྦྱར་བ་ཡིས། །",
      "en": "May joining my hands at my forehead",
      "en-trans": "talmo mintsam tralwar jarwa yi"
    },
    {
      "bo": "ལུས་ཀྱི་སྡིག་སྒྲིབ་ཐམས་ཅད་དག་པར་ཤོག །",
      "en": "Cause all harmful actions and obscurations of thebodybe purified!",
      "en-trans": "lü kyi dikdrib tamché dakpar shok"
    },
    {
      "bo": "ཐལ་མོ་མགྲིན་པའི་ཐད་དུ་སྦྱར་བ་ཡིས། །",
      "en": "May joining my hands to the level of my throat",
      "en-trans": "talmo drinpé tedu jarwa yi"
    },
    {
      "bo": "ངག་གི་སྡིག་སྒྲིབ་ཐམས་ཅད་དག་པར་ཤོག །",
      "en": "Cause all harmful actions and obscurations ofspeechto be purified!",
      "en-trans": "ngak gi dikdrib tamché dakpar shok"
    },
    {
      "bo": "ཐལ་མོ་སྙིང་གའི་ཐད་དུ་སྦྱར་བ་ཡིས། །",
      "en": "May joining my hands at the region of my heart",
      "en-trans": "talmo nyinggé tedu jarwa yi"
    },
    {
      "bo": "ཡིད་ཀྱི་སྡིག་སྒྲིབ་ཐམས་ཅད་དག་པར་ཤོག །",
      "en": "Cause all harmful actions and obscurations ofmindto be purified!",
      "en-trans": "yi kyi dikdrib tamché dakpar shok"
    },
    {
      "bo": "ཐལ་མོ་སྦྱར་བ་སོ་སོར་ཕྱེ་བ་ཡིས། །",
      "en": "May drawing apart my two hands once again",
      "en-trans": "talmo jarwa sosor chewa yi"
    },
    {
      "bo": "གཟུགས་སྐུ་གཉིས་ཀྱི་འགྲོ་དོན་བྱེད་པར་ཤོག །",
      "en": "Cause the two form kāyas to act for beings’ benefit!",
      "en-trans": "zukku nyi kyi dro dönjé par shok"
    },
    {
      "bo": "རྐང་གཉིས་པུས་མོ་ས་ལ་བཙུགས་པ་ཡིས། །",
      "en": "May touching my two knees to the ground",
      "en-trans": "kang nyi pümo sa la tsukpa yi"
    },
    {
      "bo": "འཁོར་བ་ངན་སོང་གནས་ལས་ཐར་བར་ཤོག །",
      "en": "Cause the lower realms of saṃsāra to be liberated!",
      "en-trans": "khorwa ngensong né lé tarwar shok"
    },
    {
      "bo": "ལག་གཉིས་སོར་བཅུ་ས་ལ་བཙུགས་པ་ཡིས། །",
      "en": "May touching the ten fingers of my two hands to the ground",
      "en-trans": "lak nyi sor chu sa la tsukpa yi"
    },
    {
      "bo": "ས་བཅུ་ལམ་ལྔ་རིམ་གྱིས་བགྲོད་པར་ཤོག །",
      "en": "Cause us all to traverse the ten stages and five paths!",
      "en-trans": "sa chu lam nga rimgyi dröpar shok"
    },
    {
      "bo": "མགོ་བོ་དཔྲལ་བ་ས་ལ་བཙུགས་པ་ཡིས། །",
      "en": "May touching my forehead to the ground",
      "en-trans": "gowo tralwa sa la tsukpa yi"
    },
    {
      "bo": "བཅུ་གཅིག་ཀུན་ཏུ་འོད་ཀྱི་ས་ཐོབ་ཤོག །",
      "en": "Cause us all to attain the eleventhbhūmiof Universal Radiance!",
      "en-trans": "chuchik küntu ö kyi sa tob shok"
    },
    {
      "bo": "ཡན་ལག་བཞི་པོ་བརྐྱང་བསྐུམས་བྱེད་པ་ཡིས། །",
      "en": "May extending and contracting my four limbs",
      "en-trans": "yenlak zhipo kyang kum jepa yi"
    },
    {
      "bo": "འཕྲིན་ལས་རྣམ་བཞི་ལྷུན་གྱིས་གྲུབ་པར་ཤོག །",
      "en": "Cause us to spontaneously accomplish the four types of activity!",
      "en-trans": "trinlé nam zhi lhün gyi drubpar shok"
    },
    {
      "bo": "རྩ་རྒྱུད་ཐམས་ཅད་བརྐྱངས་བསྐུམས་བྱས་པ་ཡིས། །",
      "en": "May extending and contracting all the channels of my body",
      "en-trans": "tsagyü tamché kyang kum jepa yi"
    },
    {
      "bo": "རྩ་མདུད་ཐམས་ཅད་མ་ལུས་གྲོལ་བར་ཤོག །",
      "en": "Cause all knots in the subtle channels to be released!",
      "en-trans": "tsa dü tamché malü drolwar shok"
    },
    {
      "bo": "སྒལ་ཚིགས་དབུ་མར་དགྱེ་དགུགས་བྱེད་པ་ཡིས། །",
      "en": "May flexing my spine in the centre of my body",
      "en-trans": "gal tsik umar gyé guk jepa yi"
    },
    {
      "bo": "རླུང་རྣམས་མ་ལུས་དབུ་མར་ཚུད་པར་ཤོག །",
      "en": "Cause all subtle wind-energies to enter the central channel!",
      "en-trans": "lung nam malü umar tsüpar shok"
    },
    {
      "bo": "ས་ལ་ཐུག་ནས་ཡར་ལ་ལྡང་བ་ཡིས། །",
      "en": "May touching the ground, then rising from it once again,",
      "en-trans": "sa la tuk né yar la dangwa yi"
    },
    {
      "bo": "འཁོར་བར་མི་གནས་ཐར་ལམ་ཐོབ་པར་ཤོག །",
      "en": "Ensure that we do not remain in saṃsāra but find the path to freedom!",
      "en-trans": "khorwar mi né tarlam tobpar shok"
    },
    {
      "bo": "དེ་ནས་ལན་མང་དུ་མར་ཕྱག་འཚལ་བས། །",
      "en": "Thus, through offering a great many prostrations,",
      "en-trans": "dené len mang du mar chaktsalwé"
    },
    {
      "bo": "ཞི་བར་མི་གནས་སེམས་ཅན་འདྲེན་པར་ཤོག །",
      "en": "May we not remain in peace but guide all beings!",
      "en-trans": "zhiwar mi né semchen drenpar shok"
    },
    {
      "bo": "བདག་སོགས་བརྐྱངས་ཕྱག་ཕུལ་བའི་དགེ་བའི་མཐུས། །",
      "en": "By the power of this virtuous offering of full prostrations,",
      "en-trans": "dak sok kyang chak pulwé gewé tü"
    },
    {
      "bo": "གནས་སྐབས་ཚེ་རིང་ནད་མེད་ཕུན་ཚོགས་ཤོག །",
      "en": "May we gain the temporary benefits of long-life, good health and prosperity!",
      "en-trans": "nekab tsering nemé püntsok shok"
    },
    {
      "bo": "འཆི་ཚེ་བདེ་བ་ཅན་དུ་སྐྱེས་ནས་ཀྱང་། །",
      "en": "When we die, may we be reborn in Sukhāvatī,",
      "en-trans": "chi tsé dewachen du kyé né kyang"
    },
    {
      "bo": "རྫོགས་པའི་སངས་རྒྱས་གོ་འཕང་མྱུར་ཐོབ་ཤོག །",
      "en": "And then swiftly attain the level of perfect Buddhahood!",
      "en-trans": "dzokpé sangye gopang nyur tob shok"
    },
    {
      "bo": "ཕ་མ་སེམས་ཅན་ཐམས་ཅད་བདེ་དང་ལྡན་གྱུར་ཅིང་། །",
      "en": "May all sentient beings, our very own parents, be happy!",
      "en-trans": "pama semchen tamché dé dangden gyur ching"
    },
    {
      "bo": "ངན་འགྲོ་ཐམས་ཅད་རྟག་ཏུ་སྟོང་བ་དང་། །",
      "en": "May all the lower realms be forever empty!",
      "en-trans": "ngendro tamché taktu tongwa dang"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་པ་གང་ན་སུ་བཞུགས་པ། །",
      "en": "And for all the bodhisattvas, wherever they may be,",
      "en-trans": "changchub sempa gang na su zhukpa"
    },
    {
      "bo": "དེ་དག་ཀུན་གྱི་སྨོན་ལམ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May each and every prayer of aspiration be fulfilled!",
      "en-trans": "dedak kün gyi mönlam drub gyur chik"
    }
  ]
}