{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/sikkim-happiness-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྦས་གནས་ཆེན་པོ་འབྲས་ལྗོངས་བདེ་བའི་སྨོན་ལམ་བདེ་སྐྱིད་རབ་འཕེལ་བཞུགས།",
    "en": "An Aspiration for the Welfare of the Great Hidden Land of Sikkim"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "མཆོག་གསུམ་རྩ་གསུམ་སྐུ་གསུམ་ཀུན་འདུས་པ། །",
      "en": "Embodiment of the Three Jewels, Three Roots and Three Kāyas,",
      "en-trans": "chok sum tsa sum ku sum kündüpa"
    },
    {
      "bo": "མ་ལུས་འགྲོ་བའི་སྐྱབས་མགོན་པདྨ་འབྱུང་། །",
      "en": "Protector and guardian of all beings without exception—Guru Padmākara,",
      "en-trans": "malü drowé kyab gön pema jung"
    },
    {
      "bo": "བི་མ་བཻ་རོ་ཁྲི་སྲོང་མཚོ་རྒྱལ་སོགས། །",
      "en": "Together with Vimalamitra, Vairotsana, Tri Songdetsen, Tsogyal and the rest,",
      "en-trans": "bi ma bai ro trisong tsogyal sok"
    },
    {
      "bo": "བཀའ་གཏེར་རིག་འཛིན་བརྒྱུད་པ་ཐམས་ཅད་དང་། །",
      "en": "All the lineages of vidyādharas forkamaandterma,",
      "en-trans": "kater rigdzin gyüpa tamché dang"
    },
    {
      "bo": "ཡི་དམ་ཞི་ཁྲོ་མཁའ་འགྲོ་ཆོས་སྐྱོང་དང་། །",
      "en": "Peaceful and wrathful yidam deities, ḍākinīs and dharma-protectors,",
      "en-trans": "yidam zhitro khandro chökyong dang"
    },
    {
      "bo": "ནོར་ལྷ་གཏེར་གྱི་བདག་པོ་ལ་སོགས་པ། །",
      "en": "Wealth deities, treasure-keepers and the rest—",
      "en-trans": "norlha ter gyi dakpo la sokpa"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་གཏེར་ལ་དབང་འབྱོར་བའི། །",
      "en": "All supreme sources of refuge who have mastered the treasury",
      "en-trans": "khyen tsé nü pé ter la wang jorwé"
    },
    {
      "bo": "སྐྱབས་ཀྱི་མཆོག་གྱུར་ཐམས་ཅད་དགོངས་སུ་གསོལ། །",
      "en": "Of wisdom, love and spiritual power, turn your attention towards us!",
      "en-trans": "kyab kyi chokgyur tamché gong su sol"
    },
    {
      "bo": "འཛམ་གླིང་སྤྱི་དང་ཁྱད་པར་སྦས་པའི་ཡུལ། །",
      "en": "May the whole world in general and this hidden land in particular,",
      "en-trans": "dzamling chi dang khyepar bepé yul"
    },
    {
      "bo": "འབྲས་མོ་ལྗོངས་ཞེས་དཔལ་རི་པདྨ་འོད། །",
      "en": "The Fruit-Filled Valley—Sikkim—like the glorious mountain Lotus Light",
      "en-trans": "dremo jong zhé palri pema ö"
    },
    {
      "bo": "ས་འདིར་འཕོས་པའི་སྒྲུབ་གནས་བྱིན་ཅན་ལ། །",
      "en": "Transported to earth as a blessed place of accomplishment,",
      "en-trans": "sa dir pöpé drubné jinchen la"
    },
    {
      "bo": "མི་གཙང་ཉམས་གྲིབ་གོས་པ་སངས་གྱུར་ཅིག །",
      "en": "Be cleansed of all impurity, stains of transgression and defilement.",
      "en-trans": "mi tsang nyamdrib göpa sang gyur chik"
    },
    {
      "bo": "རྩ་གསུམ་ལྷ་རྣམས་གནས་འདིར་རྟག་བཞུགས་ནས། །",
      "en": "May the deities of the Three Roots remain forever,",
      "en-trans": "tsa sum lha nam né dir tak zhuk né"
    },
    {
      "bo": "སྣོད་བཅུད་བཀྲ་ཤིས་རྡོ་རྗེའི་བྱིན་ཆེན་དབབ། །",
      "en": "Bringing down great rains of auspiciousness and vajra-blessings upon the environment and beings,",
      "en-trans": "nöchü tashi dorjé jin chen wab"
    },
    {
      "bo": "ཡུལ་ལ་དགེ་བཅུ་སྡེ་བཞིའི་དཔལ་ཡོན་རྒྱས། །",
      "en": "Spreading the riches of the ten virtues and four aspects of well-being1throughout the land,",
      "en-trans": "yul la gé chu dé zhi palyön gyé"
    },
    {
      "bo": "སྲིད་ཞིའི་ཕྱྭ་གཡང་དྭངས་བཅུད་འགུགས་པར་མཛོད། །",
      "en": "And summoning the essence of wealth and prosperity from throughout existence and quiescence.",
      "en-trans": "sizhi cha yang dangchü gukpar dzö"
    },
    {
      "bo": "ཆོས་ལྡན་རྒྱལ་པོའི་ཆབ་སྲིད་མངའ་ཐང་རྒྱས། །",
      "en": "May the dominion of the dharma-endowed king grow in strength,",
      "en-trans": "chöden gyalpö chabsi ngatang gyé"
    },
    {
      "bo": "རིགས་བརྒྱུད་འཕེལ་ཞིང་སྐུ་ཚེ་ཡུན་དུ་བརྟན། །",
      "en": "His progeny flourish and his life be secure and long.",
      "en-trans": "rikgyü pel zhing kutsé yündu ten"
    },
    {
      "bo": "ཕ་རོལ་སྡང་དགྲ་གནོད་བྱེད་གདོན་བགེགས་རྣམས། །",
      "en": "May hostile opposing forces, harm-doers and obstacle-makers",
      "en-trans": "parol dang dra nöjé dön gek nam"
    },
    {
      "bo": "ཐལ་བའི་རྡུལ་བཞིན་བརླག་པར་མཛད་དུ་གསོལ། །",
      "en": "Be utterly vanquished—destroyed and turned to dust.",
      "en-trans": "talwé dul zhin lakpar dzé du sol"
    },
    {
      "bo": "ངེས་གསང་སྙིང་པོའི་བསྟན་པ་རབ་རྒྱས་ཤིང་། །",
      "en": "May the definitive teachings of the Secret Essence spread far and wide.",
      "en-trans": "ngé sang nyingpö tenpa rabgyé shing"
    },
    {
      "bo": "སྐྱེ་འགྲོ་ཐམས་ཅད་བྱམས་པའི་སེམས་དང་ལྡན། །",
      "en": "May the minds of living beings be filled with love.",
      "en-trans": "kyendro tamché jampé sem dangden"
    },
    {
      "bo": "ཕན་ཚུན་ཕ་མ་ལྟ་བུའི་འདུ་ཤེས་ཀྱིས། །",
      "en": "May they regard one another as dear parents from former lives,",
      "en-trans": "pentsün pama tabü dushé kyi"
    },
    {
      "bo": "ཡང་དག་དགེ་ལ་སྤྱོད་པར་མཛད་དུ་གསོལ། །",
      "en": "And genuinely devote themselves to virtuous action.",
      "en-trans": "yangdak gé la chöpar dzé du sol"
    },
    {
      "bo": "ཧེ་རུ་ཀ་དཔལ་ནམ་མཁའ་འཇིགས་མེད་སོགས། །",
      "en": "May the prayers of the glorious heruka Namkha Jigme",
      "en-trans": "heruka pal namkha jikme sok"
    },
    {
      "bo": "རྣལ་འབྱོར་མཆེད་བཞིས་ཇི་ལྟར་སྨོན་པ་བཞིན། །",
      "en": "And the rest—those known as the four yogi-confrères2",
      "en-trans": "naljor ché zhi jitar mönpa zhin"
    },
    {
      "bo": "གེགས་མེད་འགྲུབ་ཅིང་གུ་རུ་པདྨ་ཡི། །",
      "en": "Be fulfilled without obstacle, and may the aspirations and prophecies",
      "en-trans": "gekmé drub ching guru pema yi"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་བདེན་ཚིག་བསླུ་བ་མེད་པར་ཤོག །",
      "en": "Of Guru Padma be shown to be infallible.",
      "en-trans": "tukkyé dentsik luwa mepar shok"
    },
    {
      "bo": "ལྷ་མ་ཡིན་དང་ཡིད་སྲུབས་འགོང་པོ་ཡི། །",
      "en": "May the activity of asuras and beguilinggongpospirits cease,",
      "en-trans": "lha mayin dang yi sub gongpo yi"
    },
    {
      "bo": "རྒྱུ་ལམ་བཅད་ནས་སྦས་ཡུལ་རིན་ཆེན་གྱི། །",
      "en": "And may all be auspicious, so that this precious hidden land,",
      "en-trans": "gyu lam ché né bé yul rinchen gyi"
    },
    {
      "bo": "བཀྲ་ཤིས་མཛོད་ཁང་འཇིགས་མེད་རྡོ་རྗེའི་གུར། །",
      "en": "A treasure-house of fortune and vajra dome beyond peril,",
      "en-trans": "tashi dzö khang jikme dorjé gur"
    },
    {
      "bo": "རྟག་བརྟན་དགེ་ལེགས་སྣང་བའི་བཀྲ་ཤིས་ཤོག །",
      "en": "Remains forever, as a beacon of virtue and positivity!",
      "en-trans": "takten gelek nangwé tashi shok"
    }
  ]
}