{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/katok-getse-gyurme-tenpa-gyaltsen/aspiration-for-teachings-in-taiwan",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཐའི་ཝན་རྒྱལ་བསྟན་དར་རྒྱས་སྨོན་ལམ།",
    "en": "Prayer of Aspiration for the Buddhist Teachings to Flourish in Taiwan"
  },
  "text": [
    {
      "bo": "ཀ་དག་སྤྲོས་བྲལ་ཆོས་སྐུའི་ཀློང་ཡངས་ལས། །",
      "en": "From the vast dharmakāya expanse of primordial purity free from complexity,",
      "en-trans": "kadak trödral chökü long yang lé"
    },
    {
      "bo": "ལྷུན་གྲུབ་གཟུགས་སྐུ་མཚན་དཔེའི་དཔལ་འབར་བ། །",
      "en": "The spontaneously present rūpakāya blazes with the splendour of the signs and marks,",
      "en-trans": "lhündrub zukku tsenpé pal barwa"
    },
    {
      "bo": "ཐུགས་བརྩེའི་སྤྲིན་ལས་ཆོས་ཆར་འབེབས་མཁས་པ། །",
      "en": "And skilfully brings down a shower of Dharma from the clouds of loving kindness—",
      "en-trans": "tuk tsé trin lé chö char beb khepa"
    },
    {
      "bo": "ཐུབ་དབང་ལྷ་མིའི་སྟོན་མཆོག་སྙིང་དབུས་རོལ། །",
      "en": "Lord of sages, supreme teacher of gods and humans, playfully appear in the centre of my heart.",
      "en-trans": "tubwang lhami tön chok nying ü rol"
    },
    {
      "bo": "མཐིང་འཛིན་མ་གུ་ར་ཡི་སྲུང་གུར་དབུས། །",
      "en": "In the centre of the protective sphere of the deep blue ocean,",
      "en-trans": "ting dzin ma gu ra yi sung gur ü"
    },
    {
      "bo": "མཛེས་སྡུག་ཕུན་སུམ་ཚོགས་པའི་དོ་ར་རུ། །",
      "en": "Is this land that is like an arena of perfect abundance and beauty—",
      "en-trans": "dzé duk pünsum tsokpé do ra ru"
    },
    {
      "bo": "ལུགས་གཉིས་སྡེ་བཞི་དཔལ་ལ་ལོངས་སྤྱོད་པས། །",
      "en": "Here, through the splendour of the two systems1and four aspects of well-being,2",
      "en-trans": "luk nyi dé zhi pal la longchö pé"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "བློ་སྣ་ཆོས་ལ་བསྒྱུར་བའི་མན་ངག་གནད། །",
      "en": "Through guarding the key instructions for turning the mind toward the Dharma—",
      "en-trans": "lona chö la gyurwé mengak né"
    },
    {
      "bo": "དལ་འབྱོར་རྙེད་དཀའ་ཚེ་ལ་རྟག་པ་མེད།",
      "en": "The rarity of the freedoms and opportunities and the impermanence of life,",
      "en-trans": "daljor nyé ka tsé la takpa mé"
    },
    {
      "bo": "འཁོར་བ་སྡུག་བསྔལ་ལས་འབྲས་རབ་སྲུང་ནས། །",
      "en": "As well as the sufferings of cyclic existence and the effects of actions,",
      "en-trans": "khorwa dukngal lé dré rab sung né"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "ཡང་དག་ཆོས་ལམ་འགྲོ་བའི་རིམ་པ་ནི། །",
      "en": "Through the stages of practice that bring progress in genuine Dharma—",
      "en-trans": "yangdak chö lam drowé rimpa ni"
    },
    {
      "bo": "དཀོན་མཆོག་སྐྱབས་འགྲོ་བྱམས་དང་སྙིང་རྗེ་དང་། །",
      "en": "Taking refuge in the Three Jewels, training in love and compassion,",
      "en-trans": "könchok kyamdro jam dang nyingjé dang"
    },
    {
      "bo": "ཚོགས་གཉིས་བསག་དང་སྒྲིབ་གཉིས་སྦྱང་བ་ཡིས། །",
      "en": "Gathering the two accumulations and purifying the two obscurations,",
      "en-trans": "tsok nyi sak dang drib nyi jangwa yi"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "འགལ་རྐྱེན་ཀུན་སེལ་བླ་མའི་རྣལ་འབྱོར་དང་། །",
      "en": "Through the practice of guru yoga which dispels all adversity,",
      "en-trans": "galkyen kün sel lamé naljor dang"
    },
    {
      "bo": "མྱུར་ལམ་འཕོ་བའི་མན་ངག་ཉམས་ལེན་སོགས། །",
      "en": "Instructions on the swift path of transference (phowa) and so on,",
      "en-trans": "nyurlam powé mengak nyamlen sok"
    },
    {
      "bo": "འཆི་ཚེ་ཐར་ལམ་ཐོབ་པའི་གདེང་ལྡན་པས། །",
      "en": "And with confidence in finding a path to liberation at the time of death,",
      "en-trans": "chi tsé tarlam tobpé deng denpé"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "མ་དག་འཁྲུལ་སྣང་དག་པར་དབང་གྱུར་བའི། །",
      "en": "Through transforming impure, deluded perception into perception that is pure,",
      "en-trans": "ma dak trulnang dakpar wang gyurwé"
    },
    {
      "bo": "རིག་སྟོང་རང་མདངས་ལྷ་སྔགས་ཆོས་སྐུའི་ངང་། །",
      "en": "While experiencing deity, mantra and dharmakāya as the self-radiance of awareness and emptiness,",
      "en-trans": "riktong rang dang lha ngak chökü ngang"
    },
    {
      "bo": "རྩ་ཐིག་རླུང་གསུམ་བདེ་སྟོང་གྲོགས་ཤར་བས། །",
      "en": "And the channels, wind-energies and essences as supports for bliss and emptiness,",
      "en-trans": "tsa tik lung sum detong drok sharwé"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "རིག་སྟོང་ཀ་དག་རང་ངོ་ཤེས་པ་དང་། །",
      "en": "Through recognising one’s own nature of primordially pure awareness and emptiness,",
      "en-trans": "riktong kadak rang ngo shepa dang"
    },
    {
      "bo": "དག་དང་མ་དག་རྩལ་སྣང་ཐག་ཆོད་ནས། །",
      "en": "And with decisive certainty about its creative manifestations, pure and impure,",
      "en-trans": "dak dang ma dak tsalnang takchö né"
    },
    {
      "bo": "རང་གྲོལ་རེ་དོགས་བྲལ་བའི་གདེང་ཐོབ་པས། །",
      "en": "So that one gains the confidence of self-liberation beyond hope and fear,",
      "en-trans": "rangdrol redok dralwé deng tobpé"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "ཤེས་རབ་རང་འབྱུང་སྒྲོན་མེའི་རང་མདངས་ལས།",
      "en": "Without getting caught in clinging to space, light-spheres and awareness,",
      "en-trans": "sherab rang jung drönmé rang dang lé"
    },
    {
      "bo": "དབྱིངས་ཐིག་རིག་གསུམ་འཛིན་པས་མ་བཅིང་པར། །",
      "en": "Which arise as the natural radiance of the lamp of self-arisen wisdom—",
      "en-trans": "ying tik rik sum dzinpé maching par"
    },
    {
      "bo": "ཡང་གསང་བླ་མེད་ཉམས་སུ་ལེན་མཁས་པས། །",
      "en": "Through skilful practice of these most secret, unsurpassable teachings—",
      "en-trans": "yangsang lamé nyam su len khepé"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "ཙི་ནའི་ཡུལ་འཁྲུངས་ཐང་སིན་བླ་མ་ཡིས། །",
      "en": "Just as the master Xuanzang, who took birth in China,",
      "en-trans": "tsi né yul trung tang sin lama yi"
    },
    {
      "bo": "རླབས་ཆེན་ཐུགས་བསྐྱེད་དམ་བཅས་འཕགས་ཡུལ་སྐྱོད། །",
      "en": "Travelled, through his magnificent aspirations, to the noble land of India,",
      "en-trans": "lab chen tukkyé damché pakyul kyö"
    },
    {
      "bo": "དཀའ་བ་སྤྱོད་ནས་མཁས་པ་ཕུལ་ཕྱིན་བཞིན། །",
      "en": "Where, through enduring hardships, he reached the pinnacle of scholarship,",
      "en-trans": "kawa chö né khepa pul chin zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "གནས་བརྟན་ཆེན་པོ་འཕགས་པ་འོད་སྲུང་སོགས། །",
      "en": "Just as the great elder noble Kaśyapa and the rest,",
      "en-trans": "neten chenpo pakpa ösung sok"
    },
    {
      "bo": "གཏད་རབས་བཞིན་དུ་བསྟན་པ་འཛིན་མཁས་པའི། །",
      "en": "In their line of succession, skilfully upheld the teachings,",
      "en-trans": "té rab zhindu tenpa dzin khepé"
    },
    {
      "bo": "བསླབ་གསུམ་རྒྱན་འཆང་ངུར་སྨིག་འཛིན་པ་ཡིས། །",
      "en": "Now with saffron-robed monks adorned with threefold training—",
      "en-trans": "lab sum gyen chang ngur mik dzinpa yi"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "གངས་ལྗོངས་ཐུབ་པའི་ལུང་དུ་བསྟན་པ་བཞིན། །",
      "en": "Just as in the Land of Snows, as the Buddha himself foretold,",
      "en-trans": "gangjong tubpé lung du tenpa zhin"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་དབང་ཐུགས་བསྐྱེད་དམ་བཅའི་མཐུས། །",
      "en": "Through the force of Avalokiteśvara’s vows and aspirations,",
      "en-trans": "chenrezik wang tukkyé damché tü"
    },
    {
      "bo": "ཆོས་རྒྱལ་ཟུང་གིས་ནམ་ལང་ཉི་ཤར་ལྟར། །",
      "en": "A pair of dharma kings appeared to herald a new dawn,",
      "en-trans": "chögyal zung gi nam lang nyishar tar"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "ཇོ་བོ་གསེར་གླིང་པ་ཡི་ཐུགས་ཀྱི་སྲས། །",
      "en": "Just as Atiśa, heart-son of the precious lord of Suvarnadvīpa",
      "en-trans": "jowo serlingpa yi tuk kyi sé"
    },
    {
      "bo": "འཕགས་ཡུལ་མཁས་གྲུབ་ཕུལ་ཕྱིན་ཨ་ཏི་ཤས། །",
      "en": "And pre-eminent among the learned and accomplished of the noble land,",
      "en-trans": "pakyul khedrub pul chin ati shé"
    },
    {
      "bo": "བཀའ་གདམས་བསྟན་པ་སྒྲོན་མེ་སྦར་བ་བཞིན། །",
      "en": "Set the torch of the Kadampa teachings ablaze—",
      "en-trans": "kadam tenpa drönmé barwa zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "ལྷོ་བྲག་མར་པའི་བཀའ་བཞིན་བསྒྲུབ་མཛད་པས། །",
      "en": "By practising according to the instructions of Marpa of Lhodrak,",
      "en-trans": "lho drak marpé ka zhin drub dzepé"
    },
    {
      "bo": "བསྒྲུབ་བརྒྱུད་བསྟན་པའི་གསེར་གྱི་རྒྱལ་མཚན་འཛིན། །",
      "en": "Holding aloft the golden victory banner of the practice lineage,",
      "en-trans": "drub gyü tenpé ser gyi gyaltsen dzin"
    },
    {
      "bo": "མི་ལ་རས་པ་ཚེ་འདིར་གྲོལ་བ་བཞིན། །",
      "en": "Just like Milarepa, who attained liberation in a single lifetime,",
      "en-trans": "mi la repa tsé dir drolwa zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙེང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyengpo dargyé shok"
    },
    {
      "bo": "ས་སྐྱ་ཞེས་བྱ་ས་སྟེང་གྲགས་པས་ཁྱབ། །",
      "en": "Just as the fame of the Sakya tradition spread throughout the world,",
      "en-trans": "sakya zheja sateng drakpé khyab"
    },
    {
      "bo": "གངས་ལྗོངས་ལུགས་གཉིས་སླར་ཡང་དར་རྒྱས་མཛད། །",
      "en": "And caused the two traditions to flourish once again in the Land of Snows,",
      "en-trans": "gangjong luk nyi lar yang dargyé dzé"
    },
    {
      "bo": "མཁས་པའི་དབང་པོ་ཕྱོགས་ཀུན་ཁྱབ་པ་བཞིན། །",
      "en": "So that supremely learned scholars congregated in every direction—",
      "en-trans": "khepé wangpo chok kün khyabpa zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "འཁོར་ལོ་ཐ་མ་བླ་མེད་དུས་འཁོར་གྱི། །",
      "en": "Just as the glorious Jonangpas skilfully propagated the teachings",
      "en-trans": "khorlo tama lamé dükhor gyi"
    },
    {
      "bo": "རྒྱལ་བསྟན་སྤེལ་མཁས་དཔལ་ལྡན་ཇོ་ནང་པས། །",
      "en": "Of Kālacakra and the unsurpassed final turning of the Dharma-wheel",
      "en-trans": "gyalten pel khé palden jo nangpé"
    },
    {
      "bo": "ངེས་དོན་སྙིང་པོ་བསྟན་པ་དར་བ་བཞིན། །",
      "en": "And caused teachings on the ‘essence of definitive meaning’ to spread,",
      "en-trans": "ngedön nyingpo tenpa darwa zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "རྒྱལ་དབང་པདྨའི་ལུང་འཛིན་བློ་བཟང་གྲགས། །",
      "en": "Just as Lobzang Drakpa, who was prophesied by the victorious lord Padma,",
      "en-trans": "gyalwang pemé lung dzin lobzang drak"
    },
    {
      "bo": "མཁས་གྲུབ་མང་བརྟེན་བཟང་གསུམ་དཔལ་གྱིས་ཕྱུག །",
      "en": "Followed many learned adepts and won the splendour of threefold excellence,",
      "en-trans": "khedrub mang ten zang sum pal gyi chuk"
    },
    {
      "bo": "མདོ་སྔགས་ཟུང་འབྲེལ་ཐུབ་བསྟན་འཛིན་མཁས་བཞིན། །",
      "en": "To become skilled in upholding Buddha’s teaching that unites sūtra and mantra,",
      "en-trans": "do ngak zungdrel tubten dzin khé zhin"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟེན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyal ten nyingpo dargyé shok"
    },
    {
      "bo": "རིས་མེད་རྒྱལ་བསྟན་པདྨོའི་ཚལ་བཞད་ནས། །",
      "en": "Through the blossoming of the lotus garden of non-sectarian Buddhist teachings,",
      "en-trans": "rimé gyalten pemö tsal zhé né"
    },
    {
      "bo": "ཕྱི་ཡི་དགྲ་བགེགས་འབྱུང་བཞིའི་གནོད་ཞི་དང་། །",
      "en": "Pacifying threats from external enemies and hindrances as well as the four elements,",
      "en-trans": "chi yi dragek jung zhi nö zhi dang"
    },
    {
      "bo": "ནང་གི་ཆགས་སྡང་རྨོངས་པའི་དུག་སེལ་ནས། །",
      "en": "Dispelling the poison of internal attachment, aversion and ignorance,",
      "en-trans": "nang gi chakdang mongpé duk sel né"
    },
    {
      "bo": "གསང་བ་བྱང་ཆུབ་སེམས་ཀྱིས་རྒྱུད་སྨིན་ཏེ། །",
      "en": "And secretly maturing the mindstream through bodhicitta—the spirit of awakening,",
      "en-trans": "sangwa changchub sem kyi gyü min té"
    },
    {
      "bo": "གླིང་འདིར་རྒྱལ་བསྟན་སྙིང་པོ་དར་རྒྱས་ཤོག །",
      "en": "May the essence of the Buddha's teachings flourish in this land!",
      "en-trans": "ling dir gyalten nyingpo dargyé shok"
    },
    {
      "bo": "མཆོག་གསུམ་རྩ་གསུམ་སྲུང་མའི་བྱིན་རླབས་དང་། །",
      "en": "Through the blessings of the Three Jewels, Three Roots and guardian deities,",
      "en-trans": "chok sum tsa sum sungmé jinlab dang"
    },
    {
      "bo": "བདག་གི་ལྷག་བསམ་དག་པའི་བདེན་སྟོབས་ཀྱིས། །",
      "en": "And through the power of the truth of my own pure altruistic intention,",
      "en-trans": "dak gi lhaksam dakpé den tob kyi"
    },
    {
      "bo": "མི་མཐུན་འགལ་རྐྱེན་རྒུད་པ་ཀུན་ཞི་ནས། །",
      "en": "May all disharmony, adversity and signs of deterioration be pacified,",
      "en-trans": "mitün galkyen güpa kün zhi né"
    },
    {
      "bo": "ཚེ་བསོད་དཔལ་ཡོན་རྒྱས་པའི་བཀྲ་ཤིས་ཤོག །",
      "en": "And may all be auspicious so that lifespan, merit, glory and prosperity increase!",
      "en-trans": "tsesö palyön gyepé tashi shok"
    }
  ]
}