{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/aspiration-for-final-age",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དུས་མཐར་གདབ་པའི་སྨོན་ལམ།",
    "en": "An Aspiration for the Final Age"
  },
  "text": [
    {
      "bo": "ན་མོ།  དཀོན་མཆོག་གསུམ་ལ་སྙིང་ནས་སྐྱབས་སུ་མཆི། །",
      "en": "Namo! From the depths of my heart, I take refuge in the Three Jewels.",
      "en-trans": "namo, könchok sum la nying né kyab su chi"
    },
    {
      "bo": "སྐྱེ་མེད་ཆོས་ལ་བཟོད་པ་མ་ཐོབ་པར། །",
      "en": "Until I gain acceptance of the unborn nature of reality,",
      "en-trans": "kyemé chö la zöpa matobpar"
    },
    {
      "bo": "ངན་འགྲོའི་གནས་ནམ་ཡང་མི་ལྟུང་ཞིང་། །",
      "en": "May I never again fall into the lower realms",
      "en-trans": "ngendrö né namyang mi tung zhing"
    },
    {
      "bo": "ལྷ་བས་ལྷག་པའི་ལུས་རྟེན་ཐོབ་པར་ཤོག །",
      "en": "But attain a human body, superior even to a godly form.",
      "en-trans": "lhawé lhakpé lü ten tobpar shok"
    },
    {
      "bo": "མཐོ་རིས་ཐོབ་ཀྱང་སྡུག་བསྔལ་རྣམ་གསུམ་གྱིས། །",
      "en": "Even if I attain the higher realms, nowhere in saṃsāra",
      "en-trans": "tori tob kyang dukngal nam sum gyi"
    },
    {
      "bo": "དམ་ལ་མ་བཞག་འཁོར་བ་ཡོད་མིན་ན། །",
      "en": "Is free from the bonds of the three types of suffering.",
      "en-trans": "dam la ma zhak khorwa yö min na"
    },
    {
      "bo": "བདེ་འགྲོའི་རྟེན་ལ་མྱ་ངན་འདའ་བའི་གེགས། །",
      "en": "And even within fortunate realms, may I avoid a form",
      "en-trans": "dendrö ten la nya ngen dawé gek"
    },
    {
      "bo": "མི་ཁོམ་གནས་དང་མཚུངས་ལྡན་ལུས་སྤོང་ཤོག །",
      "en": "That would obstruct nirvāṇa, such as the unfree states.",
      "en-trans": "mikhom né dang tsungden lü pong shok"
    },
    {
      "bo": "སྡོམ་མིན་རྒྱུན་ལྡན་རྒྱལ་བློན་སྡིག་ཏོ་ཅན། །",
      "en": "May I avoid birth as an evil king or minister lacking restraint,",
      "en-trans": "dom min gyünden gyal lön dik tochen"
    },
    {
      "bo": "གཡུལ་ལས་དགའ་དང་ཞལ་ལྕེ་འཁྱོག་པོར་སྤྱོད། །",
      "en": "Who takes delight in warfare and twists and flouts the law.",
      "en-trans": "yul lé ga dang zhal ché khyokpor chö"
    },
    {
      "bo": "རྗེ་བོའི་བྲན་གྱུར་ཉམ་ཆུང་མནར་བ་དང་། །",
      "en": "May I not become a servant, lowly and tormented,",
      "en-trans": "jewö dren gyur nyamchung narwa dang"
    },
    {
      "bo": "ཚོང་པ་དང་ནི་གཡོན་ཅན་ལུས་སྤོང་ཤོག །",
      "en": "Or a merchant, or anyone who is devious or at fault.",
      "en-trans": "tsongpa dang ni yönchen lü pong shok"
    },
    {
      "bo": "དཀོན་མཆོག་དཀོར་འཕྲོག་དགེ་འདུན་ལས་བྱེད་དང་། །",
      "en": "May I not become a steward who steals the Saṅgha’s wealth,",
      "en-trans": "könchok kor trok gendün lejé dang"
    },
    {
      "bo": "ལྡན་གྲོལ་གཉིས་མེད་དཀོར་ལ་རང་དགར་སྤྱོད། །",
      "en": "Or one without qualities or liberation who appropriates funds.",
      "en-trans": "den drol nyimé kor la rang gar chö"
    },
    {
      "bo": "ལེགས་སྨོན་དོན་གཉེར་ཁྱིམ་པ་བསུན་འབྱིན་ཅན། །",
      "en": "May I avoid rebirth as a renunciant who offends householders",
      "en-trans": "lek mön dönnyer khyimpa sün jinchen"
    },
    {
      "bo": "གཞན་རྒྱུད་བསྲེག་པའི་དགེ་སྦྱོང་ལུས་སྤོང་ཤོག །",
      "en": "As they strive for better rebirth and who torments the minds of others.",
      "en-trans": "zhen gyü sekpé gejong lü pong shok"
    },
    {
      "bo": "རང་བཞིན་ངན་པ་སྦྲུལ་གདུག་ལྟ་བུ་དང་། །",
      "en": "May I not become someone as ill-natured as a serpent",
      "en-trans": "rangzhin ngenpa drul duk tabu dang"
    },
    {
      "bo": "གཞན་འབྱོར་ལ་སྡང་ལྷ་མ་ཡིན་གྱི་སེམས། །",
      "en": "Or one whose envy of others’ wealth resembles an asura’s.",
      "en-trans": "zhen jor la dang lha mayin gyi sem"
    },
    {
      "bo": "སྐྱབས་འོས་བསླུ་ཞིང་ཆོས་ལ་སྡང་བ་དང་། །",
      "en": "May I avoid rebirth as one who deceives the venerable",
      "en-trans": "kyabö lu zhing chö la dangwa dang"
    },
    {
      "bo": "བརྐུ་དང་འཕྲོག་འཇོམས་རྔོན་པའི་ལུས་སྤོང་ཤོག །",
      "en": "And despises the Dharma, or as a thief, a robber or a hunter.",
      "en-trans": "ku dang trok jom ngönpé lü pong shok"
    },
    {
      "bo": "མཚམས་མེད་ལྔའམ་དེ་དང་ཉེ་བ་ལྔ། །",
      "en": "May I avoid the five boundless crimes and five similar misdeeds,",
      "en-trans": "tsammé nga am dé dang nyewa nga"
    },
    {
      "bo": "མི་དགེ་བཅུ་ལ་འགྱོད་སེམས་མེད་བར་སྤྱོད། །",
      "en": "And refrain from remorselessly committing the ten non-virtues.",
      "en-trans": "mi gé chu la gyösem mewar chö"
    },
    {
      "bo": "ནགས་ལ་མེ་སྦར་སྦྲང་ཚང་གཏིབས་པ་སོགས། །",
      "en": "May I avoid all major forms of wrongdoing and misconduct,",
      "en-trans": "nak la mé bar drang tsang tibpa sok"
    },
    {
      "bo": "ཁ་ན་མ་ཐོ་ཆེ་ལས་ཐར་བར་ཤོག །",
      "en": "Such as setting forests ablaze or stealing honey from hives.",
      "en-trans": "khana mato ché lé tarwar shok"
    },
    {
      "bo": "དེ་ལྟར་ཐར་ནས་ད་ནི་ལྔ་བརྒྱའི་མཐར། །",
      "en": "Avoiding such plights, now, at the close of the five hundred,1",
      "en-trans": "detar tar né dani ngabgyé tar"
    },
    {
      "bo": "སྐྱེས་བུའི་ལུས་རྟེན་མི་ལུས་རིན་པོ་ཆེ། །",
      "en": "Having gained the precious support of a human body,",
      "en-trans": "kyebü lü ten milü rinpoche"
    },
    {
      "bo": "རབ་ཏུ་བྱུང་ངམ་ཅིག་ཤོས་ཡང་ནི་རུང་། །",
      "en": "Whether as a monastic or upholder of lay vows,",
      "en-trans": "rabtu jung ngam chikshö yang ni rung"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཅན་ཐོབ་པར་ཤོག །",
      "en": "May I inherit the lineage of the bodhisattvas.",
      "en-trans": "changchub sempé rikchen tobpar shok"
    },
    {
      "bo": "སྐྱེས་མ་ཐག་ཏུ་ཐེག་པ་ཆེན་པོའི་ལམ། །",
      "en": "As soon as I’m reborn, may I meet a master who flawlessly",
      "en-trans": "kyé ma tak tu tekpa chenpö lam"
    },
    {
      "bo": "མ་ནོར་མངོན་སུམ་སྟོན་པའི་བླ་མ་དང་། །",
      "en": "And authentically teaches the Mahāyāna path,",
      "en-trans": "manor ngönsum tönpé lama dang"
    },
    {
      "bo": "མཇལ་ནས་རྣམ་པ་ཀུན་ཏུ་མཉེས་བྱེད་ཅིང་། །",
      "en": "And by pleasing him or her in every way,",
      "en-trans": "jal né nampa küntu nyé jé ching"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་ཤེས་རབ་ལྡན་པར་ཤོག།",
      "en": "May I gain the wisdom of hearing, contemplation and meditation.",
      "en-trans": "tö sam gompé sherab denpar shok"
    },
    {
      "bo": "དེ་ཡང་བསམ་པ་བྱང་ཆུབ་སེམས་དང་ལྡན། །",
      "en": "Furthermore, by possessing the motivation of bodhicitta",
      "en-trans": "deyang sampa changchub sem dangden"
    },
    {
      "bo": "སྦྱོར་བ་ཕ་རོལ་ཕྱིན་དྲུག་ལ་གོམས་པས། །",
      "en": "And familiarizing myself with the application of the six perfections,",
      "en-trans": "jorwa parol chin druk la gompé"
    },
    {
      "bo": "ལམ་ལྔ་ས་བཅུ་སྔགས་ཀྱི་སྡེ་སྣོད་ལ། །",
      "en": "May I gain the supreme good fortune to traverse all at once",
      "en-trans": "lam nga sa chu ngak kyi denö la"
    },
    {
      "bo": "ཅིག་ཅར་བགྲོད་པའི་སྐལ་བ་མཆོག་ལྡན་ཤོག །",
      "en": "The five paths and ten stages and master the tantra collection!",
      "en-trans": "chikchar dröpé kalwa chokden shok"
    }
  ]
}