{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/aspiration-to-be-cared-for",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཚེ་རབས་རྗེས་འཛིན་སྨོན་ལམ། །",
    "en": "Aspiration to Be Cared for in Every Lifetime"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་གཤེགས་པའི་རྒྱལ་བ་ཐམས་ཅད་ཀུན། །",
      "en": "All the victorious buddhas of past, present and future",
      "en-trans": "dü sum shekpé gyalwa tamché kun"
    },
    {
      "bo": "རང་ངོར་བཤེས་གཉེན་མཆོག་གི་སྐུར་སྣང་བ། །",
      "en": "Appear to us in the form of the supreme spiritual guide,",
      "en-trans": "rang ngor shenyen chok gi kur nangwa"
    },
    {
      "bo": "བཀའ་དྲིན་མཚུངས་བྲལ་ཡོན་ཏན་རྒྱ་མཚོའི་གཏེར། །",
      "en": "Unmatched in kindness, a treasury of oceanic qualities—",
      "en-trans": "kadrin tsung dral yönten gyatsö ter"
    },
    {
      "bo": "ཡིད་བཞིན་ནོར་བུ་ཁྱེད་ལ་གསོལ་བ་འདེབས། །",
      "en": "Wish-fulfilling jewel, to you I pray!",
      "en-trans": "yizhin norbu khyé la solwa deb"
    },
    {
      "bo": "ཁྱེད་ཀྱིས་འགྲོ་འདུལ་ཐབས་མཁས་སྤྱོད་པ་ནི། །",
      "en": "As you manifest all manner of activity,",
      "en-trans": "khyé kyi drodül tabkhé chöpa ni"
    },
    {
      "bo": "རྣམ་པ་སྣ་ཚོགས་ཇི་ལྟར་བསྟན་བྱས་ཀྱང༌། །",
      "en": "Employing various skilful means to tame beings,",
      "en-trans": "nampa natsok ji tar ten jé kyang"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་ལོག་ལྟ་མི་སྐྱེ་བར། །",
      "en": "Bless me so that I do not develop wrong views even for an instant",
      "en-trans": "ké chik tsam yang lok ta mi kyé war"
    },
    {
      "bo": "ཇི་མཛད་ལེགས་པར་མཐོང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "And perceive all that you do as perfect!",
      "en-trans": "ji dzé lekpar tongwar jin gyi lob"
    },
    {
      "bo": "གང་གིས་བརྩེ་བར་གདམས་པའི་གསུང་བཟང་ལས། །",
      "en": "Of the excellent advice that you have lovingly imparted",
      "en-trans": "gang gi tse war dampé sung zang lé"
    },
    {
      "bo": "ཚིག་ཟུར་ཙམ་ཡང་འགོངས་པར་མི་བྱེད་ཅིང༌། །",
      "en": "I shall not disobey even so much as a single word;",
      "en-trans": "tsik zur tsam yang gongpar mi ché ching"
    },
    {
      "bo": "བུམ་པ་གང་བྱོའི་ཚུལ་གྱིས་བྱིན་རླབས་ཀུན། །",
      "en": "Just like the contents of one vase poured into another,",
      "en-trans": "pumpa gang jöi tsul gyi chin lap kun"
    },
    {
      "bo": "མ་ལུས་བདག་གི་རྒྱུད་ལ་འཕོ་བར་ཤོག །",
      "en": "Let all your blessings be transferred into me!",
      "en-trans": "ma lü dak gi gyü la powar shok"
    },
    {
      "bo": "མགོན་ཁྱོད་དག་དང་མ་དག་ཞིང་རྣམས་སུ། །",
      "en": "O Protector, as you display various enlightened forms",
      "en-trans": "gön khyö dak dang ma dak zhing nam su"
    },
    {
      "bo": "སྣ་ཚོགས་སྤྲུལ་བའི་རོལ་གར་ངོམ་པའི་ཚེ། །",
      "en": "In pure and impure realms of existence,",
      "en-trans": "na tsok trulpé rol gar ngompé tsé"
    },
    {
      "bo": "བདག་ཀྱང་ཁྱོད་ཀྱི་ཞབས་འབྲང་མཆོག་གྱུར་ནས། །",
      "en": "May I be born as your foremost attendant,",
      "en-trans": "dak kyang khyö kyi zhab drang chok gyur né"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་ལ་མཉམ་དུ་འཇུག་པར་ཤོག །",
      "en": "So that we may act together to bring about awakening!",
      "en-trans": "chang chub chö la nyam du jukpar shok"
    },
    {
      "bo": "ནམ་ཞིག་རང་སྣང་དག་པའི་ཞིང་མཆོག་ཏུ། །",
      "en": "Precious lord, when you display the act of enlightenment",
      "en-trans": "nam zhik rang nang dakpé zhing chok tu"
    },
    {
      "bo": "རྗེ་ཁྱོད་མངོན་འཚང་རྒྱ་བའི་ཚུལ་སྟོན་ཚེ། །",
      "en": "In a sublime, self-appearing pure realm,",
      "en-trans": "jé khyö ngön tsang gyawé tsül tön tsé"
    },
    {
      "bo": "བདག་ཀྱང་འདུས་པ་དང་པོའི་གྲལ་འཁོད་དེ། །",
      "en": "May I take my place among the first of your disciples,",
      "en-trans": "dak kyang düpa dangpö dral khö dé"
    },
    {
      "bo": "ཕྲིན་ལས་སྤེལ་བའི་བྱེད་པོ་མཆོག་ཏུ་སྨོན། །",
      "en": "And act supremely to further your enlightened deeds!",
      "en-trans": "trinlé pelwé jepo chok tu mön"
    },
    {
      "bo": "མདོར་ན་ད་ནས་སྐྱེ་བ་ཐམས་ཅད་དུ། །",
      "en": "In short, from now onwards throughout all my future lives,",
      "en-trans": "dor na da né kyewa tamché du"
    },
    {
      "bo": "སྐྱབས་གཅིག་དམ་པ་ཁྱེད་དང་མི་འབྲལ་ཞིང༌། །",
      "en": "May I never be apart from you, my one true refuge,",
      "en-trans": "kyab chik dampa khye dang mi dral zhing"
    },
    {
      "bo": "བྱང་ཆུབ་ཐོབ་ཀྱང་རིགས་ཀྱི་བདག་པོ་རུ། །",
      "en": "And even once I attain enlightenment, may you be the lord of my family,",
      "en-trans": "chang chub tob kyang rik kyi dakpo ru"
    },
    {
      "bo": "གྱུར་ནས་འགྲོ་ཁམས་དོང་ནས་སྤྲུགས་པར་ཤོག །",
      "en": "As we empty the realms of ordinary beings from their depths!",
      "en-trans": "gyur né dro kham dong né trukpar shok"
    }
  ]
}