{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dodrupchen-I/aspiration-at-moment-of-death",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཆི་ཁའི་སྨོན་ལམ།",
    "en": "Aspiration at the Moment of Death"
  },
  "text": [
    {
      "bo": "མཆོག་གསུམ་རྩ་གསུམ་གྱི་ངོ་བོར་གྱུར་པ་བླ་མ་དམ་པ་རྣམས་ཀྱི་སྐུ་གསུང་ཐུགས་ཡོན་ཏན་ཕྲིན་ལས་ཀྱི་ཚོགས་ལ་སྐྱབས་སུ་མཆིའོ། །",
      "en": "I take refuge in the body, speech, mind, qualities and activity of the noble gurus, who embody the Three Jewels and Three Roots.",
      "en-trans": "chok sum tsa sum gyi ngowor gyurpa lama dampa nam kyi ku sung tuk  yönten trinlé kyi tsok la kyab su chi’o"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་གྱིས་བརླབ་པར་མཛད་དུ་གསོལ། །",
      "en": "I supplicate you: inspire me with your blessings, I pray!",
      "en-trans": "solwa depso chin gyi labpar dzé du sol"
    },
    {
      "bo": "སྨོན་ལམ་བཏབ་པ་འདི་རྣམས་འགྲུབ་པར་མཛད་དུ་གསོལ། །",
      "en": "Fulfil these aspirations of mine, I pray!",
      "en-trans": "mönlam tabpa di nam drubpar dzé du sol"
    },
    {
      "bo": "མི་ངའི་སྐྱེ་བ་ནས་སྐྱེ་བ་ཐམས་ཅད་དུ་ཕ་མ་སེམས་ཅན་ཐམས་ཅད་ལ་བསམ་པ་ངན་པ་སྤུ་ཙམ་ཡང་སྐྱེ་བར་མ་གྱུར་ཅིག །",
      "en": "From this life onwards, throughout all my future lives, may I never develop even the slightest negative intention towards sentient beings, who are my very own parents!",
      "en-trans": "mi ngé kyewa né kyewa tamché du pama semchen tamché la sampa ngenpa pu tsam yang kyewar ma gyur chik"
    },
    {
      "bo": "བསམ་སྦྱོར་བཟང་པོ་ཆུ་རྒྱུན་བཞིན་དུ་རྒྱུན་མི་འཆད་པར་གྱུར་ཅིག །",
      "en": "May my positive intentions and actions flow uninterruptedly like a stream!",
      "en-trans": "sam jor zangpo chu gyün zhin du gyün mi chépar gyur chik"
    },
    {
      "bo": "ཟ་འདོད་ཀྱི་ཚོགས་འཁོར་མ་ཡིན་པའི་རྡོ་རྗེ་ཐེག་པའི་ལམ་རྣམ་པར་དག་པའི་ཚོགས་འཁོར་ལ་ལོངས་སྤྱོད་མ་གཏོགས་འགྲོ་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤ་ཁྲག་ཟ་བ་དང་འཐུང་བ་དང་འབག་པ་ལ་སོགས་ཅུང་ཟད་ཀྱང་མི་བྱེད་པར་ཤོག་ཅིག །",
      "en": "With the exception of the puregaṇacakrafeast on the path of Vajrayāna, which does not involve any desire to eat, may I never consume or be involved in the consumption of even the slightest trace of flesh or blood from any living being!",
      "en-trans": "za dö kyi tsok khor ma yinpé dorje tekpé lam nampar dakpé tsok khor la longchö ma tok drowa semchen tamché kyi sha trak zawa dang tungwa dang bakpa la sok chung zé kyang mi chépar shok chik"
    },
    {
      "bo": "དམ་བཅའ་འདི་དག་དུས་ད་ལྟ་བཞིན་དུ་དྲན་པར་གྱུར་ཅིག །",
      "en": "May I always recall these vows as vividly as I do now!",
      "en-trans": "damcha di dak dü data zhin du drenpar gyur chik"
    },
    {
      "bo": "ལྡན་པ་དང་གྲོལ་བའི་ཡོན་ཏན་གཉིས་དང་མི་ལྡན་བཞིན་དུ་དཀོར་ཟས་ལན་ཆགས་ལ་ཏིལ་འབྲུ་ཙམ་ཡང་མི་འབག་པར་ཤོག་ཅིག །",
      "en": "For as long as I lack the two qualities of possession and freedom,1may I never incur even the slightest karmic debt based on the misuse of offerings!",
      "en-trans": "denpa dang drolwé yönten nyi dang mi den zhin du kor zé len chak la tildru tsam yang mi bakpar shok chik"
    },
    {
      "bo": "སེམས་ཅན་གཅིག་གི་དོན་དུའང་རང་གི་སྒོ་གསུམ་པོ་གཏོང་བ་ལ་ཐོགས་པ་ཅུང་ཟད་ཙམ་ཡང་མི་བྱེད་པར་ཤོག་ཅིག །",
      "en": "May I be able to sacrifice my own body, speech and mind without the slightest impediment, even it is for the sake of just a single sentient being!",
      "en-trans": "semchen chik gi dön du’ang rang gi go sumpo tongwa la tokpa chung zé tsam yang mi chepar shok chik"
    },
    {
      "bo": "ཆོས་ཉིད་འགྱུར་བ་མེད་པ་དང་ཆོས་ཅན་རྒྱུ་འབྲས་བསླུ་བ་མེད་པའི་བདེན་པའི་སྟོབས་ཀྱིས་རང་འདོད་དང་བྲལ་བའི་སྨོན་ལམ་འདི་རྣམས་ཡོངས་སུ་འགྲུབ་པར་གྱུར་ཅིག །",
      "en": "Through the power of the truth of the unchangingdharmatānature and the infallible law of causality, may these selfless aspirations be entirely fulfilled!",
      "en-trans": "chönyi gyurwa mepa dang chöchen gyu dré luwa mepé denpé tob kyi rang dö dang dralwé mönlam di nam yong su drubpar gyur chik"
    },
    {
      "bo": "དཀོན་མཆོག་གསུམ་གྱི་བདེན་པས་འགྲུབ་པར་གྱུར་ཅིག །",
      "en": "Through the truth of the Three Jewels, may they be fulfilled!",
      "en-trans": "kön chok sum gyi denpé drubpar gyur chik"
    },
    {
      "bo": "བླ་མ་དམ་པ་རྣམས་ཀྱི་བདེན་པས་འགྲུབ་པར་གྱུར་ཅིག །",
      "en": "Through the truth of the noble gurus, may they be fulfilled!",
      "en-trans": "lama dampa nam kyi denpé drubpar gyur chik"
    }
  ]
}