{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dodrupchen-III/aspiration-accomplish-dharma-genuine-way",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་ཆོས་ལ་བཏབ་པ།",
    "en": "Aspirations in Accordance with the Dharma"
  },
  "text": [
    {
      "bo": "སྐྱིད་ན་བསྙེན་བཀུར་བྱ་བའི་ཞིང་། །",
      "en": "When I am happy, it is you whom I honour and revere,",
      "en-trans": "kyi na nyenkur jawé zhing"
    },
    {
      "bo": "སྡུག་ན་ཡུས་ཀྱིས་འབོད་པའི་ཡུལ། །",
      "en": "When I suffer, it is you whom I call upon for help,",
      "en-trans": "duk na yü kyi böpé yul"
    },
    {
      "bo": "ཚེ་འདིའི་རེ་ས་ཕྱི་མའི་སྐྱབས། །",
      "en": "You are my source of hope for this life, and protection for the next—",
      "en-trans": "tsé di resa chimé kyab"
    },
    {
      "bo": "པདྨ་འབྱུང་གནས་སྤྱན་རས་གཟིགས། །",
      "en": "Padmasambhava, Avalokiteśvara,",
      "en-trans": "pema jungné chenrezig"
    },
    {
      "bo": "དྲིན་ཆེན་རྩ་བའི་བླ་མ་གསུམ། །",
      "en": "And my kind root teacher.",
      "en-trans": "drinchen tsawé lama sum"
    },
    {
      "bo": "མཚན་དང་རྣམ་འགྱུར་ཐ་དད་ཀྱང་། །",
      "en": "Although you assume these different names and forms,",
      "en-trans": "tsen dang namgyur tadé kyang"
    },
    {
      "bo": "དགོངས་ཀློང་མཛད་པ་དབྱེར་མེད་ཕྱིར། །",
      "en": "In the expanse of your wisdom and in your deeds, you are no different,",
      "en-trans": "gong long dzepa yermé chir"
    },
    {
      "bo": "སོ་སོར་མི་འཛིན་གཅིག་ཏུ་བསྡུ། །",
      "en": "So without considering you as separate, but fused together as one—",
      "en-trans": "sosor mi dzin chik tu du"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཐུགས་རྗེས་ཟུངས། །",
      "en": "I pray to you: hold me with your compassion!",
      "en-trans": "solwa deb so tukjé zung"
    },
    {
      "bo": "དུས་རྣམ་ཀུན་ཏུ་བྱིན་གྱིས་རློབས། །",
      "en": "At all times and in all situations, inspire me with your blessings!",
      "en-trans": "dü nam küntu jingyi lob"
    },
    {
      "bo": "དལ་འབྱོར་མི་ལུས་ཐོབ་དུས་སུ། །",
      "en": "Now that I have found this human existence, with its freedoms and advantages,",
      "en-trans": "daljor milü tob dü su"
    },
    {
      "bo": "སྙིང་པོའི་ལྷ་ཆོས་འགྲུབ་པར་ཤོག །",
      "en": "Let me accomplish the most essential teachings!",
      "en-trans": "nyingpö lha chö drubpar shok"
    },
    {
      "bo": "ཚེ་ཐུང་དགུན་ཉི་འདྲ་བ་འདི། །",
      "en": "Life, like a winter’s day, lasts but a short while,",
      "en-trans": "tsé tung gün nyi drawa di"
    },
    {
      "bo": "དོན་ལྡན་ཆོས་ལ་འདྲིལ་བར་ཤོག །",
      "en": "So let me devote it to what is meaningful: the Dharma.",
      "en-trans": "dönden chö la drilwar shok"
    },
    {
      "bo": "གདོང་ཐུག་འཆི་བ་བྱུང་ཙ་ན། །",
      "en": "If I should face death all of a sudden,",
      "en-trans": "dong tuk chiwa jung tsana"
    },
    {
      "bo": "ཆོས་ཀྱི་ར་མདའ་སླེབ་པར་ཤོག །",
      "en": "Let the teachings come swiftly to my aid!",
      "en-trans": "chö kyi rada lebpar shok"
    },
    {
      "bo": "ཐག་རིང་ཕྱི་མར་འགྲོ་བའི་ཚེ། །",
      "en": "When setting out upon the long journey to the next life,",
      "en-trans": "takring chimar drowé tsé"
    },
    {
      "bo": "ཆོས་ཀྱི་ལམ་རྒྱགས་མང་བར་ཤོག །",
      "en": "Let my provisions of Dharma be plentiful!",
      "en-trans": "chö kyi lam gyak mangwar shok"
    },
    {
      "bo": "ཚེ་འདིར་ཆོས་ཀྱི་ས་བོན་ཐེབ། །",
      "en": "By planting the seed of Dharma in this life,",
      "en-trans": "tsé dir chö kyi sabön teb"
    },
    {
      "bo": "ཕྱི་མ་ལོ་ཐོག་ལེགས་པར་ཤོག །",
      "en": "May I reap an abundant harvest in the next!",
      "en-trans": "chima lo tok lekpar shok"
    },
    {
      "bo": "གར་སྐྱེས་གང་དུ་སོང་ན་ཡང་། །",
      "en": "Wherever I am born, wheresoever is my destination,",
      "en-trans": "gar kyé gangdu song na yang"
    },
    {
      "bo": "ཆོས་ཀྱི་བག་ཆགས་སད་པར་ཤོག །",
      "en": "Let my propensity for the Dharma be awakened!",
      "en-trans": "chö kyi bakchak separ shok"
    },
    {
      "bo": "སྐྱིད་སྡུག་ལེགས་ཉེས་ཅི་བྱུང་ཡང་། །",
      "en": "Happiness or suffering, good or bad—no matter what occurs,",
      "en-trans": "kyiduk leknyé chi jung yang"
    },
    {
      "bo": "བློ་གཏད་ཆོས་ལ་བྱེད་པར་ཤོག །",
      "en": "May I always place my trust in the Dharma!",
      "en-trans": "lo té chö la jepar shok"
    },
    {
      "bo": "ཆོས་ཀྱི་འཇུག་སྒོ་མ་ནོར་བ། །",
      "en": "Since it is the infallible entry to the Dharma,",
      "en-trans": "chö kyi jukgo manorwa"
    },
    {
      "bo": "དད་པའི་རྩ་བ་བརྟན་པར་ཤོག །",
      "en": "Let the roots of my faith be strong!",
      "en-trans": "depé tsawa tenpar shok"
    },
    {
      "bo": "ཆོས་ཀྱི་གཞི་མ་མ་འཆུགས་པ། །",
      "en": "Since it is the definite foundation of the Dharma,",
      "en-trans": "chö kyi zhima machukpa"
    },
    {
      "bo": "མི་འཚེའི་བརྟུལ་ཞུགས་བརླིང་བར་ཤོག །",
      "en": "Let my training in nonviolence be secure!",
      "en-trans": "mi tsé tulzhuk lingwar shok"
    },
    {
      "bo": "ཆོས་ཀྱི་སྲོག་ཤིང་མ་ཡོ་བ། །",
      "en": "Since it is the vital axis of the Dharma,",
      "en-trans": "chö kyi sokshing mayowa"
    },
    {
      "bo": "བདེན་པའི་གཞུང་ལམ་སྲོང་བར་ཤོག །",
      "en": "May I follow the way that accords with how things truly are!",
      "en-trans": "denpé zhunglam songwar shok"
    },
    {
      "bo": "ཆོས་ཀྱི་ཉིང་ཁུ་མ་བསླད་པ། །",
      "en": "Since it is the pure quintessence of the Dharma,",
      "en-trans": "chö kyi nyingkhu malepa"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་གཉིས་འབྱོངས་པར་ཤོག །",
      "en": "Let me master bodhicitta in both its aspects!",
      "en-trans": "changchub sem nyi jongwar shok"
    },
    {
      "bo": "དམ་ཆོས་རྒྱལ་པོ་ཡི་གེ་དྲུག །",
      "en": "Since the six-syllable mantra is the sovereign of practices,",
      "en-trans": "damchö gyalpo yigé druk"
    },
    {
      "bo": "གཡེལ་མེད་བཟླས་སྒོམ་བྱེད་པར་ཤོག །",
      "en": "May I recite it and meditate unwaveringly!",
      "en-trans": "yelmé dé gom jepar shok"
    },
    {
      "bo": "ཆོས་བཞིན་སྒྲུབ་ལ་བར་ཆད་མེད། །",
      "en": "May I accomplish the Dharma authentically and without obstacle,",
      "en-trans": "chö zhin drub la barché mé"
    },
    {
      "bo": "མཐུན་རྐྱེན་ཡིད་བཞིན་འཛོམ་པར་ཤོག །",
      "en": "And find favourable conditions in abundance, just as I desire!",
      "en-trans": "tünkyen yizhin dzompar shok"
    },
    {
      "bo": "བླ་མ་ལྷ་ལ་དཔང་བཅོལ་ནས། །",
      "en": "Taking the teachers and the deities as my witness,",
      "en-trans": "lama lha la pang chol né"
    },
    {
      "bo": "སྨོན་ལམ་ཆོས་ལ་བཏབ་པ་འདི། །",
      "en": "May these, my prayers of aspiration towards the Dharma,",
      "en-trans": "mönlam chö la tabpa di"
    },
    {
      "bo": "བཏབ་སར་ཐེབས་ཤིན་ཕྱིར་མི་ལྡོག །",
      "en": "Take seed in fertile ground, and without ever failing,",
      "en-trans": "tab sar teb shin chir mi dok"
    },
    {
      "bo": "ཆུད་ཟོས་མེད་པར་འགྲུབ་པར་ཤོག །",
      "en": "May they be accomplished, and never go to waste!",
      "en-trans": "chüzö mepar drubpar shok"
    }
  ]
}