{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shabkar/aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ།",
    "en": "Aspiration1"
  },
  "text": [
    {
      "bo": "བསླུ་མེད་དཀོན་མཆོག་གསུམ་གྱི་བྱིན་རླབས་ཀྱིས། །",
      "en": "Through the blessings of the infallible Three Jewels,",
      "en-trans": "lumé könchok sum gyi jinlab kyi"
    },
    {
      "bo": "བདག་གི་ཕ་མ་འཁོར་བ་ངན་སོང་གི །",
      "en": "May my own parents be freed from the sufferings",
      "en-trans": "dak gi pama khorwa ngensong gi"
    },
    {
      "bo": "སྡུག་བསྔལ་ལས་སྒྲོལ་བདེ་བ་ཅན་སྐྱེས་ནས། །",
      "en": "Of saṃsāra’s lower realms and reborn in Sukhāvatī,",
      "en-trans": "dukngal lé drol dewachen kyé né"
    },
    {
      "bo": "འོད་དཔག་མེད་མགོན་མཉེས་པར་བྱེད་གྱུར་ཅིག །",
      "en": "Where they may delight the protector Amitābha.",
      "en-trans": "öpakmé gön nyepar jé gyur chik"
    },
    {
      "bo": "བདག་གིས་ཐོག་མ་མེད་ནས་ད་ལྟའི་བར། །",
      "en": "Through the force of all the virtuous deeds I have done",
      "en-trans": "dak gi tokma mé né danté bar"
    },
    {
      "bo": "རྣམ་དཀར་ལས་ཀྱི་འབྲས་བུ་གང་བགྱིས་པ། །",
      "en": "Throughout beginningless time until now,",
      "en-trans": "namkar lé kyi drebu gang gyipa"
    },
    {
      "bo": "དེ་ཡི་མཐུ་ལས་ཕ་མ་སེམས་ཅན་ནི། །",
      "en": "May all sentient beings, my kind parents,",
      "en-trans": "dé yi tu lé pama semchen ni"
    },
    {
      "bo": "དྲིན་ཅན་མཐའ་དག་འཁོར་བ་ལས་སྒྲོལ་ཤོག །",
      "en": "Be liberated from the cycle of saṃsāra.",
      "en-trans": "drinchen tadak khorwa lé drol shok"
    },
    {
      "bo": "བདག་གི་ལུས་སྲོག་བསྐྱེད་པའི་ཕ་མ་དང་། །",
      "en": "May my mother and father, who gave me life and physical form,",
      "en-trans": "dak gi lü sok kyepé pama dang"
    },
    {
      "bo": "བདག་ལ་ཐར་ལམ་སྟོན་པའི་མཁན་སློབ་རྣམས། །",
      "en": "And the teachers and instructors who showed me the path to freedom",
      "en-trans": "dak la tarlam tönpé khen lob nam"
    },
    {
      "bo": "ཚོགས་གཉིས་རབ་རྫོགས་སྒྲིབ་གཉིས་རབ་བྱང་ནས། །",
      "en": "Complete the two accumulations, purify their twofold obscurations,",
      "en-trans": "tsok nyi rabdzok drib nyi rab jang né"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཆོས་ཀྱི་རྒྱལ་པོ་མཉེས་གྱུར་ཅིག །",
      "en": "And delight the omniscient King of Dharma.",
      "en-trans": "künkhyen chö kyi gyalpo nyé gyur chik"
    },
    {
      "bo": "བདག་ལ་རེ་ལྟོས་བགྱིས་པའི་སྦྱིན་བདག་དང་། །",
      "en": "May the patrons who have placed their trust in me,",
      "en-trans": "dak la ré tö gyipé jindak dang"
    },
    {
      "bo": "བདག་གིས་གནོད་འཚེ་བྱས་པའི་འགྲོ་བ་དང་། །",
      "en": "As well as all those beings whom I have harmed,",
      "en-trans": "dak gi nö tsé jepé drowa dang"
    },
    {
      "bo": "བདག་ལ་གནོད་ཚེས་བྱས་པའི་སེམས་ཅན་རྣམས། །",
      "en": "And those who have brought harm to me",
      "en-trans": "dak la nö tsé jepé semchen nam"
    },
    {
      "bo": "ཚོགས་རྫོགས་སྒྲིབ་བྱང་སངས་རྒྱས་མྱུར་ཐོབ་ཤོག །",
      "en": "Complete the accumulations, purify the obscurations, and swiftly attain enlightenment.",
      "en-trans": "tsok dzok drib jang sangye nyur tob shok"
    },
    {
      "bo": "བདག་གིས་བརྡེག་ཙོག་ཤ་ཁྲག་ཟས་པ་དང་། །",
      "en": "May all sentient beings, led by those whom I have abused,",
      "en-trans": "dak gi dek tsok sha trak zepa dang"
    },
    {
      "bo": "སྲོག་གཅད་སྤུ་དང་ལྤགས་པ་གྱོན་པ་སོགས། །",
      "en": "Whose flesh and blood I have consumed,",
      "en-trans": "sok ché pu dang pakpa gyönpa sok"
    },
    {
      "bo": "འགྲོ་བ་དེ་རྣམས་གཙོར་བྱས་སེམས་ཅན་རྣམས། །",
      "en": "Whose lives I’ve cut short and whose fur and hides I’ve worn,",
      "en-trans": "drowa denam tsor jé semchen nam"
    },
    {
      "bo": "བདག་ལ་བསྟེན་ནས་རྣམ་མཁྱེན་མྱུར་ཐོབ་ཤོག །",
      "en": "Swiftly attain omniscience in reliance upon me.",
      "en-trans": "dak la ten né namkhyen nyur tob shok"
    }
  ]
}