{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/gyalse-thogme-zangpo/aspiration-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་བཞུགས།",
    "en": "An Aspiration Prayer"
  },
  "text": [
    {
      "bo": "བླ་མ་དང་དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Guru and Three Jewels!",
      "en-trans": "lama dang könchok sum la chaktsal lo"
    },
    {
      "bo": "བདག་ནི་སྐྱེ་ཞིང་སྐྱེ་བ་ཐམས་ཅད་དུ། །",
      "en": "May I, in each and every one of my lives to come,",
      "en-trans": "dak ni kyé zhing kyewa tamché du"
    },
    {
      "bo": "དལ་འབྱོར་མི་ལུས་རིན་ཆེན་ཐོབ་གྱུར་ནས། །",
      "en": "Gain a precious human form, free and well-favoured,",
      "en-trans": "daljor milü rinchen tob gyur né"
    },
    {
      "bo": "བཤེས་གཉེན་དམ་པ་རྣམས་དང་མཇལ་བ་དང༌། །",
      "en": "And thereafter may I encounter sublime spiritual guides",
      "en-trans": "shenyen dampa nam dang jalwa dang"
    },
    {
      "bo": "རྟག་ཏུ་དམ་པའི་ཆོས་ལ་སྤྱོད་པར་ཤོག །",
      "en": "And continuously apply myself to the sacred Dharma.",
      "en-trans": "taktu dampé chö la chöpar shok"
    },
    {
      "bo": "སྲིད་པའི་བདེ་ལ་ནམ་ཡང་མ་ཆགས་ཤིང ༌། །",
      "en": "May I never cling to the pleasures of ordinary existence,",
      "en-trans": "sipé dé la namyang ma chak shing"
    },
    {
      "bo": "མྱང་འདས་དམན་པའི་མཐའ་ལའང་མ་ཞེན་པར། །",
      "en": "Nor become attached to the extreme of an inferior nirvāṇa.",
      "en-trans": "nyangdé menpé ta la ang mazhenpar"
    },
    {
      "bo": "མཁའ་མཉམ་སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར། །",
      "en": "Instead, for the sake of all beings as numerous as space is vast,",
      "en-trans": "khanyam semchen kün gyi dön gyi chir"
    },
    {
      "bo": "བླ་མེད་བྱང་ཆུབ་སྒྲུབ་ལ་བརྩོན་པར་ཤོག །",
      "en": "May I strive to accomplish unsurpassed awakening.",
      "en-trans": "lamé changchub drub la tsönpar shok"
    },
    {
      "bo": "དོན་དམ་སྤྲོས་པའི་མཐའ་དང་བྲལ་བ་དང༌། །",
      "en": "Having realized the ultimate beyond conceptual limitations",
      "en-trans": "döndam tröpé ta dang dralwa dang"
    },
    {
      "bo": "ཀུན་རྫོབ་སྒྱུ་མ་ལྟ་བུར་རྟོགས་གྱུར་ནས། །",
      "en": "And the illusory nature of the relative,",
      "en-trans": "kündzob gyuma tabur tok gyur né"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་གཡེལ་བ་མེད་པར་ནི། །",
      "en": "May I never be distracted even for so much as an instant",
      "en-trans": "kechik tsam yang yelwa mepar ni"
    },
    {
      "bo": "ཟབ་དོན་ཉམས་སུ་ལེན་ལ་བརྩོན་པར་ཤོག །",
      "en": "As I diligently strive to take this profound truth to heart.",
      "en-trans": "zab dön nyam su len la tsönpar shok"
    },
    {
      "bo": "ཚེ་འདི་ཉིད་ལའང་མི་དགེ་ཀུན་སྤོང་ཞིང༌། །",
      "en": "Even in this very life, may I reject all that is unwholesome",
      "en-trans": "tsé di nyi la ang mi gé kün pong zhing"
    },
    {
      "bo": "རྟག་ཏུ་དགེ་བའི་ཆོས་ལ་རབ་ཏུ་བརྩོན། །",
      "en": "And constantly strive to apply the virtuous Dharma.",
      "en-trans": "taktu gewé chö la rabtu tsön"
    },
    {
      "bo": "དུས་རྣམས་རྟག་ཏུ་སྒོ་གསུམ་སྤྱོད་པ་རྣམས། །",
      "en": "May all my actions of body, speech and mind",
      "en-trans": "dü nam taktu go sum chöpa nam"
    },
    {
      "bo": "གཞན་ལ་ཕན་པའི་དོན་དུ་འགྱུར་བར་ཤོག །",
      "en": "Always be devoted solely to others' well-being!",
      "en-trans": "zhen la penpé döndu gyurwar shok"
    },
    {
      "bo": "ཚེའི་འདུ་བྱེད་གཏོང་བར་གྱུར་པ་ན། །",
      "en": "When it's time to let go of this life,",
      "en-trans": "tséyi dujé tongwar gyurpa na"
    },
    {
      "bo": "ནུབ་ཕྱོགས་བདེ་བ་ཅན་གྱི་ཞིང་ཁམས་སུ། །",
      "en": "May the force of my faith and aspiration",
      "en-trans": "nubchok dewachen gyi zhingkham su"
    },
    {
      "bo": "དད་དང་འདུན་པའི་ཤུགས་ཀྱིས་ལེགས་བགྲོད་ནས། །",
      "en": "Carry me to the western paradise of Sukhāvatī,",
      "en-trans": "dé dang dünpé shuk kyi lek drö né"
    },
    {
      "bo": "འོད་དཔག་མེད་པའི་ཐུགས་རྗེས་རྗེས་འཛིན་ཤོག །",
      "en": "There to be guided by Amitābha in his compassion.",
      "en-trans": "öpakmé pé tukjé jedzin shok"
    }
  ]
}