{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shabkar/end-of-recitation-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཁ་ཏོན་བྱས་པའི་མཇུག་ཏུ་འདོན་རྒྱུའི་སྨོན་ལམ།",
    "en": "Aspiration to Be Chanted at the Conclusion of the Recitation"
  },
  "text": [
    {
      "bo": "དང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་ཐུགས་བསྐྱེད་ནས། །",
      "en": "Having first set your mind upon supreme awakening,",
      "en-trans": "dangpo changchub chok tu tukkyé né"
    },
    {
      "bo": "ཐུགས་སྨོན་བཞིན་དུ་སངས་རྒྱས་འགྲོ་བ་འདྲེན། །",
      "en": "You became enlightened, a guide to beings, just as your aspired.",
      "en-trans": "tuk mön zhindu sangye drowa dren"
    },
    {
      "bo": "བླ་མ་རྒྱལ་བ་སྲས་བཅས་གུས་པས་འདུད། །",
      "en": "In devotion, I bow before the gurus, victors and their heirs:",
      "en-trans": "lama gyalwa sé ché güpé dü"
    },
    {
      "bo": "བདག་གིས་སྨོན་ལམ་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, that my own aspirations may be fulfilled.",
      "en-trans": "dak gi mönlam drubpar jingyi lob"
    },
    {
      "bo": "རྣལ་འབྱོར་བདག་ཅག་དཔོན་སློབ་འཁོར་བཅས་ཀྱི། །",
      "en": "Through the virtue that we yogis, the teacher and students,",
      "en-trans": "naljor dakchak pönlob khor ché kyi"
    },
    {
      "bo": "ཁ་ཏོན་མ་ཎི་བཏོན་པའི་དགེ་བ་དང་། །",
      "en": "Have accumulated through our recitation of the Maṇi,1",
      "en-trans": "khatön mani tönpé gewa dang"
    },
    {
      "bo": "གཞན་ཡང་དུས་གསུམ་བསགས་པའི་དགེ་བའི་མཐུས། །",
      "en": "And the force of virtue amassed throughout the three times,",
      "en-trans": "zhenyang dü sum sakpé gewé tü"
    },
    {
      "bo": "དྲིན་ཅན་བླ་མའི་བཞེད་དོན་ཀུན་འགྲུབ་ཤོག །",
      "en": "May all the wishes of the gracious guru be fulfilled.",
      "en-trans": "drinchen lamé zhedön kün drub shok"
    },
    {
      "bo": "ལུས་སྲོག་བསྐྱེད་པའི་དྲིན་ཅན་ཕ་མ་དང་། །",
      "en": "May our kind parents, who gave us life and physical form,",
      "en-trans": "lü sok kyepé drinchen pama dang"
    },
    {
      "bo": "ཆོས་གྲོགས་གྲྭ་སློབ་ཡོན་བདག་དྲིན་ཅན་དང་། །",
      "en": "Our kind dharma friends, monks, students and patrons,",
      "en-trans": "chö drok dra lob yöndak drinchen dang"
    },
    {
      "bo": "ཞོན་བཀལ་བཞོས་པའི་སྒོ་ཟོག་དྲིན་ཅན་ཀུན། །",
      "en": "And all the kind animals we’ve ridden, burdened, and milked",
      "en-trans": "zhön kal zhöpé go zok drinchen kün"
    },
    {
      "bo": "མྱུར་དུ་རྫོགས་པའི་སངས་རྒྱས་ཐོབ་པར་ཤོག །",
      "en": "Swiftly attain complete and perfect enlightenment.",
      "en-trans": "nyurdu dzokpé sangye tobpar shok"
    },
    {
      "bo": "ཤ་ཟོས་སྤུ་དང་པགས་པ་གྱོན་པ་དང་། །",
      "en": "May all the beings whose flesh we’ve eaten and whose hides we’ve worn,",
      "en-trans": "sha zö pu dang pakpa gyönpa dang"
    },
    {
      "bo": "རྡོ་དང་དབྱུག་པས་བརྡུང་དང་མཚོན་གྱིས་བསད། །",
      "en": "Whom we’ve beaten with sticks and stones and killed with weapons,",
      "en-trans": "do dang yukpé dung dang tsön gyi sé"
    },
    {
      "bo": "དུག་དང་མཐུས་བསད་རྐང་པའི་གཅུར་ཚད་ཀྱི། །",
      "en": "Whom we’ve poisoned, forcibly slaughtered, and trampled upon,",
      "en-trans": "duk dang tü sé kangpé chur tsé kyi"
    },
    {
      "bo": "འགྲོ་རྣམས་སངས་རྒྱས་གོ་འཕང་མྱུར་ཐོབ་ཤོག །",
      "en": "Swiftly attain the level of perfect enlightenment.",
      "en-trans": "dro nam sangye gopang nyur tob shok"
    },
    {
      "bo": "གཞན་ཡང་ནམ་མཁའ་ཡངས་པའི་མཐའ་མཉམ་པའི། །",
      "en": "May all sentient beings, my very own mothers,",
      "en-trans": "zhenyang namkha yangpé ta nyampé"
    },
    {
      "bo": "མར་གྱུར་སེམས་ཅན་གཅིག་ཀྱང་མ་ལུས་པ། །",
      "en": "Equal in number to the vastness of space itself,",
      "en-trans": "mar gyur semchen chik kyang malüpa"
    },
    {
      "bo": "ཚོགས་རྫོགས་སྒྲིབ་བྱང་སངས་རྒྱས་ཐོབ་པར་ཤོག །",
      "en": "Complete the accumulations, purify obscurations and attain enlightenment.",
      "en-trans": "tsok dzok drib jang sangye tobpar shok"
    },
    {
      "bo": "སྨོན་ལམ་དེ་དག་མྱུར་དུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May these prayers of aspiration swiftly be fulfilled.",
      "en-trans": "mönlam dedak nyurdu drub gyur chik"
    }
  ]
}