{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/tara-pureland-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གཡུ་ལོ་བཀོད་དུ་སྐྱེ་བའི་སྨོན་ལམ་ཕན་བདེའི་མྱུ་གུ་བཞུགས།",
    "en": "An Aspiration to be Reborn in the Land of Turquoise Leaves"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ཨཱརྱ་ཏཱ་རེ་ཡེ༔",
      "en": "Namo guru ārya tārāyai",
      "en-trans": "namo guru arya tareye"
    },
    {
      "bo": "རང་སྣང་རྣམ་པར་དག་པའི་ཞིང་ཁམས་མཆོག༔",
      "en": "My own perception is the supreme realm of perfect purity,",
      "en-trans": "rang nang nampar dakpé zhing kham chok"
    },
    {
      "bo": "རང་བྱུང་ལྷུན་གྲུབ་གསེར་གྱི་ས་གཞི་བརྡལ༔",
      "en": "Self-arisen and spontaneously perfect, with a vast golden ground,",
      "en-trans": "rangjung lhundrup ser gyi sa zhi dal"
    },
    {
      "bo": "ཡན་ལག་བརྒྱད་ལྡན་ཁྲུས་དང་རྫིང་བུ་འཁྱིལ༔",
      "en": "Bathing waters and pools that possess the eight qualities,",
      "en-trans": "yenlak gyeden trü dang dzingbu khyil"
    },
    {
      "bo": "ཤིང་དང་མེ་ཏོག་འབྲས་བུ་སྣ་ཚོགས་སྨིན༔",
      "en": "Trees, flowers and fruits of many kinds,",
      "en-trans": "shing dang metok drebu natsok min"
    },
    {
      "bo": "བྱ་དང་རི་དྭགས་མང་པོས་ཆོས་སྒྲ་སྒྲོགས༔",
      "en": "Birds and wild animals who proclaim the Dharma,",
      "en-trans": "cha dang ridak mangpö chödra drok"
    },
    {
      "bo": "ཕྱོགས་རྣམས་ཐམས་ཅད་དྲི་བསུང་སྤོས་ངད་ལྡང་༔",
      "en": "The sweetest perfumed incense filling all directions,",
      "en-trans": "chok nam tamché dri sung pö ngé dang"
    },
    {
      "bo": "ལྷ་ཡི་བུ་དང་བུ་མོ་སྣ་ཚོགས་ཀྱིས༔",
      "en": "And divine youths, male and female,",
      "en-trans": "lha yi pu dang pumo natsok kyi"
    },
    {
      "bo": "མཆོད་པ་དུ་མས་རྟག་ཏུ་མཆོད་ཅིང་བསྟོད༔",
      "en": "Who constantly offer gifts and words of praise.",
      "en-trans": "chöpa dumé taktu chö ching tö"
    },
    {
      "bo": "དེ་དབུས་རིན་ཆེན་སྣ་ཚོགས་བཅལ་བཀྲམ་དབུས༔",
      "en": "In the centre, upon a carpet of jewels,",
      "en-trans": "dé ü rinchen natsok chel tram ü"
    },
    {
      "bo": "བཻ་ཌཱུརྱ་ལས་གྲུབ་པའི་གཞལ་ཡས་ཁང་༔",
      "en": "Is an immense mansion of lapis lazuli,",
      "en-trans": "bendurya lé drubpé zhal yé khang"
    },
    {
      "bo": "རང་བྱུང་ཕོ་བྲང་ཉམས་དགའ་ལྟ་ན་སྡུག༔",
      "en": "A spontaneously arisen palace, delightful to behold.",
      "en-trans": "rangjung podrang nyamga ta na duk"
    },
    {
      "bo": "ཕྱི་གསལ་ནང་གསལ་གྲུ་བཞི་སྒོ་བཞི་བ༔",
      "en": "Transparent inside and out, it is square with four main doors,",
      "en-trans": "chi sal nang sal dru zhi go zhiwa"
    },
    {
      "bo": "རྟ་བབས་ཆོས་འཁོར་རྒྱལ་མཚན་གདུགས་དང་ནི༔",
      "en": "And has steps, porticoes, dharma-wheels, banners of victory, parasols,",
      "en-trans": "ta bab chö khor gyaltsen duk dang ni"
    },
    {
      "bo": "རྒྱན་དང་འཁོར་ཡུག་མཚན་ཉིད་རབ་རྫོགས་དབུས༔",
      "en": "Ornaments and all the proper surroundings and features.",
      "en-trans": "gyen dang khoryuk tsen nyi rab dzok ü"
    },
    {
      "bo": "མ་ཆགས་སྐྱོན་བྲལ་པད་ཟླ་རྒྱས་པའི་སྟེང་༔",
      "en": "In its centre, upon a lotus and full moon symbolizing non-attachment and immaculate purity,",
      "en-trans": "ma chak kyön dral pé da gyépé teng"
    },
    {
      "bo": "རྒྱལ་བའི་ཐུགས་རྗེ་ལས་འཁྲུངས་འཕགས་མ་སྒྲོལ༔",
      "en": "Is noble Tārā, born from the victorious buddhas’ compassion.",
      "en-trans": "gyalwé tukjé lé trung pakma drol"
    },
    {
      "bo": "སྔོ་ལྗང་ཞལ་གཅིག་ཕྱག་གཉིས་མྱུར་ཞི་དཔལ༔",
      "en": "She is blue-green, with one face and two hands — swift to act, peaceful and resplendent.",
      "en-trans": "ngo jang zhal chik chak nyi nyur zhi pal"
    },
    {
      "bo": "ལྷང་ངེ་ལྷན་ནེ་ལྷམ་མེར་བཞུགས་པ་ལ༔",
      "en": "In vivid, radiant splendour, she presides.",
      "en-trans": "lhang nge lhen ne lham mer zhuk pa la"
    },
    {
      "bo": "འཁོར་དུ་སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་དང་༔",
      "en": "Surrounding her are buddhas and bodhisattvas,",
      "en-trans": "khor du sangyé chang chub sempa dang"
    },
    {
      "bo": "སྒྲོལ་མ་ཉེར་གཅིག་འབུམ་ཕྲག་མཁའ་འགྲོས་བསྐོར༔",
      "en": "Her twenty-one forms, and hundreds and thousands of ḍākinīs,",
      "en-trans": "drolma nyer chik bum trak khandrö kor"
    },
    {
      "bo": "གསང་སྔགས་ཆོས་སྒྲ་རྒྱུན་ཆད་མེད་པར་སྒྲོགས༔",
      "en": "All proclaiming the Dharma of Secret Mantra without interruption,",
      "en-trans": "sang ngak chö dra gyün ché mepar drok"
    },
    {
      "bo": "ཐུགས་རྗེ་བརྩེ་བ་ཆེན་པོས་དགོངས་ཏེ་རོལ༔",
      "en": "Their wisdom minds filled with great love and compassion.",
      "en-trans": "tukjé tsewa chenpö gong té rol"
    },
    {
      "bo": "བདག་སོགས་འདི་ནས་ཚེ་རབས་ཐམས་ཅད་དུ༔",
      "en": "Throughout this and all our future lives",
      "en-trans": "dak sok di né tsé rab tamché du"
    },
    {
      "bo": "རྗེ་བཙུན་མ་ཁྱོད་ལྷག་པའི་ལྷར་བཟུང་ནས༔",
      "en": "We will hold you, precious Lady, as our special deity",
      "en-trans": "jetsün ma khyö lhakpé lhar zung né"
    },
    {
      "bo": "སྒོ་གསུམ་གཅིག་དྲིལ་དད་པས་གསོལ་བ་འདེབས༔",
      "en": "And with body, speech and mind in unison, devotedly pray:",
      "en-trans": "go sum chik dril dépé solwa dep"
    },
    {
      "bo": "ཕྱི་ན་སོར་བྱང་སྤྱོད་པ་སྐྱོང་ཚུལ་དང་༔",
      "en": "Outwardly maintaining the conduct of individual liberation and the bodhisattvas,",
      "en-trans": "chi na sor chang chöpa kyong tsul dang"
    },
    {
      "bo": "ནང་ན་ཟབ་མོ་རྡོ་རྗེ་ཐེག་པ་ཡི༔",
      "en": "And inwardly manifesting the supreme path of the two stages",
      "en-trans": "nang na zabmo dorje tekpa yi"
    },
    {
      "bo": "མ་ནོར་རིམ་གཉིས་ལམ་མཆོག་མངོན་གྱུར་ནས༔",
      "en": "Of the profound Vajra vehicle, without error,",
      "en-trans": "ma nor rim nyi lam chok ngön gyur né"
    },
    {
      "bo": "མྱུར་དུ་བདུད་བཞིའི་གཡུལ་ལས་རྒྱལ་བར་མཛོད༔",
      "en": "Let us swiftly gain victory in the battle over the four māras.",
      "en-trans": "nyur du dü zhi'i yul lé gyalwar dzö"
    },
    {
      "bo": "སྐྱིད་དམ་སྡུག་གམ་ལེགས་ཉེས་ཅི་བྱུང་ཡང་༔",
      "en": "In happiness or sorrow, whatever befalls us, good or bad,",
      "en-trans": "kyi dam duk gam lek nyé chi jung yang"
    },
    {
      "bo": "རྗེ་བཙུན་སྒྲོལ་མ་ཁྱེད་རང་མཁྱེན་ལགས་པས༔",
      "en": "O precious Tārā, care for us!",
      "en-trans": "jetsün drolma khyerang khyen lakpé"
    },
    {
      "bo": "བདག་རྒྱུད་སྨིན་ཅིང་གྲོལ་བའི་མཐུ་ནུས་སྩོལ༔",
      "en": "Grant us the power and capacity to mature and liberate our own minds!",
      "en-trans": "dak gyü min ching drolwé tu nü tsol"
    },
    {
      "bo": "བླ་མེད་ཐེག་པའི་ལམ་མཆོག་ལ་ཞུགས་ཚེ༔",
      "en": "From the moment we set out upon the supreme path of the unsurpassed vehicle,",
      "en-trans": "lamé tekpé lam chok la zhuk tsé"
    },
    {
      "bo": "ཉམས་རྟོགས་ཡོན་ཏན་གོང་དུ་འཕེལ་བ་དང་༔",
      "en": "Cause our qualities of experience and realization to grow!",
      "en-trans": "nyam tok yönten gong du pelwa dang"
    },
    {
      "bo": "གོལ་འཕྱུག་མེད་པའི་ས་ལམ་མངོན་གྱུར་ནས༔",
      "en": "Help us to attain the paths and stages without going astray!",
      "en-trans": "göl chuk mepé sa lam ngön gyur né"
    },
    {
      "bo": "རང་རིག་འོད་གསལ་ངང་ལས་མི་གཡོ་བར༔",
      "en": "And, without ever wavering from the clear light of our own awareness,",
      "en-trans": "rang rig ösal ngang lé mi yowar"
    },
    {
      "bo": "ཀ་དག་ཀུན་ཏུ་བཟང་པོར་སངས་རྒྱས་ཤོག༔",
      "en": "To attain enlightenment as the primordially pure Samantabhadra!",
      "en-trans": "kadak kuntu zangpor sangyé shok"
    },
    {
      "bo": "མདོར་ན་བདག་དང་མཐའ་ཡས་སེམས་ཅན་ཀུན༔",
      "en": "In short, may I and all other beings, infinite in number,",
      "en-trans": "dor na dak dang tayé semchen kun"
    },
    {
      "bo": "རྗེ་བཙུན་མ་ཁྱོད་ཡིད་ལ་བསམ་པ་ཡིས༔",
      "en": "By thinking of you, O precious Tārā,",
      "en-trans": "jetsün ma khyö yi la sampa yi"
    },
    {
      "bo": "སྐྱེ་བ་གཞན་གྱིས་བར་མ་ཆོད་པ་རུ༔",
      "en": "Be reborn directly, without an intervening birth,",
      "en-trans": "kyewa zhen gyi bar ma chöpa ru"
    },
    {
      "bo": "ཞིང་མཆོག་གཡུ་ལོ་བཀོད་དུ་སྐྱེ་བར་ཤོག༔",
      "en": "In the supreme Land of Turquoise Leaves!",
      "en-trans": "zhing chok yulo kö du kyewar shok"
    },
    {
      "bo": "ཞིང་དེར་སྐྱེས་ནས་ལུང་བསྟན་རབ་ཐོབ་སྟེ༔",
      "en": "And, having taken birth there, receive the prophecy of enlightenment.",
      "en-trans": "zhing der kyé né lungten rab tob té"
    },
    {
      "bo": "གདུལ་དཀའ་འདུལ་ཕྱིར་འཕྲིན་ལས་རྒྱ་མཚོ་ཡིས༔",
      "en": "Then, through vast, ocean-like activity to tame the difficult,",
      "en-trans": "dül ka dül chir trinlé gyatso yi"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་དེ་ལ་དེར་མཐུན་གྱིས༔",
      "en": "May we guide others, each according to their needs,",
      "en-trans": "gang la gang dül dé la der tün gyi"
    },
    {
      "bo": "ཁམས་གསུམ་འཁོར་བ་དོང་སྤྲུག་ནུས་པར་ཤོག༔",
      "en": "And thereby empty the three realms of saṃsāra from their very depths.",
      "en-trans": "kham sum khorwa dong truk nüpar shok"
    },
    {
      "bo": "ཆོས་ཉིད་རྣམ་པར་དག་པའི་བདེན་པ་དང་༔",
      "en": "Through the truth of the utterly pure dharmatā",
      "en-trans": "chönyi nampar dakpé denpa dang"
    },
    {
      "bo": "ཆོས་ཅན་རྒྱུ་འབྲས་བསླུ་མེད་བདེན་པ་ཡིས༔",
      "en": "And the infallible reality of cause and effect,",
      "en-trans": "chöchen gyudré lumé denpa yi"
    },
    {
      "bo": "སྨོན་པའི་དོན་ལ་བར་ཆད་མི་འབྱུང་ཞིང་༔",
      "en": "May there be no obstacle to the fulfilment of this aspiration,",
      "en-trans": "mönpé dön la barché mi jung zhing"
    },
    {
      "bo": "མྱུར་དུ་རེ་འབྲས་ཡོངས་སུ་འགྲུབ་གྱུར་ཅིག༔",
      "en": "And may all our wishes swiftly come to perfect fruition.",
      "en-trans": "nyur du ré dré yong su drub gyur chik"
    },
    {
      "bo": "འདི་ན་རྒྱུན་དུ་བརྩོན་གྱུར་ན༔",
      "en": "By exerting yourself in this continually",
      "en-trans": "di na gyun du tsön gyur na"
    },
    {
      "bo": "ལྷ་མོ་མཆོག་གིས་རྗེས་བཟུང་ནས༔",
      "en": "You will be accepted by the supreme deity,",
      "en-trans": "lhamo chok gi jé zung né"
    },
    {
      "bo": "འཆི་བའི་ལམ་ལ་མི་ལྟོས་པར༔",
      "en": "And, independently of the dying process,",
      "en-trans": "chiwé lam la mi töpar"
    },
    {
      "bo": "འོད་གསལ་དགོངས་པ་མངོན་གྱུར་ནས༔",
      "en": "Manifest the realization of clear light,",
      "en-trans": "ösal gongpa ngön gyur né"
    },
    {
      "bo": "ཆོས་སྐུའི་གཏན་སྲིད་ཟིན་གྱུར་རོ༔",
      "en": "Seizing the stronghold of the dharmakāya.",
      "en-trans": "chökü tensi zin gyur ro"
    }
  ]
}