{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/third-karmapa-rangjung-dorje/mahamudra-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངེས་དོན་ཕྱག་རྒྱ་ཆེན་པོའི་སྨོན་ལམ་གཞུགས་སོ།",
    "en": "Aspiration of the Mahāmudrā of Definitive Meaning"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "བླ་མ་རྣམས་དང་ཡི་དམ་དཀྱིལ་འཁོར་ལྷ། །",
      "en": "All you masters and yidam deities of the various maṇḍalas,",
      "en-trans": "lama nam dang yidam kyilkhor lha"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་རྒྱལ་བ་སྲས་དང་བཅས། །",
      "en": "Buddhas and your bodhisattva heirs throughout the ten directions and three times:",
      "en-trans": "chok chu dü sum gyalwa sé dangché"
    },
    {
      "bo": "བདག་ལ་བརྩེར་དགོངས་བདག་གི་སྨོན་ལམ་རྣམས། །",
      "en": "Turn your loving attention towards me and grant your blessings,",
      "en-trans": "dak la tser gong dak gi mönlam nam"
    },
    {
      "bo": "ཇི་བཞིན་འགྲུབ་པའི་མཐུན་འགྱུར་བྱིན་རླབས་མཛོད། །",
      "en": "So that all may be conducive to the fulfilment of my aspirations.",
      "en-trans": "jizhin drubpé tün gyur jinlab dzö"
    },
    {
      "bo": "བདག་དང་མཐའ་ཡས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །",
      "en": "May streams of virtue, unsullied by the three conceptual spheres,",
      "en-trans": "dak dang tayé semchen tamché kyi"
    },
    {
      "bo": "བསམ་སྦྱོར་རྣམ་དག་གངས་རི་ལས་སྐྱེས་པའི། །",
      "en": "Sprung forth from snowy peaks—my own pure intentions and actions,",
      "en-trans": "samjor namdak gangri lé kyepé"
    },
    {
      "bo": "འཁོར་གསུམ་རྙོག་མེད་དགེ་ཚོགས་ཆུ་རྒྱུན་རྣམས། །",
      "en": "And those of all other sentient beings, who are infinite in number—",
      "en-trans": "khor sum nyokmé gé tsok chugyün nam"
    },
    {
      "bo": "རྒྱལ་བ་སྐུ་བཞིའི་རྒྱ་མཚོར་འཇུག་གྱུར་ཅིག །",
      "en": "All merge into the vast ocean of the buddhas’ four kāyas.",
      "en-trans": "gyalwa ku zhi gyatsor juk gyur chik"
    },
    {
      "bo": "ཇི་སྲིད་དེ་མ་ཐོབ་པ་དེ་སྲིད་དུ། །",
      "en": "Meanwhile, for as long as I have not yet reached that level of attainment,",
      "en-trans": "jisi dé matobpa desi du"
    },
    {
      "bo": "སྐྱེ་དང་སྐྱེ་བ་ཚེ་རབས་ཀུན་ཏུ་ཡང་། །",
      "en": "Throughout the course of my many lives in one rebirth after another,",
      "en-trans": "kyé dang kyewa tserab küntu yang"
    },
    {
      "bo": "སྡིག་དང་སྡུག་བསྔལ་སྒྲ་ཡང་མི་གྲག་ཅིང་། །",
      "en": "May I never so much as hear the words ‘wrongdoing’ or ‘suffering’,",
      "en-trans": "dik dang dukngal dra yang mi drak ching"
    },
    {
      "bo": "བདེ་དགེ་རྒྱ་མཚོའི་དཔལ་ལ་སྤྱོད་པར་ཤོག །",
      "en": "And may I enjoy the splendour of oceanic happiness and virtue.",
      "en-trans": "dé gé gyatsö pal la chöpar shok"
    },
    {
      "bo": "དལ་འབྱོར་མཆོག་ཐོབ་དད་བརྩོན་ཤེས་རབ་ལྡན། །",
      "en": "Having found supreme freedom and advantage, with faith, diligence, and wisdom,",
      "en-trans": "daljor chok tob dé tsön sherab den"
    },
    {
      "bo": "བཤེས་གཉེན་བཟང་བསྟེན་གདམས་པའི་བཅུད་ཐོབ་ནས། །",
      "en": "May I rely upon excellent spiritual friends, receive the elixir of instruction,",
      "en-trans": "shenyen zang ten dampé chü tob né"
    },
    {
      "bo": "ཚུལ་བཞིན་བསྒྲུབ་ལ་བར་ཆད་མ་མཆིས་པར། །",
      "en": "And accomplish it in the proper way without any impediment,",
      "en-trans": "tsulzhin drub la barché machipar"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་དམ་ཆོས་སྤྱོད་པར་ཤོག །",
      "en": "Putting the genuine Dharma into practice throughout all my lives.",
      "en-trans": "tserab küntu damchö chöpar shok"
    },
    {
      "bo": "ལུང་རིག་ཐོས་པས་མི་ཤེས་སྒྲིབ་ལས་གྲོལ། །",
      "en": "Study of scripture and reasoning liberates from the veils of unknowing;",
      "en-trans": "lung rik töpé mi shedrib lé drol"
    },
    {
      "bo": "མན་ངག་བསམ་པས་ཐེ་ཚོམ་མུན་ནག་བཅོམ། །",
      "en": "Contemplating instructions overcomes the dense darkness of doubt;",
      "en-trans": "mengak sampé tetsom münnak chom"
    },
    {
      "bo": "སྒོམ་བྱུང་འོད་ཀྱིས་གནས་ལུགས་ཇི་བཞིན་གསལ། །",
      "en": "And the light arisen from meditation illuminates reality just as it is—",
      "en-trans": "gom jung ö kyi neluk jizhin sal"
    },
    {
      "bo": "ཤེས་རབ་གསུམ་གྱི་སྣང་བ་རྒྱས་པར་ཤོག །",
      "en": "May the radiance of these three forms of wisdom expand and increase.",
      "en-trans": "sherab sum gyi nangwa gyepar shok"
    },
    {
      "bo": "རྟག་ཆད་མཐའ་བྲལ་བདེན་གཉིས་གཞི་ཡི་དོན། །",
      "en": "The ground is the two truths, free from eternalist and nihilistic extremes;",
      "en-trans": "takché tadral den nyi zhi yi dön"
    },
    {
      "bo": "སྒྲོ་སྐུར་མཐའ་བྲལ་ཚོགས་གཉིས་ལམ་མཆོག་གིས། །",
      "en": "The supreme path, twofold accumulation, unlimited by projection and denial,",
      "en-trans": "drokur tadral tsok nyi lam chok gi"
    },
    {
      "bo": "སྲིད་ཞིའི་མཐའ་བྲལ་དོན་གཉིས་འབྲས་ཐོབ་པའི། །",
      "en": "Brings the fruition, twofold benefit, free from the extremes of existence and quiescence—",
      "en-trans": "sizhi tadral dön nyi dré tobpé"
    },
    {
      "bo": "གོལ་འཆུག་མེད་པའི་ཆོས་དང་ཕྲད་པར་ཤོག །",
      "en": "May I encounter this Dharma that is without error or confusion.",
      "en-trans": "gol chuk mepé chö dang trepar shok"
    },
    {
      "bo": "སྦྱང་གཞི་སེམས་ཉིད་གསལ་སྟོང་ཟུང་འཇུག་ལ། །",
      "en": "Upon the basis of purification, mind’s nature of clarity and emptiness in union,",
      "en-trans": "jang zhi semnyi saltong zungjuk la"
    },
    {
      "bo": "སྦྱོང་བྱེད་ཕྱག་ཆེན་རྡོ་རྗེའི་རྣལ་འབྱོར་ཆེས། །",
      "en": "May that which purifies, the great adamantine yoga of Mahāmudrā,",
      "en-trans": "jongjé chakchen dorjé naljor ché"
    },
    {
      "bo": "སྦྱང་བྱ་གློ་བུར་འཁྲུལ་པའི་དྲི་མ་རྣམས། །",
      "en": "Purify its objects, the stains of adventitious delusion,",
      "en-trans": "jangja lobur trulpé drima nam"
    },
    {
      "bo": "སྦྱངས་འབྲས་དྲི་བྲལ་ཆོས་སྐུ་མངོན་འགྱུར་ཤོག །",
      "en": "And, as a result, may I realize the immaculate dharmakāya.",
      "en-trans": "jang dré dridral chöku ngön gyur shok"
    },
    {
      "bo": "གཞི་ལ་སྒྲོ་འདོགས་ཆོད་པ་ལྟ་བའི་གདེངས། །",
      "en": "Eliminating misconceptions of the ground brings assurance in the view;",
      "en-trans": "zhi la drondok chöpa tawé deng"
    },
    {
      "bo": "དེ་ལ་མ་ཡེངས་སྐྱོང་བ་སྒོམ་པའི་གནད། །",
      "en": "To sustain that view without distraction is the key point of meditation;",
      "en-trans": "dé la ma yeng kyongwa gompé né"
    },
    {
      "bo": "སྒོམ་དོན་ཀུན་ལ་རྩལ་སྦྱོང་སྤྱོད་པའི་མཆོག །",
      "en": "And to train in all of meditation’s facets is the supreme form of action—",
      "en-trans": "gom dön kün la tsal jong chöpé chok"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་པའི་གདེང་དང་ལྡན་པར་ཤོག །",
      "en": "May I possess the confident assurance of view, meditation and conduct.",
      "en-trans": "ta gom chöpé deng dang denpar shok"
    },
    {
      "bo": "ཆོས་རྣམས་ཐམས་ཅད་སེམས་ཀྱི་རྣམ་འཕྲུལ་ཏེ། །",
      "en": "All phenomena are but apparitions of the mind;",
      "en-trans": "chö nam tamché sem kyi namtrul té"
    },
    {
      "bo": "སེམས་ནི་སེམས་མེད་སེམས་ཀྱི་ངོ་བོས་སྟོང་། །",
      "en": "Mind itself is without mind, empty of mind’s essence—",
      "en-trans": "sem ni semmé sem kyi ngowö tong"
    },
    {
      "bo": "སྟོང་ཞིང་མ་འགགས་ཅིར་ཡང་སྣང་བ་སྟེ། །",
      "en": "Empty yet unrestricted, appearing in any way at all.",
      "en-trans": "tong zhing magak chiryang nangwa té"
    },
    {
      "bo": "ལེགས་པར་བརྟག་ནས་གཞི་རྩ་ཆོད་པར་ཤོག །",
      "en": "Having examined it well, may I determine the basis.",
      "en-trans": "lekpar tak né zhi tsa chöpar shok"
    },
    {
      "bo": "ཡོད་མ་མྱོང་བའི་རང་སྣང་ཡུལ་དུ་འཁྲུལ། །",
      "en": "I mistake my own perceptions, which have never been real, for objects,",
      "en-trans": "yö manyongwé rangnang yul du trul"
    },
    {
      "bo": "མ་རིག་དབང་གིས་རང་རིག་བདག་ཏུ་འཁྲུལ། །",
      "en": "And through ignorance’s power, confuse my own awareness for a self.",
      "en-trans": "marik wang gi rangrig dak tu trul"
    },
    {
      "bo": "གཉིས་འཛིན་དབང་གིས་སྲིད་པའི་ཀློང་དུ་འཁྱམས། །",
      "en": "Through duality’s force, I roam the arena of saṃsāric existence.",
      "en-trans": "nyidzin wang gi sipé long du khyam"
    },
    {
      "bo": "མ་རིག་འཁྲུལ་པའི་རྩད་བརྡར་ཆོད་པར་ཤོག །",
      "en": "May I thoroughly eradicate ignorance and delusion.",
      "en-trans": "marik trulpé tsé dar chöpar shok"
    },
    {
      "bo": "ཡོད་པ་མ་ཡིན་རྒྱལ་བས་ཀྱང་མ་གཟིགས། །",
      "en": "It is not existent, for even the buddhas have not seen it.",
      "en-trans": "yöpa mayin gyalwé kyang ma zik"
    },
    {
      "bo": "མེད་པ་མ་ཡིན་འཁོར་འདས་ཀུན་གྱི་གཞི། །",
      "en": "It is not nonexistent, for it’s the basis of all saṃsāra and nirvāṇa.",
      "en-trans": "mepa mayin khordé kün gyi zhi"
    },
    {
      "bo": "འགལ་འདུ་མ་ཡིན་ཟུང་འཇུག་དབུ་མའི་ལམ། །",
      "en": "This is not a contradiction; it’s the middle way of unity.",
      "en-trans": "galdu mayin zungjuk umé lam"
    },
    {
      "bo": "མཐའ་བྲལ་སེམས་ཀྱི་ཆོས་ཉིད་རྟོགས་པར་ཤོག །",
      "en": "May I realize mind’s nature, free from limiting extremes.",
      "en-trans": "tadral sem kyi chönyi tokpar shok"
    },
    {
      "bo": "འདི་ཡིན་ཞེས་པ་གང་གིས་མཚོན་པ་མེད། །",
      "en": "There is nothing to point to, saying, “It is this.”",
      "en-trans": "di yin zhepa gang gi tsönpamé"
    },
    {
      "bo": "འདི་མིན་ཞེས་བྱ་གང་གིས་བཀག་པ་མེད། །",
      "en": "Nor can there be denial as in, “This it is not.”",
      "en-trans": "di min zheja gang gi kakpamé"
    },
    {
      "bo": "བློ་ལས་འདས་པའི་ཆོས་ཉིད་འདུས་མ་བྱས། །",
      "en": "Dharmatā, beyond the mind, is uncompounded.",
      "en-trans": "lo lé depé chönyi dümajé"
    },
    {
      "bo": "ཡང་དག་དོན་གྱི་མཐའ་ནི་ངེས་པར་ཤོག །",
      "en": "May I determine the bounds of genuine reality.",
      "en-trans": "yangdak dön gyi ta ni ngepar shok"
    },
    {
      "bo": "འདི་ཉིད་མ་རྟོགས་འཁོར་བའི་རྒྱ་མཚོར་འཁོར། །",
      "en": "Not realizing this, I drift about in saṃsāra’s ocean.",
      "en-trans": "di nyi ma tok khorwé gyatsor khor"
    },
    {
      "bo": "འདི་ཉིད་རྟོགས་ན་སངས་རྒྱས་གཞན་ན་མེད། །",
      "en": "When I do realize it, buddhahood lies nowhere else.",
      "en-trans": "di nyi tok na sangye zhen namé"
    },
    {
      "bo": "ཐམས་ཅད་འདི་ཡིན་འདི་མིན་གང་ཡང་མེད། །",
      "en": "Everything is this; there is nothing else besides.",
      "en-trans": "tamché di yin di min gangyang mé"
    },
    {
      "bo": "ཆོས་ཉིད་ཀུན་གཞིའི་མཚང་ནི་རིག་པར་ཤོག །",
      "en": "May I know the hidden point of the all-ground, dharmatā.",
      "en-trans": "chönyi künzhi tsang ni rigpar shok"
    },
    {
      "bo": "སྣང་ཡང་སེམས་ལ་སྟོང་ཡང་སེམས་ཡིན་ཏེ། །",
      "en": "Appearances are mind; emptiness is also the mind.",
      "en-trans": "nang yang sem la tong yang sem yin té"
    },
    {
      "bo": "རྟོགས་ཀྱང་སེམས་ལ་འཁྲུལ་ཡང་རང་གི་སེམས། །",
      "en": "Realization is mind; delusion too is one’s own mind.",
      "en-trans": "tok kyang sem la trul yang rang gi sem"
    },
    {
      "bo": "སྐྱེས་ཀྱང་སེམས་ལ་འགགས་ཀྱང་སེམས་ཡིན་པས། །",
      "en": "What’s arisen is mind; what’s ceased is also mind.",
      "en-trans": "kyé kyang sem la gak kyang sem yinpé"
    },
    {
      "bo": "སྒྲོ་འདོགས་ཐམས་ཅད་སེམས་ལ་ཆོད་པར་ཤོག །",
      "en": "May I eliminate all misconceptions within the mind.",
      "en-trans": "drondok tamché sem la chöpar shok"
    },
    {
      "bo": "བློས་བྱས་རྩོལ་བའི་སྒོམ་གྱིས་མ་བསླད་ཅིང་། །",
      "en": "Unspoilt by deliberate, mind-fabricated meditation,",
      "en-trans": "löjé tsolwé gom gyi ma lé ching"
    },
    {
      "bo": "ཐ་མལ་འདུ་འཛིའི་རླུང་གིས་མ་བསྐྱོད་པར། །",
      "en": "And unswayed by the winds of ordinary preoccupation,",
      "en-trans": "tamal dudzi lung gi makyöpar"
    },
    {
      "bo": "མ་བཅོས་གཉུག་མ་རང་བབ་འཇོག་ཤེས་པའི། །",
      "en": "May I learn how to settle naturally without contrivance,",
      "en-trans": "machö nyukma rangbab jok shepé"
    },
    {
      "bo": "སེམས་དོན་ཉམས་ལེན་མཁས་ཤིང་སྐྱོང་བར་ཤོག །",
      "en": "And skilfully sustain the practice of mind’s ultimate point.",
      "en-trans": "sem dön nyamlen khé shing kyongwar shok"
    },
    {
      "bo": "ཕྲ་རག་རྟོག་པའི་དབའ་རླབས་རང་སར་ཞི། །",
      "en": "With waves of coarse and subtle thought naturally calmed,",
      "en-trans": "tra rak tokpé walab rang sar zhi"
    },
    {
      "bo": "གཡོ་མེད་སེམས་ཀྱི་ཆུ་བོ་ངང་གིས་གནས། །",
      "en": "And the river of mind unmoving, spontaneously stilled;",
      "en-trans": "yomé sem kyi chuwo ngang gi né"
    },
    {
      "bo": "བྱིང་རྨུགས་རྙོག་པའི་དྲི་མ་དང་བྲལ་བའི། །",
      "en": "Uncontaminated by the taints of lethargy and dullness,",
      "en-trans": "jing muk nyokpé drima dang dralwé"
    },
    {
      "bo": "ཞི་གནས་རྒྱ་མཚོ་མི་གཡོ་བརྟན་པར་ཤོག །",
      "en": "May the ocean of śamatha remain steadfastly inert.",
      "en-trans": "zhiné gyatso mi yo tenpar shok"
    },
    {
      "bo": "བལྟར་མེད་སེམས་ལ་ཡང་ཡང་བལྟས་པའི་ཚེ། །",
      "en": "When looking repeatedly at unobservable mind,",
      "en-trans": "tarmé sem la yangyang tepé tsé"
    },
    {
      "bo": "མཐོང་མེད་དོན་ནི་ཇི་བཞིན་ལྷག་གེར་མཐོང་། །",
      "en": "The point of non-seeing is vividly seen, just as it is.",
      "en-trans": "tongmé dön ni jizhin lhak ger tong"
    },
    {
      "bo": "ཡིན་མིན་དོན་ལ་ཐེ་ཚོམ་ཆོད་པ་ཉིད། །",
      "en": "And indecision—is it? or is it not?—is cut right through.",
      "en-trans": "yin min dön la tetsom chöpa nyi"
    },
    {
      "bo": "འཁྲུལ་མེད་རང་ངོ་རང་གིས་ཤེས་པར་ཤོག །",
      "en": "May I recognize my very own nature, without delusion.",
      "en-trans": "trulmé rang ngo rang gi shepar shok"
    },
    {
      "bo": "ཡུལ་ལ་བལྟས་པས་ཡུལ་མེད་སེམས་སུ་མཐོང་། །",
      "en": "Looking at objects, I see them as objectless mind;",
      "en-trans": "yul la tepé yulmé sem su tong"
    },
    {
      "bo": "སེམས་ལ་བལྟས་པས་སེམས་མེད་ངོ་བོས་སྟོང་། །",
      "en": "Looking at mind, mind is absent, empty of essence;",
      "en-trans": "sem la tepé semmé ngowö tong"
    },
    {
      "bo": "གཉིས་ལ་བལྟས་པས་གཉིས་འཛིན་རང་སར་གྲོལ། །",
      "en": "Looking at both, duality is liberated there and then—",
      "en-trans": "nyi la tepé nyidzin rang sar drol"
    },
    {
      "bo": "འོད་གསལ་སེམས་ཀྱི་གནས་ལུགས་རྟོགས་པར་ཤོག །",
      "en": "May I realize mind’s true nature, which is clear light.",
      "en-trans": "ösal sem kyi neluk tokpar shok"
    },
    {
      "bo": "ཡིད་བྱེད་བྲལ་བ་འདི་ནི་ཕྱག་རྒྱ་ཆེ། །",
      "en": "This absence of mental engagement is Mahāmudrā.",
      "en-trans": "yi jé dralwa di ni chakgya ché"
    },
    {
      "bo": "མཐའ་དང་བྲལ་བ་དབུ་མ་ཆེན་པོ་ཡིན། །",
      "en": "The freedom from extremes is the great Middle Way.",
      "en-trans": "ta dang dralwa uma chenpo yin"
    },
    {
      "bo": "འདི་ནི་ཀུན་འདུས་རྫོགས་ཆེན་ཞེས་ཀྱང་བྱ། །",
      "en": "Since all is here included, it is also Great Perfection.",
      "en-trans": "di ni kündü dzogchen zhé kyangja"
    },
    {
      "bo": "གཅིག་ཤེས་ཀུན་དོན་རྟོགས་པའི་གདེང་ཐོབ་ཤོག །",
      "en": "May I acquire the confidence of knowing one and realizing all.",
      "en-trans": "chik shé kün dön tokpé deng tob shok"
    },
    {
      "bo": "ཞེན་པ་མེད་པའི་བདེ་ཆེན་རྒྱུན་ཆད་མེད། །",
      "en": "Great bliss without attachment continues uninterruptedly;",
      "en-trans": "zhenpa mepé dechen gyünché mé"
    },
    {
      "bo": "མཚན་འཛིན་མེད་པའི་འོད་གསལ་སྒྲིབ་གཡོགས་བྲལ། །",
      "en": "Clear light without conceptual identification is unobscured;",
      "en-trans": "tsen dzin mepé ösal drib yokdral"
    },
    {
      "bo": "བློ་ལས་འདས་པའི་མི་རྟོག་ལྷུན་གྱིས་གྲུབ། །",
      "en": "Non-conceptuality beyond the mind is spontaneously present—",
      "en-trans": "lo lé depé mi tok lhün gyi drub"
    },
    {
      "bo": "རྩོལ་མེད་ཉམས་མྱོང་རྒྱུན་ཆད་མེད་པར་ཤོག །",
      "en": "May effortless experience emerge in a never-ending flow.",
      "en-trans": "tsolmé nyamnyong gyünché mepar shok"
    },
    {
      "bo": "བཟང་ཞེན་ཉམས་ཀྱི་འཛིན་པ་རང་སར་གྲོལ། །",
      "en": "Attachment to positive experience is liberated of its own accord;",
      "en-trans": "zang zhen nyam kyi dzinpa rang sar drol"
    },
    {
      "bo": "ངན་རྟོག་འཁྲུལ་པ་རང་བཞིན་དབྱིངས་སུ་དག །",
      "en": "Negative thinking and delusion are purified within the natural expanse;",
      "en-trans": "ngen tok trulpa rangzhin ying su dak"
    },
    {
      "bo": "ཐ་མལ་ཤེས་པ་སྤང་བླང་བྲལ་ཐོབ་མེད། །",
      "en": "And ordinary awareness is neither shunned nor sought, neither lost nor gained—",
      "en-trans": "tamal shepa panglang dral tobmé"
    },
    {
      "bo": "སྤྲོས་བྲལ་ཆོས་ཉིད་བདེན་པ་རྟོགས་པར་ཤོག །",
      "en": "May I realize the truth of dharmatā that is beyond conceptual elaboration.",
      "en-trans": "trödral chönyi denpa tokpar shok"
    },
    {
      "bo": "འགྲོ་བའི་རང་བཞིན་རྟག་ཏུ་སངས་རྒྱས་ཀྱང་། །",
      "en": "Although beings’ true nature has always been awakened,",
      "en-trans": "drowé rangzhin taktu sangye kyang"
    },
    {
      "bo": "མ་རྟོགས་དབང་གིས་མཐའ་མེད་འཁོར་བར་འཁྱམས། །",
      "en": "In their non-recognition, they wander in saṃsāra without end.",
      "en-trans": "ma tok wang gi tamé khorwar khyam"
    },
    {
      "bo": "སྡུག་བསྔལ་མུ་མཐའ་མེད་པའི་སེམས་ཅན་ལ། །",
      "en": "For these sentient beings whose misery knows no bounds,",
      "en-trans": "dukngal muta mepé semchen la"
    },
    {
      "bo": "བཟོད་མེད་སྙིང་རྗེ་རྒྱུད་ལ་སྐྱེ་བར་ཤོག །",
      "en": "May I develop a compassion that is unbearably intense.",
      "en-trans": "zömé nyingjé gyü la kyewar shok"
    },
    {
      "bo": "བཟོད་མེད་སྙིང་རྗེའི་རྩལ་ཡང་མ་འགགས་པའི། །",
      "en": "The strength of unbearable compassion is unrestricted,",
      "en-trans": "zömé nyingjé tsal yang magakpé"
    },
    {
      "bo": "བརྩེ་དུས་ངོ་བོ་སྟོང་དོན་རྗེན་པར་ཤར། །",
      "en": "And in this love, the reality of the empty essence laid bare.",
      "en-trans": "tsé dü ngowo tong dön jenpar shar"
    },
    {
      "bo": "ཟུང་འཇུག་གོལ་ས་བྲལ་བའི་ལམ་མཆོག་འདི། །",
      "en": "May I constantly cultivate this supreme, unerring path of unity",
      "en-trans": "zungjuk golsa dralwé lam chok di"
    },
    {
      "bo": "འབྲལ་མེད་ཉིན་མཚན་ཀུན་ཏུ་སྒོམ་པར་ཤོག །",
      "en": "And may I never be apart from it, by day or by night.",
      "en-trans": "dralmé nyintsen küntu gompar shok"
    },
    {
      "bo": "སྒོམ་སྟོབས་ལས་བྱུང་སྤྱན་དང་མངོན་ཤེས་དང་། །",
      "en": "With sight and heightened perception born of meditation,",
      "en-trans": "gom tob lé jung chen dang ngönshé dang"
    },
    {
      "bo": "སེམས་ཅན་སྨིན་བྱས་སངས་རྒྱས་ཞིང་རབ་སྦྱངས། །",
      "en": "May I bring beings to maturity, fully purify buddha realms,",
      "en-trans": "semchen min jé sangye zhing rab jang"
    },
    {
      "bo": "སངས་རྒྱས་ཆོས་རྣམས་འགྲུབ་པའི་སྨོན་ལམ་རྫོགས། །",
      "en": "And fulfil the aspirations to accomplish a buddha’s qualities—",
      "en-trans": "sangye chö nam drubpé mönlam dzok"
    },
    {
      "bo": "རྫོགས་སྨིན་སྦྱངས་གསུམ་མཐར་ཕྱིན་སངས་རྒྱས་ཤོག །",
      "en": "Thus may I awaken, with perfecting, maturing and purifying all complete.",
      "en-trans": "dzok min jang sum tarchin sangye shok"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་རྒྱལ་བ་སྲས་བཅས་ཐུགས་རྗེ་དང་། །",
      "en": "Through the compassion of the buddhas and their heirs in every direction,",
      "en-trans": "chok chü gyalwa sé ché tukjé dang"
    },
    {
      "bo": "རྣམ་དཀར་དགེ་བ་ཇི་སྙེད་ཡོད་པའི་མཐུས། །",
      "en": "And the power of whatever wholesome virtue there might be,",
      "en-trans": "namkar gewa jinyé yöpé tü"
    },
    {
      "bo": "དེ་ལྟར་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །",
      "en": "May my own and all other beings’ purest aspirations",
      "en-trans": "detar dak dang semchen tamché kyi"
    },
    {
      "bo": "སྨོན་ལམ་རྣམ་དག་ཇི་བཞིན་འགྲུབ་གྱུར་ཅིག །",
      "en": "Be fulfilled, exactly in accordance with our wishes.",
      "en-trans": "mönlam namdak jizhin drub gyur chik"
    }
  ]
}