{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/patrul-rinpoche/aspiration-generate-bodhichitta",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྣམ་དག་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་བསྐྱེད་པའི་སྨོན་ལམ།",
    "en": "Aspiration to Generate Bodhicitta, Utterly Pure and Supreme"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "བསྐལ་མང་གོང་ནས་གཡོ་སྒྱུ་སྤངས་པའི་ཐུགས། །",
      "en": "Your mind, many aeons ago, rid itself of all deceit,",
      "en-trans": "kal mang gong né yogyu pangpé tuk"
    },
    {
      "bo": "བཅོས་མའི་ཚུལ་སྤངས་དྲང་ཞིང་བདེན་པའི་གསུང༌། །",
      "en": "Your speech, honest and true, is free of any form of artifice,",
      "en-trans": "chömé tsul pang drang zhing denpé sung"
    },
    {
      "bo": "ཚུལ་འཆོས་མི་མངའ་ཚུལ་དང་མཐུན་པའི་སྐུ། །",
      "en": "Your body's acts are disciplined and unpretentious—",
      "en-trans": "tsul chö mi nga tsul dang tünpé ku"
    },
    {
      "bo": "ཐུབ་པ་དྲང་སྲོང་ཆེན་པོ་ལ་ཕྱག་འཚལ། །",
      "en": "Great sage, genuine and wise, to you I prostrate!",
      "en-trans": "tubpa drangsong chenpo la chaktsal"
    },
    {
      "bo": "ཐུབ་པ་དེ་སྲས་བདེན་པའི་དོན་གཟིགས་པའི། །",
      "en": "Buddha's heirs, who have seen the ultimate meaning,",
      "en-trans": "tubpa dé sé denpé dön zikpé"
    },
    {
      "bo": "བདེན་གསུང་མངའ་བ་བདེན་ཚིག་གྲུབ་པའི་ཚོགས། །",
      "en": "Speakers of truth, whose words have prophetic power,",
      "en-trans": "den sung ngawa dentsik drubpé tsok"
    },
    {
      "bo": "ཐེག་པ་གསུམ་གྱི་ཐར་པའི་ལམ་ཞུགས་པ། །",
      "en": "Those on the way to liberation through the three vehicles—",
      "en-trans": "tekpa sum gyi tarpé lam zhukpa"
    },
    {
      "bo": "དེ་དག་ཀུན་ལ་གུས་པས་ཕྱག་འཚལ་ལོ། །",
      "en": "Before you all, in devotion, I bow down!",
      "en-trans": "dedak kün la güpé chaktsal lo"
    },
    {
      "bo": "བདག་ནི་དེང་ནས་སྐྱེ་དང་ཚེ་རབས་སུ། །",
      "en": "From now on, in all future rebirths, throughout my lives,",
      "en-trans": "dak ni deng né kyé dang tserab su"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་བཅས་ཁྱེད་དང་མི་འབྲལ་ཞིང༌། །",
      "en": "Buddhas and bodhisattvas, may I never part from you!",
      "en-trans": "gyalwa sé ché khyé dang mindral zhing"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་བཅས་ཁྱེད་ཀྱིས་རྗེས་བཟུང་ནས། །",
      "en": "Buddhas and bodhisattvas, please accept me as your follower!",
      "en-trans": "gyalwa sé ché khyé kyi jezung né"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་བཅས་ཁྱེད་བཞིན་འགྲུབ་པར་ཤོག །",
      "en": "Buddhas and bodhisattvas, let me gain accomplishment just like you!",
      "en-trans": "gyalwa sé ché khyé zhin drubpar shok"
    },
    {
      "bo": "ལུས་སྤྱོད་ཚུལ་འཆོས་མེད་པར་དུལ་བ་དང༌། །",
      "en": "My body's actions—may they be disciplined and unpretentious,",
      "en-trans": "lü chö tsul chö mepar dulwa dang"
    },
    {
      "bo": "ངག་ཚིག་རྫུན་གཏམ་མེད་པར་བདེན་པ་དང༌། །",
      "en": "My speech—may it be honest, without falsity or deception,",
      "en-trans": "ngak tsik dzün tam mepar denpa dang"
    },
    {
      "bo": "སེམས་སྤྱོད་གཡོ་སྒྱུ་མེད་པར་དྲང་བ་ཡིས། །",
      "en": "My mind—may it be genuine, without artifice or deceit,",
      "en-trans": "sem chö yogyu mepar drangwa yi"
    },
    {
      "bo": "ཆོས་མཐུན་གྲོགས་དང་བཤེས་གཉེན་བསྟེན་པར་ཤོག །",
      "en": "And may I rely upon spiritual guides and true Dharma friends!",
      "en-trans": "chö tün drok dang shenyen tenpar shok"
    },
    {
      "bo": "ཐར་པའི་ལམ་ལ་དང་པོ་འཇུག་པའི་སྒོ། །",
      "en": "The first entrance to the path of liberation,",
      "en-trans": "tarpé lam la dangpo jukpé go"
    },
    {
      "bo": "འཁོར་བའི་གནས་ནས་དང་པོ་བྲོས་པའི་ལམ། །",
      "en": "The first route of escape from saṃsāra's perils,",
      "en-trans": "khorwé né né dangpo dröpé lam"
    },
    {
      "bo": "ཉམས་ལེན་ཆོས་རྣམས་ཀུན་གྱི་དང་པོའི་འགོ །",
      "en": "The first preliminary to all practices of Dharma:",
      "en-trans": "nyamlen chö nam kün gyi dangpö go"
    },
    {
      "bo": "བཅོས་མིན་ངེས་འབྱུང་རྒྱུད་ལ་སྐྱེ་བར་ཤོག །",
      "en": "Genuine renunciation—may it dawn within my mind!",
      "en-trans": "chömin ngejung gyü la kyewar shok"
    },
    {
      "bo": "ཡོད་ན་སངས་རྒྱས་སྒྲུབ་ལ་དེས་ཆོག་ཅིང༌། །",
      "en": "With it, I have all that's needed to attain enlightenment,",
      "en-trans": "yö na sangye drub la dé chok ching"
    },
    {
      "bo": "མེད་ན་སངས་རྒྱས་སྒྲུབ་ལ་ཐབས་ཆག་པ། །",
      "en": "And without it, there's no way to find awakening,",
      "en-trans": "mé na sangye drub la tab chakpa"
    },
    {
      "bo": "སངས་རྒྱས་སྒྲུབ་པའི་ས་བོན་མ་ནོར་བ། །",
      "en": "The indisputable seed from which buddhahood is gained,",
      "en-trans": "sangye drubpé sabön ma norwa"
    },
    {
      "bo": "རྣམ་དག་བྱང་ཆུབ་སེམས་མཆོག་བསྐྱེད་པར་ཤོག །",
      "en": "May I generate bodhicitta, utterly pure and supreme!",
      "en-trans": "namdak changchub sem chok kyepar shok"
    },
    {
      "bo": "གོང་ནས་གོང་དུ་བྱང་ཆུབ་སེམས་མཆོག་འཕེལ། །",
      "en": "Further and further, may supreme bodhicitta develop,",
      "en-trans": "gong né gong du changchub sem chok pel"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་བྱང་ཆུབ་སེམས་མི་བརྗེད། །",
      "en": "Throughout my lives, may bodhicitta never be forgotten,",
      "en-trans": "tserab küntu changchub sem mi jé"
    },
    {
      "bo": "ཡང་དང་ཡང་དུ་བྱང་ཆུབ་སེམས་བསྒོམས་ནས། །",
      "en": "Again and again, may I meditate on bodhicitta,",
      "en-trans": "yang dang yang du changchub sem gom né"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལ་འཇུག་པར་ཤོག །",
      "en": "And always train in the way of the bodhisattva!",
      "en-trans": "changchub sempé chö la jukpar shok"
    },
    {
      "bo": "ཐུབ་པ་མཆོག་དང་འཇམ་དཔལ་དཔའ་བོ་དང༌། །",
      "en": "Whatever the enlightened actions of the great Sage,",
      "en-trans": "tubpa chok dang jampal pawo dang"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་གང་ཡིན་པ། །",
      "en": "Heroic Mañjuśrī, or Samantabhadra,",
      "en-trans": "kuntuzangpö chöpa gang yinpa"
    },
    {
      "bo": "བདག་གི་ཚེ་རབས་སྤྱོད་ཀུན་དེ་འདྲ་བར། །",
      "en": "In all my lives, may my own actions be equal to theirs,",
      "en-trans": "dak gi tserab chö kün dedrawar"
    },
    {
      "bo": "གྱུར་ནས་དོན་གཉིས་སྤྱོད་པ་ལྷུན་གྲུབ་ཤོག །",
      "en": "And spontaneously may I accomplish my own and others' welfare!",
      "en-trans": "gyur né dön nyi chöpa lhündrub shok"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་སྒྲུབ་པའི་ལམ་བཟང་ཅན། །",
      "en": "Excellent path, which brings about buddhahood in but a single lifetime,",
      "en-trans": "tsé chik sangye drubpé lamzang chen"
    },
    {
      "bo": "དུས་གཅིག་དོན་གཉིས་སྒྲུབ་པའི་ཐབས་མཁས་པོ། །",
      "en": "With skilful methods to benefit oneself and others at one and the same time,",
      "en-trans": "dü chik dön nyi drubpé tab khé po"
    },
    {
      "bo": "ཚུལ་གཅིག་འཁོར་འདས་དབྱེར་མེད་ལྟ་བ་ཡིས། །",
      "en": "And the view of a single reality in which saṃsāra and nirvāṇa are inseparable—",
      "en-trans": "tsul chik khordé yermé tawa yi"
    },
    {
      "bo": "ལམ་གཅིག་རྡོ་རྗེ་ཐེག་པར་འཇུག་པར་ཤོག །",
      "en": "May I embark upon this unique path of the vajra vehicle!",
      "en-trans": "lam chik dorjé tekpar jukpar shok"
    },
    {
      "bo": "ལམ་འདིའི་ལམ་སྒོམ་རྡོ་རྗེ་འཛིན་པའི་ཚོགས། །",
      "en": "Hosts of vajra holders, who cultivate the approach of this path,",
      "en-trans": "lam di lam gom dorjé dzinpé tsok"
    },
    {
      "bo": "ཀུན་ལ་བདེ་སྟོང་བསྐྱེད་པའི་གྲོགས་བགྱིད་ཅིང༌། །",
      "en": "Taking as partners those who bring about blissful emptiness,",
      "en-trans": "kün la detong kyepé drok gyi ching"
    },
    {
      "bo": "ལྷན་ཅིག་སྐྱེས་པ་མཚོན་པའི་སྒོར་གྱུར་པའི། །",
      "en": "As a way for co-emergent wisdom to be introduced—",
      "en-trans": "lhenchik kyepa tsönpé gor gyurpé"
    },
    {
      "bo": "ལམ་གཅིག་མཁའ་འགྲོའི་གླིང་དུ་རོལ་བར་ཤོག །",
      "en": "May this unique path be enjoyed in the realm of the ḍākinīs!",
      "en-trans": "lam chik khandrö ling du rolwar shok"
    },
    {
      "bo": "བཅོས་མ་སྤངས་པའི་སེམས་ཉིད་གཉུག་མའི་ཞལ། །",
      "en": "The face of my original nature, mind itself, left unaltered,",
      "en-trans": "chöma pangpé semnyi nyukmé zhal"
    },
    {
      "bo": "བཅོས་མ་མིན་པར་རང་ངོ་རྗེན་པར་མཐོང་། །",
      "en": "My very own essence, beyond contrivance—may I see it laid bare!",
      "en-trans": "chöma minpar rang ngo jenpar tong"
    },
    {
      "bo": "བཅོས་སླད་བྲལ་བའི་མཉམ་བཞག་རྒྱུན་བསྐྱངས་ཏེ། །",
      "en": "Sustaining meditation untainted by any trace of alteration,",
      "en-trans": "chö lé dralwé nyamzhak gyün kyang té"
    },
    {
      "bo": "བཅོས་མེད་དོན་གྱི་འབྲས་བུ་ཐོབ་པར་ཤོག །",
      "en": "May I gain the ultimate fruition free from any fabrication!",
      "en-trans": "chömé dön gyi drebu tobpar shok"
    },
    {
      "bo": "གནས་སྐབས་སུ་ཡང་བསམ་པའི་དོན་ཀུན་འགྲུབ། །",
      "en": "In the meantime, may all my wishes be fulfilled!",
      "en-trans": "nekab su yang sampé dön kün drub"
    },
    {
      "bo": "གསོན་པའི་ཚེ་ན་བསམ་པ་ངན་པ་མེད། །",
      "en": "For as long as I live, may I have no negative intentions,",
      "en-trans": "sönpé tsé na sampa ngenpa mé"
    },
    {
      "bo": "འཆི་བའི་ཚེ་ན་གནད་གཅོད་སྡུག་བསྔལ་མེད། །",
      "en": "And when I die, may I not suffer a painful death,",
      "en-trans": "chiwé tsé na né chö dukngal mé"
    },
    {
      "bo": "ཤི་ནས་འཁྲུལ་སྣང་འཇིགས་སྐྲག་མེད་པར་ཤོག །",
      "en": "Having died, may there be no fear of delusory appearances!",
      "en-trans": "shi né trulnang jiktrak mepar shok"
    },
    {
      "bo": "བདག་མཐོང་ཐོས་དང་དྲན་རེག་འགྲོ་བ་ཀུན། །",
      "en": "May all who see me, hear me, think of me, or come in contact with me in any way,",
      "en-trans": "dak tong tö dang dren rek drowa kün"
    },
    {
      "bo": "ངེས་འབྱུང་བྱང་ཆུབ་སེམས་དང་ལྷན་ཅིག་སྐྱེས། །",
      "en": "Develop renunciation, bodhicitta, and co-emergent wisdom",
      "en-trans": "ngejung changchub sem dang lhenchik kyé"
    },
    {
      "bo": "ཇི་ལྟར་རིགས་པ་ཇི་བཞིན་རྒྱུད་སྐྱེས་ནས། །",
      "en": "In whichever way is appropriate within their minds,",
      "en-trans": "jitar rigpa jizhin gyü kyé né"
    },
    {
      "bo": "མྱུར་དུ་རྫོགས་པའི་སངས་རྒྱས་ཐོབ་པར་ཤོག །",
      "en": "So that, swiftly, they may arrive at perfect buddhahood!",
      "en-trans": "nyurdu dzokpé sangye tobpar shok"
    },
    {
      "bo": "སངས་རྒྱས་ཉི་མ་མཚན་དཔེའི་ཞལ་མཐོང་ཞིང༌། །",
      "en": "May I behold the sun-like Buddha with his signs and marks,",
      "en-trans": "sangye nyima tsenpé zhal tong zhing"
    },
    {
      "bo": "དམ་ཆོས་ཉི་མ་སྙིང་གི་བདུད་རྩིར་སྤྱོད། །",
      "en": "May I savour the nectar of the sun-like Dharma in my heart,",
      "en-trans": "damchö nyima nying gi dütsir chö"
    },
    {
      "bo": "དགེ་འདུན་ཉི་མ་ཐར་པའི་གྲོགས་གྱུར་ནས། །",
      "en": "And may the sun-like Saṅgha accompany me to liberation—",
      "en-trans": "gendün nyima tarpé drok gyur né"
    },
    {
      "bo": "མཆོག་གསུམ་ཉི་མའི་འོད་དང་མི་འབྲལ་ཤོག །",
      "en": "From the light of these three sun-like Supreme Ones, may I never part!1",
      "en-trans": "chok sum nyimé ö dang mindral shok"
    }
  ]
}