{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/aspiration-for-jamyang-tsultrim",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ས་སྐྱ་རྩེ་གདོང་གྲྭ་འཇམ་དབྱངས་ཚུལ་ཁྲིམས་ཀྱིས་སྐུལ་ངོར་བྲིས་པའི་སྨོན་ལམ།",
    "en": "Aspiration Written for Jamyang Tsultrim of Sakya Tsedong1"
  },
  "text": [
    {
      "bo": "ཕྱོགས་དུས་རྒྱལ་བ་སྲས་བཅས་ཐུགས་རྗེ་དང་། །",
      "en": "Through the compassion of the victorious ones and their heirs throughout the whole of space and time,",
      "en-trans": "chok dü gyalwa sé ché tukjé dang"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་ཆོས་སྐྱོང་ནོར་ལྷ་ཡིས། །",
      "en": "And through the gurus, yidams, Dharma protectors, and wealth deities,",
      "en-trans": "lama yidam chökyong norlha yi"
    },
    {
      "bo": "བདག་གི་ཆོས་དང་མཐུན་པའི་བསམ་སྦྱོར་ཀུན། །",
      "en": "May all my thoughts and actions that accord with the Dharma",
      "en-trans": "dak gi chö dang tünpé samjor kün"
    },
    {
      "bo": "གེགས་མེད་ཡིད་བཞིན་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Be accomplished without hindrance, just as I wish.",
      "en-trans": "gekmé yizhin drubpar jingyi lob"
    },
    {
      "bo": "ངེས་འབྱུང་ཚུལ་ཁྲིམས་གཞི་རྩ་རབ་ཏུ་བརྟན། །",
      "en": "With a steadfast foundation of renunciation and discipline,",
      "en-trans": "ngejung tsultrim zhitsa rabtu ten"
    },
    {
      "bo": "གཞན་ཕན་བྱམས་དང་སྙིང་རྗེ་བྱམས་སེམས་དང་། །",
      "en": "And altruistic love, compassion, and benevolence,",
      "en-trans": "zhenpen jam dang nyingjé jam sem dang"
    },
    {
      "bo": "བླ་མར་མོས་གུས་རི་རྒྱལ་ལྟར་བརྟན་པས། །",
      "en": "And devotion to the guru as stable as the king of mountains,",
      "en-trans": "lamar mögü rigyal tar tenpé"
    },
    {
      "bo": "སྡོམ་དང་དམ་ཚིག་རྣམ་པར་དག་པར་ཤོག །",
      "en": "May I keep my vows and pledges perfectly pure.",
      "en-trans": "dom dang damtsik nampar dakpar shok"
    },
    {
      "bo": "ཇི་ལྟར་སྣང་བ་འདི་དག་རང་གི་སེམས། །",
      "en": "However these appearances arise, they are my own mind.",
      "en-trans": "jitar nangwa didak rang gi sem"
    },
    {
      "bo": "རང་སེམས་གདོད་ནས་སྐྱེ་འགག་གནས་གསུམ་བྲལ། །",
      "en": "My mind has always been free from arising, ceasing, and remaining.",
      "en-trans": "rangsem döné kyegak né sum dral"
    },
    {
      "bo": "གསལ་རིག་སྟོང་གསུམ་དབྱེར་མེད་གནས་ལུགས་གཤིས། །",
      "en": "Its fundamental nature is clarity, awareness, and emptiness inseparable.",
      "en-trans": "salrik tongsum yermé neluk shi"
    },
    {
      "bo": "བརྗོད་བྲལ་ལྟ་བ་མངོན་དུ་བྱེད་པར་ཤོག །",
      "en": "May I actualize the view that is beyond expression.",
      "en-trans": "jödral tawa ngön du jepar shok"
    },
    {
      "bo": "ཟབ་མོ་བསྐྱེད་དང་རྫོགས་པའི་རིམ་པ་ཡི། །",
      "en": "Through exerting myself in the profound yogas of the four empowerments",
      "en-trans": "zabmo kyé dang dzokpé rimpa yi"
    },
    {
      "bo": "དབང་བཞིའི་རྣལ་འབྱོར་ཟབ་མོར་བརྩོན་པ་ལས། །",
      "en": "Of the profound generation and completion stages,",
      "en-trans": "wang zhi naljor zabmor tsönpa lé"
    },
    {
      "bo": "སྒྲིབ་དག་སྐུ་བཞི་ཡེ་ཤེས་མངོན་དུ་གྱུར། །",
      "en": "May obscurations be purified and the wisdom of the four kāyas actualized,",
      "en-trans": "drib dak ku zhi yeshe ngön du gyur"
    },
    {
      "bo": "འབྲས་བུ་རྒྱལ་པོའི་བཙན་ས་ཟིན་པར་ཤོག །",
      "en": "And may I capture the sovereign stronghold of the fruition.",
      "en-trans": "drebu gyalpö tsensa zinpar shok"
    },
    {
      "bo": "མདོར་ན་མཉམ་རྗེས་ཀུན་ཏུ་ཐ་མལ་གྱི། །",
      "en": "In short, throughout all meditation and post-meditation periods,",
      "en-trans": "dorna nyamjé küntu tamal gyi"
    },
    {
      "bo": "འཁྲུལ་པ་རྒྱ་འབྱམས་དབང་དུ་མ་ཤོར་བར། །",
      "en": "Without succumbing to the extensive confusion of the ordinary,",
      "en-trans": "trulpa gya jam wang du ma shorwar"
    },
    {
      "bo": "འཁོར་འདས་དབྱེར་མེད་ལྟ་བའི་ཉམས་ལེན་གྱི། །",
      "en": "And never parting from the vital point of practising the view",
      "en-trans": "khordé yermé tawé nyamlen gyi"
    },
    {
      "bo": "གནད་དང་འབྲལ་མེད་ཡེ་ཤེས་འཆར་བར་ཤོག །",
      "en": "Of the inseparability of saṃsāra and nirvāṇa, may wisdom dawn.",
      "en-trans": "né dang dralmé yeshe charwar shok"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་བླ་མས་རྗེས་སུ་བཟུང་། །",
      "en": "May I be guided and cared for by the guru in all my lives,",
      "en-trans": "tserab küntu lamé jesu zung"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་ལས་ནམ་ཡང་མི་འདའ་ཞིང་། །",
      "en": "May I never stray from the conduct of the bodhisattvas,",
      "en-trans": "changchub chö lé namyang mi da zhing"
    },
    {
      "bo": "དྲན་ཤེས་བག་ཡོད་རྒྱུན་དུ་བསྟེན་པ་དང་། །",
      "en": "And by constantly applying mindfulness, vigilance and conscientiousness,",
      "en-trans": "dren shé bakyö gyündu tenpa dang"
    },
    {
      "bo": "འགྲོ་བ་སེམས་ཅན་དོན་རབ་བརྩོན་པར་ཤོག །",
      "en": "May I exert myself for the sake of sentient beings.",
      "en-trans": "drowa semchen dön rab tsönpar shok"
    }
  ]
}