{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fourteenth-dalai-lama/prayer-flourishing-jonang-teachings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཇོ་ནང་པའི་བསྟན་རྒྱས་སྨོན་ལམ།",
    "en": "An Aspiration Prayer for the Flourishing of the Jonang Teachings"
  },
  "text": [
    {
      "bo": "བགྲངས་ཡས་བསྐལ་པར་ཐུགས་བསྐྱེད་ལེགས་གོམས་པས། །",
      "en": "Having perfectly meditated upon generating the enlightened mind for incalculable eons,",
      "en-trans": "drang yé kalpar tukkyé lek gompé"
    },
    {
      "bo": "མཐའ་ཡས་འགྲོ་བའི་རེ་སྐོང་དམ་ཆོས་ཆར། །",
      "en": "The incomparable sovereign of the Śākyas wisely brought down the rain",
      "en-trans": "tayé drowé rekong damchö char"
    },
    {
      "bo": "འབེབས་མཁས་མཉམ་མེད་ཤཱཀྱའི་དབང་པོ་ཡིས། །",
      "en": "Of sublime teachings in order to fulfill the wishes of illimitable beings.",
      "en-trans": "beb khé nyammé shakyé wangpo yi"
    },
    {
      "bo": "འགྲོ་འདི་དགེ་ལེགས་དཔལ་གྱིས་བསྐྱང་དུ་གསོལ། །",
      "en": "To you who protects beings through glorious virtue, I pay homage!",
      "en-trans": "dro di gelek pal gyi kyang du sol"
    },
    {
      "bo": "རིམ་གསུམ་ཆོས་ཀྱི་འཁོར་ལོའི་དགོངས་པའི་དོན། །",
      "en": "The intended meaning of the three successive Wheels of Dharma",
      "en-trans": "rim sum chö kyi khorlö gongpé dön"
    },
    {
      "bo": "མཁས་དང་གྲུབ་བརྙེས་དུ་མས་བཀྲལ་བ་ལས། །",
      "en": "Was explicated from multiple realizations derived from study and practice.",
      "en-trans": "khé dang drub nyé dumé tralwa lé"
    },
    {
      "bo": "ཆོས་ཀྱི་སྒོ་མང་རབ་དབྱེའི་ཡ་གྱལ་ཅིག །",
      "en": "This is what distinguishes the one from the many gates of the Buddha's Dharma.",
      "en-trans": "chö kyi go mang rab yé yagyal chik"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "གངས་ལྗོངས་རྒྱལ་བསྟན་པད་མའི་ཚལ་ཡངས་པོར། །",
      "en": "Amidst the vast lotus grove of the victor's teachings in the Land of Snow,",
      "en-trans": "gangjong gyalten pemé tsal yangpor"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཆོས་ཚུལ་འདབ་བརྒྱ་གྲོལ་བའི་ཁྲོད། །",
      "en": "Hundreds of petals of Buddhist exposition and meditation systems bloomed.",
      "en-trans": "shedrub chö tsul dabgya drolwé trö"
    },
    {
      "bo": "འཁོར་ལོ་ཐ་མའི་དགོངས་པ་རྩལ་བཏོན་པའི། །",
      "en": "Among them, the dynamic intent of the final Wheel of Dharma was revealed.",
      "en-trans": "khorlo tamé gongpa tsal tönpé"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "མདོ་རྒྱུད་གཞན་དང་བཤད་སྲོལ་མི་འདྲ་བའི། །",
      "en": "You uphold and transmit an unparalleled oral transmission,",
      "en-trans": "dogyü zhen dang shé sol midrawé"
    },
    {
      "bo": "ཤིང་རྟའི་སྲོལ་ཆེན་དུས་ཀྱི་འཁོར་ལོའི་རྒྱུད། །",
      "en": "A commentarial tradition distinct from other sūtras and tantras",
      "en-trans": "shingté sol chen dü kyi khorlö gyü"
    },
    {
      "bo": "མི་མཉམ་འཛིན་ཅིང་སྤེལ་བའི་བཀའ་བབས་པ། །",
      "en": "On the great chariot tradition of the Kālacakra Tantra.",
      "en-trans": "mi nyam dzin ching pelwé kabab pa"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "ཡུ་མོ་མི་བསྐྱོད་རྡོ་རྗེ་ནས་བཟུངས་ཏེ། །",
      "en": "From Yumo Mikyö Dorje, through Dolpopa,",
      "en-trans": "yumo mi kyö dorjé né zung té"
    },
    {
      "bo": "དོལ་བུ་བ་དང་ཀུན་དགའ་གྲོལ་བའི་མཆོག །",
      "en": "Kunga Drolchok, the protector Jetsun Tāranātha,",
      "en-trans": "dol buwa dang kün ga drolwé chok"
    },
    {
      "bo": "རྗེ་བཙུན་སྒྲོལ་མགོན་སོགས་ཀྱིས་ལེགས་སྤེལ་བའི། །",
      "en": "And successive masters, your lineage has gracefully disseminated.",
      "en-trans": "jetsün drol gön sok kyi lek pelwé"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "སྙིང་པོའི་མདོ་དང་ཀླུ་སྒྲུབ་གཞུང་གི་དོན། །",
      "en": "The timelessly ultimate residing, stable, enduring",
      "en-trans": "nyingpö do dang ludrub zhung gi dön"
    },
    {
      "bo": "གཞི་འབྲས་དབྱེར་མེད་རྟག་བརྟན་བདེ་གཤེགས་སྙིང་། །",
      "en": "Enlightened essence is the indivisible ground and fruition.",
      "en-trans": "zhi dré yermé takten deshek nying"
    },
    {
      "bo": "ཡེ་ནས་བཞུགས་པའི་དོན་དམ་འགྲེལ་བའི་ཚུལ། །",
      "en": "This is the way elucidated in the Essence Sūtras and the meaning beheld by Nāgārjuna.",
      "en-trans": "yené zhukpé döndam drelwé tsul"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "མདོ་ཡི་ལྟ་བ་གཞན་སྟོང་དབུ་མ་དང་། །",
      "en": "Your Middle Way zhentong view of the sūtras",
      "en-trans": "do yi tawa zhen tong uma dang"
    },
    {
      "bo": "རྒྱུད་དོན་རྣལ་འབྱོར་དྲུག་གི་ཉམས་ལེན་གྱིས། །",
      "en": "And your practice of the Six Yogas which unfolds the meaning of the tantras",
      "en-trans": "gyü dön naljor druk gi nyamlen gyi"
    },
    {
      "bo": "ཆོས་སྐུ་མངོན་དུ་མཛད་པའི་བཞེད་སྲོལ་ཆེ། །",
      "en": "Are great traditions of explanation that activate the actual dimension of reality.",
      "en-trans": "chöku ngön du dzepé zhé sol ché"
    },
    {
      "bo": "ཇོ་ནང་པ་ཡི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jonang flourish!",
      "en-trans": "jonangpa yi tenpa gyé gyur chik"
    },
    {
      "bo": "སྐྱབས་གནས་རྒྱལ་དང་རྒྱལ་སྲས་བྱིན་ཆེན་དང་། །",
      "en": "Through the great blessings of the sources of refuge, the victor and the victor's children,",
      "en-trans": "kyabné gyal dang gyalsé jin chen dang"
    },
    {
      "bo": "ཆོས་ཉིད་དོན་དམ་འགྱུར་བ་མེད་པའི་སྟོབས། །",
      "en": "Through the power of the unalterable ultimate nature of reality,",
      "en-trans": "chönyi döndam gyurwa mepé tob"
    },
    {
      "bo": "དཀར་ཕྱོགས་ལྷ་དང་བདག་ཅག་མོས་གུས་མཐུས། །",
      "en": "Through the force of divine virtue, and through our devotion,",
      "en-trans": "karchok lha dang dakchak mögü tü"
    },
    {
      "bo": "སྨོན་ལམ་འདི་བཏབ་ཇི་བཞིན་འགྲུབ་པར་ཤོག །",
      "en": "May this aspiration prayer be fulfilled accordingly!",
      "en-trans": "mönlam di tab jizhin drubpar shok"
    }
  ]
}