{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/patrul-rinpoche/aspiration-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ།",
    "en": "Aspiration Prayer1"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་བསླུ་བ་མེད་པའི་དཀོན་མཆོག་གསུམ། །",
      "en": "Unfailing sources of refuge, the Three Jewels,",
      "en-trans": "kyabné luwa mepé könchok sum"
    },
    {
      "bo": "ཐུགས་རྗེ་མཚུངས་མེད་རྩ་བརྒྱུད་བླ་མའི་ཚོགས། །",
      "en": "And hosts of root and lineage gurus, whose kindness is beyond compare,",
      "en-trans": "tukjé tsungmé tsa gyü lamé tsok"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་བ་འདེབས་སོ་བྱིན་གྱིས་རློབས། །",
      "en": "I pray to you from the depths of my heart: inspire me with your blessings.",
      "en-trans": "nying né solwa deb so jingyi lob"
    },
    {
      "bo": "རྟག་ཏུ་གཡེལ་བ་མེད་པར་ཐུགས་རྗེས་ཟུངས། །",
      "en": "Always hold me in your compassion without ever wavering.",
      "en-trans": "taktu yelwa mepar tukjé zung"
    },
    {
      "bo": "མོས་གུས་ལམ་གྱི་རྩ་བར་ཤེས་པ་ཡིས། །",
      "en": "In the knowledge that devotion lies at the root of the path,",
      "en-trans": "mögü lam gyi tsawar shepa yi"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེས་ལམ་གྱི་གཞི་བཟུང་ནས། །",
      "en": "As I take love and compassion as the path’s foundation,",
      "en-trans": "jam dang nyingjé lam gyi zhi zung né"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་རིམ་གཉིས་བརྩོན་པས་ལྷུར་ལེན་ཚེ། །",
      "en": "And diligently apply myself to the twin stages of generation and completion,",
      "en-trans": "kyedzok rim nyi tsönpé lhurlen tsé"
    },
    {
      "bo": "མཆོག་གསུམ་བླ་མས་རྟག་ཏུ་ཐུགས་རྗེས་གཟིགས། །",
      "en": "May the Three Jewels and the gurus always watch over me with compassion.",
      "en-trans": "chok sum lamé taktu tukjé zik"
    },
    {
      "bo": "དབེན་པ་གསུམ་གྱི་རྣལ་འབྱོར་གཞིར་བཟུང་ནས། །",
      "en": "As I take the yoga of threefold solitude as a foundation,",
      "en-trans": "wenpa sum gyi naljor zhir zung né"
    },
    {
      "bo": "རྡོ་རྗེ་གསུམ་གྱི་ཉམས་ལེན་ལེགས་བརྩོན་ཚེ། །",
      "en": "And thoroughly exert myself in the practice of the three vajras,",
      "en-trans": "dorjé sum gyi nyamlen lek tsön tsé"
    },
    {
      "bo": "འགལ་རྐྱེན་ཀུན་ཞི་མཐུན་རྐྱེན་ཕུན་ཚོགས་ནས། །",
      "en": "May all adversity be pacified and favourable conditions abound,",
      "en-trans": "galkyen kün zhi tünkyen püntsok né"
    },
    {
      "bo": "ཉམས་དང་རྟོགས་པའི་ཡོན་ཏན་འཕེལ་བར་ཤོག །",
      "en": "And may I develop the qualities of experience and realization.",
      "en-trans": "nyam dang tokpé yönten pelwar shok"
    },
    {
      "bo": "ལྟ་བ་ཟབ་མོའི་གནས་ལུགས་རྟོགས་པ་དང་། །",
      "en": "With the profound view of realizing the natural state,",
      "en-trans": "tawa zabmö neluk tokpa dang"
    },
    {
      "bo": "བསྒོམ་པ་ཟབ་མོའི་ཉམས་མྱོང་ཕུན་སུམ་ཚོགས། །",
      "en": "Profound meditation in which experience is plentiful,",
      "en-trans": "gompa zabmö nyamnyong pün sum tsok"
    },
    {
      "bo": "སྤྱོད་པ་བཟང་པོ་ཕྱིན་དྲུག་ལ་བརྟེན་ནས། །",
      "en": "And excellent conduct of the six transcendent perfections,",
      "en-trans": "chöpa zangpo chin druk la ten né"
    },
    {
      "bo": "རྒྱལ་བ་དགྱེས་པའི་ལམ་ལ་སློབ་པར་ཤོག །",
      "en": "May I train in the path that delights the victorious ones.",
      "en-trans": "gyalwa gyepé lam la lobpar shok"
    },
    {
      "bo": "ཆོས་རྗེ་བླ་མ་ཀུན་མཁྱེན་ཡབ་སྲས་ཀྱིས། །",
      "en": "May the virtue and excellence that spring from the noble deeds",
      "en-trans": "chöjé lama künkhyen yabsé kyi"
    },
    {
      "bo": "མཛད་པ་བཟང་པོའི་དགེ་ལེགས་གོང་འཕེལ་ནས། །",
      "en": "Of the guru, lord of Dharma, the omniscient one and his heirs, increase.",
      "en-trans": "dzepa zangpö gelek gongpel né"
    },
    {
      "bo": "བཤད་དང་སྒྲུབ་པའི་བསྟན་པ་རིན་པོ་ཆེ། །",
      "en": "And may the precious teachings, in explanation and in practice,",
      "en-trans": "shé dang drubpé tenpa rinpoche"
    },
    {
      "bo": "ཡར་ངོའི་ཟླ་ལྟར་གོང་དུ་འཕེལ་བར་ཤོག །",
      "en": "Flourish and increase ever further just like the waxing moon!",
      "en-trans": "yar ngö da tar gong du pelwar shok"
    }
  ]
}