{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/aspiration-to-accomplish-every-aim",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་དོན་ཀུན་འགྲུབ་པ་བཞུགས།",
    "en": "Aspiration to Accomplish Every Aim"
  },
  "text": [
    {
      "bo": "ཕྱོགས་བཅུ་དུས་བཞིར་བཞུགས་པའི་རྒྱལ་བ་དང་།  །",
      "en": "Victorious ones dwelling in the ten directions and four times,",
      "en-trans": "chok chu dü zhir zhukpé gyalwa dang"
    },
    {
      "bo": "དེ་སྲས་བྱང་སེམས་ཉན་རང་དགྲ་བཅོམ་སོགས།  །",
      "en": "Their bodhisattva heirs and śrāvaka and pratyekabuddha arhats—",
      "en-trans": "dé sé changsem nyen rang drachom sok"
    },
    {
      "bo": "འཕགས་པའི་ཚོགས་རྣམས་ཡེ་ཤེས་སྤྱན་ལྡན་པས།  །",
      "en": "Noble assembly with your eyes of wisdom,",
      "en-trans": "pakpé tsok nam yeshe chen denpé"
    },
    {
      "bo": "རྣམ་དག་སྨོན་ལམ་འགྲུབ་པའི་དཔང་པོ་མཛོད།  །",
      "en": "Bear witness to the fulfilment of this pure prayer of aspiration.",
      "en-trans": "namdak mönlam drubpé pangpo dzö"
    },
    {
      "bo": "ཤཱཀྱ་སེང་གེའི་གསུང་རབ་ཕུང་པོ་ལས།  །",
      "en": "Through all the excellent deeds of past, present and future,",
      "en-trans": "shakya sengé sung rab pungpo lé"
    },
    {
      "bo": "སྐྲ་རྩེའི་ཤས་ཙམ་གངས་ཅན་ལྗོངས་འདི་རུ།  །",
      "en": "Represented by the sources of virtue created here",
      "en-trans": "tra tsé shé tsam gangchen jong diru"
    },
    {
      "bo": "ཆོས་རྒྱལ་ལོ་པཎ་རྣམས་ཀྱིས་བསྒྱུར་བ་དང་།  །",
      "en": "Through the gathering as a collection",
      "en-trans": "chögyal lo pen nam kyi gyurwa dang"
    },
    {
      "bo": "བཀའ་ཡི་བསྡུ་བ་ཆེན་པོའི་གླེགས་བམ་རྣམས།  །",
      "en": "Of a mere portion of the Śākya lion's teachings,",
      "en-trans": "ka yi duwa chenpö lekbam nam"
    },
    {
      "bo": "དེང་འདིར་འདུས་པའི་ཚོགས་ཀྱི་བསྒྲུགས་པ་ཡི།  །",
      "en": "Which are present here in this Land of Snows,",
      "en-trans": "dengdir düpé tsok kyi drukpa yi"
    },
    {
      "bo": "དགེ་བའི་རྩ་བ་ཇི་སྙེད་མཆིས་པ་དེས།  །",
      "en": "Having been translated by dharma-kings, lotsāwas and paṇḍitas,",
      "en-trans": "gewé tsawa jinyé chipa dé"
    },
    {
      "bo": "མཚོན་པའི་དུས་གསུམ་ལེགས་བྱས་ཇི་སྙེད་པ།  །",
      "en": "And compiled in these great volumes of the Word—",
      "en-trans": "tsönpé dü sum lek jé jinyepa"
    },
    {
      "bo": "ཀུན་ཀྱང་བསྟན་པ་རྒྱས་པའི་རྒྱུ་རུ་བསྔོ།  །",
      "en": "I dedicate all as a cause for the flourishing of the teachings.",
      "en-trans": "kün kyang tenpa gyepé gyu ru ngo"
    },
    {
      "bo": "ཁྱད་པར་བསྟན་ལ་འཚེ་བའི་ཉི་བུའི་ཚོགས།  །",
      "en": "In particular, may all the ‘children of the sun’ who harm the teachings1",
      "en-trans": "khyepar ten la tsewé nyi bü tsok"
    },
    {
      "bo": "མྱུར་དུ་ཞི་ནས་འཇིག་རྟེན་བདེ་ཞིང་སྐྱིད།  །",
      "en": "Be swiftly pacified and may the whole world enjoy happiness and well-being.",
      "en-trans": "nyurdu zhi né jikten dé zhing kyi"
    },
    {
      "bo": "བདག་ལ་འབྲེལ་བ་ཐོགས་པའི་སེམས་ཅན་རྣམས།  །",
      "en": "May all those sentient beings who have a connection with me",
      "en-trans": "dak la drelwa tokpé semchen nam"
    },
    {
      "bo": "ལས་ཉོན་སྡུག་བསྔལ་མ་ལུས་བྱང་བར་ཤོག  །",
      "en": "Purify all past karma, mental afflictions, and suffering.",
      "en-trans": "lé nyön dukngal malü jangwar shok"
    },
    {
      "bo": "གཡུལ་ངོར་ཤི་བའི་སྦྱིན་བདག་ཕོ་མོ་རྣམས།  །",
      "en": "May all benefactors, male and female, who have perished in conflict",
      "en-trans": "yulngor shiwé jindak pomo nam"
    },
    {
      "bo": "འཁྲུལ་སྣང་སྡུག་བསྔལ་མ་ལུས་ཀུན་ཞི་ནས།  །",
      "en": "Pacify all forms of suffering and deluded perception,",
      "en-trans": "trulnang dukngal malü kün zhi né"
    },
    {
      "bo": "མངོན་མཐོ་ལྷ་མིའི་རྟེན་བཟང་ཐོབ་པར་ཤོག  །",
      "en": "And gain an excellent form as a god or human being in the higher realms.",
      "en-trans": "ngön to lhami ten zang tobpar shok"
    },
    {
      "bo": "བདག་ལ་སྐྱབས་སུ་བསྙེན་པ་ཐམས་ཅད་ཀྱང་།  །",
      "en": "May all those who have taken refuge in me",
      "en-trans": "dak la kyab su nyenpa tamché kyang"
    },
    {
      "bo": "འགལ་རྐྱེན་ཀུན་ཞི་ཚེ་བསོད་དཔལ་འབྱོར་རྒྱས།  །",
      "en": "Overcome all adversity and enjoy increased longevity, merit, glory and wealth.",
      "en-trans": "galkyen kün zhi tsé sö paljor gyé"
    },
    {
      "bo": "བསམ་སྦྱོར་ཐམས་ཅད་ཡིད་བཞིན་འགྲུབ་པ་དང་།  །",
      "en": "May all that they do in thought and deed be successful",
      "en-trans": "samjor tamché yizhin drubpa dang"
    },
    {
      "bo": "བསོད་ནམས་ཚོགས་ཆེན་ཡོངས་སུ་རྫོགས་པར་ཤོག  །",
      "en": "And may they perfectly accumulate great stores of merit.",
      "en-trans": "sönam tsokchen yongsu dzokpar shok"
    },
    {
      "bo": "བདག་ཅག་ནད་གདོན་གནོད་པ་ཀུན་ཞི་ཞིང་།  །",
      "en": "May we pacify all illness, malevolent influences and harm.",
      "en-trans": "dakchak nedön nöpa kün zhi zhing"
    },
    {
      "bo": "གཟུགས་ཅན་གཟུགས་མེད་མི་ཁ་བྱད་ཕུར་དང་།  །",
      "en": "May all threats of scandal, sorcery, spirits and astrological influence",
      "en-trans": "zukchen zukmé mikha jepur dang"
    },
    {
      "bo": "སྲི་སྐེག་ལ་སོགས་ཉེར་འཚེས་མི་ཚུགས་ཤིང་།  །",
      "en": "From beings with form and those without form be overcome,",
      "en-trans": "si kek lasok nyertsé mitsuk shing"
    },
    {
      "bo": "དཀོན་མཆོག་གསུམ་གྱི་སྐྱབས་འོག་ཚུད་པར་ཤོག  །",
      "en": "And may everyone remain under the protection of the Three Jewels.",
      "en-trans": "könchok sum gyi kyab ok tsüpar shok"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་དམ་པའི་ཆོས་དང་འཕྲད།  །",
      "en": "In all our lives may we encounter the sacred Dharma,",
      "en-trans": "tserab küntu dampé chö dang tré"
    },
    {
      "bo": "སྟོན་བྱེད་ཡང་དག་དགེ་བའི་བཤེས་དང་མཇལ།  །",
      "en": "And always meet authentic spiritual teachers who can guide us.",
      "en-trans": "tön jé yangdak geweshé dang jal"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པ་དང་།  །",
      "en": "May we perfectly accumulate the components of ethical discipline",
      "en-trans": "tsultrim pungpo yongsu dzokpa dang"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་ལ་བྱ་བ་བྱེད་པར་ཤོག  །",
      "en": "And act to serve the teachings of the Victorious One.",
      "en-trans": "gyalwé ten la jawa jepar shok"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་འཛམ་གླིང་ཀུན་ཏུ་ཁྱབ།  །",
      "en": "May the precious teachings pervade throughout the world.",
      "en-trans": "tenpa rinchen dzamling küntu khyab"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་རྣམས་ཞབས་པད་བརྟན་པ་དང་།  །",
      "en": "May the great beings who uphold these teachings live long.",
      "en-trans": "tendzin kyé nam zhabpé tenpa dang"
    },
    {
      "bo": "བསྟན་ལ་སྡང་བ་རྩྭ་སྦུར་མེས་བསྲེགས་བཞིན།  །",
      "en": "May those who are hostile towards the teachings be overcome like grass in a wildfire,",
      "en-trans": "ten la dangwa tsa bur mé sek zhin"
    },
    {
      "bo": "བསྟན་པ་ཕྱོགས་བཅུར་རྒྱས་པའི་བཀྲ་ཤིས་ཤོག  །",
      "en": "And may all be auspicious for the teachings to spread throughout the ten directions.",
      "en-trans": "tenpa chok chur gyepé tashi shok"
    }
  ]
}