{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/aspiration-perfection-maturation-purification",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་སྨིན་སྦྱོང་བའི་སྨོན་ལམ།",
    "en": "An Aspiration to Accomplish Perfection, Maturation and Purification"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་སངས་རྒྱས་ཐམས་ཅད་དང་། །",
      "en": "To each and every buddha of the three times,",
      "en-trans": "dü sum sangye tamché dang"
    },
    {
      "bo": "རྒྱལ་ཡུམ་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །",
      "en": "The Mother of the victorious ones, Transcendent Perfection of Wisdom,",
      "en-trans": "gyalyum sherab parol chin"
    },
    {
      "bo": "འཕགས་པ་ཐུགས་རྗེ་ཅན་རྣམས་ཀྱིས། །",
      "en": "And āryas in all your compassion—",
      "en-trans": "pakpa tukjé chen nam kyi"
    },
    {
      "bo": "བདག་རྒྱུད་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "Grant us your blessings!",
      "en-trans": "dak gyü jingyi lab tu sol"
    },
    {
      "bo": "དལ་འབྱོར་མི་ལུས་ཐོབ་སྙམ་ཡང་། །",
      "en": "Fooling myself, thinking “I have obtained a human body endowed with the freedoms and advantages”,",
      "en-trans": "daljor milü tob nyam yang"
    },
    {
      "bo": "ལོག་ལྟས་མི་ཁོམ་གནས་སུ་བསྐྱལ།",
      "en": "Through wrong views, I spend my life in unfree states.",
      "en-trans": "lokté mikhom né su kyal"
    },
    {
      "bo": "ཁ་ལྟས་རྒྱུ་འབྲས་ཁྱད་དུ་བསད། །",
      "en": "My nonsensical words disregard cause and effect;",
      "en-trans": "khaté gyundré khyé du sé"
    },
    {
      "bo": "ལས་མཐའ་ལོག་པས་རང་འབྱོར་ཉམས། །",
      "en": "Straying into heinous deeds, I lose my personal advantages;",
      "en-trans": "leta lokpé rang jor nyam"
    },
    {
      "bo": "དམ་པས་མ་ཟིན་གཞན་འབྱོར་སྤངས། །",
      "en": "Not cared for by holy beings, I lack the circumstantial advantages;",
      "en-trans": "dampé ma zin zhen jor pang"
    },
    {
      "bo": "འཇིགས་སྐྱོབ་ལེགས་སྨོན་ཆོས་སུ་འཁྲུལ། །",
      "en": "I confuse mere protection from fear and good aspirations as true Dharma;",
      "en-trans": "jik kyob lek mön chö su trul"
    },
    {
      "bo": "དཀོར་དང་ལོག་འཚོར་བག་མེད་སྤྱད། །",
      "en": "I carelessly squander offerings, engage in wrong livelihood,",
      "en-trans": "kor dang loktsor bakmé ché"
    },
    {
      "bo": "ཆོས་ཀྱི་གཟུགས་ལ་ཆོས་མིན་སེམས། །",
      "en": "And fail to recognize the Dharma when it appears.",
      "en-trans": "chö kyi zuk la chö min sem"
    },
    {
      "bo": "ཤི་མ་ཐག་ཏུ་ངན་སོང་ལས། །",
      "en": "At the moment of my death, I will have nowhere to go",
      "en-trans": "shi ma tak tu ngensong lé"
    },
    {
      "bo": "འགྲོ་ས་མེད་པ་བདག་གི་བློ། །",
      "en": "But the lower realms—",
      "en-trans": "drosa mepa dak gi lo"
    },
    {
      "bo": "སྙིང་ནས་ཆོས་ལ་འགྱུར་བར་ཤོག །",
      "en": "I pray from the bottom of my heart: may my mind turn towards the Dharma!",
      "en-trans": "nying né chö la gyurwar shok"
    },
    {
      "bo": "དེ་ཡང་བླ་མ་དམ་པས་ཟིན། །",
      "en": "May I be taken care of by holy beings,",
      "en-trans": "deyang lama dampé zin"
    },
    {
      "bo": "ངེས་འབྱུང་སྐྱོ་ཤས་མོས་གུས་དང་། །",
      "en": "Generate renunciation, heartfelt sadness and devotion,",
      "en-trans": "ngejung kyoshé mögü dang"
    },
    {
      "bo": "སྙིང་རྗེ་བྱང་ཆུབ་དམ་པའི་སེམས། །",
      "en": "And may compassion and the sacred mind set upon awakening",
      "en-trans": "nyingjé changchub dampé sem"
    },
    {
      "bo": "རྒྱུད་ལ་ངམ་ངམ་ཤུགས་ཀྱིས་སྐྱེ། །",
      "en": "Arise spontaneously, without any effort!",
      "en-trans": "gyü la ngam ngam shuk kyi kyé"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་ལ་ཕན་སེམས་དང་། །",
      "en": "With the wish to benefit all sentient beings,",
      "en-trans": "semchen kün la pen sem dang"
    },
    {
      "bo": "ཕ་རོལ་ཕྱིན་དྲུག་སྤྱོད་པ་ལ། །",
      "en": "And my conduct being that of the six transcendent perfections,",
      "en-trans": "parol chin druk chöpa la"
    },
    {
      "bo": "བདུད་ཀྱི་བར་གཅོད་མི་འབྱུང་ཞིང་། །",
      "en": "Obstacles and demons do not arise.",
      "en-trans": "dü kyi barchö minjung zhing"
    },
    {
      "bo": "ཚེ་དང་སྒྲུབ་པ་མཉམ་པ་ཡིས། །",
      "en": "Practising intensely for as long as I live,",
      "en-trans": "tsé dang drubpa nyampa yi"
    },
    {
      "bo": "གྲངས་མེད་དང་པོའི་ཚོགས་སྦྱོར་ལམ། །",
      "en": "May I traverse the paths of accumulation and joining,",
      "en-trans": "drangmé dangpö tsok jor lam"
    },
    {
      "bo": "ཐབས་ལ་མཁས་པས་འདུམ་པར་ཤོག །",
      "en": "Which can take one incalculable aeon, much more swiftly through skill in means.",
      "en-trans": "tab la khepé dumpar shok"
    },
    {
      "bo": "རྡོ་རྗེའི་ལམ་ལ་རྣལ་འབྱོར་བའི། །",
      "en": "Through the truth of the path of seeing,",
      "en-trans": "dorjé lam la naljor bé"
    },
    {
      "bo": "མཐོང་ལམ་བདེན་པས་མ་དག་ས། །",
      "en": "Arrived at through the practice of the vajra path,",
      "en-trans": "tonglam denpé ma dak sa"
    },
    {
      "bo": "བདུན་གྱིས་གྲངས་མེད་གཉིས་རྫོགས་ཤིང་། །",
      "en": "The seven impure bhūmis are perfected during the second incalculable aeon,",
      "en-trans": "dün gyi drangmé nyi dzok shing"
    },
    {
      "bo": "དག་ས་གསུམ་གྱིས་གྲངས་མེད་མཐའ། །",
      "en": "And the three pure bhūmis during the final incalculable aeon.",
      "en-trans": "dak sa sum gyi drangmé ta"
    },
    {
      "bo": "མཆོག་དབང་ལྷན་སྐྱེས་ཡེ་ཤེས་དབྱིངས། །",
      "en": "Having actualized the supreme empowerment’s space of innate wisdom,",
      "en-trans": "chokwang lhenkyé yeshe ying"
    },
    {
      "bo": "མངོན་སུམ་རྫོགས་ཀྱང་ཡང་དག་མཐའ། །",
      "en": "May I refrain from aiming for nirvāṇa’s ultimate truth",
      "en-trans": "ngönsum dzok kyang yangdak ta"
    },
    {
      "bo": "མངོན་དུ་མི་བྱེད་སྨོན་ལམ་རྫོགས། །",
      "en": "And instead strive to perfect my aspirations for others’ benefit.",
      "en-trans": "ngön du mi jé mönlam dzok"
    },
    {
      "bo": "སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱེད་ཅིང་། །",
      "en": "May I mature all sentient beings",
      "en-trans": "semchen yongsu min jé ching"
    },
    {
      "bo": "སྣོད་དང་བཅུད་ཀྱིས་བསྡུས་པ་ཡིས། །",
      "en": "And purify everyone and everything in this world",
      "en-trans": "nö dang chü kyi düpa yi"
    },
    {
      "bo": "སངས་རྒྱས་ཞིང་ཁམས་སྦྱོང་བ་སྟེ། །",
      "en": "As the pure realms of the buddhas—",
      "en-trans": "sangye zhingkham jongwa té"
    },
    {
      "bo": "རྫོགས་སྨིན་སྦྱངས་གསུམ་མཐར་ཕྱིན་ཤོག །",
      "en": "May I bring the acts of perfecting, maturing and purifying to completion!",
      "en-trans": "dzok min jang sum tarchin shok"
    }
  ]
}