{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/eight-chariots-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྒྲུབ་བརྒྱུད་ཤིང་རྟ་བརྒྱད་ཀྱི་བསྟན་རྒྱས་སྨོན་ལམ་བཞུགས་སོ།།",
    "en": "Aspiration for the Spread of the Teachings of the Eight Chariots of the Practice Lineage"
  },
  "text": [
    {
      "bo": "གྲངས་མེད་བསྐལ་པ་མང་པོའི་གོང་རོལ་ནས། །",
      "en": "Countless aeons ago, with a motivation",
      "en-trans": "drangmé kalpa mangpö gong rol né"
    },
    {
      "bo": "སྙིང་རྗེའི་ཐུགས་བསྐྱེད་དྲག་པོ་ཁུར་བཞེས་ཏེ། །",
      "en": "Of intense compassion, you took on the burden",
      "en-trans": "nyingjé tukkyé drakpo khur zhé té"
    },
    {
      "bo": "རྩོད་ལྡན་མུན་པའི་ཞིང་འདི་ཡོངས་བཟུང་བ། །",
      "en": "Of caring for this realm in a dark and turbulent age—",
      "en-trans": "tsöden münpé zhing di yong zungwa"
    },
    {
      "bo": "སྟོན་མཆོག་ཐུབ་པའི་དབང་པོ་དགོངས་སུ་གསོལ། །",
      "en": "Supreme guide, Lord of Sages, consider this, I pray!",
      "en-trans": "tön chok tubpé wangpo gong su sol"
    },
    {
      "bo": "གང་གི་ཐེག་མཆོག་སྙིང་པོའི་རིང་ལུགས་ནི། །",
      "en": "When the essential traditions of your supreme vehicle",
      "en-trans": "gang gi tek chok nyingpö ringluk ni"
    },
    {
      "bo": "བསིལ་ལྡན་ཁ་བའི་ལྗོངས་འདིར་དར་བ་ལ། །",
      "en": "Spread to this frigid and snowy land, there arose",
      "en-trans": "silden khawé jong dir darwa la"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་ཤིང་རྟ་བརྒྱད་ཅེས་ཡོངས་གྲགས་པའི། །",
      "en": "What became known as the eight chariots of the practice lineage—",
      "en-trans": "drubgyü shingta gyé ché yong drakpé"
    },
    {
      "bo": "བསྟན་དང་བསྟན་འཛིན་ཕྱོགས་མཐར་རྒྱས་གྱུར་ཅིག །",
      "en": "May their teachings and adherents spread far and wide!",
      "en-trans": "ten dang tendzin chok tar gyé gyur chik"
    },
    {
      "bo": "རྒྱལ་བསྟན་སྤྱི་དང་ནང་རྒྱུད་ཡོ་ག་གསུམ། །",
      "en": "The excellent unrivalled path that upholds, preserves and spreads",
      "en-trans": "gyalten chi dang nanggyü yoga sum"
    },
    {
      "bo": "ཁྱད་པར་འོད་གསལ་རྡོ་རྗེ་སྙིང་པོའི་སྲོལ། །",
      "en": "The traditions of the general Buddhadharma and three yogas of the inner tantras,",
      "en-trans": "khyepar ösal dorjé nyingpö sol"
    },
    {
      "bo": "འཛིན་སྐྱོང་སྤེལ་བའི་ལམ་བཟང་ཟླ་མེད་པ། །",
      "en": "Especially the luminous vajra essence—1",
      "en-trans": "dzin kyong pelwé lamzang da mepa"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Lake-Born Conqueror flourish and spread!",
      "en-trans": "tsokyé gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "དྲི་མེད་བསླབ་པ་གསུམ་གྱིས་རྒྱུད་བསྡམས་ཤིང༌། །",
      "en": "Exercising restraint through the three immaculate trainings,",
      "en-trans": "drimé labpa sum gyi gyü dam shing"
    },
    {
      "bo": "ཐུབ་དབང་སྤྱན་གཟིགས་སྒྲོལ་མ་མི་གཡོ་བ། །",
      "en": "And relying on the Lord of Sages, Avalokiteśvara, Tārā and Acala",
      "en-trans": "tubwang chenzik drolma miyowa"
    },
    {
      "bo": "མི་ཕྱེད་གཏན་གྱི་སྐྱབས་སུ་ཉེར་བསྟེན་པའི། །",
      "en": "As infallible and enduring sources of protection—",
      "en-trans": "miché ten gyi kyab su nyer tenpé"
    },
    {
      "bo": "ཇོ་བོ་བཀའ་གདམས་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Jowo Kadampas flourish and spread!",
      "en-trans": "jowo kadam tenpa gyé gyur chik"
    },
    {
      "bo": "ཁྱད་པར་ཨ་ཏི་ཤ་ཡི་རིང་ལུགས་མཆོག །",
      "en": "Skilled in upholding Atiśa’s sublime tradition in particular",
      "en-trans": "khyepar ati sha yi ringluk chok"
    },
    {
      "bo": "བཤད་སྒྲུབ་དྲི་མ་མེད་པས་འཛིན་མཁས་ཤིང༌། །",
      "en": "Through flawless study and practice and pure Vinaya observance,",
      "en-trans": "shedrub drima mepé dzin khé shing"
    },
    {
      "bo": "འདུལ་འཛིན་གཙང་མས་ནོར་འཛིན་འགེངས་ནུས་པའི། །",
      "en": "And able thereby to nourish the entire wealth-bearing world—",
      "en-trans": "dul dzin tsangmé nordzin geng nüpé"
    },
    {
      "bo": "རི་བོ་དགེ་ལྡན་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Riwo Gendenpas flourish and spread!",
      "en-trans": "riwo geden tenpa gyé gyur chik"
    },
    {
      "bo": "འཇམ་དཔལ་ཡེ་ཤེས་སེམས་དཔའི་ཐུགས་རྗེའི་གར། །",
      "en": "Upon the basis of the wisdom intent of the five patriarchs,2",
      "en-trans": "jampal yeshe sempé tukjé gar"
    },
    {
      "bo": "གོང་མ་རྣམ་ལྔའི་ཐུགས་དགོངས་སྙིང་པོའི་མཐིལ། །",
      "en": "Compassionate emanations of the wisdom being Mañjuśrī,",
      "en-trans": "gongma nam ngé tukgong nyingpö til"
    },
    {
      "bo": "ཀྱཻ་རྡོར་ལམ་འབྲས་ཉམས་ལེན་གཙོར་བྱེད་པའི། །",
      "en": "Emphasising the practices of Hevajra and Path with its Fruit—",
      "en-trans": "kyé dor lamdré nyamlen tsor jepé"
    },
    {
      "bo": "དཔལ་ལྡན་ས་སྐྱའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the glorious Sakya teachings flourish and spread!",
      "en-trans": "palden sakyé tenpa gyé gyur chik"
    },
    {
      "bo": "གྲུབ་ཆེན་ན་རོ་པ་དང་མེ་ཏྲི་བའི། །",
      "en": "Teachings from the lineage of the mahāsiddhas Nāropa and Maitripāda,",
      "en-trans": "drubchen naropa dang metriwé"
    },
    {
      "bo": "བརྒྱུད་པའི་བཀའ་སྲོལ་ཐབས་ལམ་ཆོས་དྲུག་དང༌། །",
      "en": "The tradition of practising the six dharmas as the path of skilful means",
      "en-trans": "gyüpé kasol tab lam chö druk dang"
    },
    {
      "bo": "གྲོལ་ལམ་ཕྱག་རྒྱ་ཆེན་པོ་ཉམས་བཞེས་པའི། །",
      "en": "And the Great Seal (Mahāmudrā) as the path of liberation—",
      "en-trans": "drollam chakgya chenpo nyam zhepé"
    },
    {
      "bo": "འགྲོ་མགོན་བཀའ་བརྒྱུད་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Kagyüpas, protectors of beings, flourish and spread!",
      "en-trans": "dro gön kagyü tenpa gyé gyur chik"
    },
    {
      "bo": "གཞན་ཡང་ཞི་བྱེད་ཤངས་པ་ཇོ་ནང་དང༌། །",
      "en": "In addition, may all the pure, nonsectarian teachings of the victorious ones,",
      "en-trans": "zhenyang zhijé shangpa jonang dang"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་ལ་སོགས་རིས་སུ་མ་ཆད་པའི། །",
      "en": "Such as the Pacification, Shangpa Kagyü, Jonang,",
      "en-trans": "nyendrub lasok ri su machepé"
    },
    {
      "bo": "རྣམ་དག་རྒྱལ་བའི་བསྟན་པ་ཇི་སྙེད་ཀུན། །",
      "en": "Approach and Accomplishment and so on,",
      "en-trans": "namdak gyalwé tenpa jinyé kün"
    },
    {
      "bo": "སྲིད་པའི་མཐར་ཡང་ཡོངས་སུ་རྒྱས་གྱུར་ཅིག །",
      "en": "Continue to flourish and spread even unto the ends of existence!",
      "en-trans": "sipé tar yang yongsu gyé gyur chik"
    },
    {
      "bo": "མཆོག་གསུམ་རྩ་གསུམ་སྲུང་མའི་བྱིན་རླབས་དང༌། །",
      "en": "Through the blessings of the Three Jewels, Three Roots and Dharma Guardians,",
      "en-trans": "chok sum tsa sum sungmé jinlab dang"
    },
    {
      "bo": "ཆོས་ཉིད་རྣམ་དག་ཆོས་ཅན་རྟེན་འབྲེལ་མཐུས། །",
      "en": "And through the power of the pure dharmatā and phenomenal interdependence,",
      "en-trans": "chönyi namdak chöchen tendrel tü"
    },
    {
      "bo": "བདག་གི་ཡིད་ལ་སྨོན་པའི་རེ་འབྲས་ཀུན། །",
      "en": "May all the hopes and aspirations within my mind—",
      "en-trans": "dak gi yi la mönpé ré dré kün"
    },
    {
      "bo": "མ་ལུས་ཡོངས་སུ་འགྲུབ་པར་མཛད་དུ་གསོལ། །",
      "en": "Each and every one of them—be perfectly fulfilled, I pray!",
      "en-trans": "malü yongsu drubpar dzé du sol"
    }
  ]
}