{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/lala-sonam-chodrup/eight-thoughts-of-great-beings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཐེག་པ་ཆེན་པོའི་གཞུང་ལམ་སྐྱེས་བུ་ཆེན་པོའི་རྣམ་རྟོག་བརྒྱད་ཀྱི་སྨོན་ལམ་བཞུགས།",
    "en": "Prayer of Aspiration Incorporating the Eight Thoughts of Great Beings Who Follow the Way of the Mahāyāna"
  },
  "text": [
    {
      "bo": "བདག་ནི་ནམ་ཞིག་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །",
      "en": "In time, may I eliminate all the sufferings",
      "en-trans": "dak ni nam zhik semchen tamche kyi"
    },
    {
      "bo": "སྡུག་བསྔལ་མ་ལུས་སེལ་བར་བྱ་སྙམ་དང་། །",
      "en": "Of each and every living being!",
      "en-trans": "dukngal malü selwar ja nyam dang"
    },
    {
      "bo": "ནམ་ཞིག་དབུལ་བས་ཉེན་པའི་སེམས་ཅན་རྣམས། །",
      "en": "In time, may I be able to bring those afflicted by poverty",
      "en-trans": "namzhik ulwé nyenpé semchen nam"
    },
    {
      "bo": "འབྱོར་བ་ཆེན་པོའི་གནས་ལ་འཇོག་ནུས་སྙམ། །",
      "en": "To great wealth and affluence!",
      "en-trans": "jorwa chenpö né la jok nü nyam"
    },
    {
      "bo": "དེ་བཞིན་གེགས་མེད་ཡོངས་སུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May these aspirations be perfectly fulfilled without obstacle!",
      "en-trans": "dé zhin gekmé yongsu drub gyur chik"
    },
    {
      "bo": "ནམ་ཞིག་ཤ་ཁྲག་དང་བཅས་ལུས་འདི་ཡིས། །",
      "en": "In time, may this body of flesh and blood",
      "en-trans": "namzhik sha trak dang ché lü di yi"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་གྱི་དོན་བྱེད་ནུས་ན་སྙམ། །",
      "en": "Bring benefit to all living beings!",
      "en-trans": "semchen kun gyi dön ché nü na nyam"
    },
    {
      "bo": "ནམ་ཞིག་དམྱལ་བར་ཡུན་རིང་གནས་ནས་ཀྱང་། །",
      "en": "In time, even if I must remain for long within the hells,",
      "en-trans": "namzhik nyalwar yün ring né né kyang"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་དོན་བྱེད་ནུས་སྙམ་པ་སོགས། །",
      "en": "May I be able to bring benefit to all sentient beings!",
      "en-trans": "semchen kun dön ché nü nyampa sok"
    },
    {
      "bo": "དེ་བཞིན་གེགས་མེད་ཡོངས་སུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May these aspirations be perfectly fulfilled without obstacle!",
      "en-trans": "dé zhin gekmé yongsu drub gyur chik"
    },
    {
      "bo": "ནམ་ཞིག་འཇིག་རྟེན་དང་ནི་འཇིག་རྟེན་ལས། །",
      "en": "In time, with great worldly",
      "en-trans": "namzhik jikten dang ni jikten lé"
    },
    {
      "bo": "འདས་པའི་འབྱོར་པ་ཆེན་པོས་སེམས་ཅན་གྱི། །",
      "en": "And supramundane wealth,",
      "en-trans": "depé jorwa chenpö semchen gyi"
    },
    {
      "bo": "རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ནུས་སྙམ། །",
      "en": "May I be able to fulfil entirely the wishes of living beings!",
      "en-trans": "rewa yong su dzokpar ché nü nyam"
    },
    {
      "bo": "དེ་བཞིན་གེགས་མེད་ཡོངས་སུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May this aspiration be perfectly fulfilled without obstacle!",
      "en-trans": "dé zhin gekmé yongsu drub gyur chik"
    },
    {
      "bo": "ནམ་ཞིག་སངས་རྒྱས་ཉིད་དུ་གྱུར་ནས་ནི། །",
      "en": "In time, having become awakened,",
      "en-trans": "namzhik sangyé nyi du gyur né ni"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་གྱི་སྡུག་བསྔལ་ངེས་པ་རུ། །",
      "en": "May I be able to deliver all beings from suffering!",
      "en-trans": "semchen kun gyi dukngal ngepa ru"
    },
    {
      "bo": "འབྱིན་པར་བྱེད་ནུས་སྙམ་སོགས་གེགས་མེད་དུ། །",
      "en": "May this come to pass without obstacle,",
      "en-trans": "jinpar ché nü nyam sok gekmé du"
    },
    {
      "bo": "གྲུབ་ནས་འགྲོ་དོན་དཔག་མེད་འབྱུང་བར་ཤོག །",
      "en": "And bring unfathomable benefit and well-being!",
      "en-trans": "drub né dro dön pakmé jungwar shok"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་ལ་ཕན་པ་མི་བྱེད་པའི། །",
      "en": "Being reborn in a way that brings no benefit to all,",
      "en-trans": "semchen kun la penpa mi chépé"
    },
    {
      "bo": "སྐྱེ་བ་དང་ནི་དོན་དམ་སྟོང་ཉིད་ཀྱི། །",
      "en": "Or relishing the experience of the ultimate, emptiness,",
      "en-trans": "kyewa dang ni döndam tongnyi kyi"
    },
    {
      "bo": "རོ་ལ་སྤྱོད་ཅིང་ལམ་གྱི་ཐབས་འགོག་པ། །",
      "en": "So that the methods of the path are interrupted—",
      "en-trans": "ro la chö ching lam gyi tab gokpa"
    },
    {
      "bo": "དེ་སོགས་ཐབས་ཤེས་ཡ་བྲལ་མ་གྱུར་ཅིག །",
      "en": "May skilful means and wisdom never part ways like this!",
      "en-trans": "dé sok tab shé ya dral ma gyur chik"
    },
    {
      "bo": "སྐྱེ་བོ་ཐམས་ཅད་ཚིམ་པར་མི་བྱེད་པའི། །",
      "en": "Throughout all my lives,",
      "en-trans": "kyewo tamché tsimpar mi chépé"
    },
    {
      "bo": "ཚིག་དང་གཞན་ལ་ཕན་པར་མི་བྱེད་པའི། །",
      "en": "May I never take delight",
      "en-trans": "tsik dang zhen la penpar mi chépé"
    },
    {
      "bo": "འཚོ་བ་དང་ནི་ལུས་དང་ཤེས་རབ་དང་། །",
      "en": "In words that fail to satisfy beings,",
      "en-trans": "tsowo dang ni lü dang sherab dang"
    },
    {
      "bo": "ནོར་དང་དབང་ཕྱུག་དང་ལྡན་གཞན་དག་ལ། །",
      "en": "Or in ways of life, physical forms, intelligence,",
      "en-trans": "nor dang wangchuk dang den zhen dak la"
    },
    {
      "bo": "གནོད་པར་བྱེད་པ་དག་ལ་དགའ་བྱེད་པ། །",
      "en": "Wealth or power that fail to benefit others,",
      "en-trans": "nöpar chépa dak la ga chépa"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་དེ་འདྲ་མ་གྱུར་ཅིག །",
      "en": "Or in those who cause others harm.",
      "en-trans": "tserab kun tu dendra ma gyur chik"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་གྱི་སྡིག་པའི་འབྲས་བུ་ཀུན། །",
      "en": "May all the results of all the negative actions of all sentient beings",
      "en-trans": "semchen kun gyi dikpé drebu kun"
    },
    {
      "bo": "བདག་ལ་སྨིན་ཅིང་བདག་གི་དགེ་བའི་འབྲས། །",
      "en": "Ripen on me alone, and may all the results of my virtue",
      "en-trans": "dak la min ching dak gi gewé dré"
    },
    {
      "bo": "འགྲོ་བ་སེམས་ཅན་ཀུན་ལ་སྨིན་གྱུར་ནས། །",
      "en": "Ripen on all living beings!",
      "en-trans": "drowa semchen kun la min gyur né"
    },
    {
      "bo": "ཀུན་ཀྱང་སྐུ་གསུམ་འབྲས་བུ་ཐོབ་པར་ཤོག །",
      "en": "And may all these beings attain the fruition of the three buddha-kāyas!",
      "en-trans": "kun kyang ku sum drebu tobpar shok"
    },
    {
      "bo": "མཆོག་གསུམ་བདེན་པ་བསླུ་བ་མེད་པ་དང་། །",
      "en": "Through the infallible truth of the supreme Three Jewels,",
      "en-trans": "chok sum denpa luwa mepa dang"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་རིན་ཆེན་བྱང་ཆུབ་སེམས། །",
      "en": "And through the inconceivable force of love, compassion and jewel-like bodhicitta,",
      "en-trans": "jam dang nyingjé rinchen chang chub sem"
    },
    {
      "bo": "ཟབ་མོའི་བདེན་གཉིས་བསམ་མི་ཁྱབ་པའི་མཐུས། །",
      "en": "As well as the two profound levels of truth,",
      "en-trans": "zabmö den nyi sam mi khyabpé tü"
    },
    {
      "bo": "རང་དོན་བྲལ་བའི་སྨོན་ལམ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May this aspiration that is free from any selfish concern be fulfilled!",
      "en-trans": "rang dön dralwé mönlam drub gyur chik"
    }
  ]
}