{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/entering-city-omniscience",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བདེན་ཚིག་འགྲུབ་པའི་པྲ་ཎི་དྷ་རྣམ་མཁྱེན་གྲོང་འཇུག་ཅེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "An Aspiration Prayer (Praṇidhāna) for Actualizing Words of Truth1"
  },
  "text": [
    {
      "bo": "དངོས་གྲུབ་རྒྱ་མཚོའི་འབྱུང་གནས་བླ་མ་དང་མཆོག་གསུམ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕྱག་འཚལ་ཞིང་སྐྱབས་སུ་མཆིའོ། །",
      "en": "I offer homage to the source of an ocean of accomplishments: the Lamas and the Three Jewels and the bodhisattvas. I take refuge in you:",
      "en-trans": "ngödrub gyatsö jungné lama dang chok sum changchub sempa nam la chaktsal zhing kyab su chi o"
    },
    {
      "bo": "བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Grant your blessings, I pray!",
      "en-trans": "jingyi lab tu sol"
    },
    {
      "bo": "མི་ངའི་སྐྱེ་བ་ནས་ཚེ་རབས་ཐམས་ཅད་དུ་དལ་འབྱོར་བཅོ་བརྒྱད་ཚང་བའི་མི་ལུས་རིན་པོ་ཆེ་ཐོབ་སྟེ་རྗེ་བཙུན་བླ་མ་མཚན་ཉིད་དང་ལྡན་པའི་གདུལ་བྱར་འགྱུར་བར་ཤོག་ཅིག",
      "en": "In all my future lives, may I gain a precious human rebirth complete with all the eighteen freedoms and endowments, and may I become the student of an authentic master!",
      "en-trans": "mi ngé kyewa né tserab tamché du daljor chobgyé tsangwé milü rinpoche tob té jetsün lama tsennyi dang denpé duljar gyurwar shok chik"
    },
    {
      "bo": "མངོན་མཐོ་དང་ངེས་ལེགས་མཐའ་དག་གི་འབྱུང་ཁུངས་ཐོས་བསམ་སྒོམ་གསུམ་གྱིས་རང་རྒྱུད་བཏུལ་ཏེ་རྒྱལ་བའི་བསྟན་པ་རིན་པོ་ཆེའི་རྗེས་སུ་སློབ་པར་ཤོག་ཅིག",
      "en": "Training my mind through study, reflection and meditation, which are the source of higher rebirths and of definite goodness, may I follow the Buddha’s precious teachings!",
      "en-trans": "ngön to dang ngelek tadak gi jungkhung tö sam gom sum gyi ranggyü tul té gyalwé tenpa rinpoche jesu lobpar shok chik"
    },
    {
      "bo": "ཆོས་ལ་འཇུག་པའི་རྩ་བ་ངེས་འབྱུང་དང་བློ་ལྡོག་རྣམ་པ་བཞི་རྒྱུད་ལ་ངམ་ངམ་ཤུགས་ཀྱིས་སྐྱེས་ནས་འཁོར་བ་མཐའ་མེད་ཀྱི་བྱ་བ་ལ་བཙོན་དོང་དང་མེ་འོབས་ལྟ་བུར་མཐོང་བར་ཤོག་ཅིག",
      "en": "May renunciation, the root of all dharma practice, and the four thoughts which cause renunciation, arise naturally in my mindstream, and may I see saṃsāra with all its endless activity as a prison or a fiery pit!",
      "en-trans": "chö la jukpé tsawa ngejung dang lo dok nampa zhi gyü la ngam ngam shuk kyi kyé né khorwa tamé kyi jawa la tsön dong dang mé ob tabur tongwar shok chik"
    },
    {
      "bo": "ལས་འབྲས་བསླུ་བ་མེད་པ་ལ་ཡིད་ཆེས་རྙེད་ནས་དགེ་སྡིག་གི་ལས་ཕྲ་མོ་ཙམ་ལ་ཡང་འཇུག་ལྡོག་བྱེད་པར་ཤོག་ཅིག",
      "en": "Gaining confidence in the infallibility of karma, may I strive to undertake even the smallest good deeds and abandon even the slightest harmful actions!",
      "en-trans": "lé dré luwa mepa la yiché nyé né gedik gi lé tramo tsam la yang juk dok jepar shok chik"
    },
    {
      "bo": "གནས་གྲོགས་འདུ་འཛི་རྐྱེན་ངན་ལ་སོགས་པ་བྱང་ཆུབ་བསྒྲུབ་པའི་བར་ཆད་ཀྱི་དབང་དུ་མི་འགྲོ་བར་དཀོན་མཆོག་གསུམ་གྱི་སྐྱབས་འོག་ཏུ་ཚུད་དེ་སྐྱེས་བུ་གསུམ་གྱི་ལམ་ལ་སློབ་པར་ཤོག་ཅིག",
      "en": "Not falling prey to adverse circumstances, busy places, distracting companions, or any other such obstacles on the path to enlightenment, may I take the Three Jewels as my refuge and train in the graduated path for beings of the three levels of spiritual capacity!",
      "en-trans": "né drok dudzi kyen ngen lasokpa changchub drubpé barché kyi wang du midrowar könchok sum gyi kyab oktu tsü dé kyebu sum gyi lam la lobpar shok chik"
    },
    {
      "bo": "བདེ་གཤེགས་ཀུན་འདུས་ཀྱི་ངོ་བོ་བཀའ་དྲིན་ཅན་གྱི་བླ་མ་དམ་པ་ལ་ཐེ་ཚོམ་དང་མཉམ་འགྲོགས་ཀྱི་མི་རུ་བཟུང་བའི་ལོག་ལྟ་སྤངས་ཏེ་སངས་རྒྱས་དངོས་སུ་མཐོང་བར་ཤོག་ཅིག",
      "en": "May I give up all my doubts regarding the master, the embodiment of all the sugatas, and without slipping into the mistaken view of considering them as an equal, may I see him as an actual buddha!",
      "en-trans": "deshek kündü kyi ngowo kadrinchen gyi lama dampa la tetsom dang nyam drok kyi mi ru zungwé lokta pang té sangye ngö su tongwar shok chik"
    },
    {
      "bo": "དེའི་མཐུ་ལས་མཚོན་བྱེད་དཔེའི་དབང་བཞིས་སྒོ་གསུམ་སྨིན་པར་བྱས་ཏེ་རྨད་བྱུང་རྡོ་རྗེ་ཐེག་པའི་གསེང་ལམ་ལ་འཇུག་པར་ཤོག་ཅིག",
      "en": "In this way, may my body, speech and mind be matured through the four empowerments, and so may I embark upon the path of the wondrous vajra vehicle!",
      "en-trans": "dé tu lé tsönjé pé wang zhi go sum minpar jé té mejung dorjé tekpé seng lam la jukpar shok chik"
    },
    {
      "bo": "གསོལ་འདེབས་དང་མོས་གུས་ཀྱི་མཚམས་སྦྱོར་ལམ་དུ་ལོངས་ནས་མཚོན་བྱ་དོན་གྱི་དགོངས་བརྒྱུད་བདག་ལ་འཕོས་ཏེ་རྟོགས་པ་ནམ་མཁའ་དང་མཉམ་པར་ཤོག་ཅིག",
      "en": "Through the medium of fervent prayer and devotion, may the wisdom of the lineage be transferred into me, and may my realization become equal to space!",
      "en-trans": "soldeb dang mögü kyi tsam jor lam du long né tsönja dön gyi gonggyü dak la pö té tokpa namkha dang nyampar shok chik"
    },
    {
      "bo": "བསྐྱེད་པ་མ་ཧཱ་ཡོ་གའི་ཉམས་ལེན་མཐར་ཕྱིན་ནས་སྣོད་བཅུད་དཀྱིལ་འཁོར་གསུམ་དུ་ཤེས་ཤིང་རིག་འཛིན་རྣམ་པ་བཞིའི་ས་ལ་བགྲོད་པ་རྒྱལ་སྲས་པདྨ་དང་བི་མ་ལ་ལྟ་བུར་འགྱུར་བར་ཤོག་ཅིག",
      "en": "Perfecting the mahāyoga practices of the generation stage, may I come to perceive the whole universe and beings as the three maṇḍalas and traverse the four levels of a vidyādhara, just like the buddha’s heirs Padmasambhava and Vimalamitra!",
      "en-trans": "kyepa mahayogé nyamlen tarchin né nöchü kyilkhor sum du shé shing rigdzin nampa zhi sa la dröpa gyalsé pema dang bimala tabur gyurwar shok chik"
    },
    {
      "bo": "ལུང་ཨ་ནུ་ཡོ་གའི་ཉམས་ལེན་མཐར་ཕྱིན་ནས་འཁོར་འདས་ཀྱི་འཛིན་རྟོག་བདེ་སྟོང་གཉིས་སུ་མེད་པའི་ངོ་བོར་སངས་རྒྱས་ཏེ་འོག་མིན་སྟུག་པོ་བཀོད་པའི་ཞིང་ཁམས་ལ་དབང་སྒྱུར་བར་ཤོག་ཅིག",
      "en": "Perfecting the practice of anuyoga, may all concepts of saṃsāra and nirvāṇa be purified into the state of indivisible bliss and emptiness, and may I experience the pure realm of Akaniṣṭha!",
      "en-trans": "lung anuyogé nyamlen tarchin né khordé kyi dzin tok detong nyisu mepé ngowor sangye té womin tukpo köpé zhingkham la wang gyurwar shok chik"
    },
    {
      "bo": "རྫོགས་ཆེན་ཨ་ཏི་ཡོ་གའི་ཉམས་ལེན་མཐར་ཕྱིན་ནས་ཆོས་ཅན་གྱི་སྣང་བ་ཆོས་ཉིད་ཀྱི་ཀློང་དུ་ཟད་ནས་གཞོན་ནུ་བུམ་སྐུར་གྲོལ་བ་རིག་འཛིན་དགའ་རབ་རྡོ་རྗེ་ལྟ་བུར་འགྱུར་བར་ཤོག་ཅིག",
      "en": "Perfecting the atiyoga practice of Dzogpachenpo, may all experience dissolve into the expanse of intrinsic reality, and may I be liberated into the youthful vase body, just like the vidyādhara Garab Dorje!",
      "en-trans": "dzogchen atiyogé nyamlen tarchin né chöchen gyi nangwa chönyi kyi long du zé né zhönnu bumkur drolwa rigdzin garab dorjé tabur gyurwar shok chik"
    },
    {
      "bo": "མདོར་ན་བདག་གིས་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ལ་བསླབ་པ་ནས་བཟུང་སྟེ་སྒོ་གསུམ་གྱིས་བྱ་བ་ཅི་བགྱིས་པ་ཐམས་ཅད་ཕ་མ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་འགྱུར་བར་ཤོག་ཅིག",
      "en": "In short, beginning with the training in the conduct of the bodhisattvas, may whatever I do, with body, speech or mind, bring nothing but benefit to all sentient beings, my very own parents!",
      "en-trans": "dorna dak gi changchub kyi chöpa la labpa né zung té go sum gyi jawa chi gyipa tamché pama semchen tamché kyi döndu gyurwar shok chik"
    },
    {
      "bo": "དུས་དང་རྣམ་པ་ཐམས་ཅད་དུ་དམ་པའི་ཆོས་མ་ཡིན་པའི་འཇིག་རྟེན་མཐུན་འཇུག་གི་བསམ་པ་སྐད་ཅིག་མ་ཙམ་ཡང་སེམས་ལ་མི་སྐྱེ་བར་ཤོག་ཅིག",
      "en": "Whatever my situation or circumstance, may I never feel the slightest wish to follow worldly ways, which run contrary to the Dharma!",
      "en-trans": "dü dang nampa tamché du dampé chö mayinpé jikten tün juk gi sampa kechikma tsam yang sem la mikyewar shok chik"
    },
    {
      "bo": "གལ་ཏེ་ལས་དང་བག་ཆགས་དབང་བཙན་པར་གྱུར་ནས་ཕྱིན་ཅི་ལོག་གི་བློ་སྐྱེས་ནའང་དེ་ཉིད་མི་འགྲུབ་པར་ཤོག་ཅིག",
      "en": "Even if, whilst under the sway of karma and habitual patterns, a mistaken thought occurs to me, may it never be successful!",
      "en-trans": "galté lé dang bakchak wang tsenpar gyur né chin chi lok gi lo kyé na ang denyi midrubpar shok chik"
    },
    {
      "bo": "གཞན་དོན་དུ་འགྱུར་ན་ལུས་སྲོག་འདོར་བ་ལ་ཡང་ཉམ་ང་མེད་པར་གཞོན་ནུ་དོན་གྲུབ་ལྟ་བུར་འགྱུར་བར་ཤོག་ཅིག",
      "en": "For the sake of others, may I be fearless and ready even to give up my life, just like Prince Siddhārtha!",
      "en-trans": "zhendön du gyur na lü sok dorwa la yang nyam ngamé par zhönnu döndrub tabur gyurwar shok chik"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་ཀྱི་ས་ལ་ཕྱིན་ནས་ཁམས་གསུམ་འཁོར་བའི་རྒྱ་མཚོ་དོང་ནས་སྤྲུགས་ནུས་པ་སྟོབས་བཅུ་མི་འཇིགས་རྣམ་བཞིའི་རྩལ་ཅན་དུ་གྱུར་ཅིག",
      "en": "Having reached the state of spontaneously accomplishing the benefit of self and others, may I stir the depths of the ocean of saṃsāra’s three worlds by means of the ten strengths and four fearlessnesses!",
      "en-trans": "dön nyi lhündrub kyi sa la chin né kham sum khorwé gyatso dong né truk nüpa tob chu mijik nam zhi tsalchen du gyur chik"
    },
    {
      "bo": "འདོད་པ་དང་བྲལ་བའི་སྨོན་ལམ་དེ་ལྟ་བུ་ཡོངས་སུ་འགྲུབ་པའི་མཐུན་འགྱུར་མཛད་པར་རྒྱལ་བ་སྲས་བཅས་རྣམས་ཀྱིས་ཞལ་གྱིས་བཞེས་པ་ཡིན་ནོ། །",
      "en": "The buddhas and bodhisattvas have vowed to work towards the accomplishment of unselfish aspiration prayers such as these.",
      "en-trans": "döpa dang dralwé mönlam detabu yongsu drubpé tün gyur dzepar gyalwa sé ché nam kyi zhal gyi zhepa yin no"
    },
    {
      "bo": "དྲང་སྲོང་བདེན་པར་སྨྲ་བ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the sages who proclaim the truth!",
      "en-trans": "drangsong denpar mawa nam la chaktsal lo"
    },
    {
      "bo": "དགེ་བ་སྟོབས་ཆེ་བར་གྱུར་ཅིག",
      "en": "May the strength of virtue increase!",
      "en-trans": "gewa tob chewar gyur chik"
    },
    {
      "bo": "སྨོན་ལམ་མཐུ་བཙན་པར་གྱུར་ཅིག",
      "en": "May the power of aspiration grow!",
      "en-trans": "mönlam tutsenpar gyur chik"
    },
    {
      "bo": "སྡིག་པ་འདག་སྐྱེན་པར་གྱུར་ཅིག",
      "en": "May negativity be swiftly purified!",
      "en-trans": "dikpa dak kyenpar gyur chik"
    }
  ]
}