{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/guhyagarbha-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངེས་གསང་བསྟན་པ་རྒྱས་པའི་སྨོན་ལམ།",
    "en": "Aspiration for the Spread of the Guhyagarbha Teachings"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti.",
      "en-trans": "om swati"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་ཀུན་གྱི་དགོངས་པའི་མཐིལ། །",
      "en": "Fundamental realization of all the victorious ones of the three times,",
      "en-trans": "dü sum gyalwa kün gyi gongpé til"
    },
    {
      "bo": "ནང་རྒྱུད་ཐེག་པའི་ཡང་བཅུད་སྒྱུ་འཕྲུལ་ཆེ། །",
      "en": "Quintessence of the inner tantric vehicles, great Magical Illusion,",
      "en-trans": "nang gyü tekpé yang chü gyutrul ché"
    },
    {
      "bo": "དཔལ་ལྡན་གསང་བའི་སྙིང་པོའི་རྒྱུད་ཀྱི་དོན། །",
      "en": "The real meaning of the glorious Secret Essence tantra—",
      "en-trans": "palden sangwé nyingpö gyü kyi dön"
    },
    {
      "bo": "བཤད་དང་སྒྲུབ་པས་ས་སྟེང་ཁྱབ་གྱུར་ཅིག །",
      "en": "May its study and practice spread throughout the world!",
      "en-trans": "shé dang drubpé sateng khyab gyur chik"
    },
    {
      "bo": "བདེན་གཉིས་དབྱེར་མེད་ཆོས་སྐུའི་དོན་རྟོགས་ཤིང་། །",
      "en": "May we realize the meaning of the dharmakāya, the two truths indivisible,",
      "en-trans": "den nyi yermé chökü dön tok shing"
    },
    {
      "bo": "དག་མཉམ་ཆེན་པོའི་ཏིང་འཛིན་རོལ་མོ་འཁྲོལ། །",
      "en": "May the music of the samādhi of great purity and equalness resound,",
      "en-trans": "dak nyam chenpö tingdzin rolmo trol"
    },
    {
      "bo": "ལམ་གྱུར་རིག་འཛིན་རྣམ་བཞིའི་འབྲས་བུ་བརྙེས། །",
      "en": "May we gain the results of the path, the four levels of a vidyādhara,",
      "en-trans": "lam gyur rigdzin nam zhi drebu nyé"
    },
    {
      "bo": "རྡོ་རྗེ་སེམས་དཔའི་རྒྱལ་ས་ཐོབ་གྱུར་ཅིག །",
      "en": "And may we ultimately attain the sovereign domain of Vajrasattva!",
      "en-trans": "dorjé sempé gyalsa tob gyur chik"
    },
    {
      "bo": "རྒྱུད་ཀྱི་རྒྱལ་པོའི་ཆོས་ཉིད་བདེན་སྟོབས་ཀྱིས། །",
      "en": "Through the power of the natural truth of this, the king of tantras,",
      "en-trans": "gyü kyi gyalpö chönyi den tob kyi"
    },
    {
      "bo": "ནག་ཕྱོགས་དུས་ཀྱི་རྒུད་པ་ཀུན་ཞི་ཞིང་། །",
      "en": "May all the faults and failings of these evil times be pacified,",
      "en-trans": "nakchok dü kyi güpa kün zhi zhing"
    },
    {
      "bo": "རྒྱལ་བསྟན་སྤྱི་དང་ངེས་གསང་སྙིང་པོ་ཡི། །",
      "en": "And may all be auspicious for the teachings of Buddhism in general",
      "en-trans": "gyalten chi dang ngé sang nyingpo yi"
    },
    {
      "bo": "བསྟན་པ་དར་ཞིང་རྒྱས་པའི་བཀྲ་ཤིས་ཤོག །",
      "en": "And this definitive Secret Essence in particular to spread far and wide!",
      "en-trans": "tenpa dar zhing gyepé tashi shok"
    }
  ]
}