{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/gaton-ngawang-lekpa/heart-of-mahayana-path",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐེག་ཆེན་ལམ་གྱི་སྙིང་པོ་བཞུགས།",
    "en": "A Bodhisattva’s Prayer of Aspiration"
  },
  "text": [
    {
      "bo": "རབ་འབྱམས་ཕྱོགས་བཅུའི་རྒྱལ་བ་སྲས་དང་བཅས། །",
      "en": "Victorious buddhas and your heirs throughout the infinite worlds of the ten directions,",
      "en-trans": "rabjam chok chü gyalwa sé dangché"
    },
    {
      "bo": "དུས་གསུམ་དྲང་སྲོང་གྲུབ་པ་རིག་འཛིན་སོགས། །",
      "en": "Together with all you sages, siddhas and vidyādharas of the past, present and future—",
      "en-trans": "dü sum drangsong drubpa rigdzin sok"
    },
    {
      "bo": "མཐུ་ལྡན་ཐུགས་རྗེ་ཅན་རྣམས་བདག་ལ་དགོངས། །",
      "en": "All you powerful and compassionate ones, turn your attention towards me,",
      "en-trans": "tuden tukjé chen nam dak la gong"
    },
    {
      "bo": "སྨོན་ལམ་ཡིད་བཞིན་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And grant your blessings so that these aspirations of mine may be fulfilled!",
      "en-trans": "mönlam yizhin drubpar jingyi lob"
    },
    {
      "bo": "རང་གཞན་འཁོར་འདས་དགེ་བ་མ་ལུས་དང་། །",
      "en": "All my own and others’ virtuous deeds in saṃsāra and nirvāṇa,",
      "en-trans": "rangzhen khordé gewa malü dang"
    },
    {
      "bo": "ལུས་དང་ལོངས་སྤྱོད་མཆོད་འོས་དངོས་པོ་རྣམས། །",
      "en": "Together with my body, possessions and whatever is worthy of giving,",
      "en-trans": "lü dang longchö chö ö ngöpo nam"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་འཕགས་ཚོགས་ཐམས་ཅད་ལ། །",
      "en": "I offer in devotion, with respect and pure motivation,",
      "en-trans": "lama yidam pak tsok tamché la"
    },
    {
      "bo": "དད་གུས་བསམ་པ་དག་པས་མཆོད་པར་བགྱི། །",
      "en": "To all you gurus,yidamdeities and the noble assembly!",
      "en-trans": "dé gü sampa dakpé chöpar gyi"
    },
    {
      "bo": "དེ་དག་སྤྱན་སྔར་ཀུན་བཟང་མཆོད་པའི་སྤྲིན། །",
      "en": "Before you all, these vast offering clouds of Samantabhadra",
      "en-trans": "dedak chen ngar kunzang chöpé trin"
    },
    {
      "bo": "བསམ་ཡས་མཁའ་ཁྱབ་སྲིད་པའི་མཐར་གནས་པ། །",
      "en": "Multiply beyond imagining and extend to the very limits of existence.",
      "en-trans": "samyé khakhyab sipé tar nepa"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་དབང་གིས་བཞེས་པའི་མཐུས། །",
      "en": "As you accept them by means of your wisdom, love and power,",
      "en-trans": "khyen tsé nü pé wang gi zhepé tü"
    },
    {
      "bo": "དྲི་མེད་དགོངས་པ་མཐའ་དག་རྫོགས་གྱུར་ཅིག །",
      "en": "May your immaculate intentions be entirely fulfilled!",
      "en-trans": "drimé gongpa tadak dzok gyur chik"
    },
    {
      "bo": "ཐུབ་པའི་བསྟན་དང་བསྟན་འཛིན་དམ་པ་དང་། །",
      "en": "May the Buddhist teachings and noble holders of the doctrine,",
      "en-trans": "tubpé ten dang tendzin dampa dang"
    },
    {
      "bo": "དཀར་ཕྱོགས་སྐྱོང་བའི་སྲུང་མ་རྒྱ་མཚོའི་ཚོགས། །",
      "en": "As well as the oceanic hosts of guardians who protect the virtuous,",
      "en-trans": "karchok kyongwé sungma gyatsö tsok"
    },
    {
      "bo": "མཐུ་སྟོབས་ཕྱོགས་མཐའ་ཁྱབ་པར་འཕེལ་བ་ལས། །",
      "en": "All strengthen and flourish, extending to the limits of space itself,",
      "en-trans": "tutob chok ta khyabpar pelwa lé"
    },
    {
      "bo": "སྐྱེ་རྒུའི་དགེ་ལེགས་རྟག་ཏུ་རྒྱས་གྱུར་ཅིག །",
      "en": "And through this, may beings' virtue and goodness forever increase!",
      "en-trans": "kyegü gelek taktu gyé gyur chik"
    },
    {
      "bo": "དེ་ལྟར་བསྔོས་པའི་ལེགས་སྤྱད་འབྲས་བཅས་ཀྱིས། །",
      "en": "Through this excellent practice of dedication and its effects,",
      "en-trans": "detar ngöpé lek ché dré ché kyi"
    },
    {
      "bo": "མཁའ་མཉམ་འགྲོ་བའི་རེ་བ་རྫོགས་གྱུར་ཏེ། །",
      "en": "May the hopes of all beings everywhere be realised,",
      "en-trans": "khanyam drowé rewa dzok gyur té"
    },
    {
      "bo": "ཟས་གོས་ལོངས་སྤྱོད་བྲན་གྲོགས་གནས་སྐྱབས་སོགས། །",
      "en": "So that they receive food, clothing, possessions, service, companions, sanctuary and more—",
      "en-trans": "zegö longchö dren drok né kyab sok"
    },
    {
      "bo": "གང་འདོད་དྲན་པ་ཙམ་གྱིས་འགྲུབ་གྱུར་ཅིག །",
      "en": "Whatever they wish for—by simply bringing it to mind!",
      "en-trans": "gang dö drenpa tsam gyi drub gyur chik"
    },
    {
      "bo": "ཁྱད་པར་བདག་ལ་ཕན་དང་གནོད་བྱེད་པའི། །",
      "en": "In particular, may those with whom I have a positive or negative connection,",
      "en-trans": "khyepar dak la pen dang nöjé pé"
    },
    {
      "bo": "དཀར་ནག་ལས་ཀྱིས་འབྲེལ་བའི་སེམས་ཅན་དང་། །",
      "en": "Those who act in ways that bring me benefit or harm,",
      "en-trans": "karnak lé kyi drelwé semchen dang"
    },
    {
      "bo": "ངན་འགྲོའི་གནས་སུ་ཉམ་ཐག་གྱུར་པ་རྣམས། །",
      "en": "As well as all those who are exhausted by the torments of the lower realms,",
      "en-trans": "ngendrö né su nyamtak gyurpa nam"
    },
    {
      "bo": "ཟག་མེད་བདེ་ཆེན་མྱུར་དུ་ཐོབ་གྱུར་ཅིག །",
      "en": "Swiftly come to find great bliss that is inexhaustible!",
      "en-trans": "zakmé dechen nyurdu tob gyur chik"
    },
    {
      "bo": "མདོར་ན་དུས་གསུམ་དགེ་ཚོགས་མ་ལུས་ཀུན། །",
      "en": "In short, by dedicating all virtuous actions from the past, present or future,",
      "en-trans": "dorna dü sum gé tsok malü kün"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བས་ཇི་ལྟར་བསྔོས་པ་བཞིན། །",
      "en": "In the manner of the victorious buddhas and their heirs,",
      "en-trans": "sé ché gyalwé jitar ngöpa zhin"
    },
    {
      "bo": "དམིགས་མེད་སྒྱུ་མའི་ཚུལ་དུ་ཡོངས་བསྔོ་བས། །",
      "en": "Without conceptual reference and in keeping with illusion,",
      "en-trans": "mikmé gyumé tsul du yong ngowé"
    },
    {
      "bo": "འགྲོ་ཀུན་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་གྱུར་ཅིག །",
      "en": "May all beings attain perfect awakening!",
      "en-trans": "dro kün dzokpé changchub tob gyur chik"
    },
    {
      "bo": "ཅི་སྲིད་དེ་མ་ཐོབ་ཀྱི་སྲིད་པར་ཡང་། །",
      "en": "For as long as I am yet to reach that final stage,",
      "en-trans": "chi si dé ma tob kyi sipar yang"
    },
    {
      "bo": "ཡོན་ཏན་བདུན་ལྡན་ལྷ་མིའི་ལུས་ཐོབ་ནས། །",
      "en": "May I gain a human or divine birth complete with seven qualities,1",
      "en-trans": "yönten dünden lhami lü tob né"
    },
    {
      "bo": "རྨད་བྱུང་འཕགས་པའི་ནོར་ལ་དབང་འབྱོར་ཞིང་། །",
      "en": "And may I possess the wondrous riches of the noble,",
      "en-trans": "mejung pakpé nor la wangjor zhing"
    },
    {
      "bo": "བསླུ་མེད་དཀོན་མཆོག་སྐྱབས་སུ་བརྟེན་གྱུར་ཅིག །",
      "en": "And rely on the infallible precious jewels as my refuge!",
      "en-trans": "lumé könchok kyab su ten gyur chik"
    },
    {
      "bo": "མཚན་ལྡན་བཤེས་གཉེན་ཚུལ་བཞིན་མཉེས་བྱས་ཏེ། །",
      "en": "May I follow and gratify an authentic spiritual teacher,",
      "en-trans": "tsenden shenyen tsulzhin nyé jé té"
    },
    {
      "bo": "ཚུལ་གནས་ཐོས་བསམ་སྒོམ་ལ་རབ་སྦྱོར་ཞིང་། །",
      "en": "Observe the discipline and apply myself to study, reflection and meditation,",
      "en-trans": "tsul né tö sam gom la rab jor zhing"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དང་ནམ་ཡང་མི་འབྲལ་བར། །",
      "en": "May I never be apart from bodhicitta, the spirit of awakening,",
      "en-trans": "changchub sem dang namyang mi dralwar"
    },
    {
      "bo": "རྒྱལ་སྲས་སྤྱོད་པ་རྒྱ་མཚོར་འཇུག་པར་ཤོག །",
      "en": "As I immerse myself in the oceanic conduct of the Buddha’s heirs!",
      "en-trans": "gyalsé chöpa gyatsor jukpar shok"
    },
    {
      "bo": "དེ་ཚེ་སོ་ཐར་བྱང་སེམས་རིག་འཛིན་གྱི། །",
      "en": "May any stains on my conduct, misdeeds of body, speech or mind,",
      "en-trans": "detsé sotar changsem rigdzin gyi"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་པའི་ཚུལ་དང་མི་མཐུན་པའི། །",
      "en": "Any failure to accord with the view, meditation and action",
      "en-trans": "ta gom chöpé tsul dang mitünpé"
    },
    {
      "bo": "སྒོ་གསུམ་ཉེས་པར་སྤྱོད་པའི་དྲི་མ་རྣམས། །",
      "en": "Of the vidyādharas, or the code of individual liberation or bodhisattva vows,",
      "en-trans": "go sum nyepar chöpé drima nam"
    },
    {
      "bo": "ཕུལ་བྱུང་གཉེན་པོས་རྩད་ནས་འཇོམས་གྱུར་ཅིག །",
      "en": "Be eradicated entirely through applying the most excellent of remedies!",
      "en-trans": "puljung nyenpö tsené jom gyur chik"
    },
    {
      "bo": "གནས་སྐབས་ཀུན་ཏུ་ཚེ་རབས་དྲན་གྱུར་ནས། །",
      "en": "In all situations, may I entirely recall my past lives,",
      "en-trans": "nekab küntu tserab dren gyur né"
    },
    {
      "bo": "རྣམ་དག་ལམ་ལ་བརྩོན་པས་སློབ་པ་དང་། །",
      "en": "And train with diligence in the utterly pure path.",
      "en-trans": "namdak lam la tsönpé lobpa dang"
    },
    {
      "bo": "རབ་འབྱམས་རྒྱལ་བའི་ཆོས་ཚུལ་མ་ལུས་པ། །",
      "en": "May I always uphold the infinite ways of the Dharma",
      "en-trans": "rabjam gyalwé chö tsul malüpa"
    },
    {
      "bo": "ཉམས་པ་མེད་པར་རྟག་ཏུ་འཛིན་གྱུར་ཅིག །",
      "en": "Of the victorious buddhas and never allow them to decline.",
      "en-trans": "nyampa mepar taktu dzin gyur chik"
    },
    {
      "bo": "རྟག་ཏུ་འབྲས་བུའི་ཐེག་པ་མཐའ་དག་གི །",
      "en": "May I always realise the points of the profound and vast,",
      "en-trans": "taktu drebü tekpa tadak gi"
    },
    {
      "bo": "ཟབ་དང་རྒྱ་ཆེའི་དོན་ཀུན་མངོན་གྱུར་ནས། །",
      "en": "Which are conveyed in all the resultant vehicles,",
      "en-trans": "zab dang gyaché dön kün ngöngyur né"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་བགྲོད་པ་མཐར་ཕྱིན་ཏེ། །",
      "en": "And fully traverse the paths and stages,",
      "en-trans": "sa dang lam gyi dröpa tarchin té"
    },
    {
      "bo": "སྤངས་རྟོགས་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་ཤོག །",
      "en": "So that I perfect the qualities of abandonment and realization!",
      "en-trans": "pang tok yönten yongsu dzokpar shok"
    },
    {
      "bo": "སྐྱེ་བ་འདི་དང་མ་འོངས་སྲིད་པར་བདག །",
      "en": "In this and all my future lives,",
      "en-trans": "kyewa di dang ma ong sipar dak"
    },
    {
      "bo": "གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར། །",
      "en": "No matter where I might take birth,",
      "en-trans": "gang dang gangdu kyewa dé dang der"
    },
    {
      "bo": "གཅིག་ཏུ་གཞན་ལ་ཕན་པའི་བསམ་སྦྱོར་དང་། །",
      "en": "May I never deviate, even for a moment,",
      "en-trans": "chik tu zhen la penpé samjor dang"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་འབྲལ་བར་མ་གྱུར་ཅིག །",
      "en": "From my singular focus on altruistic thoughts and deeds.",
      "en-trans": "kechik tsam yang dralwar magyur chik"
    },
    {
      "bo": "སྲིད་གསུམ་འགྲོ་བའི་མི་འདོད་མི་མཐུན་ཀུན། །",
      "en": "May all that the inhabitants of the three worlds find undesirable or unharmonious,",
      "en-trans": "si sum drowé mindö mitün kün"
    },
    {
      "bo": "རྒྱུ་དང་འབྲས་བཅས་བདག་ལ་རབ་སྨིན་ཅིང་། །",
      "en": "Both the causes and their effects, all ripen fully on me alone!",
      "en-trans": "gyu dang dré ché dak la rab min ching"
    },
    {
      "bo": "བདག་གི་དུས་གསུམ་དགེ་བ་མ་ལུས་པ། །",
      "en": "And may all my own virtuous deeds of past, present and future",
      "en-trans": "dak gi dü sum gewa malüpa"
    },
    {
      "bo": "ལུས་ཅན་ཀུན་གྱི་ཕན་བདེའི་རྒྱུར་གྱུར་ཅིག །",
      "en": "Become causes for the benefit and happiness of incarnate beings!",
      "en-trans": "lüchen kün gyi pendé gyur gyur chik"
    },
    {
      "bo": "དངོས་སམ་བརྒྱུད་ནས་གཞན་དོན་སྒྲུབ་པའི་ཚེ། །",
      "en": "When working directly or indirectly for the welfare of others,",
      "en-trans": "ngö sam gyü né zhendön drubpé tsé"
    },
    {
      "bo": "བདུད་དང་སྡིག་གྲོགས་ནད་གདོན་ལ་སོགས་པ། །",
      "en": "May all outer, inner and secret obstacles, including evil spirits,",
      "en-trans": "dü dang dik drok nedön lasokpa"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་བར་ཆད་མཐའ་དག་ཀྱང་། །",
      "en": "Corrupting companions, illness and harmful influences,",
      "en-trans": "chi nang sangwé barché tadak kyang"
    },
    {
      "bo": "ནགས་མེའི་རླུང་བཞིན་བྱང་ཆུབ་གྲོགས་གྱུར་ཅིག །",
      "en": "Become supports for awakening, like wind that fans the forest flames!",
      "en-trans": "nakme lung zhin changchub drok gyur chik"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་དག་དང་མ་དག་ཞིང་རྣམས་སུ། །",
      "en": "All at once, may I perfectly embrace",
      "en-trans": "chok chü dak dang ma dak zhing nam su"
    },
    {
      "bo": "སངས་རྒྱས་མཆོད་དང་སེམས་ཅན་སྨིན་པ་ལ། །",
      "en": "The ocean-like activity of the victorious ones and their heirs throughout the three times,",
      "en-trans": "sangye chö dang semchen minpa la"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་སྲས་རྒྱ་མཚོའི་ཕྲིན་ལས་ཀུན། །",
      "en": "Such deeds as making offerings to buddhas and ripening sentient beings",
      "en-trans": "dü sum gyalsé gyatsö trinlé kün"
    },
    {
      "bo": "གཅིག་ཏུ་བསྡུས་པའི་ཕུལ་གྱིས་འཇུག་གྱུར་ཅིག །",
      "en": "In all the pure and impure realms throughout the ten directions.",
      "en-trans": "chik tu düpé pul gyi juk gyur chik"
    },
    {
      "bo": "བླ་མེད་གསང་ཆེན་ལམ་གྱི་སྒོར་ཞུགས་ཏེ། །",
      "en": "Having set out upon the great secret path that is unsurpassed,",
      "en-trans": "lamé sang chen lam gyi gor zhuk té"
    },
    {
      "bo": "སྨིན་གྲོལ་མྱུར་ལམ་ཟབ་མོའི་གནད་རྟོགས་ནས། །",
      "en": "And realized the profound points of the path that swiftly matures and liberates,",
      "en-trans": "mindrol nyurlam zabmö né tok né"
    },
    {
      "bo": "ཐབས་མཁས་ཕྲིན་ལས་རྒྱ་མཚོས་འགྲོ་བ་ཀུན། །",
      "en": "May I lead beings through vast, ocean-like skilful action",
      "en-trans": "tabkhé trinlé gyatsö drowa kün"
    },
    {
      "bo": "རྡོ་རྗེ་འཛིན་པའི་ས་ལ་འགོད་པར་ཤོག །",
      "en": "And establish them all at the level of Vajradhara!",
      "en-trans": "dorjé dzinpé sa la göpar shok"
    }
  ]
}