{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/hevajra-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འདོད་པའི་དོན་ལ་སྨོན་ལམ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཞེས་བྱ་བ་བཞུགས་སོ།  །",
    "en": "An Aspiration Toward Longed-for Aims"
  },
  "text": [
    {
      "bo": "བླ་མ་རྣམས་དང་དཔལ་ལྡན་བིཪྺ་པ།  །",
      "en": "All the gurus, including glorious Virūpa,",
      "en-trans": "lama nam dang palden birwapa"
    },
    {
      "bo": "བརྩེ་བ་ཆེན་པོ་བསོད་ནམས་རྩེ་མོ་དང་།  །",
      "en": "The great benevolent one,1Sonam Tsemo,",
      "en-trans": "tsewa chenpo sönam tsemo dang"
    },
    {
      "bo": "གྲགས་པ་རྒྱལ་མཚན་ས་སྐྱ་པཎྜི་ཏ།  །",
      "en": "Drakpa Gyaltsen, Sakya Paṇḍita,",
      "en-trans": "drakpa gyaltsen sakya pandita"
    },
    {
      "bo": "བློ་གྲོས་རྒྱལ་མཚན་ངོར་ཆེན་ཀུན་དགའ་བཟང་།  །",
      "en": "Lodrö Gyaltsen, Ngorchen Kunga Zangpo,",
      "en-trans": "lodrö gyaltsen ngorchen künga zang"
    },
    {
      "bo": "བློ་གསལ་རྒྱ་མཚོ་མཁྱེན་བརྩེའི་དབང་ཕྱུག་དང་།  །",
      "en": "Losal Gyatso, Khyentse Wangchuk,",
      "en-trans": "losal gyatso khyentsé wangchuk dang"
    },
    {
      "bo": "འཇམ་དབྱངས་མཁྱེན་བརྩེ་བློ་གཏེར་དབང་པོ་སོགས།  །",
      "en": "Jamyang Khyentse, Loter Wangpo and the rest,",
      "en-trans": "jamyang khyentsé loter wangpo sok"
    },
    {
      "bo": "གསུང་ངག་བརྒྱུད་པའི་བླ་མ་ཐམས་ཅད་དང་།  །",
      "en": "All you gurus of the lineage of Lamdré teachings,",
      "en-trans": "sung ngak gyüpé lama tamché dang"
    },
    {
      "bo": "དགྱེས་པ་རྡོ་རྗེ་ལྷ་མོ་བརྒྱད་དང་བཅས།  །",
      "en": "Together with Hevajra and the eight goddesses,",
      "en-trans": "gyepa dorjé lhamo gyé dangché"
    },
    {
      "bo": "མཐུ་སྟོབས་དབང་ཕྱུག་མགོན་པོ་ལྕམ་དྲལ་སོགས།  །",
      "en": "Mighty lord Mahākāla, consort and retinue, and others,",
      "en-trans": "tutob wangchuk gönpo chamdral sok"
    },
    {
      "bo": "བདག་ལ་དགོངས་ཤིང་སྨོན་པའི་གནས་འདི་དག  །",
      "en": "Turn your wise attention towards me, and",
      "en-trans": "dak la gong shing mönpé né didak"
    },
    {
      "bo": "མྱུར་དུ་འགྲུབ་ལ་དཔང་པོར་མཛོད་ཅིག་ཀྱེ།  །",
      "en": "Be a witness to the swift fulfilment of these points of aspiration. Kyé!",
      "en-trans": "nyurdu drub la pangpor dzö chik kyé"
    },
    {
      "bo": "བདག་ནི་བག་མེད་པ་ཡི་དབང་དུ་གྱུར།  །",
      "en": "As I have fallen under the power of carelessness,",
      "en-trans": "dak ni bakmepa yi wang du gyur"
    },
    {
      "bo": "ཆོས་བཞིན་སྤྱོད་ལ་འགལ་རྐྱེན་ཆེས་མང་ཞིང་།  །",
      "en": "My dharmic practice has been beset by adversity,",
      "en-trans": "chö zhin chö la galkyen ché mang zhing"
    },
    {
      "bo": "ཁྱད་པར་ཚུལ་མིན་རྣམ་རྟོག་འཚུབ་མ་ཡིས།  །",
      "en": "And my turbulent, mistaken thoughts in particular",
      "en-trans": "khyepar tsul min namtok tsubma yi"
    },
    {
      "bo": "བདག་རྒྱུད་ལས་སུ་རུང་བར་མ་གྱུར་པས།  །",
      "en": "Have prevented my character from becoming workable,",
      "en-trans": "dak gyü lé su rungwar magyurpé"
    },
    {
      "bo": "དེང་ནས་རང་སེམས་འདུལ་ལ་བརྩོན་པར་ཤོག  །",
      "en": "Henceforth, therefore, may I strive to tame my mind.",
      "en-trans": "deng né rangsem dul la tsönpar shok"
    },
    {
      "bo": "ཉོན་མོངས་འཕེལ་བའི་གནས་དང་གྲོགས་སྤངས་ཤིང་།  །",
      "en": "May I avoid companions and places that inflame emotion,",
      "en-trans": "nyönmong pelwé né dang drok pang shing"
    },
    {
      "bo": "འདོད་ཡོན་བདུད་ཀྱི་གཡབ་མོས་མ་ཁྱེར་བར།  །",
      "en": "Ignore the beckoning demons of the sensory pleasures,",
      "en-trans": "döyön dü kyi yabmö ma khyer war"
    },
    {
      "bo": "ཆོས་མཐུན་སྤྱོད་པའི་གྲོགས་དང་ཟས་གོས་སོགས།  །",
      "en": "And remain content with dharma-practicing friends",
      "en-trans": "chö tün chöpé drok dang zegö sok"
    },
    {
      "bo": "འཚོ་བ་ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་ཤོག  །",
      "en": "And modest food, clothing and other necessities.",
      "en-trans": "tsowa ngen ngön tsam gyi chok shé shok"
    },
    {
      "bo": "དོན་མེད་ངག་འཁྱལ་ཆགས་སྡང་འཕེལ་བའི་རྒྱུ།  །",
      "en": "Meaningless chatter triggers attachment and aversion.",
      "en-trans": "dönmé ngak khyal chakdang pelwé gyu"
    },
    {
      "bo": "ཉེས་པའི་རང་བཞིན་སྨྲ་བ་བཅད་ནས་སུ།  །",
      "en": "Having put a stop to speech that is by nature harmful,",
      "en-trans": "nyepé rangzhin mawa ché né su"
    },
    {
      "bo": "ཆོས་མཐུན་གཏམ་གྱི་སྦྱོར་བ་ཉུང་ངུ་ལས།  །",
      "en": "Aside from brief messages with purely dharmic content,",
      "en-trans": "chö tün tam gyi jorwa nyung ngu lé"
    },
    {
      "bo": "རྟག་ཏུ་ཁ་ཏོན་བྱེད་ལ་བརྩོན་པར་ཤོག  །",
      "en": "May I strive to maintain only continuous recitation.",
      "en-trans": "taktu khatön jé la tsönpar shok"
    },
    {
      "bo": "ངེས་འབྱུང་བྱང་སེམས་ཡང་དག་ལྟ་བ་དང་།  །",
      "en": "May I never be without renunciation, bodhicitta,",
      "en-trans": "ngejung changsem yangdak tawa dang"
    },
    {
      "bo": "ནམ་ཡང་མི་འབྲལ་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས།  །",
      "en": "And the genuine view, uphold perfect ethics,",
      "en-trans": "namyang mindral tsultrim pünsum tsok"
    },
    {
      "bo": "དད་དང་མོས་གུས་བླ་མ་མཉེས་པར་བྱེད།  །",
      "en": "Delight the guru out of faith and devotion,",
      "en-trans": "dé dang mögü lama nyepar jé"
    },
    {
      "bo": "ཅི་བྱེད་བྱང་ཆུབ་སྤྱོད་ལ་འགྱུར་བར་ཤོག  །",
      "en": "And transform all that I do into bodhisattva conduct.",
      "en-trans": "chi jé changchub chö la gyurwar shok"
    },
    {
      "bo": "ཐུན་མོང་ཐུན་མིན་སྡོམ་པ་སྲོག་ལྟར་བསྲུང་།  །",
      "en": "May I guard the common and uncommon vows as I would my own life-force,",
      "en-trans": "tünmong tünmin dompa sok tar sung"
    },
    {
      "bo": "བླ་མ་དཀྱིལ་འཁོར་གཙོ་བོར་ཤེས་པ་ཡིས།  །",
      "en": "And through the power of exerting myself in the path of the two stages in four sessions,",
      "en-trans": "lama kyilkhor tsowor shepa yi"
    },
    {
      "bo": "རིམ་གཉིས་ཐུན་བཞིའི་ལམ་ལ་བརྩོན་པའི་མཐུས།  །",
      "en": "With the knowledge that my guru is the chief deity of the maṇḍala,",
      "en-trans": "rim nyi tün zhi lam la tsönpé tü"
    },
    {
      "bo": "རྨད་བྱུང་སྐུ་བཞིའི་གོ་འཕང་མྱུར་ཐོབ་ཤོག  །",
      "en": "May I swiftly attain the level of the wondrous four kāyas!",
      "en-trans": "mejung ku zhi gopang nyur tob shok"
    },
    {
      "bo": "ལམ་གྱི་སྙིང་པོ་ཟབ་མོ་དབང་བཞིའི་ལམ།  །",
      "en": "Through repeated practice of the way of the four empowerments,",
      "en-trans": "lam gyi nyingpo zabmo wang zhi lam"
    },
    {
      "bo": "ཡང་ཡང་གོམས་པས་སྐུ་བཞིའི་རྟེན་འབྲེལ་འགྲིགས།  །",
      "en": "The profound heart of the path, may I create the auspicious conditions for the four kāyas,",
      "en-trans": "yang yang gompé ku zhi tendrel drik"
    },
    {
      "bo": "རྡོ་རྗེ་ལུས་ཀྱི་དཀྱིལ་འཁོར་མངོན་གྱུར་ནས།  །",
      "en": "And having actualized the maṇḍala of the vajra body,",
      "en-trans": "dorjé lü kyi kyilkhor ngöngyur né"
    },
    {
      "bo": "དགྱེས་པ་རྡོ་རྗེས་སྲིད་གསུམ་གར་བྱེད་ཤོག  །",
      "en": "May I dance as Hevajra throughout the three worlds!",
      "en-trans": "gyepa dorjé si sum garjé shok"
    }
  ]
}