{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/tsongkhapa/aspiration-for-stages-of-path",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལམ་རིམ་སྨོན་ལམ་བཞུགས།",
    "en": "Aspiration for the Stages of the Path"
  },
  "text": [
    {
      "bo": "དེར་ནི་རིང་དུ་འབད་ལས་ཚོགས་གཉིས་ནི། །",
      "en": "Through my enduring efforts to amass the two accumulations",
      "en-trans": "der ni ring du bé lé tsok nyi ni"
    },
    {
      "bo": "མཁའ་ལྟར་ཡངས་པ་གང་ཞིག་བསགས་པ་དེས། །",
      "en": "Extensively, on a vast, space-like scale,",
      "en-trans": "kha tar yangpa gangzhik sakpa dé"
    },
    {
      "bo": "བློ་མིག་མ་རིག་གིས་ལྡོངས་འགྲོ་བ་ཀུན། །",
      "en": "May I become a lord of the victorious ones,",
      "en-trans": "lo mik marik gi dong drowa kün"
    },
    {
      "bo": "རྣམ་འདྲེན་རྒྱལ་བའི་དབང་བོར་བདག་གྱུར་ཅིག །",
      "en": "A guide for all beings mentally blinded by ignorance.",
      "en-trans": "namdren gyalwé wangwor dak gyur chik"
    },
    {
      "bo": "དེར་མ་སོན་པའི་ཚེ་རབས་ཀུན་ཏུ་ཡང་། །",
      "en": "Until then, throughout the course of my lives,",
      "en-trans": "der masönpé tserab küntu yang"
    },
    {
      "bo": "འཇམ་པའི་དབྱངས་ཀྱིས་བརྩེ་བས་རྗེས་བཟུང་སྟེ། །",
      "en": "May Mañjughoṣa guide me with his loving care,",
      "en-trans": "jampé yang kyi tsewé jezung té"
    },
    {
      "bo": "བསྟན་པའི་རིམ་པ་ཀུན་ཚང་ལམ་གྱི་མཆོག །",
      "en": "And may I delight the buddhas through finding and practising",
      "en-trans": "tenpé rimpa kün tsang lam gyi chok"
    },
    {
      "bo": "རྙེད་ནས་སྒྲུབ་པས་རྒྱལ་རྣམས་མཉེས་བྱེད་ཤོག །",
      "en": "The supreme path in which every phase of teaching is complete.",
      "en-trans": "nyé né drubpé gyal nam nyé jé shok"
    },
    {
      "bo": "རང་གིས་ཇི་བཞིན་རྟོགས་པའི་ལམ་གྱི་གནད། །",
      "en": "May I teach the key points of this path as I have realized them,",
      "en-trans": "rang gi jizhin tokpé lam gyi né"
    },
    {
      "bo": "ཤུགས་དྲག་བརྩེ་བས་དྲངས་པའི་ཐབས་མཁས་ཀྱིས། །",
      "en": "With skilful means and inspired by intense affection,",
      "en-trans": "shuk drak tsewé drangpé tabkhé kyi"
    },
    {
      "bo": "འགྲོ་བའི་ཡིད་ཀྱི་མུན་པ་བསལ་བྱས་ནས། །",
      "en": "And, having thereby banished the darkness that engulfs beings' minds,",
      "en-trans": "drowé yi kyi münpa sal jé né"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་པ་རིང་དུ་འཛིན་གྱུར་ཅིག །",
      "en": "May I long uphold the teachings of the victorious buddhas!",
      "en-trans": "gyalwé tenpa ring du dzin gyur chik"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་མཆོག་གིས་མ་ཁྱབ་པའམ། །",
      "en": "Where the supreme, precious teachings one is yet to find,",
      "en-trans": "tenpa rinchen chok gi makhyabpa am"
    },
    {
      "bo": "ཁྱབ་ཀྱང་ཉམས་པར་གྱུར་པའི་ཕྱོགས་དེར་ནི། །",
      "en": "Or where they were once known, but have since declined,",
      "en-trans": "khyab kyang nyampar gyurpé chok der ni"
    },
    {
      "bo": "སྙིང་རྗེ་ཆེན་པོས་ཡིད་རབ་བསྐྱོད་པ་ཡིས། །",
      "en": "There, through Great Compassion, may I stir people's minds,",
      "en-trans": "nyingjé chenpö yi rab kyöpa yi"
    },
    {
      "bo": "ཕན་བདེའི་གཏེར་དེ་གསལ་བར་བྱེད་པར་ཤོག །",
      "en": "And cause the treasury of benefit and happiness to shine!",
      "en-trans": "pendé ter dé salwar jepar shok"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བའི་རྨད་བྱུང་འཕྲིན་ལས་ལས། །",
      "en": "Through the gradual stages of the path to enlightenment,",
      "en-trans": "sé ché gyalwé mejung trinlé lé"
    },
    {
      "bo": "ལེགས་སྒྲུབ་བྱང་ཆུབ་ལམ་གྱི་རིམ་པས་ཀྱང་། །",
      "en": "Forged through the wondrous activity of buddhas and their heirs,",
      "en-trans": "lek drub changchub lam gyi rimpé kyang"
    },
    {
      "bo": "ཐར་འདོད་རྣམས་ཀྱི་ཡིད་ལ་དཔལ་སྟེར་ཞིང་། །",
      "en": "May I bring splendour to the minds of those seeking freedom,",
      "en-trans": "tar dö nam kyi yi la pal ter zhing"
    },
    {
      "bo": "རྒྱལ་བའི་མཛད་པ་རིང་དུ་སྐྱོང་གྱུར་ཅིག །",
      "en": "And long may I cultivate the deeds of the victorious ones!",
      "en-trans": "gyalwé dzepa ring du kyong gyur chik"
    },
    {
      "bo": "ལམ་བཟང་བསྒྲིག་པའི་མཐུན་རྐྱེན་སྒྲུབ་བྱེད་ཅིང་། །",
      "en": "May I create circumstances conducive to this excellent path",
      "en-trans": "lamzang drikpé tünkyen drubjé ching"
    },
    {
      "bo": "འགལ་རྐྱེན་སེལ་བྱེད་མི་དང་མི་མིན་ཀུན། །",
      "en": "And dispel any impediments; may no-one, human or otherwise,",
      "en-trans": "galkyen sel jé mi dang mi min kün"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་རྒྱལ་བས་བསྔགས་པ་ཡི། །",
      "en": "Ever be separated from this utterly pure path,",
      "en-trans": "tserab küntu gyalwé ngakpa yi"
    },
    {
      "bo": "རྣམ་དག་ལམ་དང་འབྲལ་བར་མ་གྱུར་ཅིག །",
      "en": "Which is lauded by the victorious ones.",
      "en-trans": "namdak lam dang dralwar magyur chik"
    },
    {
      "bo": "གང་ཚེ་ཐེག་པ་མཆོག་ལ་ཆོས་སྤྱོད་བཅུས། །",
      "en": "As I diligently apply myself to the genuine practice",
      "en-trans": "gang tsé tekpa chok la chöchö chü"
    },
    {
      "bo": "ཚུལ་བཞིན་སྒྲུབ་ལ་བརྩོན་པ་དེ་ཡི་ཚེ། །",
      "en": "Of the ten Dharma activities1of the supreme vehicle,",
      "en-trans": "tsulzhin drub la tsönpa dé yi tsé"
    },
    {
      "bo": "མཐུ་ལྡན་རྣམས་ཀྱིས་རྟག་ཏུ་གྲོགས་བྱེད་ཅིང་། །",
      "en": "May I always be assisted by those with mighty force,",
      "en-trans": "tuden nam kyi taktu drok jé ching"
    },
    {
      "bo": "བཀྲ་ཤིས་རྒྱ་མཚོས་ཕྱོགས་ཀུན་ཁྱབ་གྱུར་ཅིག །",
      "en": "And may an ocean of auspiciousness pervade all directions!",
      "en-trans": "tashi gyatsö chok künkhyab gyur chik"
    }
  ]
}