{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/topics/light-offering-prayers",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མར་མེའི་སྨོན་ལམ།",
    "en": "Light Offering Prayer"
  },
  "text": [
    {
      "bo": "མར་མེའི་སྣོད་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་འཇིག་རྟེན་ཁམས་ཀྱི་ཁོར་ཡུག་དང་མཉམ་པར་གྱུར་ཅིག །",
      "en": "May this vessel become as vast as the entire billionfold universe!",
      "en-trans": "marmé nö ni tongsum gyi tongchenpo jikten kham kyi khoryuk dang nyampar gyur chik"
    },
    {
      "bo": "སྡོང་བུ་ནི་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་དུ་གྱུར་ཅིག །",
      "en": "May its wick grow as large as Sumeru, the king of mountains!",
      "en-trans": "dongbu ni ri gyalpo rirab tsam du gyur chik"
    },
    {
      "bo": "མར་ཁུ་ནི་མཐའི་རྒྱ་མཚོ་ཙམ་དུ་གྱུར་ཅིག །",
      "en": "May the oil within become as vast as the great ocean at the edge of the world!",
      "en-trans": "markhu ni té gyatso tsam du gyur chik"
    },
    {
      "bo": "གྲངས་ནི་སངས་རྒྱས་རེ་རེའི་མདུན་དུ་དུང་ཕྱུར་རེ་རེ་འབྱུང་བར་གྱུར་ཅིག །",
      "en": "And may a billion such lamps appear before each and every buddha!",
      "en-trans": "drang ni sangye reré dündu dungchur reré jungwar gyur chik"
    },
    {
      "bo": "འོད་ཀྱིས་སྲིད་པའི་རྩེ་མོ་མན་ཆད་ནས།",
      "en": "Their light banishing the darkness of ignorance everywhere,",
      "en-trans": "ö kyi sipé tsemo menché né"
    },
    {
      "bo": "མནར་མེད་པའི་དམྱལ་བ་ཡན་ཆད་ཀྱི་མ་རིག་པའི་མུན་པ་ཐམས་ཅད་བསལ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཞིང་ཁམས་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་ཞིང་གསལ་བར་གྱུར་ཅིག །",
      "en": "From the very peak of existence down to the lowest hell, may they reveal all the realms of buddhas and bodhisattvas throughout the ten directions!",
      "en-trans": "narmé pé nyalwa yenché kyi marikpé münpa tamché sal né chok chü sangye dang changchub sempé zhingkham tamché ngönsum du tong zhing salwar gyur chik"
    },
    {
      "bo": "ཨེ་མ་ཧོ། ངོ་མཚར་རྨད་བྱུང་སྣང་གསལ་སྒྲོན་མེ་འདི། །",
      "en": "Emaho! This wondrous and amazing light, burning brightly,",
      "en-trans": "emaho ngotsar mejung nangsal drönmé di"
    },
    {
      "bo": "བསྐལ་བཟང་སངས་རྒྱས་སྟོང་རྩ་ལ་སོགས་པའི། །",
      "en": "I offer to the thousand buddhas of this fortunate age,",
      "en-trans": "kalzang sangye tong tsa lasokpé"
    },
    {
      "bo": "རབ་འབྱམས་ཕྱོགས་བཅུའི་ཞིང་ཁམས་མ་ལུས་པའི། །",
      "en": "Gurus, yidam deities, ḍākinīs and dharmapālas,",
      "en-trans": "rabjam chok chü zhingkham malüpé"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་མཁའ་འགྲོ་ཆོས་སྐྱོང་དང་། །",
      "en": "And the deities of all the maṇḍalas,",
      "en-trans": "lama yidam khandro chökyong dang"
    },
    {
      "bo": "དཀྱིལ་འཁོར་ལྷ་ཚོགས་རྣམས་ལ་འབུལ་བར་བགྱི། །",
      "en": "In all the infinite realms of the ten directions.",
      "en-trans": "kyilkhor lhatsok nam la bulwar gyi"
    },
    {
      "bo": "ཕ་མས་གཙོ་བྱས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །",
      "en": "May all beings, with my own parents foremost among them,",
      "en-trans": "pamé tso jé semchen tamché kyi"
    },
    {
      "bo": "ཚེ་རབས་འདི་དང་སྐྱེ་གནས་ཐམས་ཅད་དུ། །",
      "en": "In this and in all lives to come, whatever our place of birth,",
      "en-trans": "tserab di dang kyené tamché du"
    },
    {
      "bo": "རྫོགས་སངས་རྒྱས་པའི་ཞིང་ཁམས་མངོན་མཐོང་ནས། །",
      "en": "Always see directly the perfect buddhas’ realms,",
      "en-trans": "dzoksang gyepé zhingkham ngön tong né"
    },
    {
      "bo": "འོད་དཔག་མེད་མགོན་ཉིད་དང་དབྱེར་མེད་ཤོག །",
      "en": "And remain forever inseparable from Amitābha, ‘Lord of Boundless Light’—",
      "en-trans": "öpakmé gön nyi dang yermé shok"
    },
    {
      "bo": "དཀོན་མཆོག་གསུམ་དང་རྩ་གསུམ་ལྷ་ཚོགས་ཀྱི། །",
      "en": "Grant your blessings so that, through the power of the truth",
      "en-trans": "könchok sum dang tsa sum lhatsok kyi"
    },
    {
      "bo": "བདེན་པའི་མཐུ་ཡིས་སྨོན་ལམ་འདི་བཏབ་སྟེ། །",
      "en": "Of the Buddha, Dharma and Saṅgha, and the deities of the Three Roots,",
      "en-trans": "denpé tu yi mönlam di tab té"
    },
    {
      "bo": "མྱུར་དུ་འགྲུབ་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "This prayer of aspiration may swiftly be fulfilled!",
      "en-trans": "nyurdu drubpar jingyi lab tu sol"
    }
  ]
}