{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/music-to-delight-victors-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཐེག་ཆེན་སྨོན་ལམ་སྲས་བཅས་རྒྱལ་བ་དགྱེས་པའི་རོལ་མོ་ཅེས་བྱ་བ་བཞུགས་སོ།  །",
    "en": "Music to Delight the Victorious Ones and Their Heirs"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "རྡོ་རྗེའི་བླ་མ་རིག་འཛིན་ཚོགས་རྣམས་དང་།  །",
      "en": "I pray that the vajra gurus, hosts of vidyādharas,",
      "en-trans": "dorjé lama rigdzin tsok nam dang"
    },
    {
      "bo": "ཡི་དམ་གྲུབ་སྟེགས་ཌཱ་ཀཱི་ཆོས་སྐྱོངས་ཚོགས།  །",
      "en": "Yidams who support accomplishment, ḍākinīs and dharmapālas",
      "en-trans": "yidam drub tek daki chökyong tsok"
    },
    {
      "bo": "བདག་གི་ཇི་ལྟར་སྨོན་པ་འདི་བཞིན་དུ།  །",
      "en": "All bear witness to the pure fulfilment",
      "en-trans": "dak gi jitar mönpa di zhindu"
    },
    {
      "bo": "རྣམ་དག་འགྲུབ་པའི་དཔང་པོ་མཛད་དུ་གསོལ།  །",
      "en": "Of these, my prayers of aspiration, just as I wish.",
      "en-trans": "namdak drubpé pangpo dzé du sol"
    },
    {
      "bo": "ཚེ་འདི་མི་རྟག་རྩ་རྩེའི་ཟིལ་པ་འདྲ།  །",
      "en": "This life is as impermanent as a dewdrop on a blade of grass;",
      "en-trans": "tsé di mi tak tsa tsé zilpa dra"
    },
    {
      "bo": "དོ་ནུབ་སང་ཡང་ནམ་འཆི་ཆ་མེད་པས།  །",
      "en": "There’s even a chance that I might die tonight or tomorrow.",
      "en-trans": "donub sang yang namchi chamé pé"
    },
    {
      "bo": "སྲིད་པའི་ཕུན་ཚོགས་ཀུན་ལ་ཞེན་ལོག་སྟེ།  །",
      "en": "Inspire me, therefore, to end my craving for all the riches of this world",
      "en-trans": "sipé püntsok kün la zhenlok té"
    },
    {
      "bo": "ངེས་འབྱུང་གཏིང་ནས་སྐྱེ་བར་བྱིན་གྱིས་རློབས།  །",
      "en": "And develop, from deep within, a determination to be free.",
      "en-trans": "ngejung tingné kyewar jingyi lob"
    },
    {
      "bo": "ཐར་པའི་ལམ་གྱི་གཞི་མ་ཚུལ་ཁྲིམས་ཀྱི།  །",
      "en": "As it is the foundation for the path to liberation,",
      "en-trans": "tarpé lam gyi zhima tsultrim kyi"
    },
    {
      "bo": "ས་གཞི་གཙང་མ་བྱི་དོར་ལེགས་བྱས་ནས།  །",
      "en": "Inspire me to cleanse the basis of ethical discipline,",
      "en-trans": "sa zhi tsangma jidor lek jé né"
    },
    {
      "bo": "ལྟུང་བ་སྡེ་ལྔ་ཕྲ་རགས་དང་བཅས་པས།  །",
      "en": "And never to let it be corrupted in any way",
      "en-trans": "tungwa dé nga tra rak dang chepé"
    },
    {
      "bo": "ནམ་ཡང་གོས་པ་མེད་པར་བྱིན་གྱིས་རློབས།  །",
      "en": "By the five types of downfall,1however slight.",
      "en-trans": "namyang göpa mepar jingyi lob"
    },
    {
      "bo": "གཞན་ཕན་བྱང་ཆུབ་སེམས་ཀྱི་ནོར་བུ་ལ།  །",
      "en": "Bless me, that the jewel of altruistic bodhicitta",
      "en-trans": "zhenpen changchub sem kyi norbu la"
    },
    {
      "bo": "རང་དོན་ཡིད་བྱེད་རྟོག་པ་ངན་པ་ཡིས།  །",
      "en": "May remain unsullied by base thoughts of self-interest,",
      "en-trans": "rangdön yi jé tokpa ngenpa yi"
    },
    {
      "bo": "མ་སླད་སྟོང་ཉིད་སྙིང་རྗེའི་སྙིང་པོ་ཅན།  །",
      "en": "And emptiness of which compassion is the very core",
      "en-trans": "ma lé tongnyi nyingjé nyingpochen"
    },
    {
      "bo": "མྱུར་དུ་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས།  །",
      "en": "May swiftly take hold within my stream of being.",
      "en-trans": "nyurdu gyü la kyewar jingyi lob"
    },
    {
      "bo": "མཚན་ཉིད་ཚང་བའི་རྡོ་རྗེ་སློབ་དཔོན་ལས།  །",
      "en": "May my mindstream be ripened by pure empowerment",
      "en-trans": "tsennyi tsangwé dorjé lobpön lé"
    },
    {
      "bo": "རྣམ་དག་དབང་གིས་བདག་རྒྱུད་སྨིན་བྱས་ནས།  །",
      "en": "Received from a fully qualified vajra master,",
      "en-trans": "namdak wang gi dak gyü min jé né"
    },
    {
      "bo": "དམ་ཚིག་གཉན་པོ་ཚུལ་བཞིན་བསྲུང་བ་ཡིས།  །",
      "en": "And, by genuinely maintaining the solemn samaya pledges,",
      "en-trans": "damtsik nyenpo tsulzhin sungwa yi"
    },
    {
      "bo": "རྡོ་རྗེའི་ལམ་མཆོག་ནོར་མེད་རྙེད་གྱུར་ཅིག  །",
      "en": "May I unerringly adopt the supreme path of Vajrayāna.",
      "en-trans": "dorjé lam chok normé nyé gyur chik"
    },
    {
      "bo": "བསྐྱེད་དང་རྫོགས་པས་ཐ་མལ་སྣང་ཞེན་སྡོམ།  །",
      "en": "Through generation and perfection, may I control my clinging to perception as ordinary,",
      "en-trans": "kyé dang dzokpé tamal nang zhen dom"
    },
    {
      "bo": "ཕུང་ཁམས་རྩ་རླུང་ཐིག་ལེའི་དྲྭ་བ་ཀུན།  །",
      "en": "And, bringing the entire web of aggregates, elements, channels, energies and essences",
      "en-trans": "pung kham tsa lung tiklé drawa kün"
    },
    {
      "bo": "ཤིན་ཏུ་རྣམ་དག་རྡུལ་བྲལ་འོད་གསལ་དུ།  །",
      "en": "To maturity within utterly pure and immaculate luminosity,",
      "en-trans": "shintu namdak duldral ösal du"
    },
    {
      "bo": "སྨིན་ནས་འགྱུར་མེད་བདེ་ཆེན་མཐར་སོན་ཤོག  །",
      "en": "May I perfect the great bliss that is immutable.",
      "en-trans": "min né gyurmé dechen tar sön shok"
    },
    {
      "bo": "ཉེ་ལམ་ཟབ་མོའི་བླ་མའི་རིམ་པ་ཡིས།  །",
      "en": "Through the swift approach, the profound stage of guru practice,",
      "en-trans": "nyelam zabmö lamé rimpa yi"
    },
    {
      "bo": "གཉུག་མའི་སེམས་ལ་བྱིན་གྱིས་རློབས་པ་དང་།  །",
      "en": "May I blessed with insight into the genuine nature of mind,",
      "en-trans": "nyukmé sem la jingyi lob pa dang"
    },
    {
      "bo": "མཁའ་ཁྱབ་རྡོ་རྗེའི་ཡེ་ཤེས་མཁའ་ཆེན་པོ།  །",
      "en": "And realize, just as it is, without any error,",
      "en-trans": "khakhyab dorjé yeshe kha chenpo"
    },
    {
      "bo": "མ་ནོར་ཇི་བཞིན་མངོན་སུམ་རྟོགས་པར་ཤོག  །",
      "en": "The vast wisdom sky of all-pervasive vajra wisdom.",
      "en-trans": "manor jizhin ngönsum tokpar shok"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་བླ་མ་རྡོ་རྗེ་འཆང་།  །",
      "en": "Throughout all my lives to come, may I gain certainty",
      "en-trans": "kyewa küntu lama dorjé chang"
    },
    {
      "bo": "རྩ་གསུམ་འདུས་ཞལ་ཆེན་པོར་ངེས་ཤེས་རྙེད།  །",
      "en": "That the guru is Vajradhara, great face and embodiment of the Three Roots,",
      "en-trans": "tsa sum dü zhal chenpor ngeshé nyé"
    },
    {
      "bo": "བཅོས་མིན་མོས་གུས་ནང་ནས་སྐྱེ་བ་དང་།  །",
      "en": "May uncontrived devotion arise from deep within,",
      "en-trans": "chömin mögü nang né kyewa dang"
    },
    {
      "bo": "རང་འབྲས་དང་པོའི་སངས་རྒྱས་ཐོབ་པར་ཤོག  །",
      "en": "And may I attain the original buddhahood that is its own effect.",
      "en-trans": "rang dré dangpö sangye tobpar shok"
    },
    {
      "bo": "སྲིད་པ་ཇི་སྲིད་གནས་ཀྱི་བར་དག་ཏུ།  །",
      "en": "For as long as conditioned existence continues to endure,",
      "en-trans": "sipa jisi né kyi bar dak tu"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའི་ལུས་བཟང་ལ་བརྟེན་ནས།  །",
      "en": "By adopting the excellent form of a bodhisattva,",
      "en-trans": "changchub sempé lü zang la ten né"
    },
    {
      "bo": "མཐའ་ཡས་འགྲོ་བའི་དོན་རྣམས་སྒྲུབ་པ་ལ།  །",
      "en": "May I perfect the aspirations of the heroic Mañjuśrī",
      "en-trans": "tayé drowé dön nam drubpa la"
    },
    {
      "bo": "འཇམ་དཔལ་དཔའ་བོའི་སྨོན་ལམ་རྫོགས་པར་ཤོག  །",
      "en": "To accomplish the welfare of beings in their infinity.2",
      "en-trans": "jampal pawö mönlam dzokpar shok"
    },
    {
      "bo": "ཁྱད་པར་ལྔ་བརྒྱའི་ཐ་མར་བསྟན་འགྲོ་ལ།  །",
      "en": "During this final era of five hundred years in particular,",
      "en-trans": "khyepar ngabgyé tamar ten dro la"
    },
    {
      "bo": "འཚེ་བའི་འབྱུང་པོ་མི་དང་མི་མིན་རྣམས།  །",
      "en": "When human and non-human forces harm the teachings and beings,",
      "en-trans": "tsewé jungpo mi dang mi min nam"
    },
    {
      "bo": "སྙིང་རྗེ་དྲག་པོར་ཁྲོས་པའི་སྟོབས་ཤུགས་ཀྱིས།  །",
      "en": "May I have the strength of compassion’s intense wrath",
      "en-trans": "nyingjé drakpor tröpé tobshuk kyi"
    },
    {
      "bo": "བདུད་ཀྱི་སྡེ་ཚོགས་ཕྱེ་མར་འཐག་བྱེད་ཤོག  །",
      "en": "And smash the legions of Māra to smithereens.",
      "en-trans": "dü kyi dé tsok chemar tak jé shok"
    },
    {
      "bo": "གང་ཞིག་ལྟ་སྤྱོད་ངན་པའི་རྩ་སྦུར་རྣམས།  །",
      "en": "With the great fire of scripture and reasoning,",
      "en-trans": "gangzhik tachö ngenpé tsa bur nam"
    },
    {
      "bo": "རྣམ་མང་ལུང་དང་རིག་པའི་ཞུགས་ཆེན་གྱིས།  །",
      "en": "May I be able to set alight in a single instant",
      "en-trans": "nam mang lung dang rigpé zhuk chen gyi"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ལ་བསྲེག་ནས་ཡང་དག་གི  །",
      "en": "The straw and chaff of erroneous views and conduct,",
      "en-trans": "kechik tsam la sek né yangdak gi"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་པ་འཁྲུལ་མེད་གསལ་ནུས་ཤོག  །",
      "en": "And illuminate the unmistaken view, meditation and action.",
      "en-trans": "ta gom chöpa trulmé sal nü shok"
    },
    {
      "bo": "སྔོན་བྱོན་ཇོ་བོ་ཡབ་སྲས་རྣམ་ཐར་དང་།  །",
      "en": "May I adopt the lifestyle of the great Jowo and his heirs,3",
      "en-trans": "ngön jön jowo yabsé namtar dang"
    },
    {
      "bo": "ཕྱག་རྫོགས་གྲུབ་པའི་སློབ་དཔོན་ཆེ་རྣམས་ཀྱི།  །",
      "en": "Become proficient in all the enlightened deeds",
      "en-trans": "chakdzok drubpé lobpön ché nam kyi"
    },
    {
      "bo": "མཛད་པ་ཇི་སྙེད་ཀུན་ལ་དབང་འབྱོར་ཏེ།  །",
      "en": "Of the accomplished masters of Mahāmudrā and Dzogchen",
      "en-trans": "dzepa jinyé kün la wangjor té"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་ལ་བྱ་བ་བྱེད་པར་ཤོག  །",
      "en": "And be of service to the teachings of the Victorious Ones!",
      "en-trans": "gyalwé ten la jawa jepar shok"
    },
    {
      "bo": "མདོར་ན་བྱང་ཆུབ་སྤྱོད་པའི་སྨོན་ལམ་རྣམས།  །",
      "en": "In short, may I thoroughly and perfectly accomplish",
      "en-trans": "dorna changchub chöpé mönlam nam"
    },
    {
      "bo": "མ་ལུས་བདག་གི་རྒྱུད་ལ་ཡོངས་སུ་རྫོགས།  །",
      "en": "All the aspirations of bodhisattva conduct without exception,",
      "en-trans": "malü dak gi gyü la yongsu dzok"
    },
    {
      "bo": "ནམ་ཞིག་འཁོར་བ་སྟོང་པར་གྱུར་པའི་ཚེ།  །",
      "en": "And, in time, when saṃsāra is eventually emptied,",
      "en-trans": "namzhik khorwa tongpar gyurpé tsé"
    },
    {
      "bo": "ཀུན་བཟང་ཆོས་སྐུའི་ཀློང་དུ་ཐིམ་གྱུར་ཅིག  །",
      "en": "Merge into the dharmakāya expanse of Samantabhadra.",
      "en-trans": "kunzang chökü long du tim gyur chik"
    }
  ]
}