{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/brief-method-for-reciting-zangcho-monlam",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བཟང་སྤྱོད་འདོན་ཐབས་ཉུང་ངུ་བཞུགས་སོ། །",
    "en": "A Brief Method for Reciting Samantabhadra's Prayer of Good Actions"
  },
  "text": [
    {
      "bo": "སངས་རྒྱས་ཆོས་དང་ཚོགས་ཀྱི་མཆོག་རྣམས་ལ། །",
      "en": "In the Buddha, the Dharma and the Supreme Assembly",
      "en-trans": "sangye chö dang tsok kyi chok nam la"
    },
    {
      "bo": "བྱང་ཆུབ་བར་དུ་བདག་ནི་སྐྱབས་སུ་མཆི། །",
      "en": "I take refuge until I attain enlightenment.",
      "en-trans": "changchub bardu dak ni kyab su chi"
    },
    {
      "bo": "བདག་གི་སྦྱིན་སོགས་བགྱིས་པའི་བསོད་ནམས་ཀྱིས། །",
      "en": "Through the merit of practising generosity and so on,",
      "en-trans": "dak gi jin sok gyipé sönam kyi"
    },
    {
      "bo": "འགྲོ་ལ་ཕན་ཕྱིར་སངས་རྒྱས་འགྲུབ་པར་ཤོག །",
      "en": "May I attain buddhahood for the benefit of all beings.",
      "en-trans": "dro la pen chir sangye drubpar shok"
    },
    {
      "bo": "མདུན་མཁར་བླ་མ་བཅོམ་ལྡན་ཤཱཀྱ་ཐུབ། །",
      "en": "In the sky before me is the guru, the conqueror Śākyamuni,",
      "en-trans": "dün khar lama chomden shakya tub"
    },
    {
      "bo": "མདུན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་། །",
      "en": "And in front of him is the bodhisattva Samantabhadra,",
      "en-trans": "dündu changchub sempa kuntuzang"
    },
    {
      "bo": "ཕྱོགས་མཚམས་སྟེང་འོག་སངས་རྒྱས་བྱང་སེམས་སོགས། །",
      "en": "In the cardinal and intermediate directions, above and below, are the buddhas and bodhisattvas, and the rest,",
      "en-trans": "choktsam tengok sangye changsem sok"
    },
    {
      "bo": "སྨོན་ལམ་འགྲུབ་པའི་དཔང་པོར་བཞུགས་པ་དང་། །",
      "en": "Who remain as witnesses to the fulfilment of these aspirations,",
      "en-trans": "mönlam drubpé pangpor zhukpa dang"
    },
    {
      "bo": "མཐུན་འགྱུར་བདེན་ཚིག་གནང་བས་སྨོན་པའི་གནས། །",
      "en": "And declare facilitating words of truth, through which the objects of my aspiration",
      "en-trans": "tün gyur dentsik nangwé mönpé né"
    },
    {
      "bo": "ཇི་ལྟར་བཏབ་པ་ཡིད་བཞིན་འགྲུབ་པ་དང་། །",
      "en": "May be accomplished just as I wish for and request,",
      "en-trans": "jitar tabpa yizhin drubpa dang"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་མཆོག་ཡོངས་སུ་རྫོགས་གྱུར་ནས། །",
      "en": "And so that having entirely perfected supreme enlightened action,",
      "en-trans": "changchub chö chok yongsu dzok gyur né"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་མཐར་ཕྱིན་ཤོག །",
      "en": "I may bring the aspirations of Samantabhadra to complete fulfilment.",
      "en-trans": "kuntuzangpö mönlam tarchin shok"
    },
    {
      "bo": "ཐུབ་དབང་འཁོར་བཅས་འོད་ཞུ་རང་ལ་ཐིམ། །",
      "en": "Śākyamuni and his retinue melt into light and dissolve into me.",
      "en-trans": "tubwang khor ché ö zhu rang la tim"
    },
    {
      "bo": "འོད་གསལ་སྤྲོས་པ་བྲལ་བའི་ངང་ལ་བཞགས། །",
      "en": "I rest in a state of clear light, free from conceptual elaboration.",
      "en-trans": "ösal tröpa dralwé ngang la zhak"
    }
  ]
}