{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-shenga/middle-way-aspiration-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དབུ་མའི་སྨོན་ལམ།",
    "en": "Middle Way Aspiration"
  },
  "text": [
    {
      "bo": "མི་མཇེད་ཞིང་གི་འདྲེན་པ་ཤཱཀྱའི་ཏོག །",
      "en": "Guiding light of this world, crowning glory of the Śākya clan,",
      "en-trans": "mi jé zhing gi drenpa shakyé tok"
    },
    {
      "bo": "རྒྱལ་སྲས་ཐུ་བོ་རྗེ་བཙུན་མཁྱེན་པའི་གཏེར། །",
      "en": "Seniormost of buddha’s heirs, precious wisdom’s treasure,",
      "en-trans": "gyalsé tuwo jetsün khyenpé ter"
    },
    {
      "bo": "བསྟན་པའི་རྩ་ལག་འཕགས་པ་ཡབ་སྲས་སོགས། །",
      "en": "Successors to these teachings, noble Nāgārjuna and your spiritual sons,",
      "en-trans": "tenpé tsalak pakpa yabsé sok"
    },
    {
      "bo": "འགྲོ་བའི་འདྲེན་མཆོག་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "I prostrate before you all, the supreme of guides for living beings!",
      "en-trans": "drowé dren chok nam la chaktsal lo"
    },
    {
      "bo": "མཐའ་བྲལ་དབུ་མའི་དོན་གཟིགས་སངས་རྒྱས་བསྐྱངས། །",
      "en": "Buddhapālita, you who realized the Middle Way beyond extremes,",
      "en-trans": "tadral umé dön zik sangye kyang"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པའི་མངའ་བདག་ཞི་བ་ལྷ། །",
      "en": "Master of the bodhisattvas’ enlightened actions, Śāntideva,",
      "en-trans": "changchub chöpé ngadak zhiwa lha"
    },
    {
      "bo": "ཐལ་འགྱུར་ཤིང་རྟའི་སྲོལ་འཛིན་ཟླ་བ་གྲགས། །",
      "en": "Upholder of the great tradition of the Prāsaṅgika, Candrakīrti,",
      "en-trans": "talgyur shingté sol dzin dawa drak"
    },
    {
      "bo": "གུས་པས་འདུད་དོ་བརྩེ་ཆེན་ཐུགས་ཀྱིས་དགོངས། །",
      "en": "Respectfully, I bow before you—think of me with great compassion!",
      "en-trans": "güpé dü do tsé chen tuk kyi gong"
    },
    {
      "bo": "བདག་ནི་དེང་ནས་ཚེ་རབས་ཐམས་ཅད་དུ། །",
      "en": "From this day on, throughout all my future lives,",
      "en-trans": "dak ni deng né tserab tamché du"
    },
    {
      "bo": "དལ་འབྱོར་ལུས་ཐོབ་རྒྱལ་བའི་བསྟན་དང་མཇལ། །",
      "en": "May I gain the freedoms and endowments and meet with buddhas’ teachings.",
      "en-trans": "daljor lü tob gyalwé ten dang jal"
    },
    {
      "bo": "མཚན་ཉིད་ལྡན་པའི་དགེ་བའི་བཤེས་ཀྱིས་ཟིན། །",
      "en": "May I be accepted by an authentic spiritual teacher,",
      "en-trans": "tsennyi denpé geweshé kyi zin"
    },
    {
      "bo": "རྣམ་གསུམ་དད་པས་ཚུལ་བཞིན་བསྟེན་པར་ཤོག །",
      "en": "Whom I follow well, with all three kinds of faith!1",
      "en-trans": "nam sum depé tsulzhin tenpar shok"
    },
    {
      "bo": "ངེས་དོན་ཟབ་མོའི་མདོ་ཡི་དགོངས་པ་བཞིན། །",
      "en": "Having fully received instructions from my supreme and noble guide,",
      "en-trans": "ngedön zabmö do yi gongpa zhin"
    },
    {
      "bo": "བཤེས་གཉེན་མཆོག་ལས་ལེགས་པར་ཐོབ་ནས་ཀྱང༌། །",
      "en": "On the definitive meaning that is the intent of the profoundest sūtras,",
      "en-trans": "shenyen chok lé lekpar tob né kyang"
    },
    {
      "bo": "ཤེས་རབ་གསུམ་གྱིས་གཏན་ལ་ཕབ་པའི་མཐུས། །",
      "en": "May I reach conclusive certainty through the three kinds of wisdom,2",
      "en-trans": "sherab sum gyi ten la pabpé tü"
    },
    {
      "bo": "ཆོས་རྗེས་འབྲང་བའི་དད་པ་ཐོབ་པར་ཤོག །",
      "en": "And gain the conviction of one who relies upon the Dharma!",
      "en-trans": "chöjé drangwé depa tobpar shok"
    },
    {
      "bo": "དད་དང་སྙིང་རྗེ་ཆེན་པོའི་གཞི་བཟུང་ནས། །",
      "en": "Taking faith and great compassion as the basis of my path,",
      "en-trans": "dé dang nyingjé chenpö zhi zung né"
    },
    {
      "bo": "སྐྱབས་ཀྱི་ཡུལ་དུ་དཀོན་མཆོག་མི་གཏོང་ཞིང༌། །",
      "en": "And never forgetting the Three Jewels, the sources of refuge,",
      "en-trans": "kyab kyi yul du könchok mi tong zhing"
    },
    {
      "bo": "ཐེག་པ་ཆེན་པོའི་ལམ་ལ་རབ་ཞུགས་ཏེ། །",
      "en": "May I embark fully upon the path of the Mahāyāna,",
      "en-trans": "tekpa chenpö lam la rab zhuk té"
    },
    {
      "bo": "བཅོས་མ་མིན་པའི་སེམས་བསྐྱེད་ཐོབ་པར་ཤོག །",
      "en": "And arouse a mind of bodhicitta that is uncontrived!",
      "en-trans": "chöma minpé semkyé tobpar shok"
    },
    {
      "bo": "ལུས་སྲོག་ཡལ་བར་འདོར་བའི་སྙིང་སྟོབས་ཀྱིས། །",
      "en": "With the courageous willingness to sacrifice even life and limb,",
      "en-trans": "lü sok yalwar dorwé nyingtob kyi"
    },
    {
      "bo": "ཕྱི་ནང་དངོས་ཀུན་གཞན་ལ་གཏོང་བ་དང༌། །",
      "en": "May I give away to others all that I own and have within myself,",
      "en-trans": "chinang ngö kün zhen la tongwa dang"
    },
    {
      "bo": "རྣམ་དག་ཁྲིམས་ཀྱིས་རང་གི་རྒྱུད་བསྡམས་ནས། །",
      "en": "And, guarding my mindstream with the purest moral discipline,",
      "en-trans": "namdak trim kyi rang gi gyü dam né"
    },
    {
      "bo": "བཅས་པའི་མཚམས་ལས་འདའ་བ་མེད་པར་ཤོག །",
      "en": "May I never stray beyond the boundaries of my vows!",
      "en-trans": "chepé tsam lé dawa mepar shok"
    },
    {
      "bo": "གནོད་བྱེད་རྣམས་ལ་རིན་ཆེན་གཏེར་བཞིན་དུ། །",
      "en": "Seeing all who do me harm as equal to some priceless treasure,",
      "en-trans": "nöjé nam la rinchen ter zhindu"
    },
    {
      "bo": "དགའ་དང་གུས་པའི་ཡིས་ཀྱིས་རབ་བཏུད་དེ། །",
      "en": "May I honour them with a mind of joy and great respect,",
      "en-trans": "ga dang güpé yi kyi rab tü dé"
    },
    {
      "bo": "སྙིང་རྗེས་དྲང་བའི་རྨད་བྱུང་སྤྱོད་པ་ཡང༌། །",
      "en": "And always, in all my lives to come, may I rely",
      "en-trans": "nyingjé drangwé mejung chöpa yang"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་བདག་གིས་བསྟེན་པར་ཤོག །",
      "en": "Upon this wondrous conduct born of a noble heart!",
      "en-trans": "tserab küntu dak gi tenpar shok"
    },
    {
      "bo": "རང་བཞིན་རྣམ་དག་དོན་དམ་ཆོས་ཀྱི་དབྱིངས། །",
      "en": "The naturally pure, ultimate space of all phenomena",
      "en-trans": "rangzhin namdak döndam chö kyi ying"
    },
    {
      "bo": "ཡོད་མེད་སྤྲོས་པའི་ཡུལ་ལས་རབ་འདས་པ། །",
      "en": "Is entirely beyond the realm of concepts such as ‘is’ or ‘is not.’",
      "en-trans": "yömé tröpé yul lerab depa"
    },
    {
      "bo": "མ་རྟོགས་ལོག་པར་རྟོག་པའི་སྐྱོན་བསལ་ཏེ། །",
      "en": "May my failure to understand and false ideas be cleared away,",
      "en-trans": "ma tok lokpar tokpé kyön sal té"
    },
    {
      "bo": "ཆོས་ཉིད་བདེན་པ་མངོན་སུམ་མཐོང་བར་ཤོག །",
      "en": "So that I come to see the truth of reality itself directly.",
      "en-trans": "chönyi denpa ngönsum tongwar shok"
    },
    {
      "bo": "ཡོད་དང་མེད་པར་ལྟ་བ་སྤྲོས་པའི་མཐའ། །",
      "en": "Views based on existence and non-existence are limiting ideas,",
      "en-trans": "yö dang mepar tawa tröpé ta"
    },
    {
      "bo": "གཉིས་དང་གཉིས་མིན་འཛིན་པ་ལོག་པའི་བློ། །",
      "en": "Clinging to both and to neither is the product of a mistaken mind.",
      "en-trans": "nyi dang nyimin dzinpa lokpé lo"
    },
    {
      "bo": "མཐའ་བཞིའི་སྤྲོས་དང་བྲལ་བ་དབུ་མའི་ལམ། །",
      "en": "The Middle Way is free from these four extremes of elaboration,",
      "en-trans": "ta zhi trö dang dralwa umé lam"
    },
    {
      "bo": "མཁས་པས་བསྟན་པའི་དེ་ཉིད་མཐོང་བར་ཤོག །",
      "en": "May I see this reality that the learned ones have taught!",
      "en-trans": "khepé tenpé denyi tongwar shok"
    },
    {
      "bo": "ཕྱི་ནང་ཆོས་ཀུན་བདག་ལས་སྐྱེ་མེད་ཅིང༌། །",
      "en": "All outer and inner things are not produced by themselves,",
      "en-trans": "chinang chö kün dak lé kyemé ching"
    },
    {
      "bo": "གཞན་ལས་མ་ཡིན་གཉིས་དང་རྒྱུ་མེད་མིན། །",
      "en": "Or from something else, from both or without cause at all.",
      "en-trans": "zhen lé mayin nyi dang gyumé min"
    },
    {
      "bo": "འཇིག་རྟེན་རབ་ཏུ་གྲགས་པའི་ཆོས་རྣམས་ལ། །",
      "en": "With regard to all the things that are known in this world,",
      "en-trans": "jikten rabtu drakpé chö nam la"
    },
    {
      "bo": "བླང་དོར་འཇུག་ལྡོག་ཚུལ་བཞིན་བྱེད་པར་ཤོག །",
      "en": "May I adopt and avoid, engage in and withdraw from what I should.",
      "en-trans": "langdor jukdok tsulzhin jepar shok"
    },
    {
      "bo": "བདག་ཕུང་ངོ་བོ་གཅིག་དང་ཐ་དད་སོགས། །",
      "en": "May I abandon all falsely conceived notions of a self,",
      "en-trans": "dak pung ngowo chik dang tadé sok"
    },
    {
      "bo": "ལོག་པར་རྟོག་པའི་འདུ་ཤེས་ཀུན་སྤངས་ཏེ། །",
      "en": "Thinking it is identical to the aggregates, distinct from them and so on,",
      "en-trans": "lokpar tokpé dushé künpang té"
    },
    {
      "bo": "རྣམ་བདུན་ཤིང་རྟའི་རིགས་པ་ལ་བརྟེན་ནས། །",
      "en": "And, through the sevenfold reasoning of the chariot,",
      "en-trans": "nam dün shingté rikpa la ten né"
    },
    {
      "bo": "བརྟེན་ནས་བརྟགས་པའི་ངེས་པ་རྙེད་པར་ཤོག །",
      "en": "May I gain certainty that it is but a dependent imputation!",
      "en-trans": "ten né takpé ngepa nyepar shok"
    },
    {
      "bo": "ཤེས་བྱའི་ཆོས་ཀུན་ངོ་བོ་གདོད་ནས་སྟོང༌། །",
      "en": "All knowable things have always been empty by their very essence.",
      "en-trans": "shejé chö kün ngowo döné tong"
    },
    {
      "bo": "ཐེར་ཟུག་གནས་དང་ཅུང་ཟད་གནས་པ་སོགས། །",
      "en": "May I now eliminate entirely the pain of conceptual thoughts,",
      "en-trans": "ter zuk né dang chungzé nepa sok"
    },
    {
      "bo": "ཡང་དག་དོན་ལ་སྒྲིབ་པའི་འཛིན་སྟངས་ཀྱི། །",
      "en": "With their mode of perceiving which obscures genuine reality,",
      "en-trans": "yangdak dön la dribpé dzintang kyi"
    },
    {
      "bo": "རྟོག་པའི་ཟུག་རྔུ་དྲུངས་ནས་འབྱིན་པར་ཤོག །",
      "en": "Thinking for example that things abide forever or even partially persist.",
      "en-trans": "tokpé zukngu drung né jinpar shok"
    },
    {
      "bo": "རྡོ་ཁམས་གསེར་དང་བུམ་ནང་སྒྲོན་སོགས་ཀྱི། །",
      "en": "May the excellent meaning that is conveyed through examples",
      "en-trans": "do kham ser dang bum nang drön sok kyi"
    },
    {
      "bo": "དཔེ་ཡིས་གཞལ་བའི་དོན་བཟང་མངོན་དུ་གྱུར། །",
      "en": "Such as gold within rock, or a lamp inside a vase be revealed.",
      "en-trans": "pé yi zhalwé dön zang ngön du gyur"
    },
    {
      "bo": "ཡབ་རྗེ་དཔལ་མགོན་ཀླུ་ཡི་དགོངས་པ་བཞིན། །",
      "en": "According to the vision of the noble father, glorious protector Nāgārjuna,",
      "en-trans": "yab jé palgön lu yi gongpa zhin"
    },
    {
      "bo": "ས་ལམ་མཐར་ཕྱིན་ཆོས་སྐུ་ཐོབ་པར་ཤོག །",
      "en": "And may I complete all the stages and paths to gain the dharmakāya!",
      "en-trans": "salam tarchin chöku tobpar shok"
    },
    {
      "bo": "དེ་ཚེ་ཕྱོགས་མཐར་གཏུག་པའི་རྒྱལ་སྲས་དང༌། །",
      "en": "Then may I manifest continuously in many billions of emanations,",
      "en-trans": "detsé chok tar tukpé gyalsé dang"
    },
    {
      "bo": "དམན་དང་མཆོག་གི་འགྲོ་ཁམས་རྒྱ་མཚོ་ལ། །",
      "en": "To all the buddha’s heirs throughout the far reaches of space itself,",
      "en-trans": "men dang chok gi dro kham gyatso la"
    },
    {
      "bo": "རང་རང་བློ་དང་མཐུན་པའི་འདུལ་བྱེད་ནི། །",
      "en": "And to infinite oceans of beings of every type, lesser and greater,",
      "en-trans": "rang rang lo dang tünpé dul jé ni"
    },
    {
      "bo": "བྱེ་བ་ཕྲག་བརྒྱར་རྟག་ཏུ་སྣང་བར་ཤོག །",
      "en": "Guiding each and every one according to their mind’s capacity!",
      "en-trans": "jewa trak gyar taktu nangwar shok"
    },
    {
      "bo": "དེ་ལྟར་གོ་འཕང་རྣམ་པར་མཆིས་ཀྱི་བར། །",
      "en": "From now until I reach that perfect level of attainment,",
      "en-trans": "detar gopang nampar chi kyi bar"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་མཐའ་བྲལ་དབུ་མའི་དོན། །",
      "en": "In all my lives, may I realize and skilfully teach to others",
      "en-trans": "tserab küntu tadral umé dön"
    },
    {
      "bo": "རང་གིས་རྟོགས་ཤིང་གཞན་ལ་སྟོན་མཁས་པ། །",
      "en": "The meaning of the Middle Way beyond all extremes,",
      "en-trans": "rang gi tok shing zhen la tön khepa"
    },
    {
      "bo": "དཔལ་ལྡན་འཕགས་པ་ལྷ་དང་མཉམ་པར་ཤོག །",
      "en": "Becoming the equal of glorious Āryadeva!",
      "en-trans": "palden pakpa lha dang nyampar shok"
    }
  ]
}