{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/yangthang-rinpoche/flourishing-dzogchen-teachings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་ཆེན་བསྟན་རྒྱས་སྨོན་ལམ།",
    "en": "Prayer for the Flourishing of the Dzogchen Teachings of Sogyal Rinpoche, the Incarnation of Lerab Lingpa"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ། འཁོར་འདས་གཉིས་མེད་ཐོག་མཐའ་བྲལ་བའི་ཀློང་། །",
      "en": "Emaho! Beginningless and endless is the expanse that is free from the duality of samsara and nirvana,",
      "en-trans": "emaho, khordé nyimé tokta dralwé long"
    },
    {
      "bo": "རང་བྱུང་ཀ་དག་མཉམ་གདལ་ཐིག་ལེ་ཆེ། །",
      "en": "Self-arisingprimordial purity,the all-pervading great sphere of reality—",
      "en-trans": "rangjung kadak nyam dal tiklé ché"
    },
    {
      "bo": "ཁྱད་ཆོས་གསུམ་ལྡན་འོད་མི་འགྱུར་བའི་སྐུ། །",
      "en": "You are the body of unchanging clear light, endowed with three unique aspects,1",
      "en-trans": "khyechö sumden ö migyurwé ku"
    },
    {
      "bo": "བྱ་བྲལ་ཀུན་ཏུ་བཟང་ལ་གསོལ་བ་འདེབས། །",
      "en": "Samantabhadra, who transcends all activity, to you we pray!",
      "en-trans": "jadral kuntuzang la solwa deb"
    },
    {
      "bo": "རྫོགས་ཆེན་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us with your blessings so that we realize the natural state of Dzogpachenpo!",
      "en-trans": "dzogchen neluk tokpar jingyi lob"
    },
    {
      "bo": "གཡོ་བ་མེད་ལས་འགགས་པ་མེད་པའི་མདངས། །",
      "en": "Within this unmoving space shines the unceasing radiance",
      "en-trans": "yowa mé lé gakpa mepé dang"
    },
    {
      "bo": "ལྷུན་གྲུབ་རྟེན་འབྱུང་འཆར་སྣང་མ་ལུས་ཀུན། །",
      "en": "Ofspontaneous presence,the arisings of interdependence.",
      "en-trans": "lhündrub tenjung char nang malü kün"
    },
    {
      "bo": "གཞི་སྣང་ཡིན་པར་རྟོགས་པའི་སྐད་གཅིག་ལ། །",
      "en": "By realizing them all to be the appearances of the Ground, at that very instant",
      "en-trans": "zhi nang yinpar tokpé ké chik la"
    },
    {
      "bo": "ཁྱད་ཆོས་དྲུག་གིས་མངོན་པར་སངས་རྒྱས་པའི། །",
      "en": "You attain perfect enlightenment, with its six special features.",
      "en-trans": "khyechö druk gi ngönpar sangyé pé"
    },
    {
      "bo": "ཐོག་མའི་ཀུན་ཏུ་བཟང་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you, the primordial buddha Samantabhadra, we pray!",
      "en-trans": "tokmé kuntuzang la solwa deb"
    },
    {
      "bo": "རྫོགས་ཆེན་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us with your blessings so that we realize the natural state of Dzogpachenpo!",
      "en-trans": "dzogchen neluk tokpar jingyi lob"
    },
    {
      "bo": "གང་ཐུགས་ཁྱབ་གདལ་ནམ་མཁའ་ལྟ་བུ་ལས། །",
      "en": "From your wisdom mind, all-pervading just like space,",
      "en-trans": "gang tuk khyab dal namkha tabu lé"
    },
    {
      "bo": "ཀུན་ཁྱབ་ཐུགས་རྗེའི་རོལ་པ་ཅིར་ཡང་སྣང་། །",
      "en": "Dawns the play of compassion, omnipresent, in forms of every kind,",
      "en-trans": "künkhyab tukjé rolpa chiryang nang"
    },
    {
      "bo": "ཟབ་དང་རྒྱ་ཆེན་ཆོས་སྒོ་མཐའ་ཡས་པ། །",
      "en": "Opening limitless doors to the Dharma, profound and vast,",
      "en-trans": "zab dang gyachen chögo tayepa"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་མཛད་པ་རྨད་བྱུང་བ། །",
      "en": "And performing the wondrous enlightened actions that tame each according to their needs.",
      "en-trans": "gang la gang dul dzepa mejung ba"
    },
    {
      "bo": "རང་བྱུང་རྡོ་རྗེའི་སྣང་བར་གསོལ་བ་འདེབས། །",
      "en": "To all these appearances of the self-arisen vajra, we pray!",
      "en-trans": "rangjung dorjé nangwar solwa deb"
    },
    {
      "bo": "རྫོགས་ཆེན་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us with your blessings so that we realize the natural state of Dzogpachenpo!",
      "en-trans": "dzogchen neluk tokpar jingyi lob"
    },
    {
      "bo": "སྤྲོས་བྲལ་ཐུགས་ལ་འཕོ་འགྱུར་མ་འཆིས་ཀྱང་། །",
      "en": "The enlightened mind transcends concepts and never knows transition or change,",
      "en-trans": "trödral tuk la pogyur ma chi kyang"
    },
    {
      "bo": "དྭངས་བའི་མཚོ་ལ་གཟའ་སྐར་ཇི་བཞིན་དུ། །",
      "en": "Yet still, like stars and planets reflected on the limpid surface of a lake,",
      "en-trans": "dangwé tso la zakar jizhin du"
    },
    {
      "bo": "དགོངས་གཞི་གཉིས་མེད་གཅིག་ལ་དུ་མར་སྣང་། །",
      "en": "In the single vision of non-duality, there appear the countless forms",
      "en-trans": "gongzhi nyimé chik la dumar nang"
    },
    {
      "bo": "རྒྱལ་བ་རིགས་ལྔ་རིགས་གསུམ་མགོན་པོ་སོགས། །",
      "en": "Of the buddhas of the five families, the three bodhisattva lords,",
      "en-trans": "gyalwa rik nga rik sum gönpo sok"
    },
    {
      "bo": "རང་བྱུང་རང་ཤར་སྤྲུལ་པའི་འཁོར་ཚོགས་ལ། །",
      "en": "And all the gatherings of naturally appearing, self-arising emanations.",
      "en-trans": "rangjung rangshar trulpé khor tsok la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བདག་རྒྱུད་བྱིན་གྱིས་རློབས། །",
      "en": "To you we pray: transform our minds, our very being, with your grace!",
      "en-trans": "solwa deb so dak gyü jingyi lob"
    },
    {
      "bo": "རྫོགས་ཆེན་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us with your blessings so that we realize the natural state of Dzogpachenpo!",
      "en-trans": "dzogchen neluk tokpar jingyi lob"
    },
    {
      "bo": "དགའ་རབ་རྡོ་རྗེ་འཇམ་དཔལ་བཤེས་གཉེན་དང་། །",
      "en": "Garab Dorjé and Mañjuśrīmitra,",
      "en-trans": "garab dorjé jampal shenyen dang"
    },
    {
      "bo": "ཤྲཱི་སིང་ཛྙཱ་ན་སཱུཏྲ་བཱི་མ་ལ། །",
      "en": "Śrī Siṃha, Jñānasūtra and Vimalamitra,",
      "en-trans": "shrising jnanasutra bimala"
    },
    {
      "bo": "བཀའ་དྲིན་ཟླ་བྲལ་མཚོ་སྐྱེས་རྡོ་རྗེ་སོགས། །",
      "en": "Guru Tsokyé Dorjé, ‘the Lake-born Vajra,’ whose kindness is beyond compare,",
      "en-trans": "kadrin dadral tsokyé dorjé sok"
    },
    {
      "bo": "བརྒྱུད་གསུམ་རིག་འཛིན་བླ་མ་མ་ལུས་དང་། །",
      "en": "All you vidyādhara gurus in the three transmission lineages,",
      "en-trans": "gyü sum rigdzin lama malü dang"
    },
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་རྩ་བའི་བླ་མ་ལ། །",
      "en": "And the very embodiment of all sources of refuge, our root lama,",
      "en-trans": "kyabné kündü tsawé lama la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བདག་རྒྱུད་བྱིན་གྱིས་རློབས། །",
      "en": "To you we pray: transform our minds, our very being, with your grace!",
      "en-trans": "solwa deb so dak gyü jingyi lob"
    },
    {
      "bo": "རྫོགས་ཆེན་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us with your blessings so that we realize the natural state of Dzogpachenpo!",
      "en-trans": "dzogchen neluk tokpar jingyi lob"
    },
    {
      "bo": "རྩོད་ལྡན་དུས་ཀྱི་འདྲེན་མཆོག་ཤཱཀྱའི་རྒྱལ། །",
      "en": "In this time of turmoil, you are our supreme guide, King of the Śākyas.",
      "en-trans": "tsöden dü kyi dren chok shakyé gyal"
    },
    {
      "bo": "གང་གི་ཞལ་གསུང་དྲོད་རླངས་མ་ཡལ་བར། །",
      "en": "Now that the warm breath of your teachings has still not evaporated,",
      "en-trans": "gang gi zhal sung drö lang mayalwar"
    },
    {
      "bo": "འབྲས་བུའི་བསྟན་པ་གནས་པའི་དུས་བཟང་འདིར། །",
      "en": "And the Vajrayāna teachings remain in this age of good fortune,",
      "en-trans": "drebü tenpa nepé dü zang dir"
    },
    {
      "bo": "མཁན་སློབ་ཆོས་གསུམ་སྤྲུལ་པའི་ལོ་པཎ་གྱིས། །",
      "en": "May the teachings of the Ancient Translation school,",
      "en-trans": "khen lob chö sum trulpé lo pen gyi"
    },
    {
      "bo": "དྲིན་ལས་ལེགས་ཐོབ་སྔ་འགྱུར་རྒྱལ་བའི་བསྟན། །",
      "en": "Passed down through the kindness of Śāntarakṣita, Padmasambhava, Tri Songdetsen and the emanated translators and scholars,",
      "en-trans": "drin lé lek tob ngagyur gyalwé ten"
    },
    {
      "bo": "མི་ནུབ་མཁའ་ལ་ཉི་ཤར་ཇི་བཞིན་དུ། །",
      "en": "Never wane, but like the sun high up in the sky,",
      "en-trans": "mi nub kha la nyishar jizhin du"
    },
    {
      "bo": "ཕྱོགས་དུས་ཀུན་ཏུ་དར་ཞིང་རྒྱས་གྱུར་ཅིག །",
      "en": "May they shine and spread and flourish far and wide!",
      "en-trans": "chok dü küntu dar zhing gyé gyur chik"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་སྙིང་པོ་རྫོགས་པ་ཆེ། །",
      "en": "The very heart of the Ngagyur Nyingma teachings is the Dzogpachenpo,",
      "en-trans": "ngagyur tenpé nyingpo dzogpa ché"
    },
    {
      "bo": "བདེར་གཤེགས་སྙིང་པོའི་གནས་ལུགས་ཇི་བཞིན་པ། །",
      "en": "The natural state of the sugatagarbha, just as it is,",
      "en-trans": "der shek nyingpö neluk jizhinpa"
    },
    {
      "bo": "མངོན་སུམ་སྟོན་པའི་ལམ་མཆོག་མ་ནོར་བ། །",
      "en": "Revealed directly through this supreme, unerring path,",
      "en-trans": "ngönsum tönpé lam chok manorwa"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྡོ་རྗེའི་ཞལ་རླངས་ཐོལ་ལེ་བ། །",
      "en": "Spoken spontaneously by the Lake-born Vajra, Guru Rinpoche.",
      "en-trans": "tsokyé dorjé zhal lang tol lewa"
    },
    {
      "bo": "འོད་གསལ་རྡོ་རྗེ་སྙིང་པོའི་བཤད་སྒྲུབ་སྡེ། །",
      "en": "May the teachings and practice of this Clear Light Vajra Essence",
      "en-trans": "ösal dorjé nyingpö shedrub dé"
    },
    {
      "bo": "ཕྱོགས་དུས་ཐ་གྲུ་ཀུན་ཏུ་འབར་གྱུར་ཅིག །",
      "en": "Blaze up and spread to every land!",
      "en-trans": "chok dü tadru küntu bar gyur chik"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་བརྒྱུད་འཛིན་ལས༵་གླིང༵་གི །",
      "en": "One who holds the lineage of these Ancient Translation teachings is the incarnation of Lerab Lingpa,",
      "en-trans": "ngagyur tenpé gyü dzin leling gi"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཐོས་བསམ་སྒོམ་པའི་ལང་ཚོ་ཅན། །",
      "en": "Whose manner of teaching and practice, of study, contemplation and meditation, is full of vigour and energy.",
      "en-trans": "shedrub tö sam gompé langtso chen"
    },
    {
      "bo": "འཛིན་མཛད་བླ་སློབ་ཀུན་གྱི་ཐུགས་རྒྱུད་ལ། །",
      "en": "May the masters and disciples who maintain this very tradition",
      "en-trans": "dzin dzé la lob kün gyi tukgyü la"
    },
    {
      "bo": "བརྒྱུད་གསུམ་བླ་མའི་བྱིན་རླབས་མངོན་ཞུགས་ནས། །",
      "en": "Receive the actual blessings of the lamas of the three transmissions.",
      "en-trans": "gyü sum lamé jinlab ngön zhuk né"
    },
    {
      "bo": "ཆོས་བརྒྱད་འདི་ལ་ཞེན་པ་རང་ལོག་སྟེ། །",
      "en": "Then may our minds instinctively turn away from the eight worldly concerns,",
      "en-trans": "chö gyé di la zhenpa rang lok té"
    },
    {
      "bo": "ཉམ་ཆུང་ཆོག་ཤེས་ཁ་དོན་མཚུངས་པ་ཡིས། །",
      "en": "And, with humility, contentment and integrity,",
      "en-trans": "nyamchung chok shé kha dön tsungpa yi"
    },
    {
      "bo": "དམ་པ་གོང་མའི་ནམ་ཐར་རྗེས་ཟིན་ནས། །",
      "en": "By emulating the lives of the great masters of the past,",
      "en-trans": "dampa gongmé nam tar jé zin né"
    },
    {
      "bo": "རྫོགས་ཆེན་བསྟན་པའི་དགའ་ཚལ་རབ་རྒྱས་ཤིང་། །",
      "en": "As the lovely orchard of the Dzogchen teachings bursts into bloom,",
      "en-trans": "dzogchen tenpé gatsal rabgyé shing"
    },
    {
      "bo": "སྙིང་པོའི་འབྲས་བུ་ལོན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "May we be infused with their blessings, so that we can pick and enjoy its inmost fruit!",
      "en-trans": "nyingpö drebu lönpar jingyi lob"
    },
    {
      "bo": "ཁྱད་པར་ཞིང་འདིའི་བསྟན་འཛིན་སྐྱེས་མཆོག་གི །",
      "en": "As for the supreme being Sogyal Rinpoche, who upholds the teachings here,",
      "en-trans": "khyepar zhing di tendzin kyechok gi"
    },
    {
      "bo": "བསོ༵ད་ནམ༵ས་མི་འགྱུར་རི་བོ་བཞིན་དུ་བརྟན། །",
      "en": "May his merit(Sönam)remain forever stable as a mountain,",
      "en-trans": "sönam mingyur riwo zhindu ten"
    },
    {
      "bo": "སྐུ་ཚེ་མི་འགྱུར་རྟག་བརྟན་རྡོ་རྗེའི་གཞིར། །",
      "en": "May his life remain forever firm within the vajra ground,",
      "en-trans": "kutsé mingyur takten dorjé zhir"
    },
    {
      "bo": "ཚེ་དབང་གྲུབ་པ་རྣམས་ཀྱིས་བྱིན་བརླབས་ནས། །",
      "en": "And, blessed by those who have attained the power of longevity,",
      "en-trans": "tsewang drubpa nam kyi jinlab né"
    },
    {
      "bo": "བསྟན་པའི་རྒྱལ༵་མཚ༵ན་སྲིད་རྩེར་བསྒྲེང་མཛད་ཅིང་། །",
      "en": "May he raise the victory banner(Gyaltsen)of the teachings to the very summit of existence,",
      "en-trans": "tenpé gyaltsen sitser dreng dzé ching"
    },
    {
      "bo": "བསྟན་པ་ཡུན་ནས་ཡུན་དུ་རྒྱས་གྱུར་ཅིག །",
      "en": "And may his teachings remain for ages to come, spreading forever further and further!",
      "en-trans": "tenpa yün né yündu gyé gyur chik"
    }
  ]
}