{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/thangtong-gyalpo/prayer-pacifying-fear-illness",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གྲུབ་ཐོབ་ཐང་སྟོང་རྒྱལ་པོའི་རྡོ་རྗེའི་གསུང་ནད་ཀྱི་འཇིགས་པ་ཞི་བའི་གསོལ་འདེབས་ས་སྐྱ་ནད་གྲོལ་མ།",
    "en": "A Prayer for Quelling the Fear of Diseases"
  },
  "text": [
    {
      "bo": "ལས་དང་གློ་བུར་རྐྱེན་ལས་གྱུར་པ་ཡི། །",
      "en": "May everyillnessthat preys on sentient beings’ minds",
      "en-trans": "lé dang lobur kyen lé gyurpa yi"
    },
    {
      "bo": "གདོན་དང་ནད་དང་འབྱུང་པོའི་འཚེ་བ་སོགས། །",
      "en": "Caused by karma and incidental conditions,",
      "en-trans": "dön dang né dang jungpö tsewa sok"
    },
    {
      "bo": "སེམས་ཅན་ཡིད་མི་བདེ་བའི་ནད་རྣམས་ཀུན། །",
      "en": "Be it attacks by dark forces, disease or elemental spirits,",
      "en-trans": "semchen yi midewé né nam kün"
    },
    {
      "bo": "འཇིག་རྟེན་ཁམས་སུ་འབྱུང་བར་མ་གྱུར་ཅིག །",
      "en": "Never occur anywhere throughout this world!",
      "en-trans": "jikten kham su jungwar magyur chik"
    },
    {
      "bo": "ཇི་ལྟར་གཤེད་མས་འཁྲིད་པའི་གསད་བྱ་བཞིན། །",
      "en": "May all thesufferingof diseases that snatch life away,",
      "en-trans": "jitar shemé tripé seja zhin"
    },
    {
      "bo": "སྐད་ཅིག་གཅིག་ལ་ལུས་སེམས་འབྲལ་བྱེད་པའི། །",
      "en": "Tearing body and mind apart in an instant,",
      "en-trans": "kechik chik la lü sem dral jepé"
    },
    {
      "bo": "སྲོག་འཕྲོག་ནད་ཀྱི་སྡུག་བསྔལ་ཇི་སྙེད་པ། །",
      "en": "Like the executioner who’s dragged his victim to their death,",
      "en-trans": "sok trok né kyi dukngal jinyé pa"
    },
    {
      "bo": "འཇིག་རྟེན་ཁམས་སུ་འབྱུང་བར་མ་གྱུར་ཅིག །",
      "en": "Never occur anywhere throughout this world!",
      "en-trans": "jikten kham su jungwar magyur chik"
    },
    {
      "bo": "འཆི་བདག་གཤེན་རྗེའི་ཁ་ནང་ཚུད་པ་ལྟར། །",
      "en": "Mayepidemics, be they short-lived or enduring,",
      "en-trans": "chidak shen jé kha nang tsüpa tar"
    },
    {
      "bo": "ནད་ཀྱི་མིང་ཙམ་ཐོས་པས་སྐྲག་བྱེད་པའི། །",
      "en": "The very names of which strike terror equal",
      "en-trans": "né kyi ming tsam töpé trak jepé"
    },
    {
      "bo": "ཉིན་གཅིག་པ་དང་རྟག་པའི་རིམས་སོགས་ཀྱིས། །",
      "en": "To that of falling into the jaws of Yama, Lord of Death,",
      "en-trans": "nyin chikpa dang takpé rim sok kyi"
    },
    {
      "bo": "ལུས་ཅན་ཀུན་ལ་གནོད་པར་མ་གྱུར་གཅིག །",
      "en": "Never cause harm to any living beings.",
      "en-trans": "lüchen kün la nöpar magyur chik"
    },
    {
      "bo": "གནོད་པའི་བགེགས་རིགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། །",
      "en": "May eighty thousand classes of harmful obstructers,",
      "en-trans": "nöpé gek rik tongtrak gyechu dang"
    },
    {
      "bo": "གློ་བུར་ཡེ་འདྲོགས་སུམ་བརྒྱ་དྲུག་བཅུ་དང་། །",
      "en": "Three hundred and sixty spirits who strike without warning,",
      "en-trans": "lobur yé drok sumgya druk chu dang"
    },
    {
      "bo": "བཞི་བརྒྱ་རྩ་བཞིའི་ནད་ལ་སོགས་པ་ཡིས། །",
      "en": "Four hundred and four types of disease and more,",
      "en-trans": "zhigya tsa zhi né lasokpa yi"
    },
    {
      "bo": "ལུས་ཅན་ཀུན་ལ་འཚེ་བར་མ་གྱུར་ཅིག །",
      "en": "Never cause harm to any living beings.",
      "en-trans": "lüchen kün la tsewar magyur chik"
    },
    {
      "bo": "ལུས་སེམས་བདེ་བ་མ་ལུས་འཕྲོག་བྱེད་པའི། །",
      "en": "May all the sufferings due to turmoil in the four elements,",
      "en-trans": "lü sem dewa malü trok jepé"
    },
    {
      "bo": "འབྱུང་བཞི་འཁྲུགས་པའི་སྡུག་བསྔལ་ཇི་སྙེད་པ། །",
      "en": "That strip body and mind of every trace of well-being,",
      "en-trans": "jung zhi trukpé dukngal jinyé pa"
    },
    {
      "bo": "མ་ལུས་ཞི་ཞིང་མདངས་སྟོབས་ལྡན་པ་དང་། །",
      "en": "Be eliminated, granting us radiance, strength, and a long life,",
      "en-trans": "malü zhi zhing dang tob denpa dang"
    },
    {
      "bo": "ཚེ་རིང་ནད་མེད་བདེ་སྐྱིད་ལྡན་པར་ཤོག །",
      "en": "Free from sickness, and endowed with inner peace and happiness.",
      "en-trans": "tsering nemé dekyi denpar shok"
    },
    {
      "bo": "བླ་མ་དཀོན་མཆོག་གསུམ་གྱི་ཐུགས་རྗེ་དང། །",
      "en": "Through the compassion of the gurus, Buddha, Dharma and Saṅgha,",
      "en-trans": "lama könchok sum gyi tukjé dang"
    },
    {
      "bo": "མཁའ་འགྲོ་ཆོས་སྐྱོང་སྲུང་མའི་ནུས་མཐུ་དང་།",
      "en": "The power of ḍākinīs, Dharma protectors and guardians,",
      "en-trans": "khandro chökyong sungmé nütu dang"
    },
    {
      "bo": "ལས་འབྲས་བསླུ་བ་མེད་པའི་བདེན་སྟོབས་ཀྱིས། །",
      "en": "And the strength of the unfailing truth of cause and effect,",
      "en-trans": "lé dré luwa mepé den tob kyi"
    },
    {
      "bo": "བསྔོ་བ་སྨོན་ལམ་བཏབ་ཚད་འགྲུབ་པར་ཤོག །",
      "en": "Let these prayers of ours be fulfilled, exactly as we wish!",
      "en-trans": "ngowa mönlam tab tsé drubpar shok"
    }
  ]
}