{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/thangtong-gyalpo/prayer-pacifying-fears-of-war",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཚོན་གྱི་འཇིགས་པ་ཞི་བའི་བདེན་ཚིག",
    "en": "Prayer of Truthful Words to Pacify the Fear of War"
  },
  "text": [
    {
      "bo": "བྱམས་ཆེན་རྒྱལ་བ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །",
      "en": "Victorious Maitreya, sublime and noble Avalokiteśvara,",
      "en-trans": "jamchen gyalwa pakchok chenrezik"
    },
    {
      "bo": "ཁྲོ་རྒྱལ་རྟ་མགྲིན་རྗེ་བཙུན་སྒྲོལ་མ་སོགས། །",
      "en": "Ferocious king Hayagrīva, Jetsün Tārā, and the rest –",
      "en-trans": "trogyal tamdrin jetsün drolma sok"
    },
    {
      "bo": "མཚན་ཙམ་ཐོས་པས་འཇིགས་པ་ཀུན་སེལ་བའི། །",
      "en": "Buddhas, the mere sound of whose names dispels all fear;",
      "en-trans": "tsen tsam töpé jikpa kün selwé"
    },
    {
      "bo": "སྐྱབས་གནས་ཐུགས་རྗེའི་བདག་ཉིད་དགོངས་སུ་གསོལ། །",
      "en": "Compassionate sources of refuge, pray grant me heed.",
      "en-trans": "kyabné tukjé daknyi gong su sol"
    },
    {
      "bo": "རྩོད་ལྡན་སྙིགས་མ་ལྔ་བདོའི་སེམས་ཅན་རྣམས། །",
      "en": "In this time when individuals experience an oceanic surge",
      "en-trans": "tsöden nyikma nga dö semchen nam"
    },
    {
      "bo": "ལས་ངན་ཕྲག་དོག་མཚོ་ཆེན་བརྡོལ་བ་ལས། །",
      "en": "Of negative karma and jealousy – the age of fivefold decadence and strife –",
      "en-trans": "lé ngen trakdok tso chen dolwa lé"
    },
    {
      "bo": "འཐབ་རྩོད་སྡུག་བསྔལ་དྲག་པོས་མནར་བ་ན། །",
      "en": "As intense suffering, fighting and quarrelling oppress us,",
      "en-trans": "tabtsö dukngal drakpö narwa na"
    },
    {
      "bo": "ཡེ་ཤེས་ཐུགས་རྗེའི་ཞུགས་ཀྱིས་སྐེམས་པར་མཛོད། །",
      "en": "Pray burn it all in the fires of your compassionate wisdom.",
      "en-trans": "yeshe tukjé zhuk kyi kempar dzö"
    },
    {
      "bo": "ཞེ་སྡང་མེ་དཔུང་འབར་བའི་འགྲོ་བ་ལ། །",
      "en": "Shower the nectar of love",
      "en-trans": "zhedang mepung barwé drowa la"
    },
    {
      "bo": "བྱམས་པའི་བདུད་རྩིའི་ཆར་ཆེན་ཕབས་ནས་ཀྱང་། །",
      "en": "Upon those who fan the flames of hatred.",
      "en-trans": "jampé dütsi char chen pab né kyang"
    },
    {
      "bo": "ཕན་ཚུན་ཕ་མ་ལྟ་བུའི་འདུ་ཤེས་ཀྱིས། །",
      "en": "Bless them to recognize one another as parents,",
      "en-trans": "pentsün pama tabü dushé kyi"
    },
    {
      "bo": "བདེ་སྐྱིད་བཀྲ་ཤིས་འཕེལ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "And thereby usher in auspiciousness and happiness.",
      "en-trans": "dekyi tashi pelwar jingyi lob"
    },
    {
      "bo": "གང་གི་རྒྱུད་ལ་ཞུགས་པའི་སྐད་ཅིག་གིས། །",
      "en": "May the mischievous elemental spirits",
      "en-trans": "gang gi gyü la zhukpé kechik gi"
    },
    {
      "bo": "བློ་སྣ་ལྷ་མིན་བཞིན་དུ་བསྒྱུར་བྱེད་པའི། །",
      "en": "That enter the minds of beings",
      "en-trans": "lona lhamin zhindu gyur jepé"
    },
    {
      "bo": "འབྱུང་པོ་གདུག་པའི་ཚོགས་རྣམས་ཚར་བཅད་ནས། །",
      "en": "And instantaneously transform their hosts into warring titans,",
      "en-trans": "jungpo dukpé tsok nam tsarché né"
    },
    {
      "bo": "ཕྱིན་ཆད་ཕྱོགས་འདིར་རྒྱུ་བར་མ་གྱུར་ཅིག །",
      "en": "Never hold sway in this region again.",
      "en-trans": "chinché chok dir gyuwar magyur chik"
    },
    {
      "bo": "གཡུལ་ངོར་ཤི་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། །",
      "en": "May all who have died in battles, fighting and wars",
      "en-trans": "yulngor shiwé semchen tamché kyang"
    },
    {
      "bo": "དེང་ནས་ལས་ངན་རྒྱུ་འབྲས་ཀུན་སྤངས་ནས། །",
      "en": "Immediately give up their indulgence in destructive action, cause and effect,",
      "en-trans": "deng né lé ngen gyundré künpang né"
    },
    {
      "bo": "བདེ་བ་ཅན་དུ་རྫུས་ཏེ་སྐྱེས་ནས་ཀྱང་། །",
      "en": "And, having taken birth in the pure realm of Sukhāvatī,",
      "en-trans": "dewachen du dzü té kyé né kyang"
    },
    {
      "bo": "ཐམས་ཅད་ཞིང་དེར་འཁྲིད་པར་མཛད་དུ་གསོལ། །",
      "en": "Lead all to that same buddha realm.",
      "en-trans": "tamché zhing der tripar dzé du sol"
    },
    {
      "bo": "སྐྱེ་རྒུ་ཐམས་ཅད་ཚེ་རིང་ནད་མེད་ཅིང་། །",
      "en": "May all beings have long, healthy lives,",
      "en-trans": "kyegu tamché tsering nemé ching"
    },
    {
      "bo": "འཐབ་རྩོད་ཀུན་ཞི་དགེ་བ་བཅུ་ལ་སྤྱོད། །",
      "en": "Be free of quarrels and strife, live according to the ten virtues,",
      "en-trans": "tabtsö kün zhi gewa chu la chö"
    },
    {
      "bo": "ཆར་ཆུ་དུས་འབབ་ལོ་ཕྱུགས་རྟག་ཏུ་ལེགས། །",
      "en": "And experience timely rains and bountiful harvests;",
      "en-trans": "charchu dü bab lo chuk taktu lek"
    },
    {
      "bo": "སྣོད་བཅུད་བཀྲ་ཤིས་འཕེལ་བར་མཛད་དུ་གསོལ། །",
      "en": "And may the auspiciousness of the environment and beings increase exponentially.",
      "en-trans": "nöchü tashi pelwar dzé du sol"
    },
    {
      "bo": "ཆོས་ཉིད་རང་བཞིན་རྣམ་པར་དག་པ་དང་། །",
      "en": "May these pure, vast prayers be accomplished",
      "en-trans": "chönyi rangzhin nampar dakpa dang"
    },
    {
      "bo": "ཆོས་ཅན་རྒྱུ་འབྲས་བསླུ་བ་མེད་པ་དང་། །",
      "en": "Through the compassion of the Guru, Yidam, and Three Rare and Sublime Ones,",
      "en-trans": "chöchen gyundré luwa mepa dang"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་དཀོན་མཆོག་ཐུགས་རྗེ་ཡིས། །",
      "en": "Suchness, which by its very nature is utterly pure,",
      "en-trans": "lama yidam könchok tukjé yi"
    },
    {
      "bo": "རྣམ་དག་སྨོན་ལམ་རྒྱ་ཆེན་འགྲུབ་པར་ཤོག །",
      "en": "And the appearance of things, the undeceiving nature of cause and effect.",
      "en-trans": "namdak mönlam gyachen drubpar shok"
    }
  ]
}