{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/neten-chokling-teachings-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བསྟན་རྒྱས་སྨོན་ལམ།",
    "en": "Aspiration for the Spread of the Teachings"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti.",
      "en-trans": "om svasti"
    },
    {
      "bo": "སྔ་འགྱུར་བཀའ་གཏེར་བསྟན་པ་རྒྱ་མཚོའི་བདག  །",
      "en": "Master of the oceanic teachings of the Ancient Translations,kamaandterma,",
      "en-trans": "ngagyur kater tenpa gyatsö dak"
    },
    {
      "bo": "ཨོ་རྒྱན་མཆོག་གྱུར་བདེ་ཆེན་ཞིག་པོ་གླིང་།  །",
      "en": "Orgyen Chokgyur Dechen Shikpo Lingpa,",
      "en-trans": "orgyen chokgyur dechen zhikpo ling"
    },
    {
      "bo": "ཡོངས་རྫོགས་བསྟན་པའི་མངའ་བདག་མཁྱེན་བརྩེའི་དབང་།  །",
      "en": "Sovereign of all the teachings, Khyentse Wangpo,",
      "en-trans": "yongdzok tenpé ngadak khyentsé wang"
    },
    {
      "bo": "མཛོད་ལྔའི་ཤིང་རྟ་བློ་གྲོས་མཐའ་ཡས་ཀྱི།  །",
      "en": "And pioneer of the Five Treasuries, Lodrö Thayé—",
      "en-trans": "dzö ngé shingta lodrö tayé kyi"
    },
    {
      "bo": "རིང་ལུགས་མི་ཉམས་བླ་ནས་བླར་འཕེལ་ཤོག  །",
      "en": "May your tradition never fade but grow further and further.",
      "en-trans": "ringluk mi nyam lané lar pel shok"
    },
    {
      "bo": "ཆོས་འཁོར་རྣམ་གསུམ་རྟེན་མཆོག་འགྱུར་བ་མེད།  །",
      "en": "May this supreme, unchanging support for the three turnings of the Dharma Wheel,1",
      "en-trans": "chökhor nam sum ten chok gyurwamé"
    },
    {
      "bo": "མི་ནུབ་བསྟན་པའི་བཙས་སུ་བཞུགས་པའི་གླིང་།  །",
      "en": "This sanctuary where the teachings remain without ever fading,",
      "en-trans": "mi nub tenpé tsé su zhukpé ling"
    },
    {
      "bo": "ཁྲིམས་ལྡན་འདུས་པའི་ཚོགས་ཀྱི་ཡོངས་གང་ནས།  །",
      "en": "Be filled with disciplined members of the saṅgha community,",
      "en-trans": "trimden düpé tsok kyi yong gangné"
    },
    {
      "bo": "ལུང་རྟོགས་བསྟན་པ་དར་རྒྱས་ཡུན་གནས་ཤོག  །",
      "en": "And may the teachings of scripture and realization flourish and endure.",
      "en-trans": "lungtok tenpa dargyé yün né shok"
    },
    {
      "bo": "ཆོས་སྤྱོད་བཅུ་ཡི་བྱ་བར་རྟག་ཏུ་བརྩོན།  །",
      "en": "May everyone exert themselves continuously in the ten dharmic activities.2",
      "en-trans": "chöchö chuyi jawar taktu tsön"
    },
    {
      "bo": "སྤང་དང་ཀློག་པའི་ཕྲིན་ལས་རྒྱུན་མི་ཆད།  །",
      "en": "May the activities of renunciation and study continue without interruption.",
      "en-trans": "pang dang lokpé trinlé gyün mi ché"
    },
    {
      "bo": "དགེ་འདུན་མི་ཕྱེད་བདེན་པའི་མཐུ་སྟོབས་ཀྱིས།  །",
      "en": "And through the power and strength of the saṅgha's true indivisibility,",
      "en-trans": "gendün miché denpé tutob kyi"
    },
    {
      "bo": "བསྟན་པ་ཕྱོགས་བརྒྱར་འཕེལ་བའི་བཀྲ་ཤིས་ཤོག  །",
      "en": "May all be auspicious for the teachings to spread in a hundred directions.",
      "en-trans": "tenpa chok gyar pelwé tashi shok"
    }
  ]
}