{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/thangtong-gyalpo/prayer-pacifying-famine",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་གྲུབ་ཐོབ་ཆེན་པོས་ལྷ་ལྡན་ཇོ་བོ་རིན་པོ་ཆེའི་དྲུང་དུ་གསོལ་འདེབས་གནང་བའི་རྡོ་རྗེའི་གསུང་བྱིན་རླབས་བདུད་རྩིའི་སྤྲིན་ཕུང་འཕྲོ་བ། །",
    "en": "An Aspiration Prayer Composed by the Master Mahāsiddha Thangtong Gyalpo in the Presence of the Jowo Rinpoche in Lhasa"
  },
  "text": [
    {
      "bo": "མཐའ་ཡས་འགྲོ་བ་ངེས་པར་སྒྲོལ་སླད་དུ། །",
      "en": "First, you generated the supreme mind of unsurpassable awakening",
      "en-trans": "tayé drowa ngepar drol ledu"
    },
    {
      "bo": "བླ་མེད་བྱང་ཆུབ་མཆོག་ཏུ་ཐུགས་བསྐྱེད་ནས། །",
      "en": "Firmly set upon the liberation of sentient beings in their infinitude,",
      "en-trans": "lamé changchub chok tu tukkyé né"
    },
    {
      "bo": "ཚོགས་གཉིས་རྫོགས་མཛད་རྒྱལ་བ་ཐུགས་རྗེ་ཅན། །",
      "en": "Then, you perfected the two accumulations, O compassionate Victorious One,",
      "en-trans": "tsok nyi dzok dzé gyalwa tukjé chen"
    },
    {
      "bo": "མགོན་མེད་སྙིགས་མའི་འགྲོ་ལ་བརྩེར་དགོངས་ནས། །",
      "en": "You whose love embraces beings bereft of any protector in these degenerate times:",
      "en-trans": "gönmé nyikmé dro la tser gong né"
    },
    {
      "bo": "བཀྲེས་སྐོམ་ཉམ་ཐག་སྡུག་བསྔལ་གྱིས་གཟིར་བའི། །",
      "en": "Protect them without fail!",
      "en-trans": "trekom nyamtak dukngal gyi zirwé"
    },
    {
      "bo": "ལུས་ཅན་འདི་དག་ངེས་པར་བསྐྱབ་ཕྱིར་དུ། །",
      "en": "For these beings plagued by hunger, thirst, difficulties, and suffering,",
      "en-trans": "lüchen didak ngepar kyab chirdu"
    },
    {
      "bo": "རིན་ཆེན་ཟས་ནོར་འབྲུ་དང་མལ་ཆ་སོགས། །",
      "en": "Release upon the world and the Land of Snows",
      "en-trans": "rinchen zé nor dru dang mal cha sok"
    },
    {
      "bo": "ཡིད་འོངས་འདོད་དགུའི་ལོངས་སྤྱོད་ཇི་སྙེད་ཀྱི། །",
      "en": "A rain of all the pleasant things the senses can enjoy,",
      "en-trans": "yi ong dögü longchö jinyé kyi"
    },
    {
      "bo": "ཆར་པ་འཛམ་གླིང་ཁ་བ་ཅན་དུ་ཕོབ། །",
      "en": "Including jewels, food, wealth, grain, and bedding!",
      "en-trans": "charpa dzamling khawachen du pob"
    },
    {
      "bo": "དུས་མིན་རླུང་དང་མེ་ཐན་ཆར་ཆུ་སོགས། །",
      "en": "Pacify harm among the four elements,",
      "en-trans": "dümin lung dang mé ten charchu sok"
    },
    {
      "bo": "འབྱུང་བཞིའི་གནོད་པ་ཉེ་བར་ཞི་བ་དང།",
      "en": "Untimely wind and fire, or inauspicious rains and waters!",
      "en-trans": "jung zhi nöpa nyewar zhiwa dang"
    },
    {
      "bo": "འབྲུ་བཅུད་རྩི་ཐོག་ལོ་ཏོག་ལ་སོགས་པ། །",
      "en": "Let grains, plants, harvests and the like",
      "en-trans": "dru chü tsitok lotok lasokpa"
    },
    {
      "bo": "རྫོགས་ལྡན་དུས་ལྟར་སྨིན་ཅིང་རྒྱས་གྱུར་ཅིག །",
      "en": "Mature fully, just as in the golden age!",
      "en-trans": "dzokden dü tar min ching gyé gyur chik"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེའི་ཤུགས་ཀྱིས་རང་བསྐུལ་ནས། །",
      "en": "Through the strength of aspirations such as these,",
      "en-trans": "jam dang nyingjé shuk kyi rang kul né"
    },
    {
      "bo": "རྒྱ་ཆེན་སྨོན་ལམ་བཏབ་པ་འདི་ཡི་མཐུས། །",
      "en": "Inspired by loving-kindness and compassion,",
      "en-trans": "gyachen mönlam tabpa di yi tü"
    },
    {
      "bo": "ནད་མཚོན་མུ་གེའི་བསྐལ་བ་ཉེར་ཞི་ནས། །",
      "en": "May sicknesses, weapons, and famines be thoroughly pacified",
      "en-trans": "né tsön mugé kalwa nyerzhi né"
    },
    {
      "bo": "ཚེ་རིང་ནད་མེད་བདེ་སྐྱིད་ལྡན་པར་ཤོག །",
      "en": "And beings enjoy long life, good health, well-being and happiness!",
      "en-trans": "tsering nemé dekyi denpar shok"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་དང་བཅས་པའི་ཐུགས་རྗེ་དང་། །",
      "en": "Through the power of the compassion of the victorious ones and their heirs,",
      "en-trans": "gyalwa sé dang chepé tukjé dang"
    },
    {
      "bo": "ལས་འབྲས་སླུ་བ་མེད་པའི་བདེན་སྟོབས་ཀྱིས། །",
      "en": "And the infallible power of the interdependence of causes and results,",
      "en-trans": "lé dré luwa mepé den tob kyi"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་པ་དར་ཞིང་རྒྱས་པ་དང་། །",
      "en": "May the teachings of the Victorious One spread and flourish,",
      "en-trans": "gyalwé tenpa dar zhing gyepa dang"
    },
    {
      "bo": "འགྲོ་ཀུན་བླ་མེད་བྱང་ཆུབ་མྱུར་ཐོབ་ཤོག །",
      "en": "And all beings swiftly reach unsurpassable awakening!",
      "en-trans": "dro kün lamé changchub nyur tob shok"
    }
  ]
}