{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamgon-kongtrul/prayer-peace-and-stability",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བོད་ཡུལ་བདེ་བའི་སྨོན་ལམ།",
    "en": "Prayer for Peace and Stability in Tibet"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་བསླུ་མེད་དཀོན་མཆོག་རྩ་བ་གསུམ། །",
      "en": "Unfailing sources of refuge—Buddha, Dharma and Saṅgha, and gurus, yidams and ḍākinīs,",
      "en-trans": "kyabné lumé könchok tsawa sum"
    },
    {
      "bo": "ཁྱད་པར་གངས་ཅན་མགོན་པོ་སྤྱན་རས་གཟིགས། །",
      "en": "And especially Avalokiteśvara, protector of the Land of Snows,",
      "en-trans": "khyepar gangchen gönpo chenrezik"
    },
    {
      "bo": "རྗེ་བཙུན་སྒྲོལ་མ་གུ་རུ་པདྨ་འབྱུང་། །",
      "en": "Together with Noble Tārā and Guru Padmasambhava,",
      "en-trans": "jetsün drolma guru pema jung"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཐུགས་དམ་ཞལ་བཞེས་དགོངས། །",
      "en": "We pray to you: think of us and the sacred pledges you have made!",
      "en-trans": "solwa deb so tukdam zhalzhé gong"
    },
    {
      "bo": "སྨོན་ལམ་ཡོངས་སུ་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that our prayers of aspiration may be fulfilled entirely.",
      "en-trans": "mönlam yongsu drubpar jingyi lob"
    },
    {
      "bo": "སྙིགས་དུས་འགྲོ་རྣམས་བསམ་སྦྱོར་ལོག་པ་དང་། །",
      "en": "Beings of this degenerate age think and act in perverse ways,",
      "en-trans": "nyikdü dro nam samjor lokpa dang"
    },
    {
      "bo": "ཕྱི་ནང་འབྱུང་བ་འཁྲུགས་པའི་རྒྱུ་རྐྱེན་གྱིས། །",
      "en": "And disturbances in the elements, both outer and inner,",
      "en-trans": "chinang jungwa trukpé gyukyen gyi"
    },
    {
      "bo": "སྔར་མ་གྲགས་པ་མི་ཕྱུགས་དལ་ཡམས་ནད། །",
      "en": "Mean that disease and pestilence, unknown in ages past, threaten human beings and animals alike.",
      "en-trans": "ngar madrakpa mi chuk dalyam né"
    },
    {
      "bo": "གཟའ་ཀླུ་རྒྱལ་གདོན་ནག་ཕྱོགས་འབྱུང་པོའི་གཟེར། །",
      "en": "Planetary forces, nāgas,gyalpo, obstructing spirits and elemental forces,",
      "en-trans": "za lu gyal dön nakchok jungpö zer"
    },
    {
      "bo": "བཙའ་སད་སེར་གསུམ་ལོ་ཉེས་དམག་འཁྲུག་རྩོད། །",
      "en": "Cause blight, frost and hail, poor harvests, war and conflict,",
      "en-trans": "tsa sé ser sum lonyé maktruk tsö"
    },
    {
      "bo": "ཆར་ཆུ་མི་སྙོམས་གངས་ཅན་བྲ་བྱའི་ཐན། །",
      "en": "Untimely rains and ominous portents for the Land of Snows,",
      "en-trans": "charchu minyom gangchen dra jé ten"
    },
    {
      "bo": "ས་གཡོས་མེ་དགྲ་འབྱུང་བཞིའི་འཇིགས་པ་དང་། །",
      "en": "And there is fear of earthquakes, fire, adversaries, and environmental catastrophe,",
      "en-trans": "sayö mé dra jung zhi jikpa dang"
    },
    {
      "bo": "ཁྱད་པར་བསྟན་ལ་འཚེ་བའི་མཐའ་དམག་སོགས། །",
      "en": "And especially of foreign invaders who might harm the teachings.",
      "en-trans": "khyepar ten la tsewé tamak sok"
    },
    {
      "bo": "གངས་ཅན་ལྗོངས་འདིར་གནོད་འཚེའི་རིགས་མཐའ་དག །",
      "en": "May all types of harm and violence in these snowy lands,",
      "en-trans": "gangchen jong dir nö tsé rik tadak"
    },
    {
      "bo": "མྱུར་དུ་ཞི་ཞིང་རྩད་ནས་འཇོམས་གྱུར་ཅིག །",
      "en": "Be swiftly pacified and eliminated entirely.",
      "en-trans": "nyurdu zhi zhing tsené jom gyur chik"
    },
    {
      "bo": "མི་དང་མི་མིན་འགྲོ་བ་མཐའ་དག་གི །",
      "en": "May precious sublime bodhicitta",
      "en-trans": "mi dang mimin drowa tadak gi"
    },
    {
      "bo": "རྒྱུད་ལ་བྱང་ཆུབ་སེམས་མཆོག་རིན་པོ་ཆེ། །",
      "en": "Arise naturally in the minds of all beings, human and non-human alike,",
      "en-trans": "gyü la changchub sem chok rinpoche"
    },
    {
      "bo": "ངང་གིས་སྐྱེས་ནས་གནོད་འཚེའི་བསམ་སྦྱོར་བྲལ། །",
      "en": "So that they never again think or act in harmful, violent ways.",
      "en-trans": "ngang gi kyé né nö tsé samjor dral"
    },
    {
      "bo": "ཕན་ཚུན་བྱམས་པའི་སེམས་དང་ལྡན་ནས་ཀྱང་། །",
      "en": "May the minds of all be filled with love for one another!",
      "en-trans": "pentsün jampé sem dangden né kyang"
    },
    {
      "bo": "བོད་ཡུལ་མཐའ་དབུས་བདེ་སྐྱིད་དཔལ་གྱིས་འབྱོར། །",
      "en": "May the whole of Tibet enjoy abundant splendours, happiness and well-being!",
      "en-trans": "böyul ta ü dekyi pal gyi jor"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་པ་དར་རྒྱས་ཡུན་གནས་ཤོག །",
      "en": "And may the Buddha’s teachings flourish and endure!",
      "en-trans": "sangye tenpa dargyé yün né shok"
    },
    {
      "bo": "རྩ་གསུམ་རྒྱལ་བ་སྲས་བཅས་བདེན་པའི་སྟོབས། །",
      "en": "Through the force of the truth embodied in the Three Roots, the Buddhas and their heirs,",
      "en-trans": "tsa sum gyalwa sé ché denpé tob"
    },
    {
      "bo": "འཁོར་འདས་དགེ་བའི་རྩ་བ་གང་མཆིས་དང་། །",
      "en": "And through the power of all the sources of merit throughout saṃsāra and nirvāṇa,",
      "en-trans": "khordé gewé tsawa gang chi dang"
    },
    {
      "bo": "བདག་ཅག་ལྷག་བསམ་རྣམ་པར་དཀར་བའི་མཐུས། །",
      "en": "And of our own completely pure, positive intention,",
      "en-trans": "dakchak lhaksam nampar karwé tü"
    },
    {
      "bo": "གསོལ་བཏབ་སྨོན་པའི་འབྲས་བུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May this, our prayer of aspiration, be fulfilled!",
      "en-trans": "soltab mönpé drebu drub gyur chik"
    }
  ]
}