{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/trulshik-rinpoche/prayer-of-view-meditation-conduct",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལྟ་སྒོམ་སྤྱོད་གསུམ་གྱི་གསོལ་འདེབས།",
    "en": "Prayer of the View, Meditation and Conduct"
  },
  "text": [
    {
      "bo": "ཆོས་ཉིད་རིག་པ་རང་བྱུང་འདུས་མ་བྱས། །",
      "en": "The primordial ground, the great, ever-pure primordial emptiness,",
      "en-trans": "chönyi rigpa rangjung dümajé"
    },
    {
      "bo": "ཡེ་གནས་གཞིར་རྫོགས་འཕོ་འགྱུར་སྤྲོས་ཀུན་བྲལ། །",
      "en": "Which is free from all elaboration and change,",
      "en-trans": "yé né zhir dzok pogyur trö kündral"
    },
    {
      "bo": "གདོད་མའི་སྟོང་ཆེན་ཀ་ནས་དག་པ་ཡི། །",
      "en": "Is the very nature of uncompounded and self-arising awareness:",
      "en-trans": "dömé tongchen kané dakpa yi"
    },
    {
      "bo": "ལྟ་བ་རང་ངོ་འཕྲོད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me so that I may recognize the view, my very own nature.",
      "en-trans": "tawa rang ngotrö par jingyi lob"
    },
    {
      "bo": "མ་བཅོས་ཀློང་དེར་མ་ཡེངས་ངང་བསྒོམ་གྱི། །",
      "en": "To meditate without distraction in this uncontrived expanse,",
      "en-trans": "machö long der ma yeng ngang gom gyi"
    },
    {
      "bo": "མི་སྤྲོ་མི་བསྡུ་བསམ་བརྗོད་བྲལ་བར་བཞག །",
      "en": "Which has neither contraction nor expansion, is simply to settle,",
      "en-trans": "mi tro mi du sam jödral bar zhak"
    },
    {
      "bo": "སྐུ་གསུམ་ལྷུན་གྲུབ་རིག་པའི་གཤིས་ལུགས་དེར། །",
      "en": "Without thought or expression, in natural awareness – the three kāyas:",
      "en-trans": "ku sum lhündrub rigpé shi luk der"
    },
    {
      "bo": "ཐག་ཆོད་བློ་བདེ་འབྱུང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me so that I may meditate like this, with decisiveness and ease.",
      "en-trans": "takchö lo dejung bar jingyi lob"
    },
    {
      "bo": "འཁོར་འདས་ཆོས་ཀུན་རྟོག་པ་གང་ཤར་ཡང་། །",
      "en": "All thoughts of saṃsāra and nirvāṇa are unbound and naturally liberated,",
      "en-trans": "khordé chö küntokpa gangshar yang"
    },
    {
      "bo": "མ་འཆིང་རང་གྲོལ་གཉེན་པོས་རྩོལ་མེད་པར། །",
      "en": "And there is no need for effort-based antidotes",
      "en-trans": "ma ching rangdrol nyenpö tsolmé par"
    },
    {
      "bo": "སྤང་བླང་ལས་འདས་ཡེ་གྲོལ་ཆེན་པོའི་ངང་། །",
      "en": "In this, the great, primordial liberation beyond adoption and rejection:",
      "en-trans": "panglang lé dé yedrol chenpö ngang"
    },
    {
      "bo": "ཤར་གྲོལ་རིས་མེད་འབྱུང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me so that I may realize this great, all-encompassing liberation upon arising.",
      "en-trans": "shardrol rimé jungwar jingyi lob"
    },
    {
      "bo": "དེ་ལྟར་མཆོག་གསང་རྫོགས་པ་ཆེན་པོ་ཡི། །",
      "en": "The supremely secret view, meditation, conduct and result of the Great Perfection",
      "en-trans": "detar chok sang dzogpachenpo yi"
    },
    {
      "bo": "ལྟ་སྒོམ་སྤྱོད་འབྲས་བླ་མའི་དྲིན་གྱིས་རྟོགས། །",
      "en": "Are to be realized through the guru’s kindness,",
      "en-trans": "ta gom chö dré lamé drin gyi tok"
    },
    {
      "bo": "རང་རིག་བླ་མར་ཤར་བའི་མོས་གུས་ཀྱིས། །",
      "en": "And the devotion of one’s own awareness arising as the guru:",
      "en-trans": "rangrig lamar sharwé mögü kyi"
    },
    {
      "bo": "བྱིན་རླབས་སྙིང་ལ་འཇུག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me so that your inspiration and blessings may enter my heart.",
      "en-trans": "jinlab nying la jukpar jingyi lob"
    }
  ]
}