{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/tsarchen-losal-gyatso/aspirational-prayer-to-behold-beautiful-face-of-khechari",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁའ་སྤྱོད་ཞལ་བཟང་བལྟ་བའི་སྨོན་ལམ་བཞུགས་སོ།།",
    "en": "An Aspirational Prayer to Behold the Beautiful Face of Khecharī"
  },
  "text": [
    {
      "bo": "མཐའ་ཡས་རྒྱལ་བའི་བདེ་སྟོང་ཟློས་གར་ནི། །",
      "en": "From the dance of bliss-emptiness of limitless conquerors,",
      "en-trans": "tayé gyalwé detong dögar ni"
    },
    {
      "bo": "སྲིད་ཞིའི་མིག་འཕྲུལ་ཅིར་ཡང་འཆར་བ་ལས། །",
      "en": "Appearing as so many visual illusions of saṃsāra-nirvāṇa;",
      "en-trans": "sizhi miktrul chiryang charwa lé"
    },
    {
      "bo": "དེང་འདིར་མཁའ་སྤྱོད་དཔལ་མོ་ཡིད་འོང་མ། །",
      "en": "Henceforth, now, glorious Khecharī, Attractive One,",
      "en-trans": "dengdir khachö palmo yi ong ma"
    },
    {
      "bo": "སྙིང་ནས་དྲན་ནོ་འཁྱུད་པའི་བརྩེ་དགས་སྐྱོང་། །",
      "en": "With my heartfelt recollection, protect with a joyful loving embrace.",
      "en-trans": "nying né dren no khyüpé tsé gé kyong"
    },
    {
      "bo": "འོག་མིན་ཞིང་ན་ལྷན་སྐྱེས་རྒྱལ་ཡུམ་མ། །",
      "en": "In Akaniṣṭha is the innate Mother of the conquerors,",
      "en-trans": "womin zhing na lhenkyé gyalyum ma"
    },
    {
      "bo": "ཉེར་བཞིའི་ཡུལ་ན་ཞིང་སྐྱོང་ཌཱ་ཀི་མ། །",
      "en": "At the twenty-four places — the realm born ḍākinīs,",
      "en-trans": "nyerzhi yul na zhingkyong daki ma"
    },
    {
      "bo": "ནོར་འཛིན་ཁྱབ་པའི་ཀརྨ་མུ་ཏྲ་མ། །",
      "en": "Pervasive wealth-holders — karmamudrās;",
      "en-trans": "nordzin khyabpé karma mu tra ma"
    },
    {
      "bo": "རྣལ་འབྱོར་བདག་གི་སྐྱབས་མཆོག་རྗེ་བཙུན་མ། །",
      "en": "Holy One, be the Refuge Lord of me the yogi.",
      "en-trans": "naljor dak gi kyab chok jetsünma"
    },
    {
      "bo": "ཁྱོད་ནི་སེམས་ཉིད་སྟོང་པའི་རང་རྩལ་སྟེ། །",
      "en": "You are the manifestation of my own mind of emptiness,",
      "en-trans": "khyö ni semnyi tongpé rang tsal té"
    },
    {
      "bo": "རྡོ་རྗེའི་གྲོང་ན་ཨེ་དབྱིངས་བཾ་གྱིས་དངོས། །",
      "en": "The actual VAṂ in the E space of the vajra city;",
      "en-trans": "dorjé drong na é ying bam gyi ngö"
    },
    {
      "bo": "སྒྱུ་མའི་གླིང་ན་འཇིགས་རུང་སྲིན་མོ་དང་། །",
      "en": "As a frightful rakṣasī of the island of illusion and",
      "en-trans": "gyumé ling na jikrung sinmo dang"
    },
    {
      "bo": "འཛུམ་དཀར་གཡོ་བའི་ལང་ཚོ་གསར་པ་སྟོན། །",
      "en": "A bright smiling youth — clearly revealed.",
      "en-trans": "dzum kar yowé langtso sarpa tön"
    },
    {
      "bo": "བདག་གིས་ཇི་ལྟར་བཙལ་ཡང་འཕགས་མ་ཁྱོད། །",
      "en": "I, not having found anything determined to be",
      "en-trans": "dak gi jitar tsal yang pakma khyö"
    },
    {
      "bo": "བདེན་པར་གྲུབ་པའི་ངེས་པ་མ་རྙེད་ནས། །",
      "en": "Truly established, although searching, however much;",
      "en-trans": "denpar drubpé ngepa ma nyé né"
    },
    {
      "bo": "སྤྲོས་པས་དུབ་པའི་སེམས་ཉིད་གཞོན་ནུ་དེ། །",
      "en": "The mind of that person wearied by elaborations,",
      "en-trans": "tröpé dubpé semnyi zhönnu dé"
    },
    {
      "bo": "བརྗོད་བྲལ་ནགས་ཀྱི་ཁང་བུར་ངལ་གསོ་རྟེན། །",
      "en": "Takes rest in the forest shelter free of expression.",
      "en-trans": "jödral nak kyi khang bur ngalso ten"
    },
    {
      "bo": "ཨེ་མ་ད་ནི་ཌཱ་ཀི་དབྱིངས་ནས་བཞེངས། །",
      "en": "Ema! Now Ḍākinī, arise from space; from the Śrī Heruka,",
      "en-trans": "ema dani daki ying né zheng"
    },
    {
      "bo": "ཧེ་རུ་ཀ་དཔལ་རྒྱུད་ཀྱི་རྒྱལ་པོ་ལས། །",
      "en": "King of Tantras, protect by the truth of the saying;",
      "en-trans": "heruka pal gyü kyi gyalpo lé"
    },
    {
      "bo": "རྡོ་རྗེ་བཙུན་མོ་ཉེ་བའི་སྙིང་པོ་མཆོག །",
      "en": "Accomplishment is through reciting the excellent",
      "en-trans": "dorjé tsünmo nyewé nyingpo chok"
    },
    {
      "bo": "བཀླག་པས་འགྲུབ་ཅེས་གསུངས་པའི་བདེན་པས་སྐྱོངས། །",
      "en": "Near-essence mantra of the Vajra Queen.",
      "en-trans": "lakpé drub ché sungpé denpé kyong"
    },
    {
      "bo": "ཨོ་ཌི་བི་ཤའི་བས་མཐའི་ནགས་ཁྲོད་དུ། །",
      "en": "In a secluded forest of Oḍḍiyāna,",
      "en-trans": "o di bishé wé té naktrö du"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་རྡོ་རྗེ་དྲིལ་བུ་བ། །",
      "en": "After protecting the lord of siddhas, Vajra Ghaṇṭapa;",
      "en-trans": "drubpé wangchuk dorjé drilbu ba"
    },
    {
      "bo": "འཁྱུད་དང་ཙུམྦྷའི་བདེ་བས་རྗེས་བསྐྱངས་ཏེ། །",
      "en": "With the bliss of an embrace and kiss,",
      "en-trans": "khyü dang tsumbhé dewé jé kyang té"
    },
    {
      "bo": "ཁ་སྦྱོར་མཆོག་གིས་རོལ་ཞིང་བདག་ཀྱང་སྐྱོངས། །",
      "en": "[You] led to the realm of Khechara; likewise also protect me.",
      "en-trans": "khajor chok gi rol zhing dak kyang kyong"
    },
    {
      "bo": "གངྒཱའི་གླིང་དུ་རྗེ་བཙུན་ཀུ་སཱ་ལིས། །",
      "en": "From an island in the Ganga, the holy Kushali",
      "en-trans": "ganggé ling du jetsün kusali"
    },
    {
      "bo": "མངོན་སུམ་ནམ་མཁའི་དབྱིངས་སུ་འཁྲིད་པ་དང་། །",
      "en": "Was actually led to the expanse of space,",
      "en-trans": "ngönsum namkhé ying su tripa dang"
    },
    {
      "bo": "དཔལ་ལྡན་ནཱ་རོ་ཏ་པ་རྗེས་བཟུང་ལྟར། །",
      "en": "And after, glorious Nāropa was taken; likewise,",
      "en-trans": "palden na ro tapa jezung tar"
    },
    {
      "bo": "བདག་ཀྱང་མཁའ་སྤྱོད་དགེ་བའི་གྲོང་དུ་ཁྲིད། །",
      "en": "Lead me also to Khechara, the city of Joyful Ones.",
      "en-trans": "dak kyang khachö gewé drong du tri"
    },
    {
      "bo": "རྩ་བརྒྱུད་བླ་མ་མཆོག་གི་ཐུགས་རྗེ་དང་། །",
      "en": "Through the compassion of the root and lineage [gurus] and the",
      "en-trans": "tsa gyü lama chok gi tukjé dang"
    },
    {
      "bo": "རྒྱུད་ཆེན་གསང་མཐའི་མྱུར་ལམ་ཟབ་ཁྱད་དང་། །",
      "en": "Superior swift path of the profound, ultimate secret, great Tantra;",
      "en-trans": "gyü chen sang té nyurlam zab khyé dang"
    },
    {
      "bo": "རྣལ་འབྱོར་བདག་གིས་ལྷག་བསམ་དད་པའི་མཐུས། །",
      "en": "With the power of a pure unusual attitude, may I the yogi,",
      "en-trans": "naljor dak gi lhaksam depé tü"
    },
    {
      "bo": "མཁའ་སྤྱོད་དགའ་མའི་འཛུམ་ཞལ་མྱུར་མཐོང་ཤོག །",
      "en": "Quickly see the smiling face of the Joyful One, Khecharī.",
      "en-trans": "khachö ga mé dzum zhal nyur tong shok"
    }
  ]
}