{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/words-to-delight-lake-born-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།  །སྔ་འགྱུར་རྡོ་རྗེ་ཐེག་པའི་བསྟན་པ་དར་ཞིང་རྒྱས་པའི་སྨོན་ལམ་མཚོ་སྐྱེས་དགྱེས་པའི་ཞལ་ལུང་།",
    "en": "Words to Delight the Lake-Born One"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་པདྨཱ་ཀ་རཱ་ཡ།  །",
      "en": "Namo guru padmākarāya!",
      "en-trans": "namo guru pemakaraya"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་ཐམས་ཅད་འདུས་པའི་དངོས།  །",
      "en": "The actual embodiment of all the victorious ones of the three times,",
      "en-trans": "dü sum gyalwa tamché düpé ngö"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་ཡོན་ཏན་མཁའ་དང་མཉམ།  །",
      "en": "Whose qualities of knowledge, love and power are as vast as space,",
      "en-trans": "khyen tsé nü pé yönten kha dang nyam"
    },
    {
      "bo": "འཕུར་འགྲོའི་སློབ་དཔོན་པདྨ་འབྱུང་གནས་ཀྱི།  །",
      "en": "Teacher to all who soar and roam about, Ācārya Padmasambhava—",
      "en-trans": "pur drö lobpön pema jungné kyi"
    },
    {
      "bo": "རིང་ལུགས་དར་ཞིང་རྒྱས་པའི་ཤིས་པ་སྩོལ།  །",
      "en": "Grant auspiciousness, so your tradition may flourish and spread.",
      "en-trans": "ringluk dar zhing gyepé shipa tsol"
    },
    {
      "bo": "ཁྱེད་ནི་སངས་རྒྱས་རྣམས་དང་དགོངས་པ་གཅིག  །",
      "en": "You are the equal of the buddhas in your realized intent,",
      "en-trans": "khyé ni sangye nam dang gongpa chik"
    },
    {
      "bo": "ཡི་དམ་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲོ་བསྡུའི་བདག  །",
      "en": "A master from whom oceanic maṇḍalas of yidam deities emanate and into whom they are reabsorbed.",
      "en-trans": "yidam kyilkhor gyatso trodü dak"
    },
    {
      "bo": "མཁའ་འགྲོ་ཡོངས་ཀྱི་མིང་པོ་དཔའ་བོ་རྒྱལ།  །",
      "en": "A brother to all ḍākinīs, sovereign of all vīras,",
      "en-trans": "khandro yong kyi mingpo pawo gyal"
    },
    {
      "bo": "རྡོ་རྗེ་ཐོད་ཕྲེང་བྱིན་རླབས་གཏེར་མཛོད་ཆེ།  །",
      "en": "Vajra Skull-Garland, a great treasury of blessings,",
      "en-trans": "dorjé tötreng jinlab terdzö ché"
    },
    {
      "bo": "ཉི་ཟླ་ནོར་བུ་དཔག་བསམ་ཤིང་བཞིན་དུ།  །",
      "en": "Comparable to the sun and moon, a wish-fulfilling jewel or wish-granting tree,",
      "en-trans": "nyida norbu paksam shing zhindu"
    },
    {
      "bo": "མཆོག་ཐུན་དངོས་གྲུབ་འབྱུང་གནས་ཕན་བདེའི་དབྱིག  །",
      "en": "A source of supreme and ordinary attainments, a treasure of benefit and happiness,",
      "en-trans": "choktün ngödrub jungné pendé yik"
    },
    {
      "bo": "སྲིད་གསུམ་འགྲོ་བ་ཀུན་གྱི་གཙུག་གི་རྒྱན།  །",
      "en": "An adornment for the crowns of all the beings of the three worlds—",
      "en-trans": "si sum drowa kün gyi tsuk gi gyen"
    },
    {
      "bo": "གང་གི་རིང་ལུགས་ཉི་ལྟར་གསལ་གྱུར་ཅིག  །",
      "en": "May your tradition shine as resplendently as the sun.",
      "en-trans": "gang gi ringluk nyi tar sal gyur chik"
    },
    {
      "bo": "གདོང་དམར་བོད་ཡུལ་མུན་པའི་གླིང་ཉིད་དུ།  །",
      "en": "In this benighted country of the red-faced people, Tibet,",
      "en-trans": "dong mar böyul münpé ling nyi du"
    },
    {
      "bo": "ལྷ་སྲིན་དམ་བཏགས་བསྟན་པའི་ཤིང་རྟ་འདྲེན།  །",
      "en": "You bound gods and spirits under oath and introduced the chariot of the teachings.",
      "en-trans": "lhasin dam tak tenpé shingta dren"
    },
    {
      "bo": "མཁན་སློབ་ཆོས་རྒྱལ་བཻ་རོ་སྐ་ཅོག་གང་།  །",
      "en": "Abbot, teacher and dharma-king, Vairotsana, Kawa Paltsek and Chokro Lüi Gyaltsen,",
      "en-trans": "khen lob chögyal bai ro ka chok gang"
    },
    {
      "bo": "གྲུབ་བརྙེས་མཁས་གྲུབ་རིག་འཛིན་ཚོགས་རྣམས་ཀྱིས།  །",
      "en": "And hosts of learned and accomplished vidyādharas who had gained attainments,",
      "en-trans": "drub nyé khedrub rigdzin tsok nam kyi"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་དཀའ་བས་བཙལ་ཞིང་བསྒྱུར་བཤད་དང་།  །",
      "en": "All with enlightened resolve, painstakingly sought, translated and taught,",
      "en-trans": "tukkyé kawé tsal zhing gyur shé dang"
    },
    {
      "bo": "འཆད་ཉན་སྒོམ་སྒྲུབ་ཚད་མས་གྲུབ་པ་ཡི།  །",
      "en": "Establishing the validity, through study and through practice,",
      "en-trans": "chenyen gom drub tsemé drubpa yi"
    },
    {
      "bo": "འདུལ་མདོ་མངོན་པ་གསང་སྔགས་ཕྱི་ནང་གི  །",
      "en": "Of the precious teachings of the Vinaya, Sūtra, Abhidharma,",
      "en-trans": "dul do ngönpa sang ngak chinang gi"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་དར་ཞིང་རྒྱས་གྱུར་ཅིག  །",
      "en": "And the outer and inner collections of Secret Mantra—may they flourish and spread.",
      "en-trans": "tenpa rinchen dar zhing gyé gyur chik"
    },
    {
      "bo": "ཁྱད་པར་བསྐལ་མང་མཚན་ཙམ་ཐོས་དཀའ་བའི།  །",
      "en": "Even across many aeons, it is rare to hear the names of",
      "en-trans": "khyepar kal mang tsen tsam tö kawé"
    },
    {
      "bo": "ནང་པ་རྣལ་འབྱོར་ཐབས་ཀྱི་རྒྱུད་ཆེན་པོའི།  །",
      "en": "The great tantras of the inner yogic methods, in particular—",
      "en-trans": "nangpa naljor tab kyi gyü chenpö"
    },
    {
      "bo": "སྙིང་པོ་སྒྱུ་འཕྲུལ་འདུས་མདོ་སེམས་ཕྱོགས་ཀྱི།  །",
      "en": "The Essence of Illusory Display, the Sūtra of Gathering, and Area of the Mind.1",
      "en-trans": "nyingpo gyutrul dü do sem chok kyi"
    },
    {
      "bo": "རྒྱུད་བཤད་དབང་བཀའ་གདམས་པའི་མན་ངག་རྣམས།  །",
      "en": "Seeing the extremely fragile state of the transmission lineages",
      "en-trans": "gyü shé wang kadampé mengak nam"
    },
    {
      "bo": "ཤིན་ཏུ་ཉག་ཕྲར་གྱུར་པ་འདིར་གཟིགས་ནས།  །",
      "en": "Of their explanation, empowerment and pith instructions,",
      "en-trans": "shintu nyak trar gyurpa dir zik né"
    },
    {
      "bo": "མཁྱེན་སྟོབས་ཐུགས་རྗེ་ནུས་པའི་རྩལ་སྤྲུགས་ཏེ།  །",
      "en": "Intensify the power of your wisdom, compassion and skill,",
      "en-trans": "khyen tob tukjé nüpé tsal truk té"
    },
    {
      "bo": "རིག་འཛིན་སྤྲུལ་པའི་སྐུ་མཆོག་ཁྱད་པར་ཅན།  །",
      "en": "And cause vidyādharas and sublime nirmāṇakāya emanations",
      "en-trans": "rigdzin trulpé ku chok khyepar chen"
    },
    {
      "bo": "མཁའ་ལས་ཐོག་བབ་བཞིན་དུ་འབྱོན་པར་མཛོད།  །",
      "en": "To appear, just like bolts of lightning descending from the sky.",
      "en-trans": "kha lé tok bab zhindu jönpar dzö"
    },
    {
      "bo": "འཇམ་དཔལ་དཔའ་བོའི་ཡེ་ཤེས་སྙིང་ལ་ཞུགས།  །",
      "en": "With the wisdom of the warrior Mañjuśrī in our hearts,",
      "en-trans": "jampal pawö yeshe nying la zhuk"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་ཀྱི་བརྩེ་བའི་སྤྱན་དང་ལྡན།  །",
      "en": "The tender loving gaze of Avalokiteśvara,",
      "en-trans": "chenrezik kyi tsewé chen dangden"
    },
    {
      "bo": "གསང་འཛིན་དབང་པོའི་ནུས་པའི་མཐུ་བརྙེས་པས།  །",
      "en": "And the strength and capacity of the mighty Keeper of Secrets,2",
      "en-trans": "sang dzin wangpö nüpé tu nyepé"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་མེ་རོ་སློངས་གྱུར་ཅིག  །",
      "en": "May we rekindle the dying embers of the Ancient Translation teachings.",
      "en-trans": "ngagyur tenpé mé ro long gyur chik"
    },
    {
      "bo": "ངེས་འབྱུང་ཚུལ་ཁྲིམས་ལྡན་པའི་བཙུན་པ་དང་།  །",
      "en": "May the ranks of the ordained saṅgha who possess renunciation and discipline",
      "en-trans": "ngejung tsultrim denpé tsünpa dang"
    },
    {
      "bo": "རིམ་གཉིས་དམ་ལྡན་གསང་སྔགས་འཆང་བ་ཡི།  །",
      "en": "And of the secret mantra practitioners who maintain the samayas of the two stages",
      "en-trans": "rim nyi damden sang ngakchang ba yi"
    },
    {
      "bo": "སྡེ་གཉིས་མ་དྲོས་མཚོ་ཆེན་ལྟར་རྒྱས་ཏེ།  །",
      "en": "Both expand like the great lake of Manasarovar.",
      "en-trans": "dé nyi ma drö tso chen tar gyé té"
    },
    {
      "bo": "ཚར་གཅོད་རྗེས་འཛིན་ཕྱི་ཡི་རིག་པའི་གནས།  །",
      "en": "The outer sciences of refutation and maintenance,",
      "en-trans": "tsarchö jedzin chi yi rigpé né"
    },
    {
      "bo": "ཟབ་མོ་ནང་གི་དོན་རིག་གཞུང་ལུགས་ཆེ།  །",
      "en": "The great textual tradition of the profound inner science,",
      "en-trans": "zabmo nang gi dön rik zhungluk ché"
    },
    {
      "bo": "བྱང་ཕྱོགས་བཤད་རྒྱུན་འདེགས་པའི་བཀའ་ཆེན་བཅུའི།  །",
      "en": "And scripture and reasoning based on threefold analysis",
      "en-trans": "jangchok shé gyün dekpé ka chen chü"
    },
    {
      "bo": "དཔྱད་གསུམ་དག་པའི་ལུང་རིགས་ཆོས་རྔ་སྒྲོགས།  །",
      "en": "From the ten great pillars who supported the exegetical tradition in this northern land—",
      "en-trans": "ché sum dakpé lung rik chö nga drok"
    },
    {
      "bo": "བཀའ་བབ་ཆུ་བོ་རྣམ་བཞི་རྒྱས་གྱུར་ཅིག  །",
      "en": "May the drum of Dharma resound and the four river-like transmissions flourish.",
      "en-trans": "kabab chuwo nam zhi gyé gyur chik"
    },
    {
      "bo": "ཤིན་ཏུ་ཟབ་པ་ཀུན་དང་ཐུན་མོང་མིན།  །",
      "en": "May the jewel-like material and Dharma treasures",
      "en-trans": "shintu zabpa kün dang tünmong min"
    },
    {
      "bo": "མཁའ་འགྲོའི་སྙིང་ཁྲག་གཏེར་གྱི་བརྒྱུད་འཛིན་པའི།  །",
      "en": "Of the great vidyādharas with miraculous powers,",
      "en-trans": "khandrö nyingtrak ter gyi gyü dzinpé"
    },
    {
      "bo": "རྫུ་འཕྲུལ་རྩལ་འཆང་རིག་འཛིན་ཆེན་པོ་རྣམས།  །",
      "en": "Who appeared in the past and who will come in future,",
      "en-trans": "dzutrul tsal chang rigdzin chenpo nam"
    },
    {
      "bo": "སྔར་ཡང་བྱོན་དང་སླད་ནས་འབྱོན་འགྱུར་གྱི།  །",
      "en": "Upholding the lineage of extremely profound, uncommon treasures,",
      "en-trans": "ngar yang jön dang lé né jön gyur gyi"
    },
    {
      "bo": "རྫས་དང་ཆོས་གཏེར་ནོར་བུའི་གྲམ་བུར་བརྡལ།  །",
      "en": "The ḍākinīs’ heart-blood, be widely disseminated,",
      "en-trans": "dzé dang chö ter norbü dram bur dal"
    },
    {
      "bo": "བསྟན་འགྲོའི་རྒུད་པ་ཐམས་ཅད་སེལ་བ་དང་།  །",
      "en": "Dispelling all the ills that plague the teachings and beings.",
      "en-trans": "ten drö güpa tamché selwa dang"
    },
    {
      "bo": "མཆོག་ཐུན་དངོས་གྲུབ་བརྙེས་པས་ས་སྟེང་ཁེངས།  །",
      "en": "May those who attain supreme and common siddhis fill the earth,",
      "en-trans": "choktün ngödrub nyepé sateng kheng"
    },
    {
      "bo": "མ་ཧཱ་གུ་རུའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག  །",
      "en": "And may the teachings of the Mahāguru spread far and wide.",
      "en-trans": "maha gurü tenpa gyé gyur chik"
    },
    {
      "bo": "ཡིད་དཔྱོད་ཐེག་པའི་གྲུབ་མཐའི་འཕྲང་ལས་བརྒལ།  །",
      "en": "By transcending the limited tenets of the eight speculative vehicles,",
      "en-trans": "yichö tekpé drubté trang lé gal"
    },
    {
      "bo": "སེམས་ཀྱི་མདུད་གྲོལ་རིག་པ་སྐུ་གསུམ་གྱི།  །",
      "en": "As mental knots are released, may the realization of three-kāya awareness",
      "en-trans": "sem kyi dü drol rigpa ku sum gyi"
    },
    {
      "bo": "དགོངས་པའི་རྩལ་རྫོགས་ཆོས་ཀུན་རང་སར་གྲོལ།  །",
      "en": "Reach full strength and all dharmas be freed in their own place.",
      "en-trans": "gongpé tsal dzok chö kün rang sar drol"
    },
    {
      "bo": "འོད་གསལ་སྒྲོན་མ་བཞི་ཡི་གསེང་ལམ་ནས།  །",
      "en": "Then, through the direct approach of the four lamps of luminosity,",
      "en-trans": "ösal drönma zhi yi seng lam né"
    },
    {
      "bo": "ཀ་དག་སྟོང་ཆེན་ཆོས་སྐུའི་ཀློང་ཆེན་པོར།  །",
      "en": "In the vast dharmakāya expanse of primordially pure great emptiness,",
      "en-trans": "kadak tongchen chökü longchen por"
    },
    {
      "bo": "ལྷུན་གྲུབ་སྐུ་དང་ཡེ་ཤེས་ཚོམ་བུ་བཀྲ།  །",
      "en": "May the spontaneously perfect clusters of kāyas and wisdoms appear clearly,",
      "en-trans": "lhündrub ku dang yeshe tsombu tra"
    },
    {
      "bo": "སྣང་བ་བཞི་ཡི་ལམ་གྱི་ཕ་མཐར་ཕྱིན།  །",
      "en": "And may we reach the culmination of the path of the four visions.",
      "en-trans": "nangwa zhi yi lam gyi patar chin"
    },
    {
      "bo": "རིག་པ་བཅུད་སྨིན་རྡོ་རྗེའི་སྐུ་བརྙེས་པས།  །",
      "en": "Through gaining the vajrakāya that is the maturation of awareness,",
      "en-trans": "rigpa chü min dorjé ku nyepé"
    },
    {
      "bo": "གངས་ཅན་རི་ཡི་སུལ་ཀུན་ཁྱབ་པ་དང་།  །",
      "en": "May our impact extend throughout every valley in the Land of Snows,",
      "en-trans": "gangchen ri yi sul künkhyab pa dang"
    },
    {
      "bo": "འཇིགས་མེད་རྡོ་རྗེའི་གད་རྒྱངས་སྒྲོགས་པ་ཡིས།  །",
      "en": "And with the roaring laughter of vajra fearlessness,",
      "en-trans": "jikme dorjé gegyang drokpa yi"
    },
    {
      "bo": "ཕས་རྒོལ་གཅན་གཟན་གཏུམ་པོ་མཐའ་དག་བཅོམ།  །",
      "en": "May we triumph over all the savage beasts who are our adversaries.",
      "en-trans": "pé gol chenzen tumpo tadak chom"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག  །",
      "en": "May the teachings of the Lake-born Buddha flourish and spread.",
      "en-trans": "tsokyé gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "མན་ངག་རྒྱ་མཚོའི་ཆུ་གཏེར་ཆེན་པོ་ལས།  །",
      "en": "May the great waves of the four types of activity",
      "en-trans": "mengak gyatsö chuter chenpo lé"
    },
    {
      "bo": "ཕྲིན་ལས་རྣམ་བཞིའི་རྦ་རླབས་ཆེར་གཡོས་པས།  །",
      "en": "Emerge out of the vast, oceanic treasury of pith instructions,",
      "en-trans": "trinlé nam zhi ba lab cher yöpé"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཐུབ་པའི་བསྟན་པ་འཕེལ་ཞིང་རྒྱས།  །",
      "en": "Causing the teachings of the Omniscient Sage to flourish and spread,",
      "en-trans": "künkhyen tubpé tenpa pel zhing gyé"
    },
    {
      "bo": "མཁའ་ཁྱབ་སེམས་ཅན་བདེ་སྐྱིད་རྒྱས་གྱུར་ཅིག  །",
      "en": "And may the happiness of beings throughout the whole of space forever increase.",
      "en-trans": "khakhyab semchen dekyi gyé gyur chik"
    },
    {
      "bo": "སྔ་འགྱུར་ཤིང་རྟའི་དཔལ་ལས་དྲངས་པ་ཡི།  །",
      "en": "Encouraged by the glories of the Ancient Translations school,",
      "en-trans": "ngagyur shingté pal lé drangpa yi"
    },
    {
      "bo": "བཀའ་གདམས་ས་སྐྱ་མར་ཤངས་བཀའ་བརྒྱུད་དང་།  །",
      "en": "May those who uphold the teaching and practice of the Kadam, Sakya,",
      "en-trans": "kadam sakya mar shang kagyü dang"
    },
    {
      "bo": "དགེ་ལྡན་ཞི་གཅོད་ཇོ་ཞལ་ལ་སོགས་པ།  །",
      "en": "Marpa and Shangpa Kagyü, Gendenpa, Pacifying, Chöd, Jonang, Zhalu",
      "en-trans": "geden zhi chö jo zhal lasokpa"
    },
    {
      "bo": "བཤད་སྒྲུབ་འཛིན་རྣམས་བསྟན་པ་དར་རྒྱས་ཤོག  །",
      "en": "And other traditions help their own systems to flourish and spread.",
      "en-trans": "shedrub dzin nam tenpa dargyé shok"
    },
    {
      "bo": "མདོར་ན་སྔོན་བྱོན་རྒྱལ་བློན་བྱང་སེམས་དང་།  །",
      "en": "In short, through the enlightened resolve of the kings, ministers,",
      "en-trans": "dorna ngön jön gyal lön changsem dang"
    },
    {
      "bo": "སྤྲུལ་པའི་ལོ་པཎ་རྣམས་ཀྱི་ཐུགས་བསྐྱེད་ཀྱིས།  །",
      "en": "Bodhisattvas and emanated lotsāwas and paṇḍitas of the past,",
      "en-trans": "trulpé lo pen nam kyi tukkyé kyi"
    },
    {
      "bo": "ཇི་ལྟར་སྨོན་པ་བཞིན་དུ་འགྲུབ་པ་དང་།  །",
      "en": "May all that we be accomplished in accordance with our wishes,",
      "en-trans": "jitar mönpa zhindu drubpa dang"
    },
    {
      "bo": "ཨོ་རྒྱན་གུ་རུའི་བསྟན་པ་དར་རྒྱས་ཤོག  །",
      "en": "And may the teachings of the Oḍḍiyāna Guru flourish and spread.",
      "en-trans": "orgyen gurü tenpa dargyé shok"
    },
    {
      "bo": "གཞན་ཡང་རིས་མེད་བསྟན་པ་དར་ཞིང་རྒྱས།  །",
      "en": "Moreover, may all be auspicious for the nonsectarian teachings to spread,",
      "en-trans": "zhenyang rimé tenpa dar zhing gyé"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་མཆོག་ཞབས་པད་བརྟན་པ་དང་།  །",
      "en": "The lives of the sublime beings who uphold the teachings to remain secure,",
      "en-trans": "tendzin kyechok zhabpé tenpa dang"
    },
    {
      "bo": "དགེ་འདུན་ཐུགས་མཐུན་སྦྱིན་བདག་ཚེ་བསོད་རྒྱས།  །",
      "en": "The saṅgha to live in harmony, the merit and longevity of patrons to increase,",
      "en-trans": "gendün tuktün jindak tsesö gyé"
    },
    {
      "bo": "དུས་ཀྱི་རྒུད་པ་མ་ལུས་ཀུན་ཞི་ཞིང་།  །",
      "en": "All the various ills of this age without exception to be pacified,",
      "en-trans": "dü kyi güpa malü kün zhi zhing"
    },
    {
      "bo": "མཁའ་ལ་རྫོགས་ལྡན་གསར་པའི་ཉི་གཞོན་འཆར།  །",
      "en": "The fresh sun heralding a golden dawn to rise within the sky,",
      "en-trans": "kha la dzokden sarpé nyizhön char"
    },
    {
      "bo": "ས་ལ་ངོ་མཚར་པདྨའི་དགའ་ཚལ་རྒྱས།  །",
      "en": "Lotus gardens of wonder to flourish everywhere upon the earth,",
      "en-trans": "sa la ngotsar pemé gatsal gyé"
    },
    {
      "bo": "བར་དུ་དགེ་ལེགས་དཔལ་གྱིས་འབྱོར་པ་ཡི།  །",
      "en": "The atmosphere to be enriched by splendours of virtuous excellence,",
      "en-trans": "bardu gelek pal gyi jorpa yi"
    },
    {
      "bo": "བསྟན་པ་མི་ནུབ་དར་རྒྱས་བཀྲ་ཤིས་ཤོག།  །།",
      "en": "And the teachings never to decline but to flourish and spread far and wide.",
      "en-trans": "tenpa mi nub dargyé tashi shok"
    }
  ]
}