{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-overcome-invading-forces",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཀོན་མཆོག་རྩ་གསུམ་རྒྱ་མཚོའི་བདེན་སྟོབས་བརྗོད་པ།",
    "en": "A Prayer to Overcome Invading Forces"
  },
  "text": [
    {
      "bo": "དཀོན་མཆོག་རྩ་གསུམ་རྒྱ་མཚོའི་བདེན་སྟོབས་དང་།  །",
      "en": "Through the power of the truth of the Three Jewels and the oceanic Three Roots,",
      "en-trans": "könchok tsa sum gyatsö den tob dang"
    },
    {
      "bo": "ཁྱད་པར་རིག་འཛིན་རྡོ་རྗེ་དྲག་རྩལ་གྱིས།  །",
      "en": "Especially the vidyādhara Dorje Drakpo Tsal,",
      "en-trans": "khyepar rigdzin dorjé drakstal gyi"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པ་བསྐལ་པའི་མེ་བཞིན་སྦོར།  །",
      "en": "May all their power, force and strength blaze forth like apocalyptic flames",
      "en-trans": "tutob nüpa kalpé mé zhin bor"
    },
    {
      "bo": "མཐའ་དམག་དམར་པོའི་དཔུང་ཚོགས་ལྷག་མེད་བསྲེགས།  །",
      "en": "To burn away the invading forces of the Red Army until none remains.",
      "en-trans": "tamak marpö pungtsok lhakmé sek"
    },
    {
      "bo": "ཀླ་ཀློའི་འདུན་གྲོས་བྱེ་མ་ཆུ་བླུགས་བཞིན།  །",
      "en": "May the machinations of these barbarians vanish like water poured on sand,",
      "en-trans": "lalö dün drö jema chu luk zhin"
    },
    {
      "bo": "ནུས་མེད་རང་ཞི་གྱུར་ནས་རྒྱལ་བའི་བསྟན།  །",
      "en": "And may they be naturally subdued, rendered powerless, so that the teachings of the victorious Buddha,",
      "en-trans": "nümé rang zhi gyur né gyalwé ten"
    },
    {
      "bo": "དེ་འཛིན་སྡེ་དང་བཅས་པ་གནོད་འཚེ་བྲལ།  །",
      "en": "Together with all the ranks of those who uphold them, remain intact and unscathed.",
      "en-trans": "dé dzin dé dang chepa nö tsedral"
    },
    {
      "bo": "བསམ་དོན་ཡིད་བཞིན་འགྲུབ་པར་བྱིན་གྱིས་རློབས།  །",
      "en": "Grant your blessings so that this aspiration may be fulfilled according to our wishes.",
      "en-trans": "samdön yizhin drubpar jingyi lob"
    }
  ]
}