{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/longchen-rabjam/six-aspirations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྟག་ཏུ་གདབ་པའི་སྨོན་ལམ་རྣམ་དྲུག",
    "en": "Six Aspirations to Be Continually Recited"
  },
  "text": [
    {
      "bo": "གང་དུ་སྐྱེས་པའི་སྐྱེ་བ་ཐམས་ཅད་དུ། །",
      "en": "In all my lives, wherever I am born,",
      "en-trans": "gangdu kyepé kyewa tamché du"
    },
    {
      "bo": "མཐོ་རིས་ཡོན་ཏན་བདུན་ལྡན་ཐོབ་པར་ཤོག །",
      "en": "May I obtain the seven qualities of birth in higher realms.1",
      "en-trans": "tori yönten dünden tobpar shok"
    },
    {
      "bo": "སྐྱེ་མ་ཐག་ཏུ་ཆོས་དང་འཕྲད་གྱུར་ཅིང༌། །",
      "en": "As soon as I am born, may I meet the Dharma,",
      "en-trans": "kyé mataktu chö dang tré gyur ching"
    },
    {
      "bo": "ཚུལ་བཞིན་བསྒྲུབ་པའི་རང་དབང་ཡོད་པར་ཤོག །",
      "en": "And have the freedom to practise it correctly.",
      "en-trans": "tsulzhin drubpé rangwang yöpar shok"
    },
    {
      "bo": "དེར་ཡང་བླ་མ་དམ་པ་མཉེས་བྱེད་ཅིང༌། །",
      "en": "Then, may I please the noble guru,",
      "en-trans": "der yang lama dampa nyé jé ching"
    },
    {
      "bo": "ཉིན་དང་མཚན་དུ་ཆོས་ལ་སྤྱོད་པར་ཤོག །",
      "en": "And put the Dharma into action day and night.",
      "en-trans": "nyin dang tsen du chö la chöpar shok"
    },
    {
      "bo": "ཆོས་རྟོགས་ནས་ནི་སྙིང་པོའི་དོན་བསྒྲུབ་སྟེ། །",
      "en": "May I realize the Dharma, actualize its innermost meaning,",
      "en-trans": "chö tok né ni nyingpö dön drub té"
    },
    {
      "bo": "ཚེ་དེར་སྲིད་པའི་རྒྱ་མཚོ་བརྒལ་བར་ཤོག །",
      "en": "And so cross the ocean of existence in this very life.",
      "en-trans": "tsé der sipé gyatso galwar shok"
    },
    {
      "bo": "སྲིད་པར་དམ་པའི་ཆོས་རབ་སྟོན་བྱེད་ཅིང༌། །",
      "en": "May I teach the sacred Dharma to beings wandering in saṃsāra,",
      "en-trans": "sipar dampé chö rab tönjé ching"
    },
    {
      "bo": "གཞན་ཕན་བསྒྲུབ་ལ་སྐྱོ་ངལ་མེད་པར་ཤོག །",
      "en": "And never tire or weary of working to help others.",
      "en-trans": "zhenpen drub la kyo ngal mepar shok"
    },
    {
      "bo": "རླབས་ཆེན་གཞན་དོན་ཕྱོགས་རིས་མེད་པ་ཡིས། །",
      "en": "Through my vast and impartial service to others,",
      "en-trans": "lab chen zhendön chokri mepa yi"
    },
    {
      "bo": "ཐམས་ཅད་ཕྱམ་གཅིག་སངས་རྒྱས་ཐོབ་པར་ཤོག །",
      "en": "May all beings attain buddhahood together, as one!",
      "en-trans": "tamché chamchik sangye tobpar shok"
    }
  ]
}