{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/topics/sukhavati-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གསོལ་འདེབས་ཚུལ་དུ་འཕོ་བ།",
    "en": "Prayer of Transference1"
  },
  "text": [
    {
      "bo": "མདུན་མཁར་ཡིད་འཕྲོག་འཇའ་འོད་འཁྲིགས་པའི་ཀློང་།  །",
      "en": "In the sky in front, amidst a captivating expanse of dense rainbow light,",
      "en-trans": "dün khar yitrok ja ö trikpé long"
    },
    {
      "bo": "སེང་ཁྲི་པདྨ་ཟླ་བའི་གདན་སྟེང་དུ།  །",
      "en": "Upon a lion throne and seats of lotus and lunar disc",
      "en-trans": "sengtri pema dawé den tengdu"
    },
    {
      "bo": "རྩ་བའི་བླ་མ་མགོན་པོ་འོད་དཔག་མེད།  །",
      "en": "Is my own root guru in the form of the protector Amitābha,",
      "en-trans": "tsawé lama gönpo öpakmé"
    },
    {
      "bo": "སྐྱབས་གནས་རྒྱ་མཚོའི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་བ།  །",
      "en": "Entirely surrounded by oceanic hosts of the sources of refuge.",
      "en-trans": "kyabné gyatsö tsok kyi yong korwa"
    },
    {
      "bo": "བདག་དང་དམིགས་ཡུལ་འགྲོ་བ་མ་ལུས་པར།  །",
      "en": "All of them abide with loving affection for me,",
      "en-trans": "dak dang mikyul drowa malüpar"
    },
    {
      "bo": "རྗེས་སུ་བརྩེ་བའི་ཚུལ་གྱིས་བཞུགས་པར་གྱུར།  །",
      "en": "The object of focus, and all beings.",
      "en-trans": "jesu tsewé tsul gyi zhukpar gyur"
    },
    {
      "bo": "སྐྱེ་འཆི་བར་དོའི་འཁྲུལ་སྣང་མ་ཞིག་པ།  །",
      "en": "Now that this object of focus, who has not yet put a stop to the delusory perceptions",
      "en-trans": "kyechi bardö trulnang mazhikpa"
    },
    {
      "bo": "དམིགས་ཡུལ་ཚེ་འདས་འདི་ཡི་རྣམ་ཤེས་ནི།  །",
      "en": "Of birth, death and the bardo, has passed on, let their consciousness",
      "en-trans": "mikyul tsedé di yi namshé ni"
    },
    {
      "bo": "འཆི་མེད་ལམ་ནས་སྐར་མདའ་འཕོ་བ་བཞིན།  །",
      "en": "Be transferred through the path of deathlessness like a shooting star",
      "en-trans": "chimé lam né karda powa zhin"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཐུགས་ཀར་ཐིམ་པར་གྱུར།  །",
      "en": "And dissolve into the precious guru’s heart.",
      "en-trans": "jetsün lamé tukkar timpar gyur"
    },
    {
      "bo": "སྐྱབས་གནས་རྒྱ་མཚོའི་ཐུགས་རྗེའི་བྱིན་རླབས་དང་།  །",
      "en": "Through the compassionate blessings of the oceanic sources of refuge",
      "en-trans": "kyabné gyatsö tukjé jinlab dang"
    },
    {
      "bo": "རྣལ་འབྱོར་བདག་གི་ལྷག་བསམ་དག་པའི་མཐུས།  །",
      "en": "And the power of this yogi’s pure altruistic intention,",
      "en-trans": "naljor dak gi lhaksam dakpé tü"
    },
    {
      "bo": "འཁྲུལ་པའི་སེམས་དང་རྗེ་བཙུན་བླ་མའི་ཐུགས།  །",
      "en": "May their deluded mind and the precious guru’s wisdom",
      "en-trans": "trulpé sem dang jetsün lamé tuk"
    },
    {
      "bo": "གཉིས་མེད་མཉམ་པ་ཆེན་པོར་མ་བཅོས་ཨཿ།  །",
      "en": "Rest without contrivance in non-dual great equanimity: āḥ!",
      "en-trans": "nyimé nyampa chenpor machö ah"
    },
    {
      "bo": "རྒྱུ་དེས་ལས་ངན་སྡིག་སྒྲིབ་ཀུན་བྱང་ནས།  །",
      "en": "May this be the cause of purifying negative karma, misdeeds and obscurations,",
      "en-trans": "gyu dé lé ngen dikdrib kün jang né"
    },
    {
      "bo": "འཁྲུལ་སྣང་བར་དོའི་འཇིགས་སྐྲག་མི་འཆར་བར།  །",
      "en": "So that the terrifying delusory appearances of the bardos do not arise,",
      "en-trans": "trulnang bardö jiktrak mi charwar"
    },
    {
      "bo": "དག་པའི་ཞིང་དུ་དགེ་བའི་འཕྲོ་མཐུད་དེ།  །",
      "en": "And this person may continue their pursuit of virtue in a pure realm",
      "en-trans": "dakpé zhing du gewé trotü dé"
    },
    {
      "bo": "མྱུར་དུ་རྫོགས་པའི་སངས་རྒྱས་ཐོབ་པར་ཤོག  །",
      "en": "And swiftly attain perfect buddhahood!",
      "en-trans": "nyurdu dzokpé sangye tobpar shok"
    }
  ]
}