{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/sun-of-samantabhadras-realm-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་རྒྱ་མཚོའི་ཡང་སྙིང་ཀུན་བཟང་ཞིང་གི་ཉི་མ་ཞེས་བྱ་བ་བཞུགས། །",
    "en": "The Quintessence of Oceanic Prayers of Aspiration"
  },
  "text": [
    {
      "bo": "བགྲང་ཡས་ཚོགས་ཟུང་དཔལ་གྱིས་བསྐྲུན་པའི་སྐུ། །",
      "en": "Your enlightened body was formed through the splendour of twofold accumulation beyond measure;",
      "en-trans": "drang yé tsok zung pal gyi trünpé ku"
    },
    {
      "bo": "ཡན་ལག་དྲུག་ཅུ་ལྡན་པ་ཚངས་དབྱངས་གསུང་། །",
      "en": "Your enlightened speech, the melody of Brahmā, has sixty aspects;",
      "en-trans": "yenlak drukchu denpa tsang yang sung"
    },
    {
      "bo": "སྟོབས་བཅུའི་ཡོན་ཏན་ཀུན་ནས་རྫོགས་པའི་ཐུགས། །",
      "en": "And your enlightened mind is perfectly replete with the qualities of the ten powers—",
      "en-trans": "tob chü yönten künné dzokpé tuk"
    },
    {
      "bo": "ཐུབ་དབང་ལྷ་ཡི་ལྷ་མཆོག་དགོངས་སུ་གསོལ། །",
      "en": "Mighty Sage, supreme deity of deities, turn your attention towards me, I pray.",
      "en-trans": "tubwang lha yi lha chok gong su sol"
    },
    {
      "bo": "སྡུག་བསྔལ་གསུམ་གྱིས་ཆེས་ཆེར་མནར་བའི་ཚོགས། །",
      "en": "Just as you embraced with intense care and compassion",
      "en-trans": "dukngal sum gyi ché cher narwé tsok"
    },
    {
      "bo": "གང་གིས་བརྩེ་ཆེན་ཐུགས་རྗེས་ཉེ་བར་བཟུང་། །",
      "en": "The multitudes tormented by the three types of suffering,1",
      "en-trans": "gang gi tsé chen tukjé nyewar zung"
    },
    {
      "bo": "དོན་གཉིས་འདོད་པ་ཡིད་བཞིན་འཇོ་བའི་ཕྱིར། །",
      "en": "And set your mind on supreme and unsurpassed awakening,",
      "en-trans": "dön nyi döpa yizhin jowé chir"
    },
    {
      "bo": "བླ་མེད་བྱང་ཆུབ་མཆོག་ཏུ་ཐུགས་བསྐྱེད་ལྟར། །",
      "en": "In order to fulfil the twin aims and wishes of yourself and others,",
      "en-trans": "lamé changchub chok tu tukkyé tar"
    },
    {
      "bo": "བདག་ཀྱང་མཁའ་མཉམ་འགྲོ་ཀུན་མ་སྟོང་བར། །",
      "en": "May I too remain untempted by the allure of selfish peace and bliss,",
      "en-trans": "dak kyang khanyam dro kün matong bar"
    },
    {
      "bo": "རང་དོན་ཞི་བདེའི་དཔལ་ལ་མི་ཆགས་པར། །",
      "en": "And, until all beings, who are as innumerable as space is vast, are freed,",
      "en-trans": "rangdön zhidé pal la mi chakpar"
    },
    {
      "bo": "གཞན་ཕན་ལྷག་པའི་བསམ་སྤྱོད་རྒྱན་བཞིན་བསྟེན། །",
      "en": "Rely on the adornment of altruistic concern and beneficial conduct.",
      "en-trans": "zhenpen lhakpé sam chö gyen zhin ten"
    },
    {
      "bo": "འཇུག་པར་བྱའོ་སྲིད་པའི་གྲོང་ཁྱེར་ལ། །",
      "en": "In all my lives, as I willingly enter the citadel of conditioned existence,",
      "en-trans": "jukpar ja o sipé drongkhyer la"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་ཡབ་གཅིག་མཁྱེན་པའི་གཏེར། །",
      "en": "May I be cared for and joyfully accepted by the sole father of all,",
      "en-trans": "kyewa küntu yab chik khyenpé ter"
    },
    {
      "bo": "འཇམ་དཔལ་དཔའ་བོས་དགྱེས་བཞིན་རྗེས་སུ་བཟུང་། །",
      "en": "That veritable treasury of wisdom, heroic Mañjuśrī,",
      "en-trans": "jampal pawö gyé zhin jesu zung"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་ལས་བསྟན་པའི། །",
      "en": "And may I perfect the oceanic conduct of the bodhisattvas,",
      "en-trans": "kuntuzangpö mönlam lé tenpé"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པ་རྒྱ་མཚོ་མཐར་ཕྱིན་ཤོག །",
      "en": "As revealed in Samantabhadra's prayer of aspiration.",
      "en-trans": "changchub chöpa gyatso tarchin shok"
    },
    {
      "bo": "མ་འོངས་རྣམ་འདྲེན་དགུ་བརྒྱ་དགུ་བཅུ་དྲུག།",
      "en": "In future, when nine hundred and ninety-six great guides",
      "en-trans": "ma ong namdren gugya guchu druk"
    },
    {
      "bo": "ཞིང་འདིར་མངོན་འཚང་རྒྱ་བའི་ཚུལ་སྟོན་ཚེ། །",
      "en": "Display the attainment of awakening in this very realm,",
      "en-trans": "zhing dir ngön tsanggyawé tsul tön tsé"
    },
    {
      "bo": "རྟག་ཏུ་ཞབས་འབྲང་ཉེར་གནས་མཆོག་ཏུ་གྱུར། །",
      "en": "May I serve them constantly as the best of their attendants,",
      "en-trans": "taktu zhab drang nyer né chok tu gyur"
    },
    {
      "bo": "རླབས་ཆེན་ཕྲིན་ལས་སྤེལ་བའི་མཐུ་ཐོབ་ཤོག །",
      "en": "And gain the power to contribute to their magnificent activity.",
      "en-trans": "lab chen trinlé pelwé tu tob shok"
    },
    {
      "bo": "བཟང་ངན་ལས་ཀྱིས་འབྲེལ་བའི་སེམས་ཅན་རྣམས། །",
      "en": "May all beings with whom I am connected, through actions good or bad,",
      "en-trans": "zang ngen lé kyi drelwé semchen nam"
    },
    {
      "bo": "ཚེ་འདི་འཕོས་ཚེ་བདེ་ཆེན་ཞིང་དུ་སྐྱེས། །",
      "en": "Take birth, as soon as they depart this life, in the realm of Great Bliss,",
      "en-trans": "tsé di pö tsé dechen zhing du kyé"
    },
    {
      "bo": "འོད་མཚན་སྟོང་འབར་གསུང་གི་ལུང་བསྟན་ཐོབ། །",
      "en": "There to receive prophecy from Ablaze with Myriad Tokens of Light2",
      "en-trans": "ö tsen tong bar sung gi lungten tob"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་རྩལ་ཆེན་རྫོགས་པར་ཤོག །",
      "en": "And fulfil their enormous potential for knowledge, love and strength.",
      "en-trans": "khyen tsé nü pé tsal chen dzokpar shok"
    },
    {
      "bo": "དྲི་མེད་རྒྱལ་བསྟན་དར་ཞིང་ཡུན་དུ་གནས། །",
      "en": "May the faultless teachings of Buddha flourish and endure,",
      "en-trans": "drimé gyalten dar zhing yündu né"
    },
    {
      "bo": "རིས་མེད་འགྲོ་རྣམས་ཕན་བདེའི་དཔལ་གྱིས་འཚོ། །",
      "en": "And all beings without exception enjoy the splendour of benefit and happiness.",
      "en-trans": "rimé dro nam pendé pal gyi tso"
    },
    {
      "bo": "དུས་ཀུན་ཡིད་ལ་སྨོན་པ་འདི་ཁོ་ན། །",
      "en": "This, and only this, is my constant aspiration—",
      "en-trans": "dü kün yi la mönpa di khona"
    },
    {
      "bo": "མཐུན་འགྱུར་གསུང་གི་དབུགས་དབྱུང་དེང་འདིར་སྩོལ། །",
      "en": "Assure me, here and now, that it all will be fulfilled.",
      "en-trans": "tün gyur sung gi ukyung dengdir tsol"
    },
    {
      "bo": "བཀྲ་ཤིས་གང་ཞིག་ཕུན་ཚོགས་སྡེ་བཞིའི་གཏེར། །",
      "en": "May auspiciousness ripen as a treasure of fourfold abundance,3",
      "en-trans": "tashi gangzhik püntsok dé zhi ter"
    },
    {
      "bo": "མ་ལུས་སྐྱེ་དགུའི་ཉེར་འཚོའི་གསོས་སུ་སྨིན། །",
      "en": "Healing nourishment for all living beings without exception.",
      "en-trans": "malü kyegü nyer tsö sö su min"
    },
    {
      "bo": "མི་ཤིས་རྒུད་པ་བཙལ་ཀྱང་མི་རྙེད་པའི། །",
      "en": "And may ills and misfortune be forever entirely unknown,",
      "en-trans": "mi shi güpa tsal kyang mi nyepé"
    },
    {
      "bo": "དགེ་ལེགས་སྣང་བས་ས་གསུམ་ཁྱབ་པར་ཤོག །",
      "en": "As the light of virtue and excellence fills the three domains.",
      "en-trans": "gelek nangwé sa sum khyabpar shok"
    }
  ]
}