{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/swift-fulfilment-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་བསམ་དོན་མྱུར་འགྲུབ།",
    "en": "A Prayer of Aspiration"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "རྩ་གསུམ་ཀུན་འདུས་གུ་རུ་པདྨ་འབྱུང་།  །",
      "en": "Padmākara, universal embodiment of the Three Roots,",
      "en-trans": "tsa sum kündü guru pema jung"
    },
    {
      "bo": "དངོས་གཅིག་དུ་མའི་གར་བསྒྱུར་མཚན་མཆོག་བརྒྱད།  །",
      "en": "One in reality yet diverse in manifestation—the Eight Supreme Emanations,",
      "en-trans": "ngö chik dumé gar gyur tsen chok gyé"
    },
    {
      "bo": "ཐོད་ཕྲེང་སྡེ་ལྔ་དྲག་པོ་དམར་ནག་དང་།  །",
      "en": "The five classes of Tötreng, wrathful and dark red in colour,",
      "en-trans": "tötreng dé nga drakpo marnak dang"
    },
    {
      "bo": "རྣམ་འཕྲུལ་བཅུ་གཉིས་འཕྲུལ་མཚན་བཞི་བཅུ་སོགས།",
      "en": "The twelve primary and forty secondary manifestations, and the rest—",
      "en-trans": "namtrul chunyi trul tsen zhibchu sok"
    },
    {
      "bo": "ངོ་མཚར་སྤྲུལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་དང་།  །",
      "en": "All you wondrous emanations in your hundreds of billions,",
      "en-trans": "ngotsar trulpa jewa trak gya dang"
    },
    {
      "bo": "རྗེ་འབངས་ཉེར་ལྔ་སོ་ཟུར་གནུབ་གཉགས་ཉང་།  །",
      "en": "Together with the twenty-five disciples, So, Zur, Nub, Nyak and Nyang,",
      "en-trans": "jebang nyernga so zur nub nyak nyang"
    },
    {
      "bo": "ཆོས་དབང་རྒོད་ལྡེམ་ཀློང་ཆེན་སྨིན་གཏེར་སོགས།  །",
      "en": "Chöwang, Gödem, Longchenpa, Minling Terchen,",
      "en-trans": "chö wang gödem longchen min ter sok"
    },
    {
      "bo": "བཀའ་གཏེར་རིག་འཛིན་བརྒྱུད་པ་ཐམས་ཅད་དང་།  །",
      "en": "And all the other vidyādharas of the kama and terma lineages,",
      "en-trans": "kater rigdzin gyüpa tamché dang"
    },
    {
      "bo": "འཛམ་གླིང་མཛེས་རྒྱན་རྨད་བྱུང་སློབ་དཔོན་ཚོགས།  །",
      "en": "As well as the wondrous ācāryas who beautifully adorned this world,",
      "en-trans": "dzamling dzé gyen mejung lobpön tsok"
    },
    {
      "bo": "ཟླ་བཟང་ལ་སོགས་ཆོས་རྒྱལ་རིགས་ལྡན་ཚོགས།  །",
      "en": "All the Kulika Dharma Kings, such as Sucandra,",
      "en-trans": "da zang lasok chögyal rikden tsok"
    },
    {
      "bo": "གྲུབ་བརྒྱའི་གཙུག་རྒྱན་བྲམ་ཟེ་ས་ར་ཧ།  །",
      "en": "The brahmin Saraha, crown ornament among a hundred siddhas,",
      "en-trans": "drub gyé tsukgyen dramzé sara ha"
    },
    {
      "bo": "བིཪྺ་པ་དང་ཌོཾ་བྷི་ལཱུ་ནག་དྲིལ།  །",
      "en": "Virūpa, Ḍombi, Lūyipa, Kṛṣṇācārya, Ghaṇṭapāda,",
      "en-trans": "birwapa dang dombi lu nak dril"
    },
    {
      "bo": "ཏེ་ལོ་ནཱ་རོ་མཻ་ཏྲི་ལ་སོགས་དང་།  །",
      "en": "Tilopa, Nāropa, Maitripāda, and the rest,",
      "en-trans": "té lo na ro mai tri lasok dang"
    },
    {
      "bo": "ཇོ་རྔོག་འབྲོམ་དང་སྐུ་མཆེད་རྣམ་པ་གསུམ།  །",
      "en": "Together with Jowo Atiśa, Ngok Lekpé Sherab and Dromtönpa, as well as the Three Brothers,1",
      "en-trans": "jo ngok drom dang kuché nampa sum"
    },
    {
      "bo": "གླང་ཤར་གཉིས་སོགས་བཀའ་གདམས་བརྒྱུད་པ་དང་།  །",
      "en": "Langri Thangpa, Sharawa Yönten Drak and all the other masters of the Kadam lineage,",
      "en-trans": "lang shar nyi sok kadam gyüpa dang"
    },
    {
      "bo": "འབྲོག་མི་ས་ཆེན་བསོད་ནམས་རྩེ་མོའི་ཞབས།  །",
      "en": "Drokmi Lotsāwa, Sachen Kunga Nyingpo, Sönam Tsemo,",
      "en-trans": "drok mi sa chen sönam tsemö zhab"
    },
    {
      "bo": "གྲགས་རྒྱལ་པཎ་ཆེན་ཆོས་འཕགས་ངོར་ཚར་རྫོང་།  །",
      "en": "Drakpa Gyaltsen, the great Sakya Paṇḍita, Chögyal Pakpa, Ngorchen, Tsarchen and Dzongpa,2",
      "en-trans": "drak gyal penchen chö pak ngor tsar dzong"
    },
    {
      "bo": "ས་སྐྱའི་བསྟན་འཛིན་བརྒྱུད་པར་བཅས་པའི་ཚོགས།  །",
      "en": "And the all the hosts of lineage-holders of the Sakya teachings,",
      "en-trans": "sakyé tendzin gyüpar chepé tsok"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མ་བློ་བཟང་གྲགས་པ་དང་།  །",
      "en": "Mañjughoṣa guru Lobzang Drakpa,",
      "en-trans": "jamyang lama lo zang drakpa dang"
    },
    {
      "bo": "ཐུགས་སྲས་རྣམ་གསུམ་ལ་སོགས་གསེར་རིའི་ཕྲེང་།  །",
      "en": "The three heart-sons and the rest—like a chain of golden mountains,",
      "en-trans": "tuksé nam sum lasok ser ri treng"
    },
    {
      "bo": "མར་པ་མི་ལ་མཉམ་མེད་དྭགས་པོ་དང་།  །",
      "en": "Marpa, Mila, peerless Dakpo,",
      "en-trans": "marpa mi la nyammé dakpo dang"
    },
    {
      "bo": "རས་ཆུང་ཕག་གྲུ་འབྲི་སྟག་འབྲུག་པ་སོགས།  །",
      "en": "Rechungpa, Pakmodrupa, and all the learned and accomplished ones",
      "en-trans": "ré chung pak dru dri tak drukpa sok"
    },
    {
      "bo": "བཀའ་བརྒྱུད་ནོར་བུའི་ཕྲེང་མཛེས་མཁས་གྲུབ་ཚོགས།  །",
      "en": "Of the Drikung, Taklung, Drukpa and so on—the beautiful jewelled garland of Kagyü masters,",
      "en-trans": "kagyü norbü treng dzé khedrub tsok"
    },
    {
      "bo": "རྩོད་དུས་ཀུན་མཁྱེན་གཉིས་པ་རིན་ཆེན་གྲུབ།  །",
      "en": "Butön Rinchen Drup, who was like a second Omniscient One for this age of strife,",
      "en-trans": "tsödü künkhyen nyipa rinchen drub"
    },
    {
      "bo": "དོལ་པོ་སངས་རྒྱས་ཀུན་དགའ་སྙིང་པོ་སོགས།  །",
      "en": "Dolpo Sangye, Tāranātha Kunga Nyingpo and the rest—",
      "en-trans": "dolpo sangye kün ga nyingpo sok"
    },
    {
      "bo": "གསང་སྔགས་རྒྱུད་སྡེའི་གཏེར་འཆང་སྐྱེས་ཆེན་དང་།  །",
      "en": "Great beings, holders of the tantric treasures of Secret Mantra,",
      "en-trans": "sang ngak gyüdé ter chang kyé chen dang"
    },
    {
      "bo": "ཁྱད་པར་བཀའ་བབས་བདུན་ལྡན་མཁྱེན་བརྩེའི་དབང་།  །",
      "en": "And especially Khyentse Wangpo, holder of the Seven Modes of Transmission,",
      "en-trans": "khyepar kabab dünden khyentsé wang"
    },
    {
      "bo": "མཛོད་ལྔའི་ཤིང་རྟ་བློ་གྲོས་མཐའ་ཡས་ཞབས།  །",
      "en": "Lodrö Thayé, pioneer of the Five Treasuries,",
      "en-trans": "dzö ngé shingta lodrö tayé zhab"
    },
    {
      "bo": "གསང་སྔགས་བཀའ་ཡི་སྡུད་པོ་བློ་གཏེར་དབང་།  །",
      "en": "Loter Wangpo, compiler of the words of Secret Mantra,",
      "en-trans": "sang ngak ka yi düpo lo ter wang"
    },
    {
      "bo": "བཻ་རོ་དངོས་སྣང་གཞན་ཕན་མཐའ་ཡས་རྗེ།  །",
      "en": "Lord Shenpen Thayé, who was Vairotsana in person,",
      "en-trans": "bai ro ngö nang zhenpen tayé jé"
    },
    {
      "bo": "ཨོ་རྒྱན་འཇིགས་མེད་ཆོས་ཀྱི་དབང་པོ་དང་།  །",
      "en": "Orgyen Jigme Chökyi Wangpo,",
      "en-trans": "orgyen jikme chö kyi wangpo dang"
    },
    {
      "bo": "སྨྲ་བའི་སེང་གེ་མི་ཕམ་རྣམ་པར་རྒྱལ།  །",
      "en": "The lion of speech, Mipham Namgyal,",
      "en-trans": "mawé sengé mipam nampar gyal"
    },
    {
      "bo": "བཀའ་དྲིན་ཆེ་བའི་ཡོངས་འཛིན་དམ་པའི་མགོན།  །",
      "en": "My most gracious teacher, the sublime protector,",
      "en-trans": "kadrin chewé yongdzin dampé gön"
    },
    {
      "bo": "རྩ་བརྒྱུད་བླ་མའི་དཀྱིལ་འཁོར་ལྷ་ཚོགས་དང་།  །",
      "en": "And all the deities of the maṇḍalas of the root and lineage gurus,",
      "en-trans": "tsa gyü lamé kyilkhor lhatsok dang"
    },
    {
      "bo": "རྒྱུད་སྡེ་བཞི་དྲུག་ཡི་དམ་ཞི་ཁྲོའི་ཚོགས།  །",
      "en": "Hosts of peaceful and wrathful yidams of the four or six classes of tantra,",
      "en-trans": "gyüdé zhi druk yidam zhitrö tsok"
    },
    {
      "bo": "གནས་གསུམ་དཔའ་བོ་མཁའ་འགྲོ་ཆོས་སྐྱོང་དང་།  །",
      "en": "Ḍākinīs and vīras of the three abodes, dharma guardians,",
      "en-trans": "né sum pawo khandro chökyong dang"
    },
    {
      "bo": "ནོར་ལྷ་གཏེར་བདག་དཀར་ཕྱོགས་སྐྱོང་འཁོར་བཅས།  །",
      "en": "Wealth deities, treasure keepers, and guardians of the virtuous together with your retinues,",
      "en-trans": "norlha terdak karchok kyong khor ché"
    },
    {
      "bo": "ཁྱད་པར་ཐུབ་དབང་སྨན་ལྷ་མི་འཁྲུགས་པ།  །",
      "en": "Especially the Lord of Sages, Buddha of Medicine, Akṣobhya,",
      "en-trans": "khyepar tubwang men lhami trukpa"
    },
    {
      "bo": "རྡོ་རྗེ་སེམས་དཔའ་ཉེ་སྲས་སྒྲོལ་མ་དང་།  །",
      "en": "Vajrasattva, the Close Sons, Tārā,",
      "en-trans": "dorjé sempa nyesé drolma dang"
    },
    {
      "bo": "གནས་བརྟན་ཆེན་པོ་བཅུ་དྲུག་ལ་སོགས་པ།  །",
      "en": "Sixteen Elders, and the rest—",
      "en-trans": "neten chenpo chudruk lasokpa"
    },
    {
      "bo": "སྐྱབས་གནས་ཐུགས་རྗེ་ཅན་རྣམས་དགོངས་སུ་གསོལ།  །",
      "en": "All you compassionate sources of refuge, turn your wisdom minds toward me,",
      "en-trans": "kyabné tukjé chen nam gong su sol"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས་སུ་གསོལ།  །",
      "en": "Look upon me with your wisdom vision of knowledge and care.",
      "en-trans": "khyentsé yeshe chen gyi zik su sol"
    },
    {
      "bo": "བདག་གི་ལས་ངན་སྡིག་བསགས་འབྲས་བུ་སྨིན།  །",
      "en": "I have amassed negative, harmful actions and now experience their effects.",
      "en-trans": "dak gi lé ngen dik sak drebu min"
    },
    {
      "bo": "ལུས་སེམས་བདེ་འཕྲོག་ནད་ཀྱི་ཟུག་རྔུས་མནར།  །",
      "en": "I am bereft of physical and mental well-being and suffer the pains of illness.",
      "en-trans": "lü sem dé trok né kyi zukngü nar"
    },
    {
      "bo": "ཕྱི་མ་ངན་སོང་སྡུག་བསྔལ་མྱོང་རེ་རན།  །",
      "en": "In the next life, I will confront the sufferings of the lower realms.",
      "en-trans": "chima ngensong dukngal nyong ré ren"
    },
    {
      "bo": "ཉམ་ཐག་འདི་འདྲར་དགོངས་པར་མཛད་ནས་ཀྱང་།  །",
      "en": "Having considered this unfortunate plight of mine,",
      "en-trans": "nyamtak dindrar gongpar dzé né kyang"
    },
    {
      "bo": "བྱམས་པའི་ཕྱག་གིས་སྐྱོབས་པར་མཛད་དུ་གསོལ།  །",
      "en": "Please protect me with your hands of loving kindness, I pray.",
      "en-trans": "jampé chak gi kyobpar dzé du sol"
    },
    {
      "bo": "གཞན་གྱི་སྡིག་སྡུག་བདག་ལ་སྨིན་གྱུར་ནས།  །",
      "en": "Let others’ misdeeds and sufferings ripen on me,",
      "en-trans": "zhen gyi dikduk dak la min gyur né"
    },
    {
      "bo": "དེ་རྣམས་བདེ་བ་ཕུན་ཚོགས་ཐོབ་པར་ཤོག  །",
      "en": "And let them enjoy happiness in great abundance.",
      "en-trans": "denam dewa püntsok tobpar shok"
    },
    {
      "bo": "མིང་ཙམ་ཐོས་པས་འབྲེལ་བར་གྱུར་པ་རྣམས།  །",
      "en": "May all who are connected to me through merely hearing my name",
      "en-trans": "ming tsam töpé drelwar gyurpa nam"
    },
    {
      "bo": "རྣམ་གྲོལ་བྱང་ཆུབ་ལམ་བཟང་རྙེད་པར་ཤོག  །",
      "en": "Discover the excellent path that leads to liberation and awakening.",
      "en-trans": "namdrol changchub lamzang nyepar shok"
    },
    {
      "bo": "བདག་ཀྱང་དུས་མིན་འཆི་བས་མི་གཙེས་ཤིང་།  །",
      "en": "May I not suffer an untimely death but complete my lifespan.",
      "en-trans": "dak kyang dümin chiwé mi tsé shing"
    },
    {
      "bo": "ཚེ་མཐར་ཕྱིན་ཅིང་བསམ་དོན་ཀུན་འགྲུབ་ནས།  །",
      "en": "And may all my wishes and intentions be fulfilled.",
      "en-trans": "tsé tarchin ching samdön kün drub né"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་རྫོགས་བྱས་ཤིང་།  །",
      "en": "May I perfect the aspirations of Samantabhadra",
      "en-trans": "kuntuzangpö mönlam dzok jé shing"
    },
    {
      "bo": "བར་དུ་གཅོད་པའི་བདུད་ཀྱིས་མི་ཚུགས་ཤོག  །",
      "en": "And not fall prey to obstacle-making demons.",
      "en-trans": "bardu chöpé dü kyi mitsuk shok"
    },
    {
      "bo": "སྒོ་གསུམ་དངོས་དང་བརྒྱུད་ནས་བསྟན་པ་དང་།  །",
      "en": "Directly and indirectly, may I teach with body, speech and mind,",
      "en-trans": "go sum ngö dang gyü né tenpa dang"
    },
    {
      "bo": "སེམས་ཅན་ཀུན་ལ་ཕན་བདེ་སྦྱིན་གྱུར་ཅིང་།  །",
      "en": "And provide benefit happiness for all sentient beings.",
      "en-trans": "semchen kün la pendé jin gyur ching"
    },
    {
      "bo": "རྒྱལ་བའི་ཆོས་ཚུལ་དྲི་མ་མེད་པ་དག  །",
      "en": "And may there be no impediment as I uphold and transmit",
      "en-trans": "gyalwé chö tsul drima mepa dak"
    },
    {
      "bo": "འཛིན་འཆང་སྤེལ་ལ་ཐོགས་པ་མེད་པར་ཤོག  །",
      "en": "The immaculate ways of the Dharma of the Victorious Ones.",
      "en-trans": "dzin chang pel la tokpa mepar shok"
    },
    {
      "bo": "མཆོག་གསུམ་རིན་པོ་ཆེ་ཡི་བདེན་པ་དང་།  །",
      "en": "By the truth of the three most rare and precious Jewels,",
      "en-trans": "chok sum rinpoche yi denpa dang"
    },
    {
      "bo": "རྩ་བ་གསུམ་གྱི་མཐུ་བྱིན་ནུས་སྟོབས་ཀྱིས།  །",
      "en": "And the powerful blessings and force of the Three Roots,",
      "en-trans": "tsawa sum gyi tu jin nü tob kyi"
    },
    {
      "bo": "སྨོན་པའི་གནས་འདི་གེགས་མེད་འགྲུབ་པ་དང་།  །",
      "en": "May these points of aspiration be fulfilled without obstacle",
      "en-trans": "mönpé né di gekmé drubpa dang"
    },
    {
      "bo": "བསྟན་དང་བསྟན་འཛིན་དར་ཞིང་རྒྱས་པར་ཤོག  །",
      "en": "And the teachings and their holders prosper and flourish!",
      "en-trans": "ten dang tendzin dar zhing gyepar shok"
    }
  ]
}