{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/aspiration-chokchu-dushima",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ་ཕྱོགས་བཅུ་དུས་བཞིའི་མ།",
    "en": "The Aspiration of the Vajradhātu Maṇḍala"
  },
  "text": [
    {
      "bo": "ཕྱོགས་བཅུ་དུས་བཞིའི་རྒྱལ་བ་སྲས་དང་བཅས༔",
      "en": "Buddhas and bodhisattva heirs of the ten directions and four times,",
      "en-trans": "chok chu dü zhii gyalwa sé dang ché"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་མཁའ་འགྲོ་ཆོས་སྐྱོང་ཚོགས༔",
      "en": "Gurus, devas, ḍākinīs and the hosts of dharmapālas who guard the teachings—",
      "en-trans": "lama yidam khandro chö kyong tsok"
    },
    {
      "bo": "མ་ལུས་ཞིང་གི་རྡུལ་སྙེད་གཤེགས་སུ་གསོལ༔",
      "en": "All of you without exception, as numerous as atoms in the universe, please come now",
      "en-trans": "malü zhing gi dul nyé shek su sol"
    },
    {
      "bo": "མདུན་གྱི་ནམ་མཁར་པད་ཟླའི་གདན་ལ་བཞུགས༔",
      "en": "Into the space before me, and take your seats on these cushions of lotus and moon.",
      "en-trans": "dün gyi namkhar pe dé den la zhuk"
    },
    {
      "bo": "ལུས་ངག་ཡིད་གསུམ་གུས་པས་ཕྱག་འཚལ་ལོ༔",
      "en": "I pay homage with devotion in body, speech and mind.",
      "en-trans": "lü ngak yi sum güpé chaktsal lo"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བ་དེ་བཞིན་ཉིད་ཀྱིས་མཆོད༔",
      "en": "I present outer, inner and secret offerings and the gift of suchness.",
      "en-trans": "chi nang sangwa dézhin nyi kyi chö"
    },
    {
      "bo": "རྟེན་མཆོག་བདེ་གཤེགས་རྣམས་ཀྱི་སྤྱན་སྔ་རུ༔",
      "en": "In the presence of the supreme support, the sugatas,",
      "en-trans": "ten chok déshek nam kyi chen nga ru"
    },
    {
      "bo": "སྔོན་གྱི་སྡིག་པའི་ཚོགས་ལ་བདག་གནོང་ཞིང་༔",
      "en": "I feel remorse for all my accumulated negative actions of the past,",
      "en-trans": "ngön gyi dikpe tsok la dak nong zhing"
    },
    {
      "bo": "ད་ལྟའི་མི་དགེ་འགྱོད་པས་རབ་ཏུ་བཤགས༔",
      "en": "And with regret I confess my present non-virtues:",
      "en-trans": "daté migé gyöpé rap tu shak"
    },
    {
      "bo": "ཕྱིན་ཆད་དེ་ལས་ལྡོག་ཕྱིར་བདག་གིས་བསྡམ༔",
      "en": "From now on, I vow to turn away from them all.",
      "en-trans": "chinché dé lé dok chir dak gi dam"
    },
    {
      "bo": "བསོད་ནམས་དགེ་ཚོགས་ཀུན་ལ་ཡི་རང་ངོ་༔",
      "en": "I rejoice in all accumulations of virtue and merit.",
      "en-trans": "sönam gé tsok kun la yirang ngo"
    },
    {
      "bo": "རྒྱལ་བའི་ཚོགས་རྣམས་མྱ་ངན་མི་འདའ་བར༔",
      "en": "I beseech all the victorious ones not to pass beyond sorrow,",
      "en-trans": "gyalwé tsok nam nyangen midawar"
    },
    {
      "bo": "སྡེ་སྣོད་གསུམ་དང་བླ་མེད་ཆོས་འཁོར་བསྐོར༔",
      "en": "But to turn the wheel of the three piṭakas and of the unsurpassed Dharma.",
      "en-trans": "dénö sum dang lamé chö khor kor"
    },
    {
      "bo": "དགེ་ཚོགས་མ་ལུས་འགྲོ་བའི་རྒྱུད་ལ་བསྔོ༔",
      "en": "I dedicate all accumulations of virtue, without exception, to the minds of beings:",
      "en-trans": "gé tsok malü drowé gyü la ngo"
    },
    {
      "bo": "འགྲོ་རྣམས་བླ་མེད་ཐར་པའི་སར་ཕྱིན་ཤོག༔",
      "en": "May they all reach the ground of unsurpassable liberation!",
      "en-trans": "dro nam lamé tarpé sar chin shok"
    },
    {
      "bo": "སངས་རྒྱས་སྲས་བཅས་བདག་ལ་དགོངས་སུ་གསོལ༔",
      "en": "Buddhas and your bodhisattva heirs, turn your attention towards me!",
      "en-trans": "sangyé sé ché dak la gong su sol"
    },
    {
      "bo": "བདག་གིས་བརྩམས་པའི་སྨོན་ལམ་རབ་བཟང་འདི༔",
      "en": "May this excellent aspiration that I am now making,",
      "en-trans": "dak gi tsampé mönlam rapzang di"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་ཏུ་བཟང་དང་དེ་སྲས་དང་༔",
      "en": "Emulate the prayers",
      "en-trans": "gyalwa kuntuzang dang dé sé dang"
    },
    {
      "bo": "འཕགས་པ་འཇམ་དཔལ་དབྱངས་ཀྱིས་མཁྱེན་པ་ལྟར༔",
      "en": "Of the victorious Samantabhadra with his bodhisattva heirs,",
      "en-trans": "pakpa jampalyang kyi khyenpa tar"
    },
    {
      "bo": "དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་སློབ་ཤོག༔",
      "en": "And noble Mañjughoṣa's omniscient wisdom.",
      "en-trans": "dédak kun gyi jésu dak lop shok"
    },
    {
      "bo": "བསྟན་པའི་དཔལ་གྱུར་བླ་མ་རིན་ཆེན་རྣམས༔",
      "en": "May the precious gurus, the glory of the teachings,",
      "en-trans": "tenpé palgyur lama rinchen nam"
    },
    {
      "bo": "ནམ་མཁའ་བཞིན་ཏུ་ཀུན་ལ་ཁྱབ་པར་ཤོག༔",
      "en": "Pervade everywhere like space itself,",
      "en-trans": "namkha zhintu kun la khyapar shok"
    },
    {
      "bo": "ཉི་ཟླ་བཞིན་ཏུ་ཀུན་ལ་གསལ་བར་ཤོག༔",
      "en": "And illuminate everything like the sun and moon.",
      "en-trans": "nyi da zhintu kun la selwar shok"
    },
    {
      "bo": "རི་བོ་བཞིན་ཏུ་རྟག་ཏུ་བརྟན་པར་ཤོག༔",
      "en": "May they always be with us, steadfast like mountains.",
      "en-trans": "riwo zhintu taktu tenpar shok"
    },
    {
      "bo": "བསྟན་པའི་གཞི་མ་དགེ་འདུན་རིན་པོ་ཆེ༔",
      "en": "May the precious saṅgha, the bedrock of the teachings,",
      "en-trans": "tenpé zhima gendun rinpoche"
    },
    {
      "bo": "ཐུགས་མཐུན་ཁྲིམས་གཙང་བསླབ་གསུམ་གྱིས་ཕྱུག་ཤོག༔",
      "en": "Remain in harmony, maintain pure discipline and be rich in the three higher trainings.",
      "en-trans": "tuk tün trim tsang lap sum gyi chuk shok"
    },
    {
      "bo": "བསྟན་པའི་སྙིང་པོ་གསང་སྔགས་སྒྲུབ་པའི་སྡེ༔",
      "en": "May the practitioners of the Secret Mantrayāna, the heart of the teachings,",
      "en-trans": "tenpé nyingpo sang ngak drubpé dé"
    },
    {
      "bo": "དམ་ཚིག་ལྡན་ཞིང་བསྐྱེད་རྫོགས་མཐར་ཕྱིན་ཤོག༔",
      "en": "Keep their samaya commitments and perfect the generation and completion stages.",
      "en-trans": "damtsik den zhing kyé dzok tarchin shok"
    },
    {
      "bo": "བསྟན་པའི་སྦྱིན་བདག་ཆོས་སྐྱོང་རྒྱལ་པོ་ཡང་༔",
      "en": "For the king who protects the Dharma, the benefactor of the teachings,",
      "en-trans": "tenpé jindak chökyong gyalpo yang"
    },
    {
      "bo": "ཆབ་སྲིད་རྒྱས་ཤིང་བསྟན་ལ་སྨན་པར་ཤོག༔",
      "en": "May his kingdom flourish and may he be of benefit to the Dharma.",
      "en-trans": "chapsi gyé shing ten la menpar shok"
    },
    {
      "bo": "བསྟན་པའི་ཞབས་འདེགས་རྒྱལ་རིགས་བློན་པོ་ཡང་༔",
      "en": "May those who serve the teachings, warriors and ministers,",
      "en-trans": "tenpé zhap dek gyal rik lönpo yang"
    },
    {
      "bo": "བློ་གྲོས་རབ་འཕེལ་རྩལ་དང་ལྡན་པར་ཤོག༔",
      "en": "Possess increasing skills and supreme intelligence.",
      "en-trans": "lodrö rap pel tsal dang denpar shok"
    },
    {
      "bo": "བསྟན་པའི་གསོས་བྱེད་ཁྱིམ་བདག་འབྱོར་ལྡན་རྣམས༔",
      "en": "May the wealthy householders who sustain the teachings",
      "en-trans": "tenpé söjé khyimdak jorden nam"
    },
    {
      "bo": "ལོངས་སྤྱོད་ལྡན་ཞིང་ཉེར་འཚེ་མེད་པར་ཤོག༔",
      "en": "Be prosperous and always free from harm.",
      "en-trans": "longchö den zhing nyertsé mépar shok"
    },
    {
      "bo": "བསྟན་ལ་དད་པའི་ཡངས་པའི་རྒྱལ་ཁམས་ཀུན༔",
      "en": "May all Buddhist nations where there is faith in the teachings",
      "en-trans": "tenpa dépé yangpé gyalkham kun"
    },
    {
      "bo": "བདེ་སྐྱིད་ལྡན་ཞིང་བར་ཆད་ཞི་བར་ཤོག༔",
      "en": "Enjoy happiness and well-being, with all obstacles pacified.",
      "en-trans": "dékyi den zhing barché zhiwar shok"
    },
    {
      "bo": "ལམ་ལ་གནས་པའི་རྣལ་འབྱོར་བདག་ཉིད་ཀྱང་༔",
      "en": "And for me, this yogi on the path,",
      "en-trans": "lam la népé naljor daknyi kyang"
    },
    {
      "bo": "དམ་ཚིག་མི་ཉམས་བསམ་པ་འགྲུབ་པར་ཤོག༔",
      "en": "May my samaya never decline and my wishes be fulfilled.",
      "en-trans": "damtsik minyam sampa drubpar shok"
    },
    {
      "bo": "བདག་ལ་བཟང་ངན་ལས་ཀྱིས་འབྲེལ་གྱུར་གང་༔",
      "en": "May whoever makes a connection with me, through positive or negative karma,",
      "en-trans": "dak la zang ngen lé kyi drel gyur gang"
    },
    {
      "bo": "གནས་སྐབས་མཐར་ཐུག་རྒྱལ་བས་རྗེས་འཛིན་ཤོག༔",
      "en": "Always be blessed by the buddhas' care,",
      "en-trans": "nékap tartuk gyalwé jédzin shok"
    },
    {
      "bo": "འགྲོ་རྣམས་བླ་མེད་ཐེག་པའི་སྒོར་ཞུགས་ནས༔",
      "en": "And may all beings cross the gate of the supreme vehicle,",
      "en-trans": "dronam lamé tekpé gor zhuk né"
    },
    {
      "bo": "ཀུན་བཟང་རྒྱལ་སྲིད་ཆེན་པོ་ཐོབ་པར་ཤོག༔",
      "en": "And reach Samantabhadra's great kingdom.",
      "en-trans": "kunzang gyalsi chenpo tobpar shok"
    }
  ]
}