{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/words-of-the-buddha/samantabhadra-aspiration-good-actions",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ་བཞུགས།",
    "en": "The Translators’ Homage"
  },
  "text": [
    {
      "bo": "རྒྱ་གར་སྐད་དུ། ཨཱརྻ་བྷ་དྲ་ཙརྻ་པྲ་ཎི་དྷཱ་ན་རཱ་ཛ།",
      "en": "In the language of India:Ārya-Bhadracaryā-Praṇidhāna-Rāja",
      "en-trans": "gyagar ké du arya bhadratsarya pranidhana radza"
    },
    {
      "bo": "བོད་སྐད་དུ། འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ།",
      "en": "In the language of Tibet:Pakpa Zangpo Chöpé Mönlam gyi Gyalpo",
      "en-trans": "böké du pakpa zangpo chöpé mönlam gyi gyalpo"
    },
    {
      "bo": "འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to Mañjuśrī, the youthful!",
      "en-trans": "jampal zhönnur gyurpa la chaktsal lo"
    },
    {
      "bo": "ཇི་སྙེད་སུ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །",
      "en": "To all the buddhas, the lions of the human race,",
      "en-trans": "jinyé su dak chok chü jikten na"
    },
    {
      "bo": "དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་ཀུན། །",
      "en": "In all directions of the universe, through past and present and future:",
      "en-trans": "dü sum shekpa mi yi sengé kün"
    },
    {
      "bo": "བདག་གིས་མ་ལུས་དེ་དག་ཐམས་ཅད་ལ། །",
      "en": "To every single one of you, I bow in homage;",
      "en-trans": "dak gi malü dedak tamché la"
    },
    {
      "bo": "ལུས་དང་ངག་ཡིད་དང་བས་ཕྱག་བགྱིའོ། །",
      "en": "Devotion fills my body, speech and mind.",
      "en-trans": "lü dang ngak yi dangwé chak gyi o"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་སྟོབས་དག་གིས། །",
      "en": "Through the power of this prayer, aspiring to Good Action,",
      "en-trans": "zangpo chöpé mönlam tob dak gi"
    },
    {
      "bo": "རྒྱལ་བ་ཐམས་ཅད་ཡིད་ཀྱིས་མངོན་སུམ་དུ། །",
      "en": "All the victorious ones appear, vivid here before my mind",
      "en-trans": "gyalwa tamché yi kyi ngönsum du"
    },
    {
      "bo": "ཞིང་གི་རྡུལ་སྙེད་ལུས་རབ་བཏུད་པ་ཡིས། །",
      "en": "And I multiply my body as many times as atoms in the universe,",
      "en-trans": "zhing gi dul nyé lü rab tüpa yi"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་ལ་རབ་ཏུ་ཕྱག་འཚལ་ལོ། །",
      "en": "Each one bowing in prostration to all the buddhas.",
      "en-trans": "gyalwa kün la rabtu chaktsal lo"
    },
    {
      "bo": "རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་སངས་རྒྱས་རྣམས། །",
      "en": "In every atom preside as many buddhas as there are atoms,",
      "en-trans": "dul chik teng na dul nyé sangye nam"
    },
    {
      "bo": "སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་དག །",
      "en": "And around them, all their bodhisattva heirs:",
      "en-trans": "sangye sé kyi ü na zhukpa dak"
    },
    {
      "bo": "དེ་ལྟར་ཆོས་ཀྱི་དབྱིངས་རྣམས་མ་ལུས་པ། །",
      "en": "And so I imagine them filling",
      "en-trans": "detar chö kyi ying nam malüpa"
    },
    {
      "bo": "ཐམས་ཅད་རྒྱལ་བ་དག་གིས་གང་བར་མོས། །",
      "en": "Completely the entire space of reality.",
      "en-trans": "tamché gyalwa dak gi gangwar mö"
    },
    {
      "bo": "དེ་དག་བསྔགས་པ་མི་ཟད་རྒྱ་མཚོ་རྣམས། །",
      "en": "Saluting them with an endless ocean of praise,",
      "en-trans": "dedak ngakpa mizé gyatso nam"
    },
    {
      "bo": "དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་ཀུན་གྱིས། །",
      "en": "With the sounds of an ocean of different melodies",
      "en-trans": "yang kyi yenlak gyatsö dra kün gyi"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཡོན་ཏན་རབ་བརྗོད་ཅིང་། །",
      "en": "I sing of the buddhas’ noble qualities,",
      "en-trans": "gyalwa kün gyi yönten rab jö ching"
    },
    {
      "bo": "བདེ་བར་གཤེགས་པ་ཐམས་ཅད་བདག་གིས་བསྟོད། །",
      "en": "And praise all those who have gone to perfect bliss.",
      "en-trans": "dewar shekpa tamché dak gi tö"
    },
    {
      "bo": "མེ་ཏོག་དམ་པ་ཕྲེང་བ་དམ་པ་དང་། །",
      "en": "To every buddha, I make offerings:",
      "en-trans": "metok dampa trengwa dampa dang"
    },
    {
      "bo": "སིལ་སྙན་རྣམས་དང་བྱུག་པ་གདུགས་མཆོག་དང་། །",
      "en": "Of the loveliest flowers, of beautiful garlands,",
      "en-trans": "silnyen nam dang jukpa duk chok dang"
    },
    {
      "bo": "མར་མེ་མཆོག་དང་བདུག་སྤོས་དམ་པ་ཡིས། །",
      "en": "Of music and perfumed ointments, the best of parasols,",
      "en-trans": "marmé chok dang dukpö dampa yi"
    },
    {
      "bo": "རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི། །",
      "en": "The brightest lamps and finest incense.",
      "en-trans": "gyalwa dedak la ni chöpar gyi"
    },
    {
      "bo": "ན་བཟའ་དམ་པ་རྣམས་དང་དྲི་མཆོག་དང་། །",
      "en": "To every buddha, I make offerings:",
      "en-trans": "naza dampa nam dang dri chok dang"
    },
    {
      "bo": "ཕྱེ་མ་ཕུར་མ་རི་རབ་མཉམ་པ་དང་། །",
      "en": "Exquisite garments and the most fragrant scents,",
      "en-trans": "chema purma rirab nyampa dang"
    },
    {
      "bo": "བཀོད་པ་ཁྱད་པར་འཕགས་པའི་མཆོག་ཀུན་གྱིས། །",
      "en": "Powdered incense, heaped as high as Mount Meru,",
      "en-trans": "köpa khyepar pakpé chok kün gyi"
    },
    {
      "bo": "རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི། །",
      "en": "Arranged in perfect symmetry.",
      "en-trans": "gyalwa dedak la ni chöpar gyi"
    },
    {
      "bo": "མཆོད་པ་གང་རྣམས་བླ་མེད་རྒྱ་ཆེ་བ། །",
      "en": "Then the vast and unsurpassable offerings—",
      "en-trans": "chöpa gang nam lamé gya chewa"
    },
    {
      "bo": "དེ་དག་རྒྱལ་བ་ཐམས་ཅད་ལ་ཡང་མོས། །",
      "en": "Inspired by my devotion to all the buddhas, and",
      "en-trans": "dedak gyalwa tamché la yang mö"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་ལ་དད་པའི་སྟོབས་དག་གིས། །",
      "en": "Moved by the power of my faith in Good Actions—",
      "en-trans": "zangpo chö la depé tob dak gi"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་ལ་ཕྱག་འཚལ་མཆོད་པར་བགྱི། །",
      "en": "I prostrate and offer to all you victorious ones.",
      "en-trans": "gyalwa kün la chaktsal chöpar gyi"
    },
    {
      "bo": "འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དབང་གིས་ནི། །",
      "en": "Whatever negative acts I have committed,",
      "en-trans": "döchak zhedang timuk wang gi ni"
    },
    {
      "bo": "ལུས་དང་ངག་དང་དེ་བཞིན་ཡིད་ཀྱིས་ཀྱང་། །",
      "en": "While driven by desire, hatred and ignorance,",
      "en-trans": "lü dang ngak dang dezhin yi kyi kyang"
    },
    {
      "bo": "སྡིག་པ་བདག་གིས་བགྱིས་པ་ཅི་མཆིས་པ། །",
      "en": "With my body, my speech and also with my mind,",
      "en-trans": "dikpa dak gi gyipa chi chipa"
    },
    {
      "bo": "དེ་དག་ཐམས་ཅད་བདག་གིས་སོ་སོར་བཤགས། །",
      "en": "Before you, I confess and purify each and every one.",
      "en-trans": "dedak tamché dak gi sosor shak"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་དང་སངས་རྒྱས་སྲས། །",
      "en": "With a heart full of delight, I rejoice at all the merits",
      "en-trans": "chok chü gyalwa kün dang sangye sé"
    },
    {
      "bo": "རང་རྒྱལ་རྣམས་དང་སློབ་དང་མི་སློབ་དང་། །",
      "en": "Of buddhas and bodhisattvas,",
      "en-trans": "ranggyal nam dang lob dang mi lob dang"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་གྱི་བསོད་ནམས་གང་ལ་ཡང་། །",
      "en": "Pratyekabuddhas, those in training and the arhats beyond training,",
      "en-trans": "drowa kün gyi sönam gangla yang"
    },
    {
      "bo": "དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་ཡི་རང་། །",
      "en": "And every living being, throughout the entire universe.",
      "en-trans": "dedak kün gyi jesu dak yi rang"
    },
    {
      "bo": "གང་རྣམས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་སྒྲོན་མ་རྣམས། །",
      "en": "You who are like beacons of light shining through the worlds,",
      "en-trans": "gang nam chok chü jikten drönma nam"
    },
    {
      "bo": "བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་མ་ཆགས་བརྙེས། །",
      "en": "Who passed through the stages of enlightenment, to attain buddhahood, freedom from all attachment,",
      "en-trans": "changchub rimpar sangye machak nyé"
    },
    {
      "bo": "མགོན་པོ་དེ་དག་བདག་གིས་ཐམས་ཅད་ལ། །",
      "en": "I exhort you: all of you protectors,",
      "en-trans": "gönpo dedak dak gi tamché la"
    },
    {
      "bo": "འཁོར་ལོ་བླ་ན་མེད་པར་བསྐོར་བར་བསྐུལ། །",
      "en": "Turn the unsurpassable wheel of Dharma.",
      "en-trans": "khorlo lanamepar korwar kul"
    },
    {
      "bo": "མྱ་ངན་འདའ་སྟོན་གང་བཞེད་དེ་དག་ལ། །",
      "en": "Joining my palms together, I pray",
      "en-trans": "nya ngen da tön gang zhé dedak la"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་ལ་ཕན་ཞིང་བདེ་བའི་ཕྱིར། །",
      "en": "To you who intend to pass into nirvāṇa,",
      "en-trans": "drowa kün la pen zhing dewé chir"
    },
    {
      "bo": "བསྐལ་པ་ཞིང་གི་རྡུལ་སྙེད་བཞུགས་པར་ཡང་། །",
      "en": "Remain, for aeons as many as the atoms in this world,",
      "en-trans": "kalpa zhing gi dul nyé zhukpar yang"
    },
    {
      "bo": "བདག་གིས་ཐལ་མོ་རབ་སྦྱར་གསོལ་བར་བགྱི། །",
      "en": "And bring well-being and happiness to all living beings.",
      "en-trans": "dak gi talmo rab jar solwar gyi"
    },
    {
      "bo": "ཕྱག་འཚལ་བ་དང་མཆོད་ཅིང་བཤགས་པ་དང་། །",
      "en": "What little virtue I have gathered through my homage,",
      "en-trans": "chaktsalwa dang chö ching shakpa dang"
    },
    {
      "bo": "རྗེས་སུ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བ་ཡི། །",
      "en": "Through offering, confession, and rejoicing,",
      "en-trans": "jesu yi rang kul zhing solwa yi"
    },
    {
      "bo": "དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསགས་པ། །",
      "en": "Through exhortation and prayer—all of it",
      "en-trans": "gewa chungzé dak gi chi sakpa"
    },
    {
      "bo": "ཐམས་ཅད་བདག་གིས་བྱང་ཆུབ་ཕྱིར་བསྔོའོ། །",
      "en": "I dedicate to the enlightenment of all beings!",
      "en-trans": "tamché dak gi changchub chir ngo o"
    },
    {
      "bo": "འདས་པའི་སངས་རྒྱས་རྣམས་དང་ཕྱོགས་བཅུ་ཡི། །",
      "en": "Let offerings be made to buddhas of the past,",
      "en-trans": "depé sangye nam dang chok chu yi"
    },
    {
      "bo": "འཇིག་རྟེན་དག་ན་གང་བཞུགས་མཆོད་པར་གྱུར། །",
      "en": "And all who now dwell throughout the ten directions of this universe!",
      "en-trans": "jikten dak na gang zhuk chöpar gyur"
    },
    {
      "bo": "གང་ཡང་མ་བྱོན་དེ་དག་རབ་མྱུར་བར། །",
      "en": "Let all who are yet to come swiftly fulfil their wishes",
      "en-trans": "gangyang majön dedak rab nyurwar"
    },
    {
      "bo": "བསམ་རྫོགས་བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་སྤྱོན། །",
      "en": "And attain the stages of enlightenment and buddhahood!",
      "en-trans": "sam dzok changchub rimpar sangye chön"
    },
    {
      "bo": "ཕྱོགས་བཅུ་ག་ལའི་ཞིང་རྣམས་ཇི་སྙེད་པ། །",
      "en": "Let as many worlds as there are in all the ten directions",
      "en-trans": "chok chu galé zhing nam jinyepa"
    },
    {
      "bo": "དེ་དག་རྒྱ་ཆེར་ཡོངས་སུ་དག་པར་གྱུར། །",
      "en": "Transform into realms that are vast and utterly pure,",
      "en-trans": "dedak gyacher yongsu dakpar gyur"
    },
    {
      "bo": "བྱང་ཆུབ་ཤིང་དབང་དྲུང་གཤེགས་རྒྱལ་བ་དང་། །",
      "en": "Filled with buddhas who have sat before the mighty bodhi tree,",
      "en-trans": "changchub shingwang drung shek gyalwa dang"
    },
    {
      "bo": "སངས་རྒྱས་སྲས་ཀྱིས་རབ་ཏུ་གང་བར་ཤོག །",
      "en": "Around them all their bodhisattva sons and daughters!",
      "en-trans": "sangye sé kyi rabtu gangwar shok"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་སེམས་ཅན་གང་རྣམས་ཇི་སྙེད་པ། །",
      "en": "Let as many sentient beings as there are in all the ten directions",
      "en-trans": "chok chü semchen gang nam jinyé pa"
    },
    {
      "bo": "དེ་དག་རྟག་ཏུ་ནད་མེད་བདེ་བར་གྱུར། །",
      "en": "Live always and forever in happiness and health!",
      "en-trans": "dedak taktu nemé dewar gyur"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་གྱི་ཆོས་ཀྱི་དོན་རྣམས་ནི། །",
      "en": "Let all beings meet the Dharma",
      "en-trans": "drowa kün gyi chö kyi dön nam ni"
    },
    {
      "bo": "མཐུན་པར་གྱུར་ཅིང་རེ་བའང་འགྲུབ་པར་ཤོག །",
      "en": "That befits them best! And so may all they hope for be fulfilled!",
      "en-trans": "tünpar gyur ching rewa ang drubpar shok"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པ་དག་ནི་བདག་སྤྱོད་ཅིང་། །",
      "en": "As I practise the training for enlightenment,",
      "en-trans": "changchub chöpa dak ni dak chö ching"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་ཏུ་སྐྱེ་བ་དྲན་པར་གྱུར། །",
      "en": "May I recall all my previous births,",
      "en-trans": "drowa küntu kyewa drenpar gyur"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་འཆི་འཕོ་སྐྱེ་བ་ན། །",
      "en": "And in my successive lives, through death and through rebirth,",
      "en-trans": "tserab küntu chipo kyewa na"
    },
    {
      "bo": "རྟག་ཏུ་བདག་ནི་རབ་ཏུ་འབྱུང་བར་ཤོག །",
      "en": "May I always renounce the worldly life!",
      "en-trans": "taktu dak ni rabtu jungwar shok"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་རྗེས་སུ་སློབ་གྱུར་ཏེ། །",
      "en": "Training in the footsteps of all the victorious buddhas,",
      "en-trans": "gyalwa kün gyi jesu lob gyur té"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །",
      "en": "May I bring Good Actions to perfection,",
      "en-trans": "zangpo chöpa yongsu dzok jé ching"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་སྤྱོད་པ་དྲི་མེད་ཡོངས་དག་པ། །",
      "en": "And my moral conduct be taintless and pure,",
      "en-trans": "tsultrim chöpa drimé yong dakpa"
    },
    {
      "bo": "རྟག་ཏུ་མ་ཉམས་སྐྱོན་མེད་སྤྱོད་པར་ཤོག །",
      "en": "Never lapsing, and always free from fault!",
      "en-trans": "taktu manyam kyönmé chöpar shok"
    },
    {
      "bo": "ལྷ་ཡི་སྐད་དང་ཀླུ་དང་གནོད་སྦྱིན་སྐད། །",
      "en": "In the language of the gods, nāgas, and yakṣas,",
      "en-trans": "lha yi ké dang lu dang nöjin ké"
    },
    {
      "bo": "གྲུལ་བུམ་དག་དང་མི་ཡི་སྐད་རྣམས་དང་། །",
      "en": "In the language of demons and of humans too,",
      "en-trans": "drulbum dak dang mi yi ké nam dang"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་གྱི་སྒྲ་རྣམས་ཇི་ཙམ་པར། །",
      "en": "In however many kinds of speech there may be—",
      "en-trans": "drowa kün gyi dra nam ji tsampar"
    },
    {
      "bo": "ཐམས་ཅད་སྐད་དུ་བདག་གིས་ཆོས་བསྟན་ཏོ། །",
      "en": "I shall proclaim the Dharma in the language of all!",
      "en-trans": "tamché ké du dak gi chö ten to"
    },
    {
      "bo": "དེས་ཤིང་ཕ་རོལ་ཕྱིན་ལ་རབ་བརྩོན་ཏེ། །",
      "en": "Taming my mind, and striving in the pāramitās,",
      "en-trans": "dé shing parol chin la rab tsön té"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་ནི་ནམ་ཡང་བརྗེད་མ་གྱུར། །",
      "en": "I will never forget the bodhicitta;",
      "en-trans": "changchub sem ni namyang jé magyur"
    },
    {
      "bo": "སྡིག་པ་གང་རྣམས་སྒྲིབ་པར་གྱུར་པ་དག །",
      "en": "May all my harmful actions and the obscurations they cause",
      "en-trans": "dikpa gang nam dribpar gyurpa dak"
    },
    {
      "bo": "དེ་དག་མ་ལུས་ཡོངས་སུ་བྱང་བར་ཤོག །",
      "en": "Be completely purified, every single one!",
      "en-trans": "dedak malü yongsu jangwar shok"
    },
    {
      "bo": "ལས་དང་ཉོན་མོངས་བདུད་ཀྱི་ལས་རྣམས་ལས། །",
      "en": "May I be freed from karma, harmful emotions, and the work of negativity,",
      "en-trans": "lé dang nyönmong dü kyi lé nam lé"
    },
    {
      "bo": "གྲོལ་ཞིང་འཇིག་རྟེན་འགྲོ་བ་རྣམས་སུ་ཡང་། །",
      "en": "And act for all beings in the world,",
      "en-trans": "drol zhing jikten drowa nam su yang"
    },
    {
      "bo": "ཇི་ལྟར་པདྨོ་ཆུས་མི་ཆགས་པ་བཞིན། །",
      "en": "Just like the lotus flower to which mud and water cannot cling,",
      "en-trans": "jitar pemo chü michakpa zhin"
    },
    {
      "bo": "ཉི་ཟླ་ནམ་མཁར་ཐོགས་པ་མེད་ལྟར་སྤྱད། །",
      "en": "Or sun and moon that course unhindered through the sky.",
      "en-trans": "nyida namkhar tokpamé tar ché"
    },
    {
      "bo": "ཞིང་གི་ཁྱོན་དང་ཕྱོགས་རྣམས་ཅི་ཙམ་པར། །",
      "en": "Throughout the reach and range of the entire universe",
      "en-trans": "zhing gi khyön dang chok nam chi tsampar"
    },
    {
      "bo": "ངན་སོང་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད། །",
      "en": "I shall pacify completely the suffering of all the lower realms,",
      "en-trans": "ngensong dukngal rabtu zhiwar jé"
    },
    {
      "bo": "བདེ་བ་དག་ལ་འགྲོ་བ་ཀུན་འགོད་ཅིང་། །",
      "en": "I shall lead all beings to happiness,",
      "en-trans": "dewa dak la drowa kün gö ching"
    },
    {
      "bo": "འགྲོ་བ་ཐམས་ཅད་ལ་ནི་ཕན་པར་སྤྱད། །",
      "en": "And work for the ultimate benefit of each and every one!",
      "en-trans": "drowa tamché la ni penpar ché"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །",
      "en": "I shall bring enlightened action to perfection,",
      "en-trans": "changchub chöpa yongsu dzokjé ching"
    },
    {
      "bo": "སེམས་ཅན་དག་གི་སྤྱོད་དང་མཐུན་པར་འཇུག །",
      "en": "Serve beings so as to suit their needs,",
      "en-trans": "semchen dak gi chö dang tünpar juk"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པ་དག་ནི་རབ་སྟོན་ཅིང་། །",
      "en": "Teach them to accomplish Good Actions,",
      "en-trans": "zangpo chöpa dak ni rab tön ching"
    },
    {
      "bo": "མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱོད་པར་གྱུར། །",
      "en": "And continue this, throughout all the aeons to come!",
      "en-trans": "ma ong kalpa küntu chöpar gyur"
    },
    {
      "bo": "བདག་གི་སྤྱོད་དང་མཚུངས་པར་གང་སྤྱོད་པ། །",
      "en": "May I always meet and be accompanied by",
      "en-trans": "dak gi chö dang tsungpar gang chöpa"
    },
    {
      "bo": "དེ་དག་དང་ནི་རྟག་ཏུ་འགྲོགས་པར་ཤོག །",
      "en": "Those whose actions accord with mine;",
      "en-trans": "dedak dang ni taktu drokpar shok"
    },
    {
      "bo": "ལུས་དང་ངག་རྣམས་དང་ནི་སེམས་ཀྱིས་ཀྱང་། །",
      "en": "And in body, speech and mind as well,",
      "en-trans": "lü dang ngak nam dang ni sem kyi kyang"
    },
    {
      "bo": "སྤྱོད་པ་དག་དང་སྨོན་ལམ་གཅིག་ཏུ་སྤྱད། །",
      "en": "May our actions and aspirations always be one!",
      "en-trans": "chöpa dak dang mönlam chik tu ché"
    },
    {
      "bo": "བདག་ལ་ཕན་པར་འདོད་པའི་གྲོགས་པོ་དག །",
      "en": "May I always meet spiritual friends",
      "en-trans": "dak la penpar döpé drokpo dak"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པ་རབ་ཏུ་སྟོན་པ་རྣམས། །",
      "en": "Who long to be of true help to me,",
      "en-trans": "zangpo chöpa rabtu tönpa nam"
    },
    {
      "bo": "དེ་དག་དང་ཡང་རྟག་ཏུ་ཕྲད་པར་ཤོག །",
      "en": "And who teach me the Good Actions;",
      "en-trans": "dedak dang yang taktu trepar shok"
    },
    {
      "bo": "དེ་དག་བདག་གིས་ནམ་ཡང་ཡིད་མི་དབྱུང་། །",
      "en": "Never will I disappoint them!",
      "en-trans": "dedak dak gi namyang yi miyung"
    },
    {
      "bo": "སངས་རྒྱས་སྲས་ཀྱིས་བསྐོར་བའི་མགོན་པོ་རྣམས། །",
      "en": "May I always behold the buddhas, here before my eyes,",
      "en-trans": "sangye sé kyi korwé gönpo nam"
    },
    {
      "bo": "མངོན་སུམ་རྟག་ཏུ་བདག་གིས་རྒྱལ་བ་བལྟ། །",
      "en": "And around them all their bodhisattva sons and daughters.",
      "en-trans": "ngönsum taktu dak gi gyalwa ta"
    },
    {
      "bo": "མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར། །",
      "en": "Without ever tiring, throughout all the aeons to come,",
      "en-trans": "ma ong kalpa küntu mikyowar"
    },
    {
      "bo": "དེ་དག་ལ་ཡང་མཆོད་པ་རྒྱ་ཆེར་བགྱི། །",
      "en": "May the offerings I make them be endless and vast!",
      "en-trans": "dedak la yang chöpa gyacher gyi"
    },
    {
      "bo": "རྒྱལ་བ་རྣམས་ཀྱི་དམ་པའི་ཆོས་འཛིན་ཅིང་། །",
      "en": "May I maintain the sacred teachings of the buddhas,",
      "en-trans": "gyalwa nam kyi dampé chö dzin ching"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པ་ཀུན་ཏུ་སྣང་བར་བྱེད། །",
      "en": "And cause enlightened action to appear;",
      "en-trans": "changchub chöpa küntu nangwar jé"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པ་རྣམ་པར་སྦྱོང་བ་ཡང་། །",
      "en": "May I train to perfection in Good Actions,",
      "en-trans": "zangpo chöpa nampar jongwa yang"
    },
    {
      "bo": "མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱད་པར་བགྱི། །",
      "en": "And practise these in every age to come!",
      "en-trans": "ma ong kalpa küntu chepar gyi"
    },
    {
      "bo": "སྲིད་པ་ཐམས་ཅད་དུ་ཡང་འཁོར་བ་ན། །",
      "en": "As I wander through all states of samsaric existence,",
      "en-trans": "sipa tamché du yang khorwa na"
    },
    {
      "bo": "བསོད་ནམས་ཡེ་ཤེས་དག་ནི་མི་ཟད་བརྙེས། །",
      "en": "May I gather inexhaustible merit and wisdom,",
      "en-trans": "sönam yeshe dak ni mizé nyé"
    },
    {
      "bo": "ཐབས་དང་ཤེས་རབ་ཏིང་འཛིན་རྣམ་ཐར་དང་། །",
      "en": "And so become an inexhaustible treasury of noble qualities—",
      "en-trans": "tab dang sherab tingdzin namtar dang"
    },
    {
      "bo": "ཡོན་ཏན་ཀུན་གྱི་མི་ཟད་མཛོད་དུ་གྱུར། །",
      "en": "Of skill and discernment, samādhi and liberation!",
      "en-trans": "yönten kün gyi mizé dzö du gyur"
    },
    {
      "bo": "རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་ཞིང་རྣམས་ཏེ། །",
      "en": "In a single atom may I see as many pure realms as atoms in the universe:",
      "en-trans": "dul chik teng na dul nyé zhing nam té"
    },
    {
      "bo": "ཞིང་དེར་བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་རྣམས། །",
      "en": "And in each realm, buddhas beyond all imagining,",
      "en-trans": "zhing der sam gyi mikhyab sangye nam"
    },
    {
      "bo": "སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་ལ། །",
      "en": "Encircled by all their bodhisattva heirs.",
      "en-trans": "sangye sé kyi ü na zhukpa la"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་ཅིང་བལྟ་བར་བགྱི། །",
      "en": "Along with them, may I perform the actions of enlightenment!",
      "en-trans": "changchub chepa chö ching tawar gyi"
    },
    {
      "bo": "དེ་ལྟར་མ་ལུས་ཐམས་ཅད་ཕྱོགས་སུ་ཡང་། །",
      "en": "And so, in each direction, everywhere,",
      "en-trans": "detar malü tamché chok su yang"
    },
    {
      "bo": "སྐྲ་ཙམ་ཁྱོན་ལ་དུས་གསུམ་ཚད་སྙེད་ཀྱི། །",
      "en": "Even on the tip of a hair, may I see an ocean of buddhas—",
      "en-trans": "tra tsam khyön la dü sum tsé nyé kyi"
    },
    {
      "bo": "སངས་རྒྱས་རྒྱ་མཚོ་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །",
      "en": "All to come in past, present and future—in an ocean of pure realms,",
      "en-trans": "sangye gyatso zhing nam gyatso dang"
    },
    {
      "bo": "བསྐལ་པ་རྒྱ་མཚོ་སྤྱོད་ཅིང་རབ་ཏུ་འཇུག །",
      "en": "And throughout an ocean of aeons, may I enter into enlightened action in each and every one!",
      "en-trans": "kalpa gyatso chö ching rabtu juk"
    },
    {
      "bo": "གསུང་གཅིག་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་སྐད་ཀྱིས། །",
      "en": "Each single word of a buddha’s speech, that voice with its ocean of qualities,",
      "en-trans": "sung chik yenlak gyatsö draké kyi"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་དབྱངས་ཡན་ལག་རྣམ་དག་པ། །",
      "en": "Bears all the purity of the speech of all the buddhas,",
      "en-trans": "gyalwa kün yang yenlak namdakpa"
    },
    {
      "bo": "འགྲོ་བ་ཀུན་གྱི་བསམ་པ་ཇི་བཞིན་དབྱངས། །",
      "en": "Sounds that harmonize with the minds of all living beings:",
      "en-trans": "drowa kün gyi sampa jizhin yang"
    },
    {
      "bo": "སངས་རྒྱས་གསུང་ལ་རྟག་ཏུ་འཇུག་པར་བགྱི། །",
      "en": "May I always be engaged with the speech of the buddhas!",
      "en-trans": "sangye sung la taktu jukpar gyi"
    },
    {
      "bo": "དུས་གསུམ་གཤེགས་པའི་རྒྱལ་བ་ཐམས་ཅད་དག །",
      "en": "With all the power of my mind, may I hear and realize",
      "en-trans": "dü sum shekpé gyalwa tamché dak"
    },
    {
      "bo": "འཁོར་ལོའི་ཚུལ་རྣམས་རབ་ཏུ་བསྐོར་བ་ཡི། །",
      "en": "The inexhaustible melody of the teachings spoken by",
      "en-trans": "khorlö tsul nam rabtu korwa yi"
    },
    {
      "bo": "དེ་དག་གི་ཡང་གསུང་དབྱངས་མི་ཟད་ལ། །",
      "en": "All the buddhas of past, present and future,",
      "en-trans": "dedak gi yang sung yang mizé la"
    },
    {
      "bo": "བློ་ཡི་སྟོབས་ཀྱིས་བདག་ཀྱང་རབ་ཏུ་འཇུག །",
      "en": "As they turn the wheels of Dharma!",
      "en-trans": "lo yi tob kyi dak kyang rabtu juk"
    },
    {
      "bo": "མ་འོངས་བསྐལ་པ་ཐམས་ཅད་འཇུག་པར་ཡང་། །",
      "en": "Just as the wisdom of the buddhas penetrates all future aeons,",
      "en-trans": "ma ong kalpa tamché jukpar yang"
    },
    {
      "bo": "སྐད་ཅིག་གཅིག་གིས་བདག་ཀྱང་འཇུག་པར་བགྱི། །",
      "en": "So may I too know them, instantly,",
      "en-trans": "kechik chik gi dak kyang jukpar gyi"
    },
    {
      "bo": "གང་ཡང་བསྐལ་པ་དུས་གསུམ་ཚད་དེ་དག །",
      "en": "And in each fraction of an instant may I know",
      "en-trans": "gangyang kalpa dü sum tsé dedak"
    },
    {
      "bo": "སྐད་ཅིག་ཆ་ཤས་ཀྱིས་ནི་ཞུགས་པར་སྤྱད། །",
      "en": "All that will ever be, in past, present and future!",
      "en-trans": "kechik chashé kyi ni zhukpar ché"
    },
    {
      "bo": "དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་གང་། །",
      "en": "In an instant, may I behold all those who are the lions of the human race—",
      "en-trans": "dü sum shekpa mi yi sengé gang"
    },
    {
      "bo": "དེ་དག་སྐད་ཅིག་གཅིག་ལ་བདག་གིས་བལྟ། །",
      "en": "The buddhas of past, present and future!",
      "en-trans": "dedak kechik chik la dak gi ta"
    },
    {
      "bo": "རྟག་ཏུ་དེ་དག་གི་ནི་སྤྱོད་ཡུལ་ལ། །",
      "en": "May I always be engaged in the buddhas’ way of life and action,",
      "en-trans": "taktu dedak gi ni chöyul la"
    },
    {
      "bo": "སྒྱུ་མར་གྱུར་པའི་རྣམ་ཐར་སྟོབས་ཀྱིས་འཇུག །",
      "en": "Through the power of liberation, where all is realized as like an illusion!",
      "en-trans": "gyumar gyurpé namtar tob kyi juk"
    },
    {
      "bo": "གང་ཡང་དུས་གསུམ་དག་གི་ཞིང་བཀོད་པ། །",
      "en": "On a single atom, may I actually bring about",
      "en-trans": "gangyang dü sum dak gi zhing köpa"
    },
    {
      "bo": "དེ་དག་རྡུལ་གཅིག་སྟེང་དུ་མངོན་པར་བསྒྲུབ། །",
      "en": "The entire array of pure realms of past, of present and future;",
      "en-trans": "dedak dul chik tengdu ngönpar drub"
    },
    {
      "bo": "དེ་ལྟར་མ་ལུས་ཕྱོགས་རྣམས་ཐམས་ཅད་དུ། །",
      "en": "And then enter into those pure buddha realms",
      "en-trans": "detar malü chok nam tamché du"
    },
    {
      "bo": "རྒྱལ་བ་དག་གི་ཞིང་རྣམས་བཀོད་ལ་འཇུག །",
      "en": "In each atom, and in each and every direction.",
      "en-trans": "gyalwa dak gi zhing nam kö la juk"
    },
    {
      "bo": "གང་ཡང་མ་བྱོན་འཇིག་རྟེན་སྒྲོན་མ་རྣམས། །",
      "en": "When those who illuminate the world, still to come,",
      "en-trans": "gangyang majön jikten drönma nam"
    },
    {
      "bo": "དེ་དག་རིམ་པར་འཚང་རྒྱ་འཁོར་ལོ་བསྐོར། །",
      "en": "Gradually attain buddhahood, turn the Wheel of Dharma,",
      "en-trans": "dedak rimpar tsang gya khorlo kor"
    },
    {
      "bo": "མྱ་ངན་འདས་པ་རབ་ཏུ་ཞི་མཐའ་སྟོན། །",
      "en": "And demonstrate the final, profound peace of nirvāṇa:",
      "en-trans": "nya ngen depa rabtu zhi ta tön"
    },
    {
      "bo": "མགོན་པོ་ཀུན་གྱི་དྲུང་དུ་བདག་མཆི་འོ། །",
      "en": "May I be always in their presence!",
      "en-trans": "gönpo kün gyi drung du dak chi o"
    },
    {
      "bo": "ཀུན་ཏུ་མྱུར་བའི་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་། །",
      "en": "Through the power of swift miracles,",
      "en-trans": "küntu nyurwé dzutrul tob nam dang"
    },
    {
      "bo": "ཀུན་ནས་སྒོ་ཡི་ཐེག་པའི་སྟོབས་དག་དང་། །",
      "en": "The power of the vehicle, like a doorway,",
      "en-trans": "künné go yi tekpé tob dak dang"
    },
    {
      "bo": "ཀུན་ཏུ་ཡོན་ཏན་སྤྱོད་པའི་སྟོབས་རྣམས་དང་། །",
      "en": "The power of conduct that possesses all virtuous qualities,",
      "en-trans": "küntu yönten chöpé tob nam dang"
    },
    {
      "bo": "ཀུན་ཏུ་ཁྱབ་པ་བྱམས་པ་དག་གི་སྟོབས། །",
      "en": "The power of loving kindness, all-pervasive,",
      "en-trans": "küntu khyabpa jampa dak gi tob"
    },
    {
      "bo": "ཀུན་ནས་དགེ་བའི་བསོད་ནམས་སྟོབས་དག་དང་། །",
      "en": "The power of merit that is totally virtuous,",
      "en-trans": "künné gewé sönam tob dak dang"
    },
    {
      "bo": "ཆགས་པ་མེད་པར་གྱུར་པའི་ཡེ་ཤེས་སྟོབས། །",
      "en": "The power of wisdom free from attachment, and",
      "en-trans": "chakpa mepar gyurpé yeshe tob"
    },
    {
      "bo": "ཤེས་རབ་ཐབས་དང་ཏིང་འཛིན་སྟོབས་དག་གིས། །",
      "en": "The powers of knowledge, skilful means and samādhi,",
      "en-trans": "sherab tab dang tingdzin tob dak gi"
    },
    {
      "bo": "བྱང་ཆུབ་སྟོབས་རྣམས་ཡང་དག་སྒྲུབ་པར་བྱེད། །",
      "en": "May I perfectly accomplish the power of enlightenment!",
      "en-trans": "changchub tob nam yangdak drubpar jé"
    },
    {
      "bo": "ལས་ཀྱི་སྟོབས་རྣམས་ཡོངས་སུ་དག་བྱེད་ཅིང་། །",
      "en": "May I purify the power of karma;",
      "en-trans": "lé kyi tob nam yongsu dakjé ching"
    },
    {
      "bo": "ཉོན་མོངས་སྟོབས་རྣམས་ཀུན་ཏུ་འཇོམས་པར་བྱེད། །",
      "en": "Destroy the power of harmful emotions;",
      "en-trans": "nyönmong tob nam küntu jompar jé"
    },
    {
      "bo": "བདུད་ཀྱི་སྟོབས་རྣམས་སྟོབས་མེད་རབ་བྱེད་ཅིང་། །",
      "en": "Render negativity utterly powerless;",
      "en-trans": "dü kyi tob nam tobmé rabjé ching"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པའི་སྟོབས་ནི་རྫོགས་པར་བགྱི། །",
      "en": "And perfect the power of Good Actions!",
      "en-trans": "zangpo chöpé tob ni dzokpar gyi"
    },
    {
      "bo": "ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །",
      "en": "I shall purify oceans of realms;",
      "en-trans": "zhing nam gyatso nampar dakjé ching"
    },
    {
      "bo": "སེམས་ཅན་རྒྱ་མཚོ་དག་ནི་རྣམ་པར་སྒྲོལ། །",
      "en": "Liberate oceans of sentient beings;",
      "en-trans": "semchen gyatso dak ni nampar drol"
    },
    {
      "bo": "ཆོས་རྣམས་རྒྱ་མཚོ་རབ་ཏུ་མཐོང་བྱེད་ཅིང་། །",
      "en": "Understand oceans of Dharma;",
      "en-trans": "chö nam gyatso rabtu tongjé ching"
    },
    {
      "bo": "ཡེ་ཤེས་རྒྱ་མཚོ་རབ་ཏུ་རྟོགས་པར་བྱེད། །",
      "en": "Realize oceans of wisdom;",
      "en-trans": "yeshe gyatso rabtu tokpar jé"
    },
    {
      "bo": "སྤྱོད་པ་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །",
      "en": "Perfect oceans of actions;",
      "en-trans": "chöpa gyatso nampar dakjé ching"
    },
    {
      "bo": "སྨོན་ལམ་རྒྱ་མཚོ་ཡོངས་སུ་རྫོགས་པར་བྱེད། །",
      "en": "Fulfil oceans of aspirations;",
      "en-trans": "mönlam gyatso yongsu dzokpar jé"
    },
    {
      "bo": "སངས་རྒྱས་རྒྱ་མཚོ་རབ་ཏུ་མཆོད་བྱེད་ཅིང་། །",
      "en": "Serve oceans of buddhas!",
      "en-trans": "sangye gyatso rabtu chöjé ching"
    },
    {
      "bo": "བསྐལ་པ་རྒྱ་མཚོ་མི་སྐྱོ་སྤྱད་པར་བགྱི། །",
      "en": "And perform these, without ever growing weary, through oceans of aeons!",
      "en-trans": "kalpa gyatso mikyo chepar gyi"
    },
    {
      "bo": "གང་ཡང་དུས་གསུམ་གཤེགས་པའི་རྒྱལ་བ་ཡི། །",
      "en": "All the buddhas throughout the whole of time,",
      "en-trans": "gangyang dü sum shekpé gyalwa yi"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པའི་སྨོན་ལམ་བྱེ་བྲག་རྣམས། །",
      "en": "Attained enlightenment through Good Actions, and",
      "en-trans": "changchub chöpé mönlam jedrak nam"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པས་བྱང་ཆུབ་སངས་རྒྱས་ནས། །",
      "en": "Their prayers and aspirations for enlightened action:",
      "en-trans": "zangpo chöpé changchub sangye né"
    },
    {
      "bo": "དེ་ཀུན་བདག་གིས་མ་ལུས་རྫོགས་པར་བགྱི། །",
      "en": "May I fulfil them all completely!",
      "en-trans": "dé kün dak gi malü dzokpar gyi"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་སྲས་ཀྱི་ཐུ་བོ་པ། །",
      "en": "The eldest of the sons of all the buddhas",
      "en-trans": "gyalwa kün gyi sé kyi tuwopa"
    },
    {
      "bo": "གང་གི་མིང་ནི་ཀུན་ཏུ་བཟང་ཞེས་བྱ། །",
      "en": "Is called Samantabhadra: ‘All-good’—",
      "en-trans": "gang gi ming ni kuntuzang zheja"
    },
    {
      "bo": "མཁས་པ་དེ་དང་མཚུངས་པར་སྤྱད་པའི་ཕྱིར། །",
      "en": "So that I may act with a skill like his,",
      "en-trans": "khepa dé dang tsungpar chepé chir"
    },
    {
      "bo": "དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །",
      "en": "I dedicate fully all these merits!",
      "en-trans": "gewa didak tamché rabtu ngo"
    },
    {
      "bo": "ལུས་དང་ངག་དང་ཡིད་ཀྱང་རྣམ་དག་ཅིང་། །",
      "en": "To purify my body, my speech and my mind as well,",
      "en-trans": "lü dang ngak dang yi kyang namdak ching"
    },
    {
      "bo": "སྤྱོད་པ་རྣམ་དག་ཞིང་རྣམས་ཡོངས་དག་པ། །",
      "en": "To purify my actions, and all realms,",
      "en-trans": "chöpa namdak zhing nam yong dakpa"
    },
    {
      "bo": "བསྔོ་བ་བཟང་པོ་མཁས་པ་ཅི་འདྲ་བ། །",
      "en": "May I be the equal of Samantabhadra",
      "en-trans": "ngowa zangpo khepa chindrawa"
    },
    {
      "bo": "དེ་འདྲར་བདག་ཀྱང་དེ་དང་མཚུངས་པར་ཤོག །",
      "en": "In his skill in good dedication!",
      "en-trans": "dendrar dak kyang dé dang tsungpar shok"
    },
    {
      "bo": "ཀུན་ནས་དགེ་བ་བཟང་པོ་སྤྱད་པའི་ཕྱིར། །",
      "en": "In order to perform the full virtue of Good Actions,",
      "en-trans": "künné gewa zangpo chepé chir"
    },
    {
      "bo": "འཇམ་དཔལ་གྱི་ནི་སྨོན་ལམ་སྤྱད་པར་བགྱི། །",
      "en": "I shall act according to Mañjuśrī's prayers of aspiration,",
      "en-trans": "jampal gyi ni mönlam chepar gyi"
    },
    {
      "bo": "མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར། །",
      "en": "And without ever growing weary, in all the aeons to come,",
      "en-trans": "ma ong kalpa küntu mikyowar"
    },
    {
      "bo": "དེ་ཡི་བྱ་བ་མ་ལུས་རྫོགས་པར་བགྱི། །",
      "en": "I shall perfectly fulfil every one of his aims!",
      "en-trans": "dé yi jawa malü dzokpar gyi"
    },
    {
      "bo": "སྤྱོད་པ་དག་ནི་ཚད་ཡོད་མ་གྱུར་ཅིག །",
      "en": "Let my bodhisattva acts be beyond measure!",
      "en-trans": "chöpa dak ni tsé yö magyur chik"
    },
    {
      "bo": "ཡོན་ཏན་རྣམས་ཀྱང་ཚད་བཟུང་མེད་པར་ཤོག །",
      "en": "Let my enlightened qualities be measureless too!",
      "en-trans": "yönten nam kyang tsé zung mepar shok"
    },
    {
      "bo": "སྤྱོད་པ་ཚད་མེད་པ་ལ་གནས་ནས་ཀྱང་། །",
      "en": "Keeping to this immeasurable activity,",
      "en-trans": "chöpa tsemepa la né né kyang"
    },
    {
      "bo": "དེ་དག་འཕྲུལ་པ་ཐམས་ཅད་འཚལ་བར་བགྱི། །",
      "en": "May I accomplish all the miraculous powers of enlightenment!",
      "en-trans": "dedak trulpa tamché tsalwar gyi"
    },
    {
      "bo": "ནམ་མཁའི་མཐར་ཐུག་གྱུར་པ་ཇི་ཙམ་པར། །",
      "en": "Sentient beings are as limitless",
      "en-trans": "namkhé tartuk gyurpa ji tsampar"
    },
    {
      "bo": "སེམས་ཅན་མ་ལུས་མཐའ་ཡང་དེ་བཞིན་ཏེ། །",
      "en": "As the boundless expanse of space;",
      "en-trans": "semchen malü ta yang dezhin té"
    },
    {
      "bo": "ཇི་ཙམ་ལས་དང་ཉོན་མོངས་མཐར་གྱུར་པ། །",
      "en": "So shall my prayers of aspiration for them",
      "en-trans": "ji tsam lé dang nyönmong tar gyurpa"
    },
    {
      "bo": "བདག་གི་སྨོན་ལམ་མཐའ་ཡང་དེ་ཙམ་མོ། །",
      "en": "Be as limitless as their karma and harmful emotions!",
      "en-trans": "dak gi mönlam ta yang detsam mo"
    },
    {
      "bo": "གང་ཡང་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མཐའ་ཡས་པ། །",
      "en": "Whoever hears this king of dedication prayers,",
      "en-trans": "gangyang chok chü zhing nam tayepa"
    },
    {
      "bo": "རིན་ཆེན་བརྒྱན་ཏེ་རྒྱལ་བ་རྣམས་ལ་ཕུལ། །",
      "en": "And yearns for supreme enlightenment,",
      "en-trans": "rinchen gyen té gyalwa nam la pul"
    },
    {
      "bo": "ལྷ་དང་མི་ཡི་བདེ་བའི་མཆོག་རྣམས་ཀྱང་། །",
      "en": "Who even once arouses faith,",
      "en-trans": "lha dang mi yi dewé chok nam kyang"
    },
    {
      "bo": "ཞིང་གི་རྡུལ་སྙེད་བསྐལ་པར་ཕུལ་བ་བས། །",
      "en": "Will gain true merit greater still",
      "en-trans": "zhing gi dul nyé kalpar pulwa bé"
    },
    {
      "bo": "གང་གིས་བསྔོ་བའི་རྒྱལ་པོ་འདི་ཐོས་ནས། །",
      "en": "Than by offering the victorious buddhas",
      "en-trans": "gang gi ngowé gyalpo di tö né"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་གི་རྗེས་སུ་རབ་མོས་ཤིང་། །",
      "en": "Infinite pure realms in every directions, all ornamented with jewels,",
      "en-trans": "changchub chok gi jesu rab mö shing"
    },
    {
      "bo": "ལན་གཅིག་ཙམ་ཡང་དད་པ་བསྐྱེད་པ་ན། །",
      "en": "Or offering them all the highest joys of gods and humans",
      "en-trans": "len chik tsam yang depa kyepa na"
    },
    {
      "bo": "བསོད་ནམས་དམ་པའི་མཆོག་ཏུ་འདི་འགྱུར་རོ། །",
      "en": "For as many aeons as there are atoms in those realms.",
      "en-trans": "sönam dampé chok tu di gyur ro"
    },
    {
      "bo": "གང་གིས་བཟང་སྤྱོད་སྨོན་ལམ་འདི་བཏབ་པས། །",
      "en": "Whoever truly makes this Aspiration to Good Actions,",
      "en-trans": "gang gi zangchö mönlam di tabpé"
    },
    {
      "bo": "དེས་ནི་ངན་སོང་ཐམས་ཅད་སྤོང་བར་འགྱུར། །",
      "en": "Will never again be born in lower realms;",
      "en-trans": "dé ni ngensong tamché pongwar gyur"
    },
    {
      "bo": "དེས་ནི་གྲོགས་པོ་ངན་པ་སྤངས་བ་ཡིན། །",
      "en": "They will be free from harmful companions, and",
      "en-trans": "dé ni drokpo ngenpa pangwa yin"
    },
    {
      "bo": "སྣང་བ་མཐའ་ཡས་དེ་ཡང་དེས་མྱུར་མཐོང་། །",
      "en": "Soon behold the Buddha of Boundless Light.",
      "en-trans": "nangwa tayé deyang dé nyur tong"
    },
    {
      "bo": "དེ་དག་རྙེད་པ་རབ་རྙེད་བདེ་བར་འཚོ། །",
      "en": "They will acquire all kind of benefits, and live in happiness;",
      "en-trans": "dedak nyepa rab nyé dewar tso"
    },
    {
      "bo": "མི་ཚེ་འདིར་ཡང་དེ་དག་ལེགས་པར་འོང་། །",
      "en": "Even in this present life all will go well,",
      "en-trans": "mitsé dir yang dedak lekpar ong"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་ཅི་འདྲ་བར། །",
      "en": "And before long,",
      "en-trans": "kuntuzangpo deyang chindrawar"
    },
    {
      "bo": "དེ་དག་རིང་པོར་མི་ཐོགས་དེ་བཞིན་འགྱུར། །",
      "en": "They will become just like Samantabhadra.",
      "en-trans": "dedak ringpor mitok dezhin gyur"
    },
    {
      "bo": "མཚམས་མེད་ལྔ་པོ་དག་གི་སྡིག་པ་རྣམས། །",
      "en": "All negative acts—even the five of immediate retribution—",
      "en-trans": "tsammé ngapo dak gi dikpa nam"
    },
    {
      "bo": "གང་གིས་མི་ཤེས་དབང་གིས་བྱས་པ་དག །",
      "en": "Whatever they have committed in the grip of ignorance,",
      "en-trans": "gang gi mishe wang gi jepa dak"
    },
    {
      "bo": "དེ་ཡིས་བཟང་པོ་སྤྱོད་པ་འདི་བརྗོད་ན། །",
      "en": "Will soon be completely purified,",
      "en-trans": "dé yi zangpo chöpa di jö na"
    },
    {
      "bo": "མྱུར་དུ་མ་ལུས་ཡོངས་སུ་བྱང་བར་འགྱུར། །",
      "en": "If they recite this Aspiration to Good Actions.",
      "en-trans": "nyurdu malü yongsu jangwar gyur"
    },
    {
      "bo": "ཡེ་ཤེས་དང་ནི་གཟུགས་དང་མཚན་རྣམས་དང་། །",
      "en": "They will possess perfect wisdom, beauty, and excellent signs,",
      "en-trans": "yeshe dang ni zuk dang tsen nam dang"
    },
    {
      "bo": "རིགས་དང་ཁ་དོག་རྣམས་དང་ལྡན་པར་འགྱུར། །",
      "en": "Be born in a good family, and with a radiant appearance.",
      "en-trans": "rik dang khadok nam dang denpar gyur"
    },
    {
      "bo": "བདུད་དང་མུ་སྟེགས་མང་པོས་དེ་མི་ཐུབ། །",
      "en": "Demons and heretics will never harm them,",
      "en-trans": "dü dang mutek mangpö dé mitub"
    },
    {
      "bo": "འཇིག་རྟེན་གསུམ་པོ་ཀུན་ནའང་མཆོད་པར་འགྱུར། །",
      "en": "And all three worlds will honour them with offerings.",
      "en-trans": "jikten sumpo kün na ang chöpar gyur"
    },
    {
      "bo": "བྱང་ཆུབ་ཤིང་དབང་དྲུང་དུ་དེ་མྱུར་འགྲོ། །",
      "en": "They will quickly go beneath the bodhi-tree,",
      "en-trans": "changchub shingwang drung du dé nyur dro"
    },
    {
      "bo": "སོང་ནས་སེམས་ཅན་ཕན་ཕྱིར་དེར་འདུག་སྟེ། །",
      "en": "And there, they will sit, to benefit all sentient beings, then",
      "en-trans": "song né semchen pen chir der duk té"
    },
    {
      "bo": "བྱང་ཆུབ་སངས་རྒྱས་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །",
      "en": "Awaken into enlightenment, turn the wheel of Dharma,",
      "en-trans": "changchub sangye khorlo rabtu kor"
    },
    {
      "bo": "བདུད་རྣམས་སྡེ་དང་བཅས་པ་ཐམས་ཅད་བཏུལ། །",
      "en": "And tame Māra with all his hordes.",
      "en-trans": "dü nam dé dang chepa tamché tul"
    },
    {
      "bo": "གང་ཡང་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་འདི། །",
      "en": "The full result of keeping, teaching, or reading",
      "en-trans": "gangyang zangpo chöpé mönlam di"
    },
    {
      "bo": "འཆང་བ་དང་ནི་སྟོན་ཏམ་ཀློག་ན་ཡང་། །",
      "en": "This Prayer of Aspiration to Good Actions",
      "en-trans": "changwa dang ni tön tam lok na yang"
    },
    {
      "bo": "དེ་ཡི་རྣམ་པར་སྨིན་པའང་སངས་རྒྱས་མཁྱེན། །",
      "en": "Is known to the buddhas alone:",
      "en-trans": "dé yi nampar minpa ang sangye khyen"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་ལ་སོམ་ཉི་མ་བྱེད་ཅིག །",
      "en": "Have no doubt: supreme enlightenment will be yours!",
      "en-trans": "changchub chok la somnyi majé chik"
    },
    {
      "bo": "འཇམ་དཔལ་དཔའ་བོས་ཇི་ལྟར་མཁྱེན་པ་དང་། །",
      "en": "Just as the bodhisattva Mañjuśrī attained omniscience,",
      "en-trans": "jampal pawö jitar khyenpa dang"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་དེ་བཞིན་ཏེ། །",
      "en": "And Samantabhadra too",
      "en-trans": "kuntuzangpo deyang dezhin té"
    },
    {
      "bo": "དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་སློབ་ཕྱིར། །",
      "en": "All these merits now I dedicate",
      "en-trans": "dedak kün gyi jesu dak lob chir"
    },
    {
      "bo": "དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །",
      "en": "To train and follow in their footsteps.",
      "en-trans": "gewa didak tamché rabtu ngo"
    },
    {
      "bo": "དུས་གསུམ་གཤེགས་པའི་རྒྱལ་བ་ཐམས་ཅད་ཀྱིས། །",
      "en": "As all the victorious buddhas of past, present and future",
      "en-trans": "dü sum shekpé gyalwa tamché kyi"
    },
    {
      "bo": "བསྔོ་བ་གང་ལ་མཆོག་ཏུ་བསྔགས་པ་དེས། །",
      "en": "Praise dedication as supreme,",
      "en-trans": "ngowa gangla chok tu ngakpa dé"
    },
    {
      "bo": "བདག་གི་དགེ་བའི་རྩ་བ་འདི་ཀུན་ཀྱང་། །",
      "en": "So now I dedicate all these roots of virtue",
      "en-trans": "dak gi gewé tsawa di kün kyang"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་ཕྱིར་རབ་ཏུ་བསྔོ་བར་བགྱི། །",
      "en": "For all beings to perfect Good Actions.",
      "en-trans": "zangpo chö chir rabtu ngowar gyi"
    },
    {
      "bo": "བདག་ནི་འཆི་བའི་དུས་བྱེད་གྱུར་པ་ན། །",
      "en": "When it is time for me to die,",
      "en-trans": "dak ni chiwé dü jé gyurpa na"
    },
    {
      "bo": "སྒྲིབ་པ་ཐམས་ཅད་དག་ནི་ཕྱིར་བསལ་ཏེ། །",
      "en": "Let all that obscures me fade away, so",
      "en-trans": "dribpa tamché dak ni chir sal té"
    },
    {
      "bo": "མངོན་སུམ་སྣང་བ་མཐའ་ཡས་དེ་མཐོང་ནས། །",
      "en": "I look on Amitābha, there in person,",
      "en-trans": "ngönsum nangwa tayé dé tong né"
    },
    {
      "bo": "བདེ་བ་ཅན་གྱི་ཞིང་དེར་རབ་ཏུ་འགྲོ། །",
      "en": "And go at once to his pure land of Sukhāvatī.",
      "en-trans": "dewachen gyi zhing der rabtu dro"
    },
    {
      "bo": "དེར་སོང་ནས་ནི་སྨོན་ལམ་འདི་དག་ཀྱང་། །",
      "en": "In that pure land, may I actualize every single one",
      "en-trans": "der song né ni mönlam didak kyang"
    },
    {
      "bo": "ཐམས་ཅད་མ་ལུས་མངོན་དུ་འགྱུར་བར་ཤོག །",
      "en": "Of all these aspirations!",
      "en-trans": "tamché malü ngön du gyurwar shok"
    },
    {
      "bo": "དེ་དག་མ་ལུས་བདག་གིས་ཡོངས་སུ་བཀང་། །",
      "en": "May I fulfil them, each and every one,",
      "en-trans": "dedak malü dak gi yongsu kang"
    },
    {
      "bo": "འཇིག་རྟེན་ཇི་སྲིད་སེམས་ཅན་ཕན་པར་བགྱི། །",
      "en": "And bring help to beings for as long as the universe remains!",
      "en-trans": "jikten jisi semchen penpar gyi"
    },
    {
      "bo": "རྒྱལ་བའི་དཀྱིལ་འཁོར་བཟང་ཞིང་དགའ་བ་དེར། །",
      "en": "Born there in a beautiful lotus flower,",
      "en-trans": "gyalwé kyilkhor zang zhing gawa der"
    },
    {
      "bo": "པདྨོ་དམ་པ་ཤིན་ཏུ་མཛེས་ལས་སྐྱེས། །",
      "en": "In that excellent and joyous buddha realm,",
      "en-trans": "pemo dampa shintu dzé lé kyé"
    },
    {
      "bo": "སྣང་བ་མཐའ་ཡས་རྒྱལ་བས་མངོན་སུམ་དུ། །",
      "en": "May the Buddha Amitābha himself",
      "en-trans": "nangwa tayé gyalwé ngönsum du"
    },
    {
      "bo": "ལུང་བསྟན་པ་ཡང་བདག་གིས་དེར་ཐོབ་ཤོག །",
      "en": "Grant me the prophecy foretelling my enlightenment!",
      "en-trans": "lungtenpa yang dak gi der tob shok"
    },
    {
      "bo": "དེར་ནི་བདག་གིས་ལུང་བསྟན་རབ་ཐོབ་ནས། །",
      "en": "Having received the prophecy there,",
      "en-trans": "der ni dak gi lungten rab tob né"
    },
    {
      "bo": "སྤྲུལ་པ་མང་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ཡིས། །",
      "en": "With my billions of emanations,",
      "en-trans": "trulpa mangpo jewa trak gya yi"
    },
    {
      "bo": "བློ་ཡི་སྟོབས་ཀྱིས་ཕྱོགས་བཅུ་རྣམས་སུ་ཡང་། །",
      "en": "Sent out through the power of my mind,",
      "en-trans": "lo yi tob kyi chok chu nam su yang"
    },
    {
      "bo": "སེམས་ཅན་རྣམས་ལ་ཕན་པ་མང་པོ་བགྱི། །",
      "en": "May I bring enormous benefit to sentient beings, in all the ten directions!",
      "en-trans": "semchen nam la penpa mangpo gyi"
    },
    {
      "bo": "བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་བཏབ་པ་ཡི། །",
      "en": "Through whatever small virtues I have gained",
      "en-trans": "zangpo chöpé mönlam tabpa yi"
    },
    {
      "bo": "དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསགས་པ། །",
      "en": "By reciting this “Aspiration to Good Actions”,",
      "en-trans": "gewa chungzé dak gi chi sakpa"
    },
    {
      "bo": "དེས་ནི་འགྲོ་བའི་སྨོན་ལམ་དགེ་བ་རྣམས། །",
      "en": "May the virtuous wishes of all beings’ prayers and aspirations",
      "en-trans": "dé ni drowé mönlam gewa nam"
    },
    {
      "bo": "སྐད་ཅིག་གཅིག་གིས་ཐམས་ཅད་འབྱོར་བར་ཤོག །",
      "en": "All be instantly accomplished!",
      "en-trans": "kechik chik gi tamché jorwar shok"
    },
    {
      "bo": "གང་ཡང་བཟང་པོ་སྤྱོད་པ་འདི་བསྔོས་པས། །",
      "en": "Through the true and boundless merit",
      "en-trans": "gangyang zangpo chöpa di ngöpé"
    },
    {
      "bo": "བསོད་ནམས་མཐའ་ཡས་དམ་པ་གང་ཐོབ་དེས། །",
      "en": "Attained by dedicating this “Aspiration to Good Actions”,",
      "en-trans": "sönam tayé dampa gang tob dé"
    },
    {
      "bo": "འགྲོ་བ་སྡུག་བསྔལ་ཆུ་བོར་བྱིང་བ་རྣམས། །",
      "en": "May all those now drowning in the ocean of suffering,",
      "en-trans": "drowa dukngal chuwor jingwa nam"
    },
    {
      "bo": "འོད་དཔག་མེད་པའི་གནས་རབ་འཐོབ་པར་ཤོག །",
      "en": "Reach the supreme realm of Amitābha!",
      "en-trans": "öpakmepé né rab tobpar shok"
    },
    {
      "bo": "སྨོན་ལམ་རྒྱལ་པོ་འདི་དག་མཆོག་གི་གཙོ། །",
      "en": "May this King of Aspirations bring about",
      "en-trans": "mönlam gyalpo didak chok gi tso"
    },
    {
      "bo": "མཐའ་ཡས་འགྲོ་བ་ཀུན་ལ་ཕན་བྱེད་ཅིང་། །",
      "en": "The supreme aim and benefit of all infinite sentient beings;",
      "en-trans": "tayé drowa kün la pen jé ching"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོས་བརྒྱན་པའི་གཞུང་གྲུབ་སྟེ། །",
      "en": "May they perfect what is described in this holy prayer, uttered by Samantabhadra!",
      "en-trans": "kuntuzangpö gyenpé zhung drub té"
    },
    {
      "bo": "ངན་སོང་གནས་རྣམས་མ་ལུས་སྟོངས་པར་ཤོག །",
      "en": "May the lower realms be entirely emptied!",
      "en-trans": "ngensong né nam malü tongpar shok"
    },
    {
      "bo": "སངས་རྒྱས་སྐུ་གསུམ་བརྙེས་པའི་བྱིན་རླབས་དང་། །",
      "en": "By the blessings of the buddhas who have attained the three kāyas,",
      "en-trans": "sangye ku sum nyepé jinlab dang"
    },
    {
      "bo": "ཆོས་ཉིད་མི་འགྱུར་བདེན་པའི་བྱིན་རླབས་དང་། །",
      "en": "And the unchanging truth of reality",
      "en-trans": "chönyi mingyur denpé jinlab dang"
    },
    {
      "bo": "དགེ་འདུན་མི་ཕྱེད་འདུན་པའི་བྱིན་རླབས་ཀྱིས། །",
      "en": "As well as the unwavering aspirations of the Saṅgha,",
      "en-trans": "gendün miché dünpé jinlab kyi"
    },
    {
      "bo": "ཇི་ལྟར་བསྔོས་བཞིན་སྨོན་ལམ་འགྲུབ་པར་ཤོག །",
      "en": "May all the aspirations and dedication prayers be fulfilled!",
      "en-trans": "jitar ngö zhin mönlam drubpar shok"
    }
  ]
}