{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fourteenth-dalai-lama/song-devotion-khenpo-jigme-phuntsok",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གཏེར་སྟོན་ལས་རབ་གླིང་པའི་ཡང་སྤྲུལ་མཁན་ཆེན་འཇིགས་མེད་ཕུན་ཚོགས་གང་དེའི་ཐུགས་དགོངས་ཟབ་མོ་ཡོངས་སུ་རྫོགས་པའི་སྨོན་ཚིག་མོས་གུས་གླུ་དབྱངས་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "Verses of Aspiration for the Fulfilment of the Enlightened Vision of Khenchen Jigme Phuntsok, the Reincarnation of Tertön Lerab Lingpa"
  },
  "text": [
    {
      "bo": "སྤངས་རྟོགས་བདེ་གཤེགས་མཆོག་བརྙེས་ཐུབ་པའི་དབང༌། །",
      "en": "O lord of sages, Śākyamuni, who through abandoning and realizing attained supreme buddhahood,",
      "en-trans": "pang tok deshek chok nyé tubpé wang"
    },
    {
      "bo": "དེ་སྲས་ཐུ་བོ་བྱམས་མགོན་འཇམ་པའི་དབྱངས། །",
      "en": "With your heart sons, Lord Maitreya and Mañjughoṣa,",
      "en-trans": "dé sé tuwo jam gön jampé yang"
    },
    {
      "bo": "གཏད་རབས་རྣམ་བདུན་པ་ཆེན་བཅུ་བདུན་སོགས། །",
      "en": "The seven patriarchs,1the seventeen great paṇḍitas2and the like,",
      "en-trans": "té rab nam dünpa chen chudün sok"
    },
    {
      "bo": "འཕགས་ཡུལ་བསྟན་པའི་འབྱུང་གནས་ཆེ་རྣམས་དང༌། །",
      "en": "All you great founders of the teachings in the noble land of India,",
      "en-trans": "pakyul tenpé jungné ché nam dang"
    },
    {
      "bo": "ཁྱད་པར་བྷོ་ཊའི་ལྗོངས་སུ་ལེགས་ལམ་སྒོ། །",
      "en": "And especially you who introduced the excellent path in Tibet;",
      "en-trans": "khyepar bhoté jong su lek lam go"
    },
    {
      "bo": "འབྱེད་མཛད་ཆོས་ཀྱི་རྒྱལ་པོ་མེས་དབོན་གསུམ། །",
      "en": "The three ancestral Dharma kings,3",
      "en-trans": "jé dzé chö kyi gyalpo mé wön sum"
    },
    {
      "bo": "སངས་རྒྱས་གཉིས་པ་པད་མ་ཀ་རའི་ཞབས། །",
      "en": "The second buddha—Padmākara,",
      "en-trans": "sangye nyipa pema karé zhab"
    },
    {
      "bo": "ཞི་འཚོ་བརྒྱུད་བཅས་བཀའ་དྲིན་དྲན་བཞིན་དད། །",
      "en": "Śāntarakṣita and your entire lineage: recollecting your kindness fills us with faith and devotion.",
      "en-trans": "zhitso gyü ché kadrin dren zhin dé"
    },
    {
      "bo": "མི་འཇིགས་བཞི་ལྡན་རྣམ་འདྲེན་རྒྱལ་བའི་བསྟན། །",
      "en": "So as to bring living inspiration to countless beings, you spread",
      "en-trans": "mi jik zhiden namdren gyalwé ten"
    },
    {
      "bo": "མཐའ་མེད་འགྲོ་བའི་གསོས་སུ་སྤེལ་བའི་སླད། །",
      "en": "The teachings of Buddha, our victorious guide endowed with fourfold fearlessness,",
      "en-trans": "tamé drowé sö su pelwé lé"
    },
    {
      "bo": "ཕུན་ཚོགས་ལྔ་ལྡན་སྐལ་བཟང་ཕྱོགས་ཀུན་ཏུ། །",
      "en": "Radiating them, with the five perfections, to fortunate disciples in every direction,",
      "en-trans": "püntsok ngaden kalzang chok küntu"
    },
    {
      "bo": "སྤྲོ་མཁས་རྗེ་བཙུན་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "O learned, skilful and noble lama, to you we pray.",
      "en-trans": "tro khé jetsün lamar solwa deb"
    },
    {
      "bo": "ཐུབ་བསྟན་རྒྱ་མཚོ་༧རྒྱལ་བའི་དབང་པོ་ཡི། །",
      "en": "When the time came for the enlightened aspiration and actions",
      "en-trans": "tubten gyatso gyalwé wangpo yi"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་ཕྲིན་ལས་དུས་བབས་དམ་ཚིག་ལས། །",
      "en": "Of the Dalai Lama Thubten Gyatso to be fulfilled, it was through their spiritual link",
      "en-trans": "tukkyé trinlé dü bab damtsik lé"
    },
    {
      "bo": "གཏེར་སྟོན་ལས་རབ་གླིང་པའི་ཆོས་སྐོར་གྱིས། །",
      "en": "That Lerab Lingpa, with his cycle of teachings,",
      "en-trans": "tertön lerab lingpé chö kor gyi"
    },
    {
      "bo": "གངས་ལྗོངས་འགྲོ་ལ་ཤིས་པའི་དཔལ་ཡོན་བསྒྲུབས། །",
      "en": "Brought a wealth of auspiciousness to the people of the Land of Snows.",
      "en-trans": "gangjong dro la shipé pal yön drub"
    },
    {
      "bo": "ལྔ་བདོའི་རྒུད་པའི་སྨག་རུམ་ཁྲོད་དུ་ཡང༌། །",
      "en": "Even amidst the oppressive darkness of the five degenerations,",
      "en-trans": "nga dö güpé makrum trö du yang"
    },
    {
      "bo": "ཕྱི་ནང་སྡེ་སྣོད་རབ་འབྱམས་གཞུང་བརྒྱའི་དོན། །",
      "en": "You perfected your study, contemplation and meditation on all the outer and inner piṭakas, and countless scriptures,",
      "en-trans": "chinang denö rabjam zhung gyé dön"
    },
    {
      "bo": "གསན་བསམ་སྒོམ་སྒྲུབ་ཉམས་རྟོགས་མཐར་སོན་པ། །",
      "en": "Reached the highest experience and realization of their meaning,",
      "en-trans": "sen sam gom drub nyamtok tarsönpa"
    },
    {
      "bo": "ཁྱོད་ནི་ངེས་དོན་བསྟན་འཛིན་མཆོག་ཏུ་བཞེངས། །",
      "en": "And stood out, as the supreme holder of the definitive teachings.",
      "en-trans": "khyö ni ngedön tendzin chok tu zheng"
    },
    {
      "bo": "དུས་འགྱུར་མི་བཟད་འཚུབ་རླུང་ཆེས་ལྡང་མོད། །",
      "en": "When the fierce winds of change blew with unbearable intensity,",
      "en-trans": "dü gyur mi zé tsub lung ché dang mö"
    },
    {
      "bo": "གང་གི་ཐུགས་བསྐྱེད་རི་དབང་ལྟར་བརྟན་པས། །",
      "en": "Your determination and resolve remained steadfast like the king of mountains,",
      "en-trans": "gang gi tukkyé riwang tar tenpé"
    },
    {
      "bo": "བསླབ་གསུམ་ངུར་སྨྲིག་འཛིན་པའི་འདུས་སྡེ་སོགས། །",
      "en": "And those in saffron robes, upholders of the three trainings,",
      "en-trans": "lab sum ngurmik dzinpé düdé sok"
    },
    {
      "bo": "དད་ལྡན་ཁྲི་ཕྲག་ངང་གིས་འདུས་པར་གྱུར། །",
      "en": "And devoted followers in their thousands, flocked around you.",
      "en-trans": "deden tritrak ngang gi düpar gyur"
    },
    {
      "bo": "བཤད་སྒྲུབ་བྱ་བ་ལས་ཀྱི་འཁོར་ལོ་ཡིས། །",
      "en": "Day by day, by means of study, practice and spiritual activity,",
      "en-trans": "shedrub jawa lé kyi khorlo yi"
    },
    {
      "bo": "ཉིན་བཞིན་ཕྱོགས་བཞིའི་སྐྱེ་བོའི་རེ་འདུན་བཀང༌། །",
      "en": "You fulfilled the deepest wishes of beings who came from far and wide,",
      "en-trans": "nyinzhin chok zhi kyewö ré dün kang"
    },
    {
      "bo": "སྨིན་གྲོལ་ཟབ་རྒྱས་ཆོས་ཀྱི་གྲུ་ཆར་ཆེས། །",
      "en": "And with a great Dharma rain of ripening empowerments and liberating teachings, vast and profound,",
      "en-trans": "mindrol zabgyé chö kyi druchar ché"
    },
    {
      "bo": "ཀུན་ལ་རྣམ་བྱང་ས་བོན་གྲུང་པོ་བསྐྲུན། །",
      "en": "You planted the perfect seed of enlightenment within us all.",
      "en-trans": "kün la namjang sabön drungpo trün"
    },
    {
      "bo": "ཉན་ཐོས་ནས་བཟུང་ཨ་ཏི་ཡོ་གའི་བར། །",
      "en": "From the teachings of the śrāvakas up to Atiyoga,",
      "en-trans": "nyentö né zung atiyogé bar"
    },
    {
      "bo": "ཡོངས་རྫོགས་ཐེག་པ་ཀུན་གྱི་གཞུང་ལུགས་དང༌། །",
      "en": "You transmitted the scriptural traditions of all the vehicles,",
      "en-trans": "yongdzok tekpa kün gyi zhungluk dang"
    },
    {
      "bo": "མན་ངག་བདུད་རྩིའི་སྙིང་བཅུད་མ་ལུས་པ། །",
      "en": "Along with every drop of nectar from the pith instructions,",
      "en-trans": "mengak dütsi nying chü malüpa"
    },
    {
      "bo": "བསྩལ་ཏེ་སྐལ་ལྡན་མ་ལུས་ཚིམ་པར་མཛད། །",
      "en": "And satisfied the hearts of all your fortunate disciples.",
      "en-trans": "tsal té kalden malü tsimpar dzé"
    },
    {
      "bo": "གང་སྐུའི་དཀྱིལ་འཁོར་ཡིད་ལ་ལྷམ་མེར་དྲན། །",
      "en": "How clearly we recall the maṇḍala of your perfect form,",
      "en-trans": "gang kü kyilkhor yi la lham mér dren"
    },
    {
      "bo": "གང་གསུང་ཟབ་སྙན་གདངས་བཟང་ལྷང་ངེར་གསལ། །",
      "en": "How distinct the deep melody of your enlightened speech,",
      "en-trans": "gang sung zab nyen dang zang lhang nger sal"
    },
    {
      "bo": "གང་ཐུགས་མཁྱེན་བརྩེའི་དགོངས་པ་གསལ་ལེར་འཆར། །",
      "en": "How vivid the knowledge and affection of your wisdom mind:",
      "en-trans": "gang tuk khyentsé gongpa saller char"
    },
    {
      "bo": "གང་གི་ཡོན་ཏན་བསམ་བཞིན་གསོལ་འདེབས་བརྩོན། །",
      "en": "Remembering all your noble qualities, fervently we pray to you.",
      "en-trans": "gang gi yönten samzhin soldeb tsön"
    },
    {
      "bo": "བདག་ཅག་ཁྱེད་ཀྱི་རྗེས་སུ་སློབ་པ་ཀུན། །",
      "en": "All of us who are your followers pledge",
      "en-trans": "dakchak khyé kyi jesu lobpa kün"
    },
    {
      "bo": "ཐེག་པ་རིམ་དགུའི་དམ་ཆོས་ཡིད་བཞིན་མཛོད། །",
      "en": "With unwavering effort, to apply faith, diligence and critical intelligence",
      "en-trans": "tekpa rim gü damchö yizhin dzö"
    },
    {
      "bo": "དད་བརྩོན་རྣམ་དཔྱོད་འདོར་མེད་སྙིང་རུས་ཀྱིས། །",
      "en": "To the wish-granting Dharma treasury of the nine vehicles,",
      "en-trans": "dé tsön namchö dormé nyingrü kyi"
    },
    {
      "bo": "རྟག་ཏུ་བསམ་སྒོམ་ཉམས་ལེན་འབད་པར་འཚལ། །",
      "en": "And to devote ourselves, always, to the practice of contemplation and meditation.",
      "en-trans": "taktu sam gomnyam len bepar tsal"
    },
    {
      "bo": "དེ་མཐུས་མགོན་པོ་ཁྱོད་ཀྱི་ཐུགས་བཞེད་རྣམས། །",
      "en": "Through the power of this prayer to you, our protector, may all your aspirations",
      "en-trans": "dé tü gönpo khyö kyi tuk zhé nam"
    },
    {
      "bo": "མཁའ་ཁྱབ་སྐྱེ་འགྲོའི་གསོས་སུ་ལེགས་སྨིན་ཞིང༌། །",
      "en": "Be perfectly realized, and so bring inspiration to beings throughout the whole of space,",
      "en-trans": "khakhyab kyendrö sö su lek min zhing"
    },
    {
      "bo": "བདག་སོགས་སྐྱེ་ཀུན་ཐེག་མཆོག་བཤེས་གཉེན་དང༌། །",
      "en": "And may we all never be separated from the teachers of the supreme vehicle,",
      "en-trans": "dak sok kyé kün tek chok shenyen dang"
    },
    {
      "bo": "མི་འབྲལ་ཉམས་རྟོགས་ཡོན་ཏན་རབ་འཕེལ་ཤོག །",
      "en": "So that we cultivate completely the qualities of experience and realization.",
      "en-trans": "mindral nyamtok yönten rab pel shok"
    },
    {
      "bo": "རྩ་བ་གསུམ་གྱི་ཐུགས་རྗེ་བྱིན་ཆེན་དང༌། །",
      "en": "Through the vast and compassionate blessings of the lamas, yidams and ḍākinīs,",
      "en-trans": "tsawa sum gyi tukjé jin chen dang"
    },
    {
      "bo": "ཆོས་ཉིད་རྟེན་འབྲེལ་བསམ་མི་ཁྱབ་པའི་མཐུ། །",
      "en": "Through the power of interdependence, the nature of things, which is beyond all imagining,",
      "en-trans": "chönyi tendrel sam mi khyabpé tu"
    },
    {
      "bo": "བླ་སློབ་དད་གདུང་འགྱུར་མེད་སྟོབས་བཙན་པས། །",
      "en": "And through the strength of unchanging and fervent devotion in both teacher and students,",
      "en-trans": "la lob dé dung gyurmé tob tsenpé"
    },
    {
      "bo": "སྨོན་དོན་འདི་དག་ཡིད་བཞིན་འགྲུབ་པར་ཤོག །",
      "en": "May these aspirations come to pass, just as we desire!",
      "en-trans": "mön dön didak yizhin drubpar shok"
    }
  ]
}