{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamgon-kongtrul/indestructible-vajra-garland",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།  །རིས་མེད་པའི་བསྟན་འཛིན་གྱི་སྐྱེས་བུ་མཆོག་རྣམས་འཚོ་གཞེས་སུ་གསོལ་བའི་སྨོན་ཚིག་མི་ཤིགས་རྡོ་རྗེའི་ཕྲེང་བ།",
    "en": "An Aspiration Prayer for the Lives of the Supreme Holders of the Non-Sectarian Teachings"
  },
  "text": [
    {
      "bo": "འོད་མི་འགྱུར་བ་ཚེ་དཔག་མེད་མགོན་སོགས། །",
      "en": "Unchanging Light1, Lord of Boundless Life2and the rest—",
      "en-trans": "ö migyurwa tsepakmé gön sok"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་རྒྱལ་བའི་བདེན་པ་ཡིས།  །",
      "en": "By the truth of these conquerors throughout the ten directions and three times,",
      "en-trans": "chok chu dü sum gyalwé denpa yi"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་འཛིན་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who hold theBuddha'steaching,",
      "en-trans": "sangye tendzin palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "སྡེ་སྣོད་གསུམ་དང་ཐེག་པ་རིམ་དགུ་ཡི།  །",
      "en": "The three piṭakas and the nine successive vehicles—",
      "en-trans": "denö sum dang tekpa rim gu yi"
    },
    {
      "bo": "དམ་ཆོས་ཆགས་དང་བྲལ་བའི་བདེན་པ་ཡིས།  །",
      "en": "By the truth of the holyDharmafree from attachment,",
      "en-trans": "damchö chak dangdralwé denpa yi"
    },
    {
      "bo": "ཆོས་མཆོག་འབྱུང་གནས་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who are the source of supreme Dharma,",
      "en-trans": "chö chok jungné palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "རྒྱལ་སྲས་བྱང་སེམས་ཉན་རང་འཕགས་པའི་ཚོགས།  །",
      "en": "The noble community of the conqueror's heirs, the bodhisattvas, the śrāvakas and pratyekabuddhas—",
      "en-trans": "gyalsé changsem nyenrang pakpé tsok"
    },
    {
      "bo": "དགེ་འདུན་མི་ཕྱེད་འདུན་པའི་བདེན་པ་ཡིས།  །",
      "en": "By the truth of theSanghawhose aspiration is unswerving,",
      "en-trans": "gendün miché dünpé denpa yi"
    },
    {
      "bo": "ཚོགས་མཆོག་འདྲེན་པ་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who are the guides of the supreme community,",
      "en-trans": "tsok chok drenpa palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྡོ་རྗེ་བི་མ་མི་ཏྲ་སོགས།  །",
      "en": "The Lotus Born Vajra, Vimalamitra and the rest—",
      "en-trans": "tsokyé dorjé bimamitra sok"
    },
    {
      "bo": "རིག་འཛིན་རྩ་བརྒྱུད་བླ་མའི་བྱིན་རླབས་ཀྱིས།  །",
      "en": "Through the blessings of the Vidyādharas, the root and lineage masters,",
      "en-trans": "rigdzin tsagyü lamé jinlab kyi"
    },
    {
      "bo": "འགྲོ་བའི་འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who are the supreme guides for beings,",
      "en-trans": "drowé dren chok palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "འཆི་བདག་བདུད་འཇོམས་རིགས་ལྔའི་དཀྱིལ་འཁོར་སོགས།  །",
      "en": "The maṇḍala of the five families who destroy the māra of the Lord of Death,",
      "en-trans": "chidak düjom rik ngé kyilkhor sok"
    },
    {
      "bo": "ཡི་དམ་རྒྱུད་སྡེ་བཞི་དྲུག་ཐུགས་རྗེ་ཡིས།  །",
      "en": "And the other yidam deities of the four and six classes of tantra—through your compassion,",
      "en-trans": "yidam gyüdé zhi druk tukjé yi"
    },
    {
      "bo": "དཀྱིལ་འཁོར་དབང་ཕྱུག་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who are the lords of the maṇḍala,",
      "en-trans": "kyilkhor wangchuk palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "ཡིད་བཞིན་འཁོར་ལོ་གྲུབ་པའི་རྒྱལ་མོ་སོགས།  །",
      "en": "Through the capacity and power of the ḍākinīs of the three places and the Dharma Protectors,",
      "en-trans": "yizhin khorlo drubpé gyalmo sok"
    },
    {
      "bo": "གནས་གསུམ་མཁའ་འགྲོ་ཆོས་སྐྱོང་ནུས་མཐུ་ཡིས།  །",
      "en": "The Wish fulfilling Wheel3, queen of accomplishment, and the rest,",
      "en-trans": "né sum khandro chökyong nütu yi"
    },
    {
      "bo": "བདེ་ཆེན་དགྱེས་རོལ་དཔལ་ལྡན་བླ་མ་རྣམས།  །",
      "en": "May the lives of the glorious gurus, who delight in the play of great bliss,",
      "en-trans": "dechen gyé rol palden lama nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "སྐྱེས་ཐོབ་སྦྱོར་བྱུང་ཕུན་སུམ་ཚོགས་པ་ཡིས།  །",
      "en": "With their perfect qualities, those present at birth and those acquired in this life,",
      "en-trans": "kyé tob jor jung pünsum tsokpa yi"
    },
    {
      "bo": "རྒྱལ་བསྟན་གསལ་མཛད་འཆད་རྩོད་རྩོམ་པའི་བདག  །",
      "en": "They illuminate the Conqueror's teachings—masters of exposition, debate and composition,",
      "en-trans": "gyalten sal dzé ché tsö tsompé dak"
    },
    {
      "bo": "ལུང་གི་བསྟན་འཛིན་མཁས་པའི་ཁྱུ་མཆོག་རྣམས།  །",
      "en": "May the lives of the holders of theDharma of transmission, foremost among scholars,",
      "en-trans": "lung gi tendzin khepé khyuchok nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "དམ་ཚིག་གཙང་ཞིང་སྒྲུབ་པ་སྙིང་པོར་མཛད།  །",
      "en": "Those who keep pure samaya, take the practice to heart,",
      "en-trans": "damtsik tsang zhing drubpa nyingpor dzé"
    },
    {
      "bo": "ཆོས་ཉིད་དོན་གཟིགས་ལྷར་བཅས་གཙུག་གི་རྒྱན།  །",
      "en": "And see the nature of phenomena are like adornments on the crowns of all, even the gods—",
      "en-trans": "chönyi dön zik lhar ché tsuk gi gyen"
    },
    {
      "bo": "རྟོགས་པའི་བསྟན་འཛིན་རྣལ་འབྱོར་དབང་ཕྱུག་རྣམས།  །",
      "en": "May the lives of these holders of theDharma of realisation, lords among yogis,",
      "en-trans": "tokpé tendzin naljor wangchuk nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་གཞི་བརྟན་ཏིང་འཛིན་སྣང་བ་གསལ།  །",
      "en": "With the stable ground ofdiscipline, the clear light ofsamādhi,",
      "en-trans": "tsultrim zhi ten tingdzin nangwa sal"
    },
    {
      "bo": "ཤེས་རབ་རྩལ་ལྡན་འཕགས་པའི་ནོར་གྱིས་འབྱོར།  །",
      "en": "And the strength ofwisdom, they are rich with the wealth of the Noble Ones.",
      "en-trans": "sherab tsalden pakpé nor gyi jor"
    },
    {
      "bo": "ཐུབ་བསྟན་སྒྲོན་མེ་འགྲོ་བའི་སྐྱབས་གནས་རྣམས།  །",
      "en": "Lamps of the Muni's teachings, sources of refuge for beings,",
      "en-trans": "tubten drönmé drowé kyabné nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "May their lives remain secure and their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "ཐོས་པས་རྒྱུད་གྲོལ་བསམ་པས་བྱེ་བྲག་ཕྱེད།  །",
      "en": "Throughlisteningthey liberated their minds, throughcontemplationthey have clear discernment,",
      "en-trans": "töpé gyü drol sampé jedrak ché"
    },
    {
      "bo": "སྒོམ་པས་དོན་རྟོགས་གཞན་དོན་ལྷུར་མཛད་པ།  །",
      "en": "And throughmeditationthey have realised reality—now they strive for others' benefit,",
      "en-trans": "gompé dön tok zhendön lhur dzepa"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་ལྡན་རྒྱལ་བའི་བསྟན་འཛིན་རྣམས།  །",
      "en": "As wise, compassionate and powerful holders of the teachings of the Conqueror,",
      "en-trans": "khyentsé nüden gyalwé tendzin nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "May their lives remain secure and their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "དབང་པོར་འཚམས་པའི་ཐེག་རིམ་སྣ་ཚོགས་ལ།  །",
      "en": "Having practiced the various stages of the vehicles, in accord with their capacity,",
      "en-trans": "wangpor tsampé tek rim natsok la"
    },
    {
      "bo": "ལེགས་པར་ཞུགས་ནས་ཚུལ་བཞིན་སྤྱོད་པ་ཡི།  །",
      "en": "They always act appropriately—",
      "en-trans": "lekpar zhuk né tsulzhin chöpa yi"
    },
    {
      "bo": "རིས་མེད་སྐྱེས་ཆེན་ཕྱོགས་ཀུན་བཞུགས་པ་རྣམས།  །",
      "en": "May the lives of these great, non-sectarian masters, who reside in all directions,",
      "en-trans": "rimé kyé chen chok kün zhukpa nam"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "Remain secure and may their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "བསྟན་འཛིན་ཐམས་ཅད་ཕན་ཚུན་ཐུགས་མཐུན་ཅིང་།  །",
      "en": "May all the holders of the teachings be forever in agreement,",
      "en-trans": "tendzin tamché pentsün tuktün ching"
    },
    {
      "bo": "ཐུབ་པའི་བསྟན་ལ་ཕྱོགས་ཁྱེར་སེལ་མེད་པར།  །",
      "en": "And without any bias or prejudice towards the Buddha's teachings,",
      "en-trans": "tubpé ten la chok khyer sel mepar"
    },
    {
      "bo": "དག་སྣང་ཡངས་པོས་རང་བསྟན་སྐྱོང་བཞིན་དུ།  །",
      "en": "As they guard them, as if they were their own, with vast pure perception,",
      "en-trans": "daknang yangpö rang ten kyong zhindu"
    },
    {
      "bo": "ཞབས་པད་བརྟན་ཅིང་མཛད་ཕྲིན་རབ་འཕེལ་ཤོག  །",
      "en": "And may their lives remain secure and their enlightened activities increase and spread!",
      "en-trans": "zhabpé ten ching dzetrin rab pel shok"
    },
    {
      "bo": "བདག་ཅག་འབྲེལ་བཅས་ཡང་སྲིད་ཐམས་ཅད་དུ།  །",
      "en": "May all those who are connected to us, in all future lives,",
      "en-trans": "dakchak drel ché yangsi tamché du"
    },
    {
      "bo": "ནད་མེད་རྡོ་རྗེའི་ཚེ་དང་གཟུགས་བཟང་སོགས།  །",
      "en": "Attain the seven qualities of the higher realms,",
      "en-trans": "nemé dorjé tsé dang zuk zang sok"
    },
    {
      "bo": "མཐོ་རིས་ཡོན་ཏན་བདུན་ལ་དབང་འབྱོར་ནས།  །",
      "en": "Such as good health, indestructible vajra life and a beautiful form,",
      "en-trans": "tori yönten dün la wang jor né"
    },
    {
      "bo": "ཐུབ་བསྟན་ཡོངས་ཀྱི་སྣང་བྱེད་ཉིད་གྱུར་ཅིག  །",
      "en": "And become like great suns illuminating all the Buddha's teachings!",
      "en-trans": "tubten yong kyi nangjé nyi gyur chik"
    },
    {
      "bo": "ཚེ་དང་ཐར་པའི་བར་ཆད་ཀུན་ཞི་ཞིང་།  །",
      "en": "May all obstacles to our life and liberation be pacified,",
      "en-trans": "tsé dang tarpé barché kün zhi zhing"
    },
    {
      "bo": "ལོ་བརྒྱ་འཚོ་ཞིང་སྟོན་བརྒྱ་མཐོང་བ་དང་།  །",
      "en": "May we live for hundreds of years and see hundreds of teachers,",
      "en-trans": "lo gya tso zhing tön gya tongwa dang"
    },
    {
      "bo": "ལྷག་པའི་བསླབ་པས་རྒྱལ་བསྟན་རིན་པོ་ཆེ།  །",
      "en": "And through the three superior trainings, may we always uphold the precious teachings of the Conqueror,",
      "en-trans": "lhakpé labpé gyalten rinpoche"
    },
    {
      "bo": "ནམ་མཁའ་ཇི་སྲིད་གཞན་ཕྱིར་འཛིན་པར་ཤོག  །",
      "en": "For as long as space exists, and for the benefit of others!",
      "en-trans": "namkha jisi zhen chir dzinpar shok"
    },
    {
      "bo": "རྒྱལ་ཀུན་འདུས་ཞལ་དཔལ་ལྡན་བླ་མ་དང་།  །",
      "en": "May the glorious gurus, who are the very face and embodiment of all the buddhas,",
      "en-trans": "gyal kündü zhal palden lama dang"
    },
    {
      "bo": "རིས་མེད་བསྟན་པ་འཛིན་ཀུན་འཚོ་གཞེས་ཤིང་།  །",
      "en": "And all the holders of the non-sectarian teachings live long,",
      "en-trans": "rimé tenpa dzin kün tsozhé shing"
    },
    {
      "bo": "ཆོས་འཁོར་རྒྱུན་ཆད་མེད་པར་བསྐོར་བ་ཡིས།  །",
      "en": "And by turning the wheel of the Dharma without interruption,",
      "en-trans": "chökhor gyünché mepar korwa yi"
    },
    {
      "bo": "འཇིག་རྟེན་གསུམ་པོ་རྟག་ཏུ་སྣང་བྱེད་ཤོག  །",
      "en": "May they always illuminate the three worlds, now and forever!",
      "en-trans": "jikten sumpo taktu nangjé shok"
    }
  ]
}