{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fourteenth-dalai-lama/resounding-drum-of-truth",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གསོལ་འདེབས་སྨོན་ཚིག་བདེན་པའི་རྔ་སྒྲ་བཞུགས་སོ།།",
    "en": "A Prayer and Aspiration"
  },
  "text": [
    {
      "bo": "མཁྱེན་བརྩེའི་ཡོན་ཏན་མཐར་ཐུག་ཀུན་རྫོགས་ཤིང༌། །",
      "en": "In you, all the ultimate qualities of knowledge and love are complete,",
      "en-trans": "khyentsé yönten tartuk kün dzok shing"
    },
    {
      "bo": "པད་དཀར་ལྟར་བསྔགས་ཡིད་ཅན་ཀུན་གྱི་མགོན། །",
      "en": "You who are exalted as the white lotus, protector of all living beings,",
      "en-trans": "pekar tar ngak yichen kün gyi gön"
    },
    {
      "bo": "རྟེན་འབྱུང་གཏམ་གྱིས་སྡུག་ཀུན་གཞིལ་མཛད་པའི། །",
      "en": "You who eradicate all misery through your discourse on dependent arising,",
      "en-trans": "tenjung tam gyi duk kün zhil dzepé"
    },
    {
      "bo": "རྣམ་འདྲེན་ཤཱཀྱ་སེངྒེ་སྤྱི་བོས་མཆོད། །",
      "en": "Perfect guide, Lion of the Śākyas, I bow down before you.",
      "en-trans": "namdren shakya sengé chiwö chö"
    },
    {
      "bo": "ཁྱོད་བསྟན་བྱང་ནས་བྱང་དུ་དར་འགྱུར་ཞེས། །",
      "en": "As in your glorious pronouncements, which foretold",
      "en-trans": "khyö ten jang né jang du dar gyur zhé"
    },
    {
      "bo": "ཇི་ལྟར་དཔལ་གྱི་མགུར་ནས་དབུགས་དབྱུང་ལྟར། །",
      "en": "How the Dharma would spread further to the north,",
      "en-trans": "jitar pal gyi gur né ukyung tar"
    },
    {
      "bo": "ཁ་བའི་ལྗོངས་སུ་རྒྱལ་བསྟན་ཡོངས་ཁྱབ་སྟེ། །",
      "en": "The Victor’s complete teaching reached the Land of Snows,",
      "en-trans": "khawé jong su gyalten yong khyab té"
    },
    {
      "bo": "འཛམ་གླིང་རྒྱན་དུ་གྱུར་པ་སྐལ་པ་བཟང༌། །",
      "en": "As an adornment for all the world, an excellence of fortune.",
      "en-trans": "dzamling gyen du gyurpa kalpa zang"
    },
    {
      "bo": "དེ་ལྟ་ན་ཡང་དཀར་མིན་ལས་དབང་གིས། །",
      "en": "Yet now, through the power of unwholesome actions,",
      "en-trans": "deta na yang kar min lé wang gi"
    },
    {
      "bo": "དེང་འདིར་རྒྱལ་བསྟན་ཉམས་ཤིང་སྣོད་བཅུད་ཀུན། །",
      "en": "The teachings are in decline, and the outer and inner world",
      "en-trans": "dengdir gyalten nyam shing nöchü kün"
    },
    {
      "bo": "སྡུག་ཟད་འཇིག་ཉེའི་ཉམ་ངའི་ངང་ཚུལ་འདི། །",
      "en": "Are overwhelmed—beset by misery, on the verge of destruction.",
      "en-trans": "duk zé jik nyé nyam ngé ngang tsul di"
    },
    {
      "bo": "བརྩེ་ཆེན་ཐུགས་རྗེས་སྐྱོབ་པའི་དུས་ལ་བབས། །",
      "en": "It’s time to afford us protection in your great love and compassion!",
      "en-trans": "tsé chen tukjé kyobpé dü la bab"
    },
    {
      "bo": "དེ་སླད་བདག་ཅག་གངས་ལྗོངས་ལྷ་མི་ཀུན། །",
      "en": "Thus, let us all, divine and human, from the Land of Snows,",
      "en-trans": "dé lé dakchak gangjong lhami kün"
    },
    {
      "bo": "ལྷག་བསམ་དད་གདུང་དྲག་པོས་ཉེར་བཟླུམས་ཏེ། །",
      "en": "With our noble intentions and intense, fervent devotion,",
      "en-trans": "lhaksam dé dung drakpö nyer dum té"
    },
    {
      "bo": "བདེ་གཤེགས་མཚན་བཟང་གཙུག་གཏོར་གསེར་སྦྱངས་ཏོག །",
      "en": "Offer this pure golden crest, the splendid mark of a sugata,",
      "en-trans": "deshek tsen zang tsuk tor ser jang tok"
    },
    {
      "bo": "དྲང་སྲོང་སྣོད་མཆོག་ངུར་སྨྲིག་གོས་བཟང་བཅས། །",
      "en": "The supreme receptacle of a sage, and fine saffron robes.",
      "en-trans": "drangsong nö chok ngurmik gö zang ché"
    },
    {
      "bo": "ཕུལ་བའི་ཚོགས་གཉིས་རྒྱ་ཆེན་གང་མཆིས་དང༌། །",
      "en": "The vast twofold accumulation accruing from such offering,",
      "en-trans": "pulwé tsok nyi gyachen gang chi dang"
    },
    {
      "bo": "གཞན་ཡང་དུས་གསུམ་དང་འབྲེལ་དགེ་ཚོགས་ཀུན།",
      "en": "Together with all the virtues related to the three times,",
      "en-trans": "zhenyang düsum dang drel gé tsok kün"
    },
    {
      "bo": "ལྷར་བཅས་འགྲོ་བའི་ཕན་བདེ་འབྱུང་བའི་གནས། །",
      "en": "I hereby dedicate, so that the Victor’s teachings, source of benefit for all,",
      "en-trans": "lhar ché drowé pendé jungwé né"
    },
    {
      "bo": "རྒྱལ་བསྟན་མི་ནུབ་ཡུན་དུ་གནས་ཕྱིར་བསྔོ།",
      "en": "Including the devas, may never decline but endure long into the future.",
      "en-trans": "gyalten mi nub yündu né chir ngo"
    },
    {
      "bo": "མཁའ་ཁྱབ་ལུས་ཅན་སྤྱི་དང་ཁྱད་པར་དུ། །",
      "en": "For all embodied beings throughout the whole of space,",
      "en-trans": "khakhyab lüchen chi dang khyepardu"
    },
    {
      "bo": "འཛམ་བུའི་སྒྲས་བསྟན་གླིང་འདིའི་སྐྱེ་འགྲོ་ཀུན།",
      "en": "Especially the inhabitants of this continent of Jambudvīpa,",
      "en-trans": "dzambü dré ten ling di kyendro kün"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེའི་བསམ་སྦྱོར་གོང་འཕེལ་ནས། །",
      "en": "May loving and compassionate thoughts and deeds increase",
      "en-trans": "jam dang nyingjé samjor gongpel né"
    },
    {
      "bo": "འཁྲུགས་རྩོད་གནོད་འཚེ་ནམ་ཡང་མི་འབྱུང་ཤོག །",
      "en": "And brutality, conflict and aggression cease for evermore.",
      "en-trans": "truktsö nö tsé namyang minjung shok"
    },
    {
      "bo": "དབུལ་ཕོངས་ཉམ་ཐག་བཙན་གནོན་མནར་གཅོད་དང༌། །",
      "en": "Poverty, oppression, tyranny, and persecution,",
      "en-trans": "ulpong nyamtak tsen nön nar chö dang"
    },
    {
      "bo": "སྣོད་ཀྱི་རྒུད་པས་ནད་ཡམས་འབྱུང་འཁྲུགས་སོགས།",
      "en": "Infectious disease and disasters caused by environmental harm—",
      "en-trans": "nö kyi güpé né yam jung truk sok"
    },
    {
      "bo": "ཕྱི་ནང་འགལ་རྐྱེན་རྒུད་ཚོགས་ཀུན་ཞི་ནས། །",
      "en": "May all such ills and adversity, both outer and inner, be pacified,",
      "en-trans": "chinang galkyen gü tsok kün zhi né"
    },
    {
      "bo": "ཐམས་ཅད་དགའ་བདེའི་དཔལ་ལ་རྟག་རོལ་ཤོག །",
      "en": "And may everyone enjoy the splendour of happiness and well-being for evermore.",
      "en-trans": "tamché ga dé pal la tak rol shok"
    },
    {
      "bo": "རིས་སུ་མ་ཆད་ཕྱི་ནང་ཆོས་ཚུལ་ལ། །",
      "en": "Without sectarian bias but recognising the affinity of all followers",
      "en-trans": "ri su ma ché chinang chö tsul la"
    },
    {
      "bo": "ཞུགས་ཀུན་ཕན་ཚུན་གཉེན་གཤིན་འདུ་ཤེས་ཀྱིས།",
      "en": "Of spiritual traditions, both Buddhist and non-Buddhist,",
      "en-trans": "zhuk kün pentsün nyen shin dushé kyi"
    },
    {
      "bo": "དག་སྣང་ནོར་བུའི་འོད་དང་མི་འབྲལ་བར། །",
      "en": "May I never lack the gem-like radiance of pure perception,",
      "en-trans": "daknang norbü ö dang mi dralwar"
    },
    {
      "bo": "གཅིག་ཏུ་འགྲོ་ཕན་བྱ་བར་ལྷུར་ལེན་ཤོག །",
      "en": "And earnestly strive to benefit living beings as a whole.",
      "en-trans": "chik tu dro pen jawar lhurlen shok"
    },
    {
      "bo": "ལྷག་པར་བསིལ་ལྡན་ལྗོངས་སུ་རྒྱལ་བའི་བསྟན། །",
      "en": "For the cool land of Tibet in particular, may the weakened teachings",
      "en-trans": "lhakpar silden jong su gyalwé ten"
    },
    {
      "bo": "ཉམས་པ་སོར་ཆུད་མི་ཉམས་གོང་འཕེལ་ཞིང༌།",
      "en": "Of the Victor be restored, never decline again but flourish and expand.",
      "en-trans": "nyampa sorchü mi nyam gongpel zhing"
    },
    {
      "bo": "ཆོས་སྲིད་རང་དབང་བདེ་སྐྱིད་གསར་པ་ཡིས། །",
      "en": "And with the newfound joy of spiritual and temporal autonomy,",
      "en-trans": "chösi rangwang dekyi sarpa yi"
    },
    {
      "bo": "བོད་འབངས་འཕྲལ་ཡུན་འདོད་དོན་མྱུར་འགྲུབ་ཤོག །",
      "en": "May Tibetan’s immediate and long-term wishes swiftly be fulfilled.",
      "en-trans": "bö bang tral yün dödön nyur drub shok"
    },
    {
      "bo": "གངས་ཅན་ཞིང་གི་ཆོས་སྲིད་བྱ་བའི་གདུགས། །",
      "en": "May all those whose dedication is helping to raise the umbrella",
      "en-trans": "gangchen zhing gi chösi jawé duk"
    },
    {
      "bo": "འདེགས་པའི་སྲི་ཞུར་གཏོགས་པའི་སྐྱེ་བོ་ཀུན།",
      "en": "Of dharmic and temporal activity throughout the Land of Snows",
      "en-trans": "dekpé sizhur tokpé kyewo kün"
    },
    {
      "bo": "ལྷག་བསམ་རྣམ་དཔྱོད་དཔུང་པ་རབ་བརྟན་ཅིང༌། །",
      "en": "Maintain positive intentions, intelligence and steadfast determination,",
      "en-trans": "lhaksam namchö pungpa rabten ching"
    },
    {
      "bo": "སྐྱེ་ཀུན་ཕྱག་ན་པདྨོས་རྗེས་བཟུང་ཤོག །",
      "en": "And may all beings be cared for by Avalokiteśvara, Holder of the Lotus.",
      "en-trans": "kyé kün chak na pemö jezung shok"
    },
    {
      "bo": "ཆོས་ཀྱི་ཞིང་དུ་ཆོས་མིན་ཉེས་སྤྱོད་ཚོགས། །",
      "en": "In the realm of Dharma, may the collections of non-dharmic, unwholesome deeds",
      "en-trans": "chökyi zhing du chö min nyechö tsok"
    },
    {
      "bo": "ཆོས་ཀྱིས་ཞི་ཞིང་ཆོས་སྲིད་ལེགས་ཚོགས་ཀུན།",
      "en": "Be pacified through Dharma, and all that is positive, both dharmically and temporally,",
      "en-trans": "chökyi zhi zhing chösi lektsok kün"
    },
    {
      "bo": "ཆོས་ལྡན་ཡིད་བསམ་ཆོས་བཞིན་མྱུར་འགྲུབ་སྟེ། །",
      "en": "Be swiftly accomplished, according to the Dharma, by those with dharmic intention;",
      "en-trans": "chöden yi sam chö zhin nyur drub té"
    },
    {
      "bo": "ཆོས་ཀྱི་བདེན་པས་ཆོས་མིན་མཐར་བྱེད་ཤོག །",
      "en": "And may the truth of the Dharma definitively put an end to all that is non-dharmic.",
      "en-trans": "chökyi denpé chö min tar jé shok"
    }
  ]
}