{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/prayer-ground-path-and-fruition",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "འུྃཿ ཀློང་ཆེན་སྙིང་གི་ཐིག་ལེ་ལས༔ གཞི་ལམ་འབྲས་བུའི་སྨོན་ལམ་བཞུགས༔",
    "en": "The Prayer of the Ground, Path & Fruition"
  },
  "text": [
    {
      "bo": "དཔལ་ཀུན་ཏུ་བཟང་པོ་ལ་ཕྱག་འཚལ་ལོ༔",
      "en": "Homage to glorious Samantabhadra!",
      "en-trans": "pal kuntu zangpo la chak tsal lo"
    },
    {
      "bo": "གདོད་མའི་གནས་ལུགས་རང་བཞིན་སྤྲོས་དང་བྲལ༔",
      "en": "The true nature of things is naturally free of conceptual projections.",
      "en-trans": "dömé neluk rangzhin trö dangdral"
    },
    {
      "bo": "ཡོད་པ་མ་ཡིན་རྒྱལ་བས་འདི་མ་གཟིགས༔",
      "en": "It does not exist, since even the victorious ones do not see it.",
      "en-trans": "yöpa mayin gyalwé di ma zik"
    },
    {
      "bo": "མེད་པ་མ་ཡིན་འཁོར་འདས་ཀུན་གྱི་གཞི༔",
      "en": "Yet neither is it non-existent, as it is the ground of all saṃsāra and nirvāṇa.",
      "en-trans": "mepa mayin khordé kün gyi zhi"
    },
    {
      "bo": "འགལ་འདུ་མ་ཡིན་བརྗོད་བྱའི་ཡུལ་ལས་འདས༔",
      "en": "There is no contradiction here, for it lies beyond the realm of expression.",
      "en-trans": "galdu mayin jöjé yul lé dé"
    },
    {
      "bo": "རྫོགས་ཆེན་གཞི་ཡི་གནས་ལུགས་རྟོགས་པར་ཤོག༔",
      "en": "May all realize this Great Perfection, the true nature of the ground!",
      "en-trans": "dzogchen zhi yi neluk tokpar shok"
    },
    {
      "bo": "ངོ་བོ་སྟོང་པས་རྟག་པའི་མཐའ་ལས་གྲོལ༔",
      "en": "In essence it is empty, hence free from the limitations of permanence.",
      "en-trans": "ngowo tongpé takpé ta lé drol"
    },
    {
      "bo": "རང་བཞིན་གསལ་བས་ཆད་པའི་མུ་དང་བྲལ༔",
      "en": "By nature it is clear, and free from the limitations of nihilism.",
      "en-trans": "rangzhin salwé chepé mu dangdral"
    },
    {
      "bo": "ཐུགས་རྗེ་འགག་མེད་སྣ་ཚོགས་སྤྲུལ་པའི་གཞི༔",
      "en": "Its capacity unobstructed, it is the ground of manifold emanations.",
      "en-trans": "tukjé gakmé natsok trulpé zhi"
    },
    {
      "bo": "གསུམ་དུ་དབྱེ་ཡང་དོན་ལ་ཐ་མི་དད༔",
      "en": "It is divided into three, yet in truth there are no such differentiations.",
      "en-trans": "sum du yé yang dön la ta mi dé"
    },
    {
      "bo": "རྫོགས་ཆེན་གཞི་ཡི་གནས་ལུགས་རྟོགས་པར་ཤོག༔",
      "en": "May all realize this Great Perfection, the true nature of the ground!",
      "en-trans": "dzogchen zhi yi neluk tokpar shok"
    },
    {
      "bo": "བསམ་གྱིས་མི་ཁྱབ་སྒྲོ་འདོགས་ཀུན་དང་བྲལ༔",
      "en": "Inconceivable and free of all superimposition, one-sided fixation",
      "en-trans": "sam gyi mi khyab drondok kün dangdral"
    },
    {
      "bo": "ཡོད་དང་མེད་པའི་ཕྱོགས་འཛིན་རྣམ་པར་ཞིག༔",
      "en": "On things being either existent or non-existent completely dissolves.",
      "en-trans": "yö dang mepé chok dzin nampar zhik"
    },
    {
      "bo": "འདི་དོན་བརྗོད་ལ་རྒྱལ་བའི་ལྗགས་ཀྱང་རྡུགས༔",
      "en": "The full import of this turns back even the tongue of the victors.",
      "en-trans": "di dön jö la gyalwé jak kyang duk"
    },
    {
      "bo": "ཐོག་མཐའ་བར་མེད་གཏིང་གསལ་ཆེན་པོའི་དབྱིངས༔",
      "en": "Without beginning, middle, or end, it is a great expanse of deep clarity.",
      "en-trans": "tok ta bar mé tingsal chenpö ying"
    },
    {
      "bo": "རྫོགས་ཆེན་གཞི་ཡི་གནས་ལུགས་རྟོགས་པར་ཤོག༔",
      "en": "May all realize this Great Perfection, the true nature of the ground!",
      "en-trans": "dzogchen zhi yi neluk tokpar shok"
    },
    {
      "bo": "རང་ངོ་རྣམ་དག་སྐྱེ་མེད་ཀ་དག་ལ༔",
      "en": "Its essence is pristine, unoriginated, and primordially pure.",
      "en-trans": "rang ngo namdak kyemé kadak la"
    },
    {
      "bo": "ལྷུན་གྲུབ་འདུས་མ་བྱས་པའི་གདངས་ཤར་བ༔",
      "en": "Whatever manifests is the expression of this unconditioned spontaneous presence.",
      "en-trans": "lhündrub dümajepé dang sharwa"
    },
    {
      "bo": "གུད་དུ་མ་བཟུང་རིག་སྟོང་ཟུང་འཇུག་ཆེར༔",
      "en": "Without perceiving them as other, realizing the great unity of awareness-emptiness,",
      "en-trans": "güdu ma zung riktong zungjuk cher"
    },
    {
      "bo": "རྟོགས་པས་གཞི་ཡི་དགོངས་པ་ཚད་དུ་ཕྱིན༔",
      "en": "One’s understanding of the ground will reach a point of culmination.",
      "en-trans": "tokpé zhi yi gongpa tsé du chin"
    },
    {
      "bo": "ལམ་གྱི་གནད་ལ་གོལ་ཕྱོགས་མེད་པར་ཤོག༔",
      "en": "May there be no deviations and mistakes concerning this key point of the path!",
      "en-trans": "lam gyi né la gol chok mepar shok"
    },
    {
      "bo": "ཡེ་ནས་དག་པས་ལྟ་བའི་མིང་ཡང་མེད༔",
      "en": "Pure from the beginning, even the term “view” does not exist.",
      "en-trans": "yené dakpé tawé ming yangmé"
    },
    {
      "bo": "རང་ངོ་རིག་པས་སྒོམ་རྒྱུའི་ཤུབས་ནས་འདོན༔",
      "en": "Aware of the original state, the sheath of meditation falls away.",
      "en-trans": "rang ngo rigpé gom gyü shub né dön"
    },
    {
      "bo": "གཟའ་གཏད་མེད་པས་སྤྱོད་པའི་སྒྲོག་དང་བྲལ༔",
      "en": "There are no reference points, hence no need to restrain one’s conduct.",
      "en-trans": "zaté mepé chöpé drok dangdral"
    },
    {
      "bo": "རང་བཞིན་ལྷུམས་ཞུགས་སྤྲོས་བྲལ་རྗེན་པའི་ངང༌༔",
      "en": "In the spontaneously present nature, this state of naked simplicity,",
      "en-trans": "rangzhin lhum zhuk trödral jenpé ngang"
    },
    {
      "bo": "ལམ་གྱི་གནད་ལ་གོལ་ཕྱོགས་མེད་པར་ཤོག༔",
      "en": "May there be no deviations and mistakes concerning this key point of the path!",
      "en-trans": "lam gyi né la gol chok mepar shok"
    },
    {
      "bo": "བཟང་ངན་རྣམ་རྟོག་ཕྱོགས་སུ་མ་ལྷུང་ཞིང༌༔",
      "en": "Not falling into partiality towards positive thoughts or negative ones,",
      "en-trans": "zang ngen namtok chok su ma lhung zhing"
    },
    {
      "bo": "བཏང་སྙོམས་ལུང་མ་བསྟན་དུ་མ་འབྱམས་པར༔",
      "en": "And without giving free rein to a state of indifferent neutrality,",
      "en-trans": "tangnyom lungmaten du ma jampar"
    },
    {
      "bo": "ཤར་གྲོལ་རིས་མེད་རྒྱ་ཡན་ལྷུན་འབྱམས་ཀློང༌༔",
      "en": "Manifestation and liberation—an expanse unrestricted, unbridled, and spontaneously free.",
      "en-trans": "shardrol rimé gya yen lhün jam long"
    },
    {
      "bo": "སྤང་བླང་ཡེ་ཟད་རང་བཞིན་ཡོངས་ཤེས་ངང༌༔",
      "en": "Understanding that the nature is inherently devoid of needing to accept and reject,",
      "en-trans": "panglang yé zé rangzhin yong shé ngang"
    },
    {
      "bo": "ལམ་གྱི་གནད་ལ་གོལ་ཕྱོགས་མེད་པར་ཤོག༔",
      "en": "May there be no deviations and mistakes concerning this key point of the path!",
      "en-trans": "lam gyi né la gol chok mepar shok"
    },
    {
      "bo": "ཐོག་མའི་སྤྱི་གཞི་ནམ་མཁའ་ལྟ་བུའི་ངང༌༔",
      "en": "Like space, awareness is the universal ground and starting point.",
      "en-trans": "tokmé chi zhi namkha tabü ngang"
    },
    {
      "bo": "གཞི་སྣང་རིག་པ་མཁའ་ལ་སྤྲིན་དེངས་བཞིན༔",
      "en": "Manifest ground spontaneously present, yet vanishing like clouds in the sky,",
      "en-trans": "zhi nang rigpa kha la trin deng zhin"
    },
    {
      "bo": "ཕྱི་གསལ་ཤེས་པ་ནང་དུ་ལྡོག་པ་ལས༔",
      "en": "The mind radiates out, projecting outwards and then returning within",
      "en-trans": "chisal shepa nang du dokpa lé"
    },
    {
      "bo": "ཁྱད་ཆོས་དྲུག་ལྡན་གཞོན་ནུ་བུམ་སྐུའི་སྦུབས༔",
      "en": "To the youthful vase body’s inner space, possessing six unique characteristics—",
      "en-trans": "khyechö drukden zhönnu bumkü bub"
    },
    {
      "bo": "འབྲས་བུའི་རྒྱལ་པོ་བཙན་ས་ཟིན་པར་ཤོག༔",
      "en": "May all seize the throne of this majestic fruition!",
      "en-trans": "drebü gyalpo tsensa zinpar shok"
    },
    {
      "bo": "ཡེ་ནས་རང་རིག་ཀུན་ཏུ་བཟང་པོ་ལ༔",
      "en": "From the very beginning, awareness itself is Samantabhadra.",
      "en-trans": "yené rangrik kuntuzangpo la"
    },
    {
      "bo": "ཐོབ་བྱའི་ཞེ་འདོད་མཐའ་དག་དབྱིངས་སུ་ཡལ༔",
      "en": "Within it, all hoping for attainments dissolves into the sphere of reality,",
      "en-trans": "tob jé shendö tadak ying su yal"
    },
    {
      "bo": "བྱ་རྩོལ་བློ་འདས་རྫོགས་པ་ཆེན་པོའི་གཤིས༔",
      "en": "The true character of the Great Perfection, beyond intentional effort;",
      "en-trans": "jatsol lodé dzokpa chenpö shi"
    },
    {
      "bo": "དབྱིངས་རིག་ཀུན་ཏུ་བཟང་མོའི་མཁའ་ཀློང་སྦུབས༔",
      "en": "The sphere of reality and awareness, the inner space of Samantabhadrī—",
      "en-trans": "yingrik kuntuzangmö kha long bub"
    },
    {
      "bo": "འབྲས་བུའི་རྒྱལ་པོ་བཙན་ས་ཟིན་པར་ཤོག༔",
      "en": "May all seize the throne of this majestic fruition!",
      "en-trans": "drebü gyalpo tsensa zinpar shok"
    },
    {
      "bo": "རབ་ཏུ་མི་གནས་དབུ་མ་ཆེན་པོའི་དོན༔",
      "en": "Utterly non-abiding—the nature of the Great Middle Way;",
      "en-trans": "rabtu miné uma chenpö dön"
    },
    {
      "bo": "ཁྱབ་གདལ་ལྷུན་འབྱམས་ཕྱག་རྒྱ་ཆེན་པོའི་ངང༌༔",
      "en": "All-embracing and spontaneously vast—the state of Mahāmudrā;",
      "en-trans": "khyab dal lhün jam chakgya chenpö ngang"
    },
    {
      "bo": "མཐའ་གྲོལ་ཀློང་ཡངས་རྫོགས་པ་ཆེན་པོའི་གནད༔",
      "en": "Freed from limitations and wide open—the key point of the Great Perfection.",
      "en-trans": "ta drol long yang dzokpa chenpö né"
    },
    {
      "bo": "ས་ལམ་ཡོན་ཏན་གཞིར་རྫོགས་ལྷུན་གྲུབ་སྦུབས༔",
      "en": "The virtues of the levels and paths fundamentally complete—spontaneously present inner space.",
      "en-trans": "salam yönten zhir dzok lhündrub bub"
    },
    {
      "bo": "འབྲས་བུའི་རྒྱལ་པོ་བཙན་ས་ཟིན་པར་ཤོག༔",
      "en": "May all seize the throne of this majestic fruition!",
      "en-trans": "drebü gyalpo tsensa zinpar shok"
    }
  ]
}