{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/indian-masters/padampa-sangye/thirty-aspirations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཕ་དམ་པ་སངས་རྒྱས་ཀྱིས་མཛད་པའི་སྨོན་ལམ་སུམ་ཅུ་པ་བཞུགས།",
    "en": "The Thirty Aspirations"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ། །",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "བདག་གཞན་རྣམས་ཀྱི་རྒྱུད་ལ་བརྒྱུད་ལྡན་བླ་མའི་བྱིན་རླབས་འཇུག་པར་གྱུར་ཅིག །",
      "en": "May the blessings of a master endowed with a spiritual lineage enter my own and all other beings’ minds.",
      "en-trans": "dakzhen nam kyi gyü la gyüden lamé jinlab jukpar gyur chik"
    },
    {
      "bo": "དོན་གྱི་ངོ་སྤྲོད་གནད་དུ་ཆུད་པར་གྱུར་ཅིག །",
      "en": "May we recognise the ultimate meaning that has been introduced.",
      "en-trans": "dön gyi ngo trö né du chüpar gyur chik"
    },
    {
      "bo": "རྟོགས་པ་ཅི་ལྟ་བ་བཞིན་དུ་རྒྱུད་ལ་སྐྱེ་བར་གྱུར་ཅིག །",
      "en": "May this realisation dawn perfectly within us.",
      "en-trans": "tokpa chi tawa zhindu gyü la kyewar gyur chik"
    },
    {
      "bo": "སྟོབས་བཅུ་མི་འཇིགས་ལུང་བསྟན་ཐོབ་པར་གྱུར་ཅིག །",
      "en": "May we receive a prophecy concerning both fearlessness and the ten powers.",
      "en-trans": "tob chu mi jik lungten tobpar gyur chik"
    },
    {
      "bo": "ལྟ་སྟངས་འགྲུབ་ཅིང་རྟེན་འབྲེལ་འཆར་བར་གྱུར་ཅིག །",
      "en": "May auspiciousness wax and superficiality wane.",
      "en-trans": "tatang drub ching tendrel charwar gyur chik"
    },
    {
      "bo": "འགྲོ་རྣམས་སྨིན་གྲོལ་གྱི་ལམ་ལ་འགོད་ནུས་པར་གྱུར་ཅིག །",
      "en": "May we have the ability to place all beings on the path of ripening and liberation.",
      "en-trans": "dro nam mindrol gyi lam la gö nüpar gyur chik"
    },
    {
      "bo": "ས་ལམ་གདན་ཐོག་གཅིག་ཏུ་བགྲོད་ནུས་པར་གྱུར་ཅིག །",
      "en": "May we have the ability to traverse the grounds and paths in a single sitting.",
      "en-trans": "salam dentok chik tu drö nüpar gyur chik"
    },
    {
      "bo": "ཤེས་རབ་ཀྱི་སྤྱན་གྱིས་ཆོས་ཉིད་ཀྱི་བདེན་པ་མཐོང་བར་གྱུར་ཅིག །",
      "en": "May the eyes of our wisdom come to see the truth of dharmatā.",
      "en-trans": "sherab kyi chen gyi chönyi kyi denpa tongwar gyur chik"
    },
    {
      "bo": "ཡོན་ཏན་ལོ་འདབ་བཞིན་ཏུ་རྒྱས་པར་གྱུར་ཅིག །",
      "en": "May our virtues grow like leaves in springtime.",
      "en-trans": "yönten lodab zhin tu gyepar gyur chik"
    },
    {
      "bo": "འབྲས་བུ་དཔག་བསམ་བཞིན་ཏུ་སྨིན་པར་གྱུར་ཅིག །",
      "en": "May fruition ripen like a wish-fulfilling tree.",
      "en-trans": "drebu paksam zhin tu minpar gyur chik"
    },
    {
      "bo": "མོས་གུས་རི་རབ་བཞིན་ཏུ་བརྟན་པར་གྱུར་ཅིག །",
      "en": "May our devotion be as stable as Mount Meru.",
      "en-trans": "mögü rirab zhin tu tenpar gyur chik"
    },
    {
      "bo": "ངེས་པའི་ཤེས་པ་ཐེ་ཚོམ་དང་བྲལ་བར་གྱུར་ཅིག །",
      "en": "May we have certainty, free from any doubt.",
      "en-trans": "ngepé shepa tetsom dang dralwar gyur chik"
    },
    {
      "bo": "ལས་ཀྱི་འཕྲོ་སད་ནས་སྨོན་ལམ་རྣམ་པར་དག་པར་གྱུར་ཅིག །",
      "en": "May our aspirations be pure, as we experience the ripening of good karma.",
      "en-trans": "lé kyi tro sé né mönlam nampar dakpar gyur chik"
    },
    {
      "bo": "གོ་ཆས་འཇིག་རྟེན་གྱི་དྲི་མ་དག་པར་གྱུར་ཅིག །",
      "en": "May the armour [of our perseverance] be free of mundane defilement.",
      "en-trans": "goché jikten gyi drima dakpar gyur chik"
    },
    {
      "bo": "སྒྲུབ་པ་ལ་བར་ཆད་མེད་ཅིང་དཀའ་ཐུབ་བརྩམ་པར་གྱུར་ཅིག །",
      "en": "May we have the ability to endure hardship and our practice be free from obstacle.",
      "en-trans": "drubpa la barché mé ching katub tsampar gyur chik"
    },
    {
      "bo": "རྩ་རླུང་ཐིག་ལེ་ལས་སུ་རུང་བར་གྱུར་ཅིག །",
      "en": "May our channels, winds and drops be pliable.",
      "en-trans": "tsa lung tiklé lé su rungwar gyur chik"
    },
    {
      "bo": "རྟག་ཏུ་བསམ་པ་རྣམ་པར་དག་པར་གྱུར་ཅིག །",
      "en": "May we continually have pure intentions.",
      "en-trans": "taktu sampa nampar dakpar gyur chik"
    },
    {
      "bo": "བྱང་སེམས་ལ་ཉམས་པ་མེད་པར་གྱུར་ཅིག །",
      "en": "May our bodhicitta never degenerate.",
      "en-trans": "changsem la nyampa mepar gyur chik"
    },
    {
      "bo": "ཐེག་ཆེན་གྱི་ལྟ་སྒོམ་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིག །",
      "en": "May we experience the view and meditation of the Mahāyāna.",
      "en-trans": "tekchen gyi ta gom nyam su nyongwar gyur chik"
    },
    {
      "bo": "གཉིས་སྣང་གི་ཤེས་པ་རང་སར་གྲོལ་བར་གྱུར་ཅིག །",
      "en": "May our dualistic mind be naturally liberated.",
      "en-trans": "nyinang gi shepa rang sar drolwar gyur chik"
    },
    {
      "bo": "རིགས་ཁྱད་པར་ཅན་ཏུ་སྐྱེ་བར་གྱུར་ཅིག །",
      "en": "May we be born into a noble family line.",
      "en-trans": "rik khyepar chen tu kyewar gyur chik"
    },
    {
      "bo": "བརྒྱུད་ལྡན་བླ་མས་རྗེས་སུ་འཛིན་པར་གྱུར་ཅིག །",
      "en": "May we be cared for by a master of [the sublime] lineage.",
      "en-trans": "gyüden lamé jesu dzinpar gyur chik"
    },
    {
      "bo": "ལས་ཀྱི་མཐའ་མི་ལོག་པར་གྱུར་ཅིག །",
      "en": "May our conduct never be unwholesome.",
      "en-trans": "lékyi ta mi lokpar gyur chik"
    },
    {
      "bo": "ཤེས་རབ་གསུམ་ལ་བློ་སྦྱོང་བར་གྱུར་ཅིག །",
      "en": "May we train our minds in the three types of knowledge.1",
      "en-trans": "sherab sum la lo jongwar gyur chik"
    },
    {
      "bo": "དབང་གི་བྱིན་རླབས་འཇུག་པར་གྱུར་ཅིག །",
      "en": "May we receive the blessings of empowerment.",
      "en-trans": "wang gi jinlab jukpar gyur chik"
    },
    {
      "bo": "བདེ་བ་རྡོ་རྗེ་ལྟ་བུར་ཐོབ་པར་གྱུར་ཅིག །",
      "en": "May we attain the vajra-like bliss.",
      "en-trans": "dewa dorjé tabur tobpar gyur chik"
    },
    {
      "bo": "རྣམ་ཤེས་རྩ་རླུང་ལ་རང་དབང་ཐོབ་པར་གྱུར་ཅིག །",
      "en": "May we come to master consciousness, the channels and subtle energies.",
      "en-trans": "namshé tsalung la rangwang tobpar gyur chik"
    },
    {
      "bo": "རང་ལུས་གཟུགས་སྐུ་འགྲུབ་པར་གྱུར་ཅིག །",
      "en": "May we accomplish the rūpakāya as our own body.",
      "en-trans": "rang lü zukku drubpar gyur chik"
    },
    {
      "bo": "ཆོས་སྐུ་མངོན་སུམ་དུ་རྟོགས་པར་གྱུར་ཅིག །",
      "en": "May we realise the dharmakāya directly.",
      "en-trans": "chöku ngönsum du tokpar gyur chik"
    },
    {
      "bo": "སྤྲུལ་སྐུ་ཕྲིན་ལས་ཀྱིས་གཞན་དོན་མཐའ་རུ་ཕྱིན་པར་གྱུར་ཅིག །",
      "en": "With the activities of the emanation-kāya, may we perfectly accomplish others' welfare.",
      "en-trans": "tulku trinlé kyi zhendön ta ru chinpar gyur chik"
    }
  ]
}