{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fourteenth-dalai-lama/words-truth",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བདེན་གསོལ་སྨོན་ཚིག །",
    "en": "The Prayer of the Words of Truth"
  },
  "text": [
    {
      "bo": "ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། །",
      "en": "Namo ratnatrayāya!1",
      "en-trans": "namo  ratna  trayaya"
    },
    {
      "bo": "ཚད་མེད་ཡོན་ཏན་རྒྱ་མཚོའི་དཔལ་མངའ་ཞིང༌། །",
      "en": "Masters of the glory of an ocean of boundless qualities,",
      "en-trans": "tsé  mé  yönten  gyamtsöi  pal  nga  zhing"
    },
    {
      "bo": "ཉམ་ཆུང་འགྲོ་ལ་བུ་གཅིག་ལྟར་དགོངས་པའི། །",
      "en": "Who look upon all helpless beings as if they were an only child,",
      "en-trans": "nyam  chung  dro  la  pu  chik  tar  gongpé"
    },
    {
      "bo": "དུས་གསུམ་བདེ་གཤེགས་སྲས་དང་སློབ་མར་བཅས། །",
      "en": "Sugatas of the past, present and future, bodhisattvas and those in training,",
      "en-trans": "dü  sum  deshek  sé  dang  lobmar  ché"
    },
    {
      "bo": "བདག་གི་བདེན་པའི་སྨྲེ་ངག་འདིར་དགོངས་ཤིག །",
      "en": "Hear these truthful lamentations of mine, I pray!",
      "en-trans": "dak  gi  denpé  mengak  dir  gong  shik"
    },
    {
      "bo": "སྲིད་ཞིའི་གདུང་སེལ་ཡོངས་རྫོགས་ཐུབ་པའི་བསྟན། །",
      "en": "Let the complete teaching of the Sage, which dispels the miseries of existence and quiescence,",
      "en-trans": "si  zhi  dung  sel  yongdzok  tubpé  ten"
    },
    {
      "bo": "འཛམ་གླིང་ཡངས་པའི་ཕན་བདེའི་དཔལ་དུ་རྒྱས། །",
      "en": "Spread as the glory of benefit and happiness for the whole world!",
      "en-trans": "dzam  ling  yangpé  pendéi  pal  du  gyé"
    },
    {
      "bo": "དེ་འཛིན་མཁས་དང་གྲུབ་པའི་སྐྱེས་བུ་རྣམས། །",
      "en": "And among the learned and accomplished holders of these teachings",
      "en-trans": "dé  dzin  khé  dang  drubpé  kyebu  nam"
    },
    {
      "bo": "ཆོས་སྤྱོད་རྣམ་བཅུའི་བྱ་བ་འཕེལ་བར་མཛོད། །",
      "en": "Let the activity of the ten dharmic actions increase!",
      "en-trans": "chö  chö  nam  chüi  chawa  pelwar  dzö"
    },
    {
      "bo": "མི་ཟད་ལས་ངན་དྲག་པོས་ཡོངས་ནོན་པས། །",
      "en": "Totally overcome by intense and inexhaustible negative karma,",
      "en-trans": "mi  zé  lé  ngen  drakpöi  yong  nönpé"
    },
    {
      "bo": "བར་མེད་དུཿཁས་མནར་བའི་ཉམ་ཐག་འགྲོ། །",
      "en": "Beings are worn out and tormented by relentlessduḥkha.2",
      "en-trans": "barmé  duhkhé  narwé  nyam  tak  dro"
    },
    {
      "bo": "བཟོད་དཀའི་ནད་མཚོན་མུ་གེའི་འཇིགས་པ་ཀུན། །",
      "en": "Let all the terrors of unbearable illness, warfare and famine",
      "en-trans": "zö  ké  né  tsön  mugéi  jikpa  kun"
    },
    {
      "bo": "ཞི་ནས་བདེ་དགའ་རྒྱ་མཚོར་དབུགས་དབྱུངས་མཛོད། །",
      "en": "Be pacified, and relieved by an ocean of bliss!",
      "en-trans": "zhi  né  dega  gyamtsor  uk  yung  dzö"
    },
    {
      "bo": "ཁྱད་པར་གངས་ལྗོངས་ཆོས་ལྡན་སྐྱེ་འགྲོ་རྣམས། །",
      "en": "And especially for the practitioners in the Land of Snows,",
      "en-trans": "khyepar  gang  jong  chö  den  kyé  dro  nam"
    },
    {
      "bo": "ནག་ཕྱོགས་ཀླ་ཀློའི་དཔུང་གིས་བརྩེ་མེད་དུ། །",
      "en": "Mercilessly conquered by uncivilized forces of evil,",
      "en-trans": "nak  chok  lalöi  pung  gi  tsé  mé  du"
    },
    {
      "bo": "ངན་དགུས་འཇོམས་པའི་ཁྲག་དང་མཆི་མའི་རྒྱུན། །",
      "en": "Let the flowing stream of their blood and tears",
      "en-trans": "ngen  gü  jompé  trak  dang  chimé  gyün"
    },
    {
      "bo": "མྱུར་དུ་ཆད་པའི་ཐུགས་རྗེའི་མཐུ་དཔུང་སྐྱེད། །",
      "en": "Be swiftly halted by the powerful might of compassion!",
      "en-trans": "nyur  du  chépé  tukjéi  tu  pung  kyé"
    },
    {
      "bo": "ཉོན་མོངས་གདོན་གྱིས་སྨྱོས་པའི་བརླང་སྤྱོད་ཀྱིས། །",
      "en": "Those who are driven mad by the demon of negative emotions,",
      "en-trans": "nyönmong  dön  gyi  nyöpé  lang  chö  kyi"
    },
    {
      "bo": "རང་གཞན་གཉིས་ཕུང་བགྱིད་པའི་སྙིང་རྗེའི་ཡུལ། །",
      "en": "And pitifully bring ruin upon themselves and others through their reckless actions—",
      "en-trans": "rang  zhen  nyi  pung  gyipé  nyingjéi  yul"
    },
    {
      "bo": "མི་བསྲུན་སྐྱེ་བའི་ཚོགས་རྣམས་བླང་དོར་མིག །",
      "en": "Let such impudent beings gain the vision of what to adopt and abandon,",
      "en-trans": "mi  sün  kyéwé  tsok  nam  lang  dor  mik"
    },
    {
      "bo": "ཡོངས་ཐོབ་བྱམས་བརྩེ་མཛའ་བའི་དཔལ་ལ་སྦྱོར། །",
      "en": "And meet with kind and loving friends!",
      "en-trans": "yong  top  jam  tsé  dzawé  pal  la  jor"
    },
    {
      "bo": "རིང་ནས་སྙིང་དུ་བརྣག་པའི་འདོད་པའི་དོན། །",
      "en": "Let the object of my most long-standing and heartfelt wish:",
      "en-trans": "ring  né  nying  du  nakpé  döpé  dön"
    },
    {
      "bo": "ཡོངས་རྫོགས་བོད་ལྗོངས་རང་དབང་གཙང་མའི་དཔལ། །",
      "en": "The marvel of total independence and freedom for Tibet,",
      "en-trans": "yongdzok  pö  jong  rang  wang  tsangmé  pal"
    },
    {
      "bo": "ལྷུན་གྲུབ་ཆོས་སྲིད་ཟུང་འབྲེལ་དགའ་སྟོན་ལ། །",
      "en": "Be spontaneously accomplished! And let us be swiftly granted",
      "en-trans": "lhun  drup  chö  si  zung  drel  ga  tön  la"
    },
    {
      "bo": "སྤྱོད་པའི་སྐལ་བཟང་མྱུར་བ་ཉིད་དུ་སྩོལ། །",
      "en": "The good fortune to celebrate the unity of Dharma and affairs of state!",
      "en-trans": "chöpé  kalzang  nyurwa  nyi  du  tsöl"
    },
    {
      "bo": "བསྟན་དང་དེ་འཛིན་ཆབ་སྲིད་རང་རིགས་སླད། །",
      "en": "Giving away their bodies held so dear, their lives and their possessions,",
      "en-trans": "ten  dang  dé  dzin  chapsi  rang  rik  lé"
    },
    {
      "bo": "གཅེས་པའི་ལུས་སྲོག་ལོངས་སྤྱོད་ཡོངས་བཏང་སྟེ། །",
      "en": "For the sake of the teachings and those who maintain them, for our culture and unique traditions—",
      "en-trans": "chépé  lü  sok  longchö  yong  tang  té"
    },
    {
      "bo": "དཀའ་བ་བརྒྱ་ཕྲག་སྒྲུབ་པའི་སྐྱེ་བོ་རྣམས། །",
      "en": "Let those accomplished beings who undergo so many hardships,",
      "en-trans": "kawa  gya  trak  drubpé  kyewo  nam"
    },
    {
      "bo": "གྲུ་འཛིན་མགོན་དེས་ཐུགས་རྗེས་སྐྱོང་བར་མཛོད། །",
      "en": "Be protected by the compassionate lord of the Potala!3",
      "en-trans": "dru  dzin  gön  dé  tukjé  kyongwar  dzö"
    },
    {
      "bo": "མདོར་ན་མགོན་པོ་སྤྱན་རས་གཟིགས་དབང་གིས། །",
      "en": "In short, I pray that all the vast prayers of aspiration",
      "en-trans": "dor  na  gönpo  chenrézik  wang  gi"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བའི་སྤྱན་སྔར་གངས་ཅན་ཞིང༌། །",
      "en": "The lord Avalokiteśvara made for the land of Tibet",
      "en-trans": "sé  ché  gyalwé  chen  ngar  gang  chen  zhing"
    },
    {
      "bo": "ཡོངས་བཟུང་རྒྱ་ཆེན་སྨོན་ལམ་གང་མཛད་པའི། །",
      "en": "In the presence of buddhas and their bodhisattva heirs,",
      "en-trans": "yong  zung  gya  chen  mönlam  gang  dzépé"
    },
    {
      "bo": "འབྲས་བཟང་དེང་འདིར་མྱུར་དུ་འཆར་བར་གསོལ། །",
      "en": "Swiftly come to their positive fruition here and now!",
      "en-trans": "dré  zang  deng  dir  nyur  du  charwar  söl"
    },
    {
      "bo": "སྣང་སྟོང་ཆོས་ཉིད་ཟབ་མོའི་རྟེན་འབྲེལ་དང༌། །",
      "en": "Through the interdependence of the profound intrinsic nature of appearance and emptiness,",
      "en-trans": "nang  tong  chönyi  zabmöi  tendrel  dang"
    },
    {
      "bo": "མཆོག་གསུམ་ཐུགས་རྗེའི་མཐུ་དང་བདེན་ཚིག་སྟོབས། །",
      "en": "Through the power of the compassionate Three Jewels, by the force of these words of truth,",
      "en-trans": "chok  sum  tukjéi  tu  dang  dentsik  top"
    },
    {
      "bo": "ལས་འབྲས་བསླུ་མེད་བདེན་མཐུས་བདག་ཅག་གི །",
      "en": "And through the strength of the infallible truth of cause and effect,",
      "en-trans": "lé  dré  lu  mé  den  tü  dak  chak  gi"
    },
    {
      "bo": "བདེན་པའི་སྨོན་ལམ་གེགས་མེད་མྱུར་འགྲུབ་ཤོག །",
      "en": "May this, our prayer of truth, be swiftly accomplished without any hindrance!",
      "en-trans": "denpé  mönlam  gekmé  nyur  drup  shok"
    }
  ]
}