{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/amdo-geshe/jewelled-garland-longchenpa-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྔ་འགྱུར་བསྟན་པའི་བདག་པོ་ཀུན་མཁྱེན་ཡབ་སྲས་ཀྱི་བསྟན་པ་རྒྱས་པའི་སྨོན་ཚིག་ནོར་བུའི་ཕྲེང་བ།",
    "en": "The Jewelled Garland"
  },
  "text": [
    {
      "bo": "ཨོཾ་བདེ་ལེགས་སུ་གྱུར་ཅིག",
      "en": "Oṃ. May there be happiness and positivity!",
      "en-trans": "om delek su gyur chik"
    },
    {
      "bo": "བརྒྱུད་གསུམ་རིག་འཛིན་དཔལ་ལྡན་བླ་མ་དང་། །",
      "en": "Awareness-holders of the three transmissions, my glorious guru,",
      "en-trans": "gyü sum rigdzin palden lama dang"
    },
    {
      "bo": "ཡིད་དམ་ཞི་ཁྲོ་རྒྱལ་བ་སྲས་དང་བཅས། །",
      "en": "Chosen deities, peaceful and wrathful, victorious buddhas and your heirs,",
      "en-trans": "yi dam zhitro gyalwa sé dangché"
    },
    {
      "bo": "དཔའ་བོ་མཁའ་འགྲོ་བསྟན་སྲུང་རྒྱ་མཚོའི་ཚོགས། །",
      "en": "Warrior spirits, sky-faring ḍākinīs and oceanic hosts of guardians:",
      "en-trans": "pawo khandro tensung gyatsö tsok"
    },
    {
      "bo": "བདག་ལ་བརྩེར་དགོངས་སྨོན་པའི་དཔང་པོ་མཛོད། །",
      "en": "Look upon me now with love, and be witness to this, my prayer!",
      "en-trans": "dak la tser gong mönpé pangpo dzö"
    },
    {
      "bo": "མ་ལུས་སྐྱེ་དགུ་ཕན་བདེའི་སྲོག་གི་གསོས། །",
      "en": "You who bring the vital energy of benefit and happiness to all beings,",
      "en-trans": "malü kyegu pendé sok gi sö"
    },
    {
      "bo": "དུས་གསུམ་སྲས་བཅས་རྒྱལ་བའི་ཐུགས་ཀྱི་བཅུད། །",
      "en": "Essence of the wisdom of the buddhas of past, present and future and their heirs,",
      "en-trans": "dü sum sé ché gyalwé tuk kyi chü"
    },
    {
      "bo": "ཡོངས་རྫོགས་ཐུབ་བསྟན་མངའ་བདག་ཀློང་ཆེན་པ། །",
      "en": "Sovereign of all Śākyamuni Buddha’s teachings, Longchenpa:",
      "en-trans": "yongdzok tubten ngadak longchenpa"
    },
    {
      "bo": "དྲི་མེད་ཐུགས་བཟང་དར་ཞིང་རྒྱས་གྱུར་ཅིག །",
      "en": "May your stainless noble wisdom spread far and wide!",
      "en-trans": "drimé tuk zang dar zhing gyé gyur chik"
    },
    {
      "bo": "ཆོས་ཉིད་འོད་གསལ་ཞིང་ཁམས་ལྷ་ཡི་ལམ། །",
      "en": "The clear light of dharmatā is like the celestial sphere through which devas course —",
      "en-trans": "chönyi ösal zhingkham lha yi lam"
    },
    {
      "bo": "རང་བཞིན་གློ་བུར་དྲི་མས་རབ་བཏང་ཞིང་། །",
      "en": "By nature, utterly devoid of any adventitious stain,",
      "en-trans": "rangzhin lobur drimé rab tang zhing"
    },
    {
      "bo": "ཕྲིན་ལས་གོ་སྐབས་མུ་མཐའ་མེད་པའི་ཁྱོན། །",
      "en": "And affording infinite opportunity for enlightened action:",
      "en-trans": "trinlé gokab muta mepé khyön"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "རྨད་བྱུང་ལྷུན་གྲུབ་སྟུག་པོ་བཀོད་པའི་རྒྱན། །",
      "en": "Adornment of the wondrous, spontaneously perfect Dense Array,",
      "en-trans": "mejung lhündrub tukpo köpé gyen"
    },
    {
      "bo": "ཕྱོགས་དུས་རབ་འབྱམས་དཀྱིལ་འཁོར་ཀུན་གྱི་བདག །",
      "en": "Lord of all maṇḍalas throughout the whole infinity of space and time,",
      "en-trans": "chok dü rabjam kyilkhor kün gyi dak"
    },
    {
      "bo": "སར་གནས་དཔའ་བོ་འབུམ་གྱི་ཉེར་འཚོའི་གཞི། །",
      "en": "Ground-like support for myriad warriors abiding on the bhūmis:",
      "en-trans": "sar né pawo bum gyi nyer tsö zhi"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "དག་དང་མ་དག་འགྲོ་བའི་བསམ་པ་བཞིན། །",
      "en": "In keeping with the pure and impure intentions of beings,",
      "en-trans": "dak dang ma dak drowé sampa zhin"
    },
    {
      "bo": "གང་འདུལ་སྒྱུ་འཕྲུལ་དྲྭ་བའི་འཇོ་སྒེག་གིས། །",
      "en": "You take on illusory forms, as if in a play, to train others,",
      "en-trans": "gang dul gyutrul drawé jogek gi"
    },
    {
      "bo": "སྐལ་བཟང་ཡིད་ཀྱི་བརྟན་པ་འཕྲོག་བྱེད་པའི། །",
      "en": "And captivate the stable minds of the fortunate:",
      "en-trans": "kalzang yi kyi tenpa trok jepé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "མང་ཐོས་རྣམ་པར་འབྱེད་པའི་རྟ་ལྗང་གིས། །",
      "en": "Learning and discernment, like the sun drawn by its seven green horses,1",
      "en-trans": "mang tö nampar jepé ta jang gi"
    },
    {
      "bo": "ལེགས་དྲངས་བསམ་པའི་རིན་ཆེན་མེ་ཤེལ་ཁམས། །",
      "en": "Are concentrated in the magnifying lens of contemplation,",
      "en-trans": "lek drang sampé rinchen mé shel kham"
    },
    {
      "bo": "བསྒོམ་པའི་འོད་གསལ་སྣང་བ་རབ་འབར་བའི། །",
      "en": "To set aflame clear light of meditation, which burns so brightly:",
      "en-trans": "gompé ösal nangwa rab barwé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "བརྟན་མཁས་ཉིན་མོར་བྱེད་པའི་འོད་སྣང་གིས། །",
      "en": "Through the brilliant light of the sun of stability and learning,",
      "en-trans": "ten khé nyin mor jepé ö nang gi"
    },
    {
      "bo": "ཡང་དག་ཁྲིམས་ཀྱི་འདབ་སྟོང་ཆེར་བཞད་པའི། །",
      "en": "A thousand petals of perfect discipline unfurl in bloom,",
      "en-trans": "yangdak trim kyi dab tong cher zhepé"
    },
    {
      "bo": "ཕན་བདེའི་སྦྲང་རྩི་གསར་པའི་སྙིང་པོ་ཅན། །",
      "en": "To reveal the fresh honey-nectar of benefit and happiness:",
      "en-trans": "pendé drangtsi sarpé nyingpochen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "གྱ་གྱུའི་རྣམ་རྟོག་རླུང་གིས་མི་ཕྱེད་ཅིང་། །",
      "en": "Not dispersed by the winds of flickering thought,",
      "en-trans": "gya gyü namtok lung gi miché ching"
    },
    {
      "bo": "ཤིན་སྦྱངས་བདེ་བའི་རིན་ཆེན་ལས་གྲུབ་པ། །",
      "en": "Pliancy, brought about through jewel-like bliss,",
      "en-trans": "shin jang dewé rinchen lé drubpa"
    },
    {
      "bo": "གང་འདུལ་དགེ་ལ་བཀོལ་བའི་ཁོར་ཡུག་ཅན། །",
      "en": "Is here applied to the virtue of training of others:",
      "en-trans": "gang dul gé la kolwé khoryuk chen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "ཐུབ་བསྟན་ནམ་མཁའི་རྒྱན་གྱུར་འཆད་པའི་སྤྲིན། །",
      "en": "Clouds of exposition adorn the sky of Buddha’s teaching,",
      "en-trans": "tubten namkhé gyen gyur chepé trin"
    },
    {
      "bo": "ཡང་དག་རིགས་པའི་གློག་གིས་རབ་འཁྱུད་ཅིང་། །",
      "en": "Wherein the lightning of perfect reasoning flashes and strikes,",
      "en-trans": "yangdak rikpé lok gi rab khyü ching"
    },
    {
      "bo": "སྙན་འགྱུར་རྩོམ་པའི་དབྱངས་རྔ་འབུམ་ལྡིར་བ། །",
      "en": "And a hundred thousand thunder-drums of poetry resound:",
      "en-trans": "nyen gyur tsompé yang nga bum dirwa"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "འགྲན་བྲལ་མཁྱེན་རབ་ས་སྲུང་དཀར་པོའི་སྟེང་། །",
      "en": "Upon the white guardian elephant of unrivalled wisdom,",
      "en-trans": "drendral khyen rab sa sung karpö teng"
    },
    {
      "bo": "ཤེས་བྱ་ཀུན་མཁྱེན་སྤྱན་སྟོང་རྣམ་བཀྲ་ཞིང་། །",
      "en": "You stand, your thousand eyes of omniscience utterly clear,",
      "en-trans": "sheja künkhyen chen tong namtra zhing"
    },
    {
      "bo": "རྩོལ་མེད་ཨ་ཏི་རྡོ་རྗེའི་མཚོན་ཆ་ཅན། །",
      "en": "As you wield the vajra-weapon of effortless Atiyoga:",
      "en-trans": "tsolmé ati dorjé tsöncha chen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "རང་བཞིན་བརྒྱད་ལྡན་གངས་ཀྱི་རི་སུལ་ལས། །",
      "en": "From the glaciers, whose nature is eightfold purity,",
      "en-trans": "rangzhin gyeden gang kyi ri sul lé"
    },
    {
      "bo": "འོང་བའི་སྨིན་བྱེད་ཉལ་འགྲོའི་རྒྱུན་བཟང་གིས། །",
      "en": "Flows the excellent stream that brings spiritual maturity,",
      "en-trans": "ongwé min jé nyal drö gyün zang gi"
    },
    {
      "bo": "མ་དག་ཉེས་པའི་དྲི་འཁྲུད་ཆོ་ག་མཁན། །",
      "en": "With its rites that cleanse impurity and defilement:",
      "en-trans": "ma dak nyepé dri trü choga khen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "ལྟར་སྣང་བཅོས་མའི་བློ་ཙམ་མ་ཡིན་པར། །",
      "en": "No mere imagining or projection of how things might be,",
      "en-trans": "tarnang chömé lo tsam mayinpar"
    },
    {
      "bo": "སྣོད་བཅུད་དག་པ་དབྱིངས་ཀྱི་དཀྱིལ་འཁོར་དུ། །",
      "en": "This maṇḍala of basic space, in which environment and beings are pure,",
      "en-trans": "nöchü dakpa ying kyi kyilkhor du"
    },
    {
      "bo": "མངོན་སུམ་སྟོན་པའི་བྱེད་པོ་ཟླ་བྲལ་བ། །",
      "en": "And you, who are without rival, reveal it directly:",
      "en-trans": "ngönsum tönpé jepo da dralwa"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "རླུང་སེམས་བཙོན་དུ་འཇུག་པའི་རྩོལ་སྒྲུབ་ཀྱིས། །",
      "en": "Without the need for tiring means of inspiring fourfold joy",
      "en-trans": "lungsem tsön du jukpé tsoldrub kyi"
    },
    {
      "bo": "དགའ་བཞི་མངོན་དུ་བྱེད་པའི་ངལ་དུབ་ལས། །",
      "en": "Based on the confined efforts of energy and mind,",
      "en-trans": "ga zhi ngön du jepé ngaldub lé"
    },
    {
      "bo": "མ་ཡིན་འོད་གསལ་ཇི་བཞིན་སྣང་བྱེད་པའི། །",
      "en": "Here, clear light is revealed directly, just as it is:",
      "en-trans": "mayin ösal jizhin nangjé pé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "ཡིད་དཔྱོད་རྟོག་གེ་རིགས་པའི་ཆ་བཞག་དང་། །",
      "en": "All reliance upon intellectual reasoning involving analysis and speculation",
      "en-trans": "yichö tokgé rikpé cha zhak dang"
    },
    {
      "bo": "ཕྱེད་བཅིང་རླུང་གི་རང་གདངས་སྤྲོས་པའི་མཐའ། །",
      "en": "And elaborate expressions of self-radiance from controlling wind-energy",
      "en-trans": "ché ching lung gi rang dang tröpé ta"
    },
    {
      "bo": "ཉེར་ཞི་གདོད་ནས་ཀ་དག་གཏིང་གསལ་དབྱིངས། །",
      "en": "Are pacified within the space of eternally pure, profound luminosity:",
      "en-trans": "nyerzhi döné kadak tingsal ying"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "སྟོང་པའི་རང་བཞིན་འགགས་མེད་ལྷུན་གྲུབ་དོན། །",
      "en": "This wondrous system, in which the unceasing nature of emptiness",
      "en-trans": "tongpé rangzhin gakmé lhündrub dön"
    },
    {
      "bo": "མེད་དང་གཅིག་པུ་ཕྱལ་བ་ཆན་པོ་རུ། །",
      "en": "Is perfectly complete within the present moment of awareness,",
      "en-trans": "mé dang chikpu chalwa chenpo ru"
    },
    {
      "bo": "ད་ལྟའི་ཤེས་པར་རྫོགས་པའི་རྨད་བྱུང་ལུགས། །",
      "en": "As spontaneous presence, absence, oneness and suffusion:",
      "en-trans": "danté shepar dzokpé mejung luk"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "ཤེས་རིག་ཟང་ཐལ་གཉུག་མ་མ་བཅོས་དང་། །",
      "en": "This wondrous way of traversing paths and stages all at once,",
      "en-trans": "sherig zangtal nyukma machö dang"
    },
    {
      "bo": "གདོད་ནས་སྤྲོས་བྲལ་རིག་གདངས་འཇའ་ཟེར་སྦུབས། །",
      "en": "In which unimpeded awareness is left genuine and unaltered,",
      "en-trans": "döné trödral rikdang jazer bub"
    },
    {
      "bo": "ས་ལམ་གཅིག་ཆར་རྫོགས་པའི་མྱུར་ལམ་རྨད། །",
      "en": "And unelaborate rigpa’s radiance is an array of rainbow-colored light:",
      "en-trans": "salam chikchar dzokpé nyurlam mé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "འཁོར་འདས་མཉམ་ཉིད་རང་རིག་བདེ་ཆེན་རྩལ། །",
      "en": "The nature of blissful awareness, in which saṃsāra and nirvāṇa are equal,",
      "en-trans": "khordé nyamnyi rangrig dechen tsal"
    },
    {
      "bo": "མཐའ་ཀླས་འགྲོ་ལ་བྱམས་བརྩེའི་རང་བཞིན་དུ། །",
      "en": "Is expressed as loving concern for living beings, infinite in number,",
      "en-trans": "talé dro la jam tsé rangzhin du"
    },
    {
      "bo": "འོད་དང་འོད་ཟེར་ཇི་བཞིན་འབྲལ་མེད་པའི། །",
      "en": "And essence and expression are as inseparable as light and its radiance:",
      "en-trans": "ö dang özer jizhin dral mepé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "ཕྱོགས་རེར་མ་གྱུར་མདོ་སྔགས་གཞུང་ལུགས་བརྒྱ། །",
      "en": "Threading together the jewels of study, reflection and meditation",
      "en-trans": "chokrer magyur do ngak zhungluk gya"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་རིན་ཆེན་སྲད་བུ་ལ། །",
      "en": "For hundreds of traditions of sūtra and mantra, without bias,",
      "en-trans": "tö sam gompé rinchen sebu la"
    },
    {
      "bo": "བསྟར་དུ་བགྱིས་པ་བློ་གསལ་མགུལ་བའི་རྒྱན། །",
      "en": "Makes an adornment to be worn by those with clarity of mind:",
      "en-trans": "tar du gyipa losal gulwé gyen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "བླུན་སྒོམ་ཐུན་གསུམ་སྨག་རུམ་མུན་པའི་གཤེད། །",
      "en": "The darkness that is dull meditation practiced three times a day,",
      "en-trans": "lün gom tün sum makrum münpé shé"
    },
    {
      "bo": "རྟོག་གེ་རྒྱུ་སྐར་ཕྲེང་བ་ཟིལ་གནོན་པའི། །",
      "en": "And, likewise, the constellations of intellectual speculation,",
      "en-trans": "tokgé gyukar trengwa zilnön pé"
    },
    {
      "bo": "ལུང་རྟོགས་ཆ་ཤས་རྫོགས་པའི་འོད་དཀར་ཅན། །",
      "en": "Are here eclipsed by the brilliant moon of scripture and realization:",
      "en-trans": "lungtok chashé dzokpé ökar chen"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "མཁས་པའི་ངང་ཚུལ་ནམ་མཁའི་ཁྱོན་ལྟར་ཡངས། །",
      "en": "The approach to learning is vast, as broad as the sky itself,",
      "en-trans": "khepé ngang tsul namkhé khyön tar yang"
    },
    {
      "bo": "བཙུན་པའི་བརྟུལ་ཞུགས་འཕགས་པའི་གནས་བརྟན་བཞིན། །",
      "en": "Disciplined conduct is as pure as that of the noble elders,",
      "en-trans": "tsünpé tulzhuk pakpé neten zhin"
    },
    {
      "bo": "བཟང་པོའི་མཛད་པ་བརྩེ་བའི་གཏེར་ཆེན་གྲོགས། །",
      "en": "And beneficial activity is aided by love’s great treasury:",
      "en-trans": "zangpö dzepa tsewé terchen drok"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "མདོ་རྒྱུད་སེམས་སྡེ་ལེགས་བཤད་ནོར་བུའི་དཔྱ། །",
      "en": "Excellent explanations of Sūtra, Tantra and Mind2are like a jewel pinnacle,",
      "en-trans": "dogyü semdé lek shé norbü cha"
    },
    {
      "bo": "རྨད་བྱུང་ལུང་དང་རིགས་པས་བྱི་དོར་གྱིས། །",
      "en": "Made clean and bright through wondrous scripture and reasoning,",
      "en-trans": "mejung lung dang rikpé jidor gyi"
    },
    {
      "bo": "སྲིད་ཞིའི་རྒྱལ་མཚན་རྩེ་མོར་འགོད་མཛད་པའི། །",
      "en": "And set atop the banner heralding victory over existence and quiescence:",
      "en-trans": "sizhi gyaltsen tsemor gö dzepé"
    },
    {
      "bo": "ཀུན་མཁྱེན་རྒྱལ་བའི་བསྟན་པ་རྒྱས་གྱུར་ཅིག །",
      "en": "May the teachings of the Omniscient Victor spread far and wide!",
      "en-trans": "künkhyen gyalwé tenpa gyé gyur chik"
    },
    {
      "bo": "མཆོག་གསུམ་བསླུ་མེད་བདེན་པའི་བྱིན་རླབས་དང་། །",
      "en": "Through the blessings of the unfailing truth of Buddha, Dharma and Saṅgha,",
      "en-trans": "chok sum lumé denpé jinlab dang"
    },
    {
      "bo": "བསྟན་སྲུང་དམ་ཅན་རྒྱ་མཚོའི་མཐུ་སྟོབས་ནུས། །",
      "en": "And the power, strength and capacity of oceans of oath-bound guardians of the teaching,",
      "en-trans": "tensung damchen gyatsö tutob nü"
    },
    {
      "bo": "ཁྱད་པར་བདག་གི་ལྷག་བསམ་དག་པའི་མཐུས། །",
      "en": "And, above all, through the force of my own pure intentions,",
      "en-trans": "khyepar dak gi lhaksam dakpé tü"
    },
    {
      "bo": "སྨོན་དོན་བདེ་བླག་ཉིད་དུ་འགྲུབ་གྱུར་ཅིག །",
      "en": "May the points contained in this aspiration, swiftly and easily, come to pass!",
      "en-trans": "mön dön delak nyi du drub gyur chik"
    }
  ]
}