{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/tai-situ-rinpoche/wish-fulfilling-king-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཆོག་གསུམ་རྩ་བ་གསུམ་ལ་གསོལ་འདེབས་སྨོན་ལམ་ངག་འདོན་འབྲེལ་ཚད་དོན་ལྡན་ཡིད་བཞིན་དབང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "A Universally Beneficial Prayer, Aspiration, and Supplication to the Three Jewels and Three Roots"
  },
  "text": [
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་གྱི་རྒྱལ་བ་སྲས་དང་བཅས་པ་ཐམས་ཅད་ལ། སྒོ་གསུམ་མི་ཕྱེད་པའི་དད་པ་རྩེ་གཅིག་པས་ཕྱག་འཚལ་ཞིང་སྐྱབས་སུ་མཆིའོ། །བདག་དང་སེམས་ཅན་ཐམས་ཅད། འཁོར་བ་སྡུག་བསྔལ་གྱི་རྒྱ་མཚོ་ཆེན་པོ་ལས་ཐར་ཏེ། གཏན་གྱི་བདེ་བ་ཡང་དག་པ་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གོ་འཕང་དམ་པ་མངོན་དུ་འགྱུར་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "With my three doors in a state of one-pointed and unshakable faith, I prostrate to and take refuge in you, the victorious buddhas of all times and directions, together with your heirs. Grant your blessings that we might free ourselves and every other sentient being from saṃsāra’s ocean of suffering, and thus fully manifest everlasting bliss—the noble state of a complete and perfect buddha!",
      "en-trans": "chok chu dü sum gyi gyalwa sé dang chepa tamché la go sum michepé depa tsechik pé chaktsal zhing kyab su chi o dak dang semchen tamché khorwa dukngal gyi gyatso chenpo lé tar té ten gyi dewa yangdakpa dzokpé sangye kyi gopang dampa ngön du gyurwar jingyi lab tu sol"
    },
    {
      "bo": "ན་མོ། མཆོག་གསུམ་རྩ་གསུམ་རྒྱལ་བ་མ་ལུས་པ། །",
      "en": "Namo. Three Jewels and Three Roots, every single victor,",
      "en-trans": "namo, chok sum tsa sum gyalwa malüpa"
    },
    {
      "bo": "མཁའ་མཉམ་འགྲོ་ལ་བྱམས་པའི་ཁུར་ཆེན་པོས། །",
      "en": "Abundant with love for beings, vast as space,",
      "en-trans": "khanyam dro la jampé khur chenpö"
    },
    {
      "bo": "མ་རིག་སྒྲིབ་པས་རྨོངས་པའི་གདུལ་བྱ་ལ། །",
      "en": "Shine bright your sunlight upon the profound path,",
      "en-trans": "marik dribpé mongpé dulja la"
    },
    {
      "bo": "ཟབ་ལམ་ཉི་འོད་གསལ་བར་བསྟན་དུ་གསོལ། །",
      "en": "For we are mired in the darkness of our ignorance!",
      "en-trans": "zablam nyi ösalwar ten du sol"
    },
    {
      "bo": "སྟོན་པ་མཉམ་མེད་ཐུབ་པའི་དབང་པོ་དང་། །",
      "en": "O peerless teacher, Lord of the Sages,",
      "en-trans": "tönpa nyammé tubpé wangpo dang"
    },
    {
      "bo": "འདས་དང་མ་འོངས་དེ་བཞིན་གཤེགས་པ་རྣམས། །",
      "en": "And all the past tathāgatas as well as those to come:",
      "en-trans": "dé dang ma ong dezhin shekpa nam"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ།",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "རྒྱལ་ཡུམ་ཆེན་མོ་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །",
      "en": "O Prajñāpāramitā, supreme mother of the victors,",
      "en-trans": "gyalyum chenmo sherab parol chin"
    },
    {
      "bo": "ཐེག་པ་རིམ་དགུའི་གསུང་རབ་མ་ལུས་པ། །",
      "en": "Essence of all scriptures of the nine-staged vehicles:",
      "en-trans": "tekpa rim gü sung rab malüpa"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us, with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ།",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "འཇམ་དབྱངས་ཕྱག་ན་རྡོ་རྗེ་སྤྱན་རས་གཟིགས། །",
      "en": "O Mañjuśrī, Vajrapāṇi, and Avalokiteśvara,",
      "en-trans": "jamyang chak na dorjé chenrezik"
    },
    {
      "bo": "རྒྱལ་སྲས་འཕགས་པའི་ཚོགས་རྣམས་མ་ལུས་པ།",
      "en": "And the noble assembly of the victor’s heirs:",
      "en-trans": "gyalsé pakpé tsok nam malüpa"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ། །",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "ཨོ་རྒྱན་ཆེན་པོ་རྗེ་འབངས་མར་མི་སོགས། །",
      "en": "Great Guru of Uḍḍiyāna, king and disciples, Marpa and Mila,",
      "en-trans": "orgyen chenpo jebang mar mi sok"
    },
    {
      "bo": "རྩ་བརྒྱུད་དཔལ་ལྡན་བླ་མ་ཐམས་ཅད་ཀྱིས། །",
      "en": "All of you glorious root and lineage masters:",
      "en-trans": "tsa gyü palden lama tamché kyi"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ།",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "དུས་འཁོར་རྡོར་སེམས་བདེ་མཆོག་ཀྱེ་རྡོ་རྗེ། །",
      "en": "Kālacakra, Vajrasattva, Cakrasaṃvara, and Hevajra,",
      "en-trans": "dükhor dorsem demchok kyé dorjé"
    },
    {
      "bo": "ཡི་དམ་རྒྱུད་སྡེ་བཞི་ཡི་ལྷ་ཚོགས་རྣམས། །",
      "en": "And the assembly of yidam deities of the four classes of tantra:",
      "en-trans": "yidam gyüdé zhi yi lhatsok nam"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ། །",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "མགོན་པོ་བེར་ཅན་རང་བྱུང་རྒྱལ་མོ་དང་། །",
      "en": "Lord Bernakchen and Rangjung Gyalmo,1",
      "en-trans": "gönpo berchen rangjung gyalmo dang"
    },
    {
      "bo": "སྐུ་ལྔ་ལ་སོགས་ཆོས་སྲུང་མཁའ་འགྲོའི་ཚོགས། །",
      "en": "The Five Kings2, and the assembly of dharmapālas and ḍākinīs",
      "en-trans": "ku nga lasok chösung khandrö tsok"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་ལ་སྙིང་རྗེས་བརྩེར་དགོངས་ཏེ། །",
      "en": "Please consider us with your love and kindness;",
      "en-trans": "dak sok dro la nyingjé tser gong té"
    },
    {
      "bo": "ཐུགས་རྗེའི་བྱིན་རླབས་ཆར་རྒྱུན་དབབ་ཏུ་གསོལ།",
      "en": "Let the blessed rain of your compassion fall upon us all!",
      "en-trans": "tukjé jinlab char gyün wab tu sol"
    },
    {
      "bo": "མདོར་ན་རང་གཞན་དགྲ་གཉེན་བར་མ་ཡི། །",
      "en": "In brief, may all beings of the three realms and five classes,",
      "en-trans": "dorna rangzhen dra nyenwar ma yi"
    },
    {
      "bo": "ཁམས་གསུམ་རྒྱུད་ལྔས་བསྡུས་པའི་ཡིད་ཅན་རྣམས། །",
      "en": "Ourselves and others, whether enemies, friends, or strangers,",
      "en-trans": "kham sum gyü ngé düpé yichen nam"
    },
    {
      "bo": "འདིའམ་འོན་ཏེ་ཚེ་རབས་ཐམས་ཅད་དུ། །",
      "en": "Be protected by these unfailing sources of refuge",
      "en-trans": "di am önté tserab tamché du"
    },
    {
      "bo": "སྐྱབས་གནས་བསླུ་བ་མེད་པས་རྗེས་འཛིན་ཤོག །",
      "en": "From now on, throughout all our lives to come.",
      "en-trans": "kyabné luwa mepé jedzin shok"
    },
    {
      "bo": "བདག་གི་རྣམ་དག་སྨོན་པའི་རེ་འབྲས་དང་། །",
      "en": "May the results of each of these pure aspirations,",
      "en-trans": "dak gi namdak mönpé ré dré dang"
    },
    {
      "bo": "ལས་ཚོགས་བསླུ་བ་མེད་པའི་བདེན་སྟོབས་ཀྱིས། །",
      "en": "Through the unfailing power of the truth of cause and effect,",
      "en-trans": "lé tsok luwa mepé den tob kyi"
    },
    {
      "bo": "སྲིད་ཞིའི་དགེ་མཚན་བྱེ་བའི་དཔལ་འབར་བཞིན། །",
      "en": "Spark a blaze of glorious virtue, both temporal and sublime,",
      "en-trans": "sizhi getsen jewé palbar zhin"
    },
    {
      "bo": "ཁམས་གསུམ་འཁོར་བའི་གནས་ཀུན་སྟོང་གྱུར་ཅིག །",
      "en": "That will entirely empty all of saṃsāra’s triple realms.",
      "en-trans": "kham sum khorwé né kün tong gyur chik"
    },
    {
      "bo": "འདིས་མཚོན་པའི་བདག་གཞན་དུས་གསུམ་གྱི་དགེ་ཚོགས་ཐམས་ཅད། རིགས་དྲུག་གི་འགྲོ་བ་སྤྱི་དང་། ཁྱད་པར་དུ་ལས་འབྲས་ཁྱད་དུ་བསད་པ། སྙིང་རྗེའི་ཡུལ་དུ་གྱུར་པ་རྣམས་ལ་བསྔོ་བར་བྱའོ། །རྣམ་སྨིན་ངན་པ་ལས་མྱུར་དུ་གྲོལ་ཏེ། ཐར་པ་ཡང་དག་པ་བདེ་བླག་ཏུ་ཐོབ་པར་གྱུར་ཅིག །",
      "en": "We thereby dedicate the entire accumulation of merit throughout the three times, gathered by ourselves and all beings, to the objects of compassion: the six classes of beings in general, but especially those who disregard the laws governing actions and their results. May all be swiftly freed from the ripening of negativity, and may we easily attain perfect liberation!",
      "en-trans": "di tsönpé dakzhen dü sum gyi gé tsok tamché rik druk gi drowa chi dang khyepardu lé dré khyé du sepa nyingjé yul du gyurpa nam la ngowar ja o nammin ngenpa lé nyurdu drol té tarpa yangdakpa delak tu tobpar gyur chik"
    }
  ]
}