{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chatral-rinpoche/rishis-maledictory-incantation",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བསྐལ་ངན་དུས་ཀྱི་གཡོ་འཁྲུག་ཟློག་པའི་ཐུགས་དམ་རྒྱུད་བསྐུལ་གསོལ་འདེབས་སྨོན་ལམ་དུ་བྱ་བ་དྲང་སྲོང་དམོད་སྔགས་ཞེས་བྱ་བ་བཞུགས་སོ།།",
    "en": "An Invocation of Wisdom Mind and Sacred Pledges for Reversing the Disturbances and Agitations of Dark Times in the Form of an Aspiration Prayer"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ར་ཏྣ་ཏྲ་ཡཱ་ཡ།",
      "en": "Namo guru ratnatrayāya!2",
      "en-trans": "namo guru ratna trayaya"
    },
    {
      "bo": "བསྐལ་བཟང་ཞིང་གི་རྣམ་འདྲེན་ཤཱཀྱའི་ཏོག །",
      "en": "Guide for this fortunate eon, crown ornament of the Śākyas,",
      "en-trans": "kalzang zhing gi namdren shakyé tok"
    },
    {
      "bo": "སངས་རྒྱས་གཉིས་པ་ཨོ་རྒྱན་མཚོ་སྐྱེས་རྗེ། །",
      "en": "Second buddha, Lord Orgyen Tsokyé,",
      "en-trans": "sangye nyipa orgyen tsokyé jé"
    },
    {
      "bo": "འཕགས་མཆོག་སྤྱན་རས་གཟིགས་དང་འཇམ་དཔལ་དབྱངས། །",
      "en": "Eight Close sons headed by",
      "en-trans": "pakchok chenrezik dang jampal yang"
    },
    {
      "bo": "ཕྱག་རྡོར་ལ་སོགས་བྱང་སེམས་ཉེ་སྲས་བརྒྱད། །",
      "en": "The supreme and noble Avalokiteśvara, Mañjuśrī, and Vajrapāṇi,",
      "en-trans": "chakdor lasok changsem nyesé gyé"
    },
    {
      "bo": "སྒྲོལ་མ་ཉེར་གཅིག་གནས་བརྟན་འཕགས་པའི་ཚོགས། །",
      "en": "Twenty-one Tārās and the assembly of elders,",
      "en-trans": "drolma nyerchik neten pakpé tsok"
    },
    {
      "bo": "རྩ་བརྒྱུད་བླ་མ་ཡི་དམ་ཞི་ཁྲོའི་ལྷ། །",
      "en": "Root and lineage masters, peaceful and wrathful yidam deities,",
      "en-trans": "tsa gyü lama yidam zhitrö lha"
    },
    {
      "bo": "གནས་གསུམ་མཁའ་འགྲོ་ཡེ་ཤེས་ལས་གྲུབ་པའི། །",
      "en": "Ḍākinīs of the three places, wisdom Dharma protectors,",
      "en-trans": "né sum khandro yeshe lé drubpé"
    },
    {
      "bo": "ཆོས་སྲུང་ཕྱོགས་སྐྱོང་དཔལ་མགོན་བདུན་ཅུ་སོགས། །",
      "en": "Guardians of the four directions and the seventy glorious protectors,",
      "en-trans": "chösung chok kyong palgön dünchu sok"
    },
    {
      "bo": "མངོན་ཤེས་རྫུ་འཕྲུལ་མཐུ་སྟོབས་མངའ་བ་རྣམས། །",
      "en": "Great masters with powers of clairvoyance and miraculous activity,",
      "en-trans": "ngönshé dzutrul tutob ngawa nam"
    },
    {
      "bo": "རྩོད་ལྡན་འགྲོ་ལ་གཟིགས་ཤིང་དགོངས་སུ་གསོལ། །",
      "en": "In your wisdom, please turn your attention toward all beings engaged in conflict.",
      "en-trans": "tsöden dro la zik shing gong su sol"
    },
    {
      "bo": "སྐལ་ངན་དུས་མཐའི་སྐྱེ་འགྲོ་སྤྱི་མཐུན་གྱི། །",
      "en": "The shared negative karma of beings in this final dark age",
      "en-trans": "kal ngen dü té kyendro chi tün gyi"
    },
    {
      "bo": "ལས་ངན་འབྲས་བུའི་མཚོ་ཆེན་བརྡོལ་བ་ལས། །",
      "en": "Froths as a huge ocean;",
      "en-trans": "lé ngen drebü tso chen dolwa lé"
    },
    {
      "bo": "དཀར་ཕྱོགས་གཡེལ་ཞིང་ནག་ཕྱོགས་བདུད་སྡེ་ཡིས། །",
      "en": "Goodness is neglected whilst the demons of evil",
      "en-trans": "karchok yel zhing nakchok dü dé yi"
    },
    {
      "bo": "ཁ་དྲག་དབང་ཆེན་མི་ཆེན་སེམས་རྩ་སྒུལ། །",
      "en": "Churn intensely the minds of the powerful and the influential,",
      "en-trans": "khadrak wangchen mi chen sem tsa gul"
    },
    {
      "bo": "འཛམ་གླིང་ཕུང་བྱེད་རྡུལ་མཚོན་དམག་འཁྲུགས་བསླང་། །",
      "en": "Spitting out wars that could reduce this earth to dust.",
      "en-trans": "dzamling pung jé dul tsön mak truk lang"
    },
    {
      "bo": "ལོག་སྨོན་འཕྲུལ་གྱི་མཚོན་ཆའི་འཐོར་རླུང་ཆེས། །",
      "en": "Hurricanes of weapons hatched from perverse aspirations",
      "en-trans": "lok mön trul gyi tsönché tor lung ché"
    },
    {
      "bo": "སྣོད་བཅུད་ཐལ་བའི་རྡུལ་དུ་སྐད་ཅིག་ལ། །",
      "en": "Unleashed to turn the entire universe and its inhabitants instantly to ash.",
      "en-trans": "nöchü talwé dul du kechik la"
    },
    {
      "bo": "བརླག་པར་འགྱུར་ཉེའི་ལྟས་ངན་བྱ་མ་རྟ། །",
      "en": "The portents of these bad omens of our approaching total destruction",
      "en-trans": "lakpar gyur nyé té ngen ja ma ta"
    },
    {
      "bo": "སྣང་གྲགས་རྟོག་པའི་སྤྱོད་ཡུལ་མངོན་གྱུར་ཀྱང་། །",
      "en": "Appear clearly in the sights, sounds, and thoughts of our world.",
      "en-trans": "nang drak tokpé chöyul ngöngyur kyang"
    },
    {
      "bo": "མ་རིག་སྐྱེ་བོ་རྨོངས་དང་ཐེ་ཚོམ་རྒྱར། །",
      "en": "Yet the ignorant remain in their webs of delusion and doubt;",
      "en-trans": "marik kyewo mong dang tetsom gyar"
    },
    {
      "bo": "རབ་འཐུམས་ད་དུང་བྲེད་དུ་ཅང་མ་ཚོར། །",
      "en": "Exceedingly stupid, they still do not feel alarmed at all.",
      "en-trans": "rab tum dadung dré du chang ma tsor"
    },
    {
      "bo": "ཐོས་དང་དྲན་པ་ཙམ་གྱིས་འཇིགས་སྐྱེད་པའི། །",
      "en": "We are filled with terror from just hearing or thinking",
      "en-trans": "tö dang drenpa tsam gyi jik kyepé"
    },
    {
      "bo": "སྔར་མ་བྱུང་བའི་འཛམ་གླིང་འཕོ་འགྱུར་གང་། །",
      "en": "About the unprecedented transformation of our world.",
      "en-trans": "ngar majungwé dzamling pogyur gang"
    },
    {
      "bo": "དེ་ཟློག་ཐབས་དང་རེ་ས་གཞན་ན་མེད། །",
      "en": "And we have no means or hope to reverse this,",
      "en-trans": "dé dok tab dang resa zhen namé"
    },
    {
      "bo": "བསླུ་མེད་དཀོན་མཆོག་རྩ་གསུམ་ཁྱེད་རྣམས་ལ། །",
      "en": "Save the undeceiving Three Jewels and Three Roots,",
      "en-trans": "lumé könchok tsa sum khyé nam la"
    },
    {
      "bo": "ཁྱེའུས་ཕ་མར་འབོད་འདྲའི་སྨྲེ་སྔགས་ཀྱིས། །",
      "en": "To whom we cry like small children wailing for their parents.",
      "en-trans": "khyéü pamar bö dré me ngak kyi"
    },
    {
      "bo": "གསོལ་འདེབས་འོ་དོད་འབོད་པ་འདི་ལགས་ན། །",
      "en": "Please hear our desperate prayers,",
      "en-trans": "soldeb odö böpa di lak na"
    },
    {
      "bo": "ཁྱེད་རྣམས་སྔོན་གྱི་དམ་བཅའ་མ་བསྙེལ་བར། །",
      "en": "And remember your earlier commitments.",
      "en-trans": "khyé nam ngön gyi damcha manyelwar"
    },
    {
      "bo": "གློག་ལྟར་མྱུར་བའི་ཐུགས་རྗེའི་ཕྱག་རྐྱོངས་ལ། །",
      "en": "Extend your hands of compassion, as swift as lightning,",
      "en-trans": "lok tar nyurwé tukjé chak kyong la"
    },
    {
      "bo": "མགོན་མེད་འགྲོ་འདི་སྲུང་སྐྱོབས་འཇིགས་སྒྲོལ་མཛོད། །",
      "en": "To hold and shelter those lacking protection and free us from our terror.",
      "en-trans": "gönmé dro di sung kyob jik drol dzö"
    },
    {
      "bo": "འཛམ་གླིང་སྐྱེ་འགྲོའི་བདེ་སྐྱིད་འཕྲོག་བྱེད་པའི། །",
      "en": "When powerful barbarians who plunder the happiness of beings in our world",
      "en-trans": "dzamling kyendrö dekyi trok jepé"
    },
    {
      "bo": "སྟོབས་ཆེན་ཀླ་ཀློས་གཡུལ་འགྱེད་གྲོས་བཤམས་ཚེ། །",
      "en": "Plot their battles,",
      "en-trans": "tobchen lalö yul gyé drö sham tsé"
    },
    {
      "bo": "གཙོ་བོ་རྣམས་དང་དེ་ཡི་ཁ་ལོ་བ། །",
      "en": "Please transform these leaders and their minions—",
      "en-trans": "tsowo nam dang dé yi khalowa"
    },
    {
      "bo": "མ་རུང་གདུག་རྩུབ་བསམ་ངན་འཆང་བ་རྣམས། །",
      "en": "Such ruthless malefactors—",
      "en-trans": "ma rung duktsub sam ngen changwa nam"
    },
    {
      "bo": "ཞི་བདེ་མཐུན་པའི་ཕྱོགས་སུ་བསྒྱུར་དུ་གསོལ། །",
      "en": "Into proponents of peace, happiness and harmony.",
      "en-trans": "zhidé tünpé chok su gyur du sol"
    },
    {
      "bo": "འགལ་རྐྱེན་དམག་འཁྲུགས་རང་སར་ཞི་བ་དང་། །",
      "en": "Please extinguish the adverse circumstances of war right on the spot",
      "en-trans": "galkyen mak truk rangsar zhiwa dang"
    },
    {
      "bo": "བདུད་སྡེའི་རྡུལ་མཚོན་ཟློག་ཅིང་གཞོམ་པར་མཛོད། །",
      "en": "And expel and destroy these demonic atomic weapons.",
      "en-trans": "düdé dul tsön dok ching zhompar dzö"
    },
    {
      "bo": "དེ་ཡི་མཐུ་ལས་འཛམ་གླིང་ས་ཆེན་འདིར། །",
      "en": "Then, throughout our great earth,",
      "en-trans": "dé yi tu lé dzamling sachen dir"
    },
    {
      "bo": "བསྟན་འཛིན་ཞབས་བརྟན་བཤད་སྒྲུབ་ཕྱོགས་ཀུན་དར། །",
      "en": "Let Dharma teachers live long, and learning and accomplishment flourish in all directions.",
      "en-trans": "tendzin zhabten shedrub chok kündar"
    },
    {
      "bo": "བསྟན་འགྲོར་འཚེ་བྱེད་མི་དང་མི་མིན་གྱི། །",
      "en": "Liberate the world from the claws of nasty gangs of human and non-human",
      "en-trans": "ten dror tsé jé mi dang mi min gyi"
    },
    {
      "bo": "ནག་པོའི་རྩ་ལག་སྡེར་བཅས་མིང་ཙམ་སྟོངས། །",
      "en": "Executioners of the teachings and sentient beings, until not even their names remain.",
      "en-trans": "nakpö tsalak der ché ming tsam tong"
    },
    {
      "bo": "འཇིག་རྟེན་ཀུན་ཏུ་བདེ་ལེགས་རྒྱ་ཆེན་པོས། །",
      "en": "May vast happiness saturate the whole world,",
      "en-trans": "jikten küntu delek gyachenpö"
    },
    {
      "bo": "ཡོངས་ཁྱབ་སྡེ་བཞིའི་དཔལ་གྱིས་མངོན་མཐོ་ཞིང་། །",
      "en": "And beings be elevated through the glory of the four pursuits3to the Truly High.4",
      "en-trans": "yong khyab dé zhi pal gyi ngön to zhing"
    },
    {
      "bo": "རྫོགས་ལྡན་དུས་བཞིན་འཐབ་འཁྲུགས་འཚེ་མེད་པར། །",
      "en": "May the times become perfect without the harm of war and strife, as during the Golden Age,",
      "en-trans": "dzokden dü zhin tab truk tsemé par"
    },
    {
      "bo": "ཀུན་ཀྱང་བདེ་དགའི་གར་གྱིས་བྲེལ་གྱུར་ཅིག །",
      "en": "With everyone constantly enraptured in the dance of bliss and joy.",
      "en-trans": "kün kyang dé gé gar gyi drel gyur chik"
    },
    {
      "bo": "སྐྱབས་གནས་མཆོག་གསུམ་རྒྱ་མཚོའི་ཐུགས་རྗེ་དང་། །",
      "en": "Through the compassion of the ocean of the Three Jewels",
      "en-trans": "kyabné chok sum gyatsö tukjé dang"
    },
    {
      "bo": "ཆོས་དབྱིངས་རྣམ་ཀུན་མཆོག་ལྡན་བདེན་སྟོབས་ཀྱིས། །",
      "en": "And the power of the truth of the dharmadhātu endowed with all supreme aspects,",
      "en-trans": "chöying namkün chokden den tob kyi"
    },
    {
      "bo": "བདག་ཅག་བསམ་པ་དག་པས་གསོལ་བཏབ་དོན། །",
      "en": "May the purposes of our pure prayers be fulfilled",
      "en-trans": "dakchak sampa dakpé soltab dön"
    },
    {
      "bo": "ཇི་ལྟར་རེ་སྨོན་ཡིད་བཞིན་འགྲུབ་གྱུར་ཅིག །",
      "en": "And our hopes and aspirations accomplished just the same.",
      "en-trans": "jitar ré mön yizhin drub gyur chik"
    }
  ]
}