{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/train-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྨོན་ལམ།",
    "en": "Prayer of Aspiration1"
  },
  "text": [
    {
      "bo": "བླ་མ་ལ་ཕྱག་འཚལ་ལོ།",
      "en": "Homage to the Guru!",
      "en-trans": "lama la chaktsal lo"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་ཀུན་ན་བཞུགས་པ་ཡི། །",
      "en": "Oceanic victorious ones, residing throughout all",
      "en-trans": "chok chu dü sum kün na zhukpa yi"
    },
    {
      "bo": "རྩ་གསུམ་རྒྱལ་བ་རྒྱ་མཚོ་དགོངས་སུ་གསོལ། །",
      "en": "The ten directions and three times, consider me!",
      "en-trans": "tsa sum gyalwa gyatso gong su sol"
    },
    {
      "bo": "བདག་གི་ཇི་ལྟར་བརྩམ་པའི་སྨོན་ལམ་འདི། །",
      "en": "Grant your blessings so that this, my aspiration,",
      "en-trans": "dak gi jitar tsampé mönlam di"
    },
    {
      "bo": "གེགས་མེད་འགྲུབ་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "May be fulfilled just so, without impediment.",
      "en-trans": "gekmé drubpar jingyi lab tu sol"
    },
    {
      "bo": "ཐུབ་པའི་དབང་པོ་མགོན་པོ་འཇམ་དབྱངས་དང་། །",
      "en": "Lord of Sages, protector Mañjughoṣa,",
      "en-trans": "tubpé wangpo gönpo jamyang dang"
    },
    {
      "bo": "མ་ཕམ་ཕྱག་རྡོར་བྱམས་པ་ལ་སོགས་པ། །",
      "en": "Invincible Vajrapāṇi, Maitreya and the rest,",
      "en-trans": "ma pam chakdor jampa lasokpa"
    },
    {
      "bo": "རྒྱལ་དང་དེ་སྲས་སེམས་དཔའ་ཆེ་རྣམས་དང་། །",
      "en": "Victors and your heirs, great bodhisattvas,",
      "en-trans": "gyal dang dé sé sempa ché nam dang"
    },
    {
      "bo": "ས་ར་ཧ་དང་ཀླུ་སྒྲུབ་ཐོགས་མེད་སོགས། །",
      "en": "Saraha, Nāgārjuna, Asaṅga and the rest,",
      "en-trans": "sara ha dang ludrub tokmé sok"
    },
    {
      "bo": "འཛམ་གླིང་མཛེས་པའི་ཤིང་རྟ་ཆེ་རྣམས་དང་། །",
      "en": "Great pioneers who beautify this world,",
      "en-trans": "dzamling dzepé shingta ché nam dang"
    },
    {
      "bo": "པད་འབྱུང་བི་མ་བཻ་རོ་ཆོས་རྒྱལ་དང་། །",
      "en": "Padmākara, Vimala, Vairotsana, Dharma King,",
      "en-trans": "pejung bi ma bai ro chögyal dang"
    },
    {
      "bo": "རྨ་གཉག་སྐ་ལྕོགས་ཇོ་བོ་ཨ་ཏི་ཤ །",
      "en": "Ma,2Nyak,3, Kawa,4Chok,5Lord Atiśa,",
      "en-trans": "ma nyak ka chok jowo ati sha"
    },
    {
      "bo": "རིན་བཟང་རྔོག་ལོ་ཆེན་པོ་ལ་སོགས་པ། །",
      "en": "Rinchen Zangpo, great Ngok Lotsāwa and the rest—",
      "en-trans": "rin zang ngok lochen po lasokpa"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པ་རྒྱ་མཚོའི་ཚོགས་རྣམས་ནི། །",
      "en": "Ocean-like hosts of scholars and adepts",
      "en-trans": "khé dang drubpa gyatsö tsok nam ni"
    },
    {
      "bo": "འཕགས་བོད་རིམ་པར་བྱོན་པས་ལེགས་པར་གསུང་། །",
      "en": "Whose excellent words, as they appeared in India and Tibet,",
      "en-trans": "pak bö rimpar jönpé lekpar sung"
    },
    {
      "bo": "བཤད་དང་སྒྲུབ་པས་བཀྲལ་བར་མཛད་པ་ཡི། །",
      "en": "Were elucidated through teaching and through practice.",
      "en-trans": "shé dang drubpé tralwar dzepa yi"
    },
    {
      "bo": "མདོ་སྔགས་བཀའ་དང་བསྟན་བཅོས་མན་ངག་རྣམས། །",
      "en": "Though my own unerring study, contemplation and meditation",
      "en-trans": "do ngak ka dang tenchö mengak nam"
    },
    {
      "bo": "མ་ནོར་ཇི་བཞིན་ཐོས་བསམ་བསྒོམ་པ་ཡིས། །",
      "en": "On the Words of sūtra and mantra, the treatises and instructions,",
      "en-trans": "manor jizhin tö sam gompa yi"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་ལ་བྱ་བ་བྱེད་པར་ཤོག །",
      "en": "May I be of service to these teachings of the Victorious Ones.",
      "en-trans": "gyalwé ten la jawa jepar shok"
    },
    {
      "bo": "ངེས་འབྱུང་ཚུལ་ཁྲིམས་ཁང་བཟང་ཉམས་དགའ་བར། །",
      "en": "May the delightful mansion of renunciation and discipline",
      "en-trans": "ngejung tsultrim khang zang nyamgawar"
    },
    {
      "bo": "གཞན་ཕན་བྱང་ཆུབ་སེམས་ཀྱི་ནོར་གྱིས་ཕྱུག །",
      "en": "Be filled with the riches of altruistic concern and bodhicitta,",
      "en-trans": "zhenpen changchub sem kyi nor gyi chuk"
    },
    {
      "bo": "གསང་སྔགས་རྡོ་རྗེ་ཐེག་པའི་རྒྱལ་མཚན་བསྒྲེངས། །",
      "en": "The victory banner of secret mantra Vajrayāna raised aloft,",
      "en-trans": "sang ngak dorjé tekpé gyaltsen dreng"
    },
    {
      "bo": "སྡོམ་གསུམ་ལྡན་པས་ནོར་འཛིན་ཁྱབ་པར་ཤོག །",
      "en": "And the world throng with holders of the three sets of vows.",
      "en-trans": "dom sumden pé nordzin khyabpar shok"
    },
    {
      "bo": "ས་སྟེང་ཐམས་ཅད་དགེ་འདུན་སྡེ་གཉིས་ཀྱིས། །",
      "en": "As the twofold saṅgha covers the surface of the Earth,",
      "en-trans": "sateng tamché gendün dé nyi kyi"
    },
    {
      "bo": "གང་ཞིང་དེ་དག་ཀུན་ཀྱང་ཐུགས་མཐུན་པས། །",
      "en": "May all its members maintain perfect harmony,",
      "en-trans": "gang zhing dedak kün kyang tuktün pé"
    },
    {
      "bo": "སྤང་དང་ཀློགས་པའི་བྱ་བར་བརྩོན་པ་དང་། །",
      "en": "Exert themselves in the activities of renunciation and study,",
      "en-trans": "pang dang lokpé jawar tsönpa dang"
    },
    {
      "bo": "བདེ་གཤེགས་བསྟན་པ་ཕྱོགས་བཅུར་རྒྱས་པར་ཤོག །",
      "en": "And cause the Sugata’s teachings to flourish throughout the ten directions.",
      "en-trans": "deshek tenpa chok chur gyepar shok"
    },
    {
      "bo": "བསྟན་ལ་འཁུ་བའི་ལྷ་མིན་ཀླ་ཀློ་ཡི། །",
      "en": "May the savage thoughts and actions of asuras and barbarians,",
      "en-trans": "ten la khuwé lhamin lalo yi"
    },
    {
      "bo": "བསམ་སྦྱོར་ངན་པའི་གདུག་རྩུབ་རྒྱུན་ཆོད་ཅིང་། །",
      "en": "Who are hostile to the teachings, be brought to an end.",
      "en-trans": "samjor ngenpé duktsub gyün chö ching"
    },
    {
      "bo": "རིགས་ལྡན་དྲག་པོ་འཁོར་ལོ་ཆེན་པོ་ཡི། །",
      "en": "And through the force of mighty Raudracakrin’s compassion,",
      "en-trans": "rikden drakpo khorlo chenpo yi"
    },
    {
      "bo": "ཐུགས་རྗེའི་ཤུགས་ཀྱིས་གཡུལ་ལས་རྣམ་རྒྱལ་ཤོག །",
      "en": "May we attain perfect victory in the battle with evil forces.",
      "en-trans": "tukjé shuk kyi yul lé namgyal shok"
    },
    {
      "bo": "ཡངས་པའི་རྒྱལ་ཁམས་ཐམས་ཅད་དགེ་བཅུའི་འབྱོར། །",
      "en": "May all the countries of this vast world be rich with tenfold virtue,",
      "en-trans": "yangpé gyalkham tamché gé chü jor"
    },
    {
      "bo": "མི་མཐུན་དུས་ཀྱི་མུན་པ་ཀུན་ཞི་ནས། །",
      "en": "May all the disharmony and darkness of these times be pacified,",
      "en-trans": "mitün dü kyi münpa kün zhi né"
    },
    {
      "bo": "བདེ་དང་དགེ་ལེགས་བརྒྱ་ཕྲག་སྣང་བ་ཡི། །",
      "en": "And may the youthful sun of happiness dawn",
      "en-trans": "dé dang gelek gyatrak nangwa yi"
    },
    {
      "bo": "སྐྱིད་པའི་ཉི་མ་གཞོན་ནུ་འཆར་བར་ཤོག །",
      "en": "To shine its myriad rays of goodness and well-being.",
      "en-trans": "kyipé nyima zhönnu charwar shok"
    },
    {
      "bo": "བདག་ལ་འབྲེལ་ཐོགས་ཐམས་ཅད་སྡིག་སྒྲིབ་དང་། །",
      "en": "May all who are connected with me purify misdeeds and obscurations,",
      "en-trans": "dak la drel tok tamché dikdrib dang"
    },
    {
      "bo": "སྡུག་བསྔལ་ཞི་ནས་ཚེ་བསོད་ཡེ་ཤེས་རྒྱས། །",
      "en": "Pacify their suffering and increase longevity, merit and wisdom.",
      "en-trans": "dukngal zhi né tsesö yeshe gyé"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་གི་གོ་འཕང་ཐོབ་པ་དང་། །",
      "en": "May they attain the level of supreme awakening,",
      "en-trans": "changchub chok gi gopang tobpa dang"
    },
    {
      "bo": "ཟག་མེད་ཡོན་ཏན་རྒྱ་མཚོར་དབང་འབྱོར་ཤོག །",
      "en": "And gain mastery of an ocean of immaculate qualities.",
      "en-trans": "zakmé yönten gyatsor wangjor shok"
    }
  ]
}