{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/do-khyentse/truthful-words-sage",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༁ྃ༾༔ ཡང་གསང་མཁའ་འགྲོའི་ཐུགས་ཐིག་ལས༔ སྨོན་ལམ་དྲང་སྲོང་བདེན་ཚིག༔",
    "en": "An Aspiration Prayer from the Exceedingly Secret, Enlightened Heart-Essence of the Ḍākinī"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ཆོས་སྐུ་རྡོར་འཆང་ལོངས་སྐུ་རྡོ་རྗེ་སེམས༔",
      "en": "Dharmakāya Vajradhara, Saṃbhogakāya Vajrasattva,",
      "en-trans": "chöku dor chang longku dorjé sem"
    },
    {
      "bo": "སྤྲུལ་སྐུ་དྲང་སྲོང་དྲི་མེད་གསང་བའི་བདག༔",
      "en": "Nirmāṇakāya Stainless Sage Loktripāla,1",
      "en-trans": "tulku drangsong drimé sangwé dak"
    },
    {
      "bo": "དགའ་རབ་ཤྲཱི་སེང་པད་འབྱུང་བཱི་མ་ལ༔",
      "en": "Garab Dorjé, Śrī Siṃha, Padmākara, Vimalamitra,",
      "en-trans": "garab shri seng pejung bi ma la"
    },
    {
      "bo": "ཀུན་འདུས་རྩ་བའི་བླ་མ་ཐོད་ཕྲེང་རྩལ༔",
      "en": "The embodiment of all— root Guru Tötrengtsel",
      "en-trans": "kündü tsawé lama tötreng tsal"
    },
    {
      "bo": "རྩ་གསུམ་ལྷ་དང་དྲང་སྲོང་རིག་འཛིན་ཚོགས༔",
      "en": "The deities of the three roots and the assemblies of sages andvidyādharas,",
      "en-trans": "tsa sum lha dang drangsong rigdzin tsok"
    },
    {
      "bo": "བདག་གི་བདེན་ཚིག་འགྲུབ་པའི་དཔང་པོར་བཞུགས༔",
      "en": "Remain here as witness to the accomplishment of my truthful words.",
      "en-trans": "dak gi dentsik drubpé pangpor zhuk"
    },
    {
      "bo": "ཐོག་མར་འཁྲུལ་པ་ནས་བཟུང་ད་ལྟའི་བར༔",
      "en": "Since the dawn of delusion until this moment in time,",
      "en-trans": "tokmar trulpa né zung danté bar"
    },
    {
      "bo": "སྲིད་འདིར་བདག་ལུས་གྲངས་མེད་བླངས་གྱུར་ཀྱང༔",
      "en": "We have taken countless births in this [conditioned] existence.",
      "en-trans": "si dir dak lü drangmé lang gyur kyang"
    },
    {
      "bo": "སྟོང་ཉིད་བྱང་ཆུབ་སེམས་ཀྱིས་མ་ཟིན་པས༔",
      "en": "Yet, as we have not seized the mind of emptiness-bodhicitta,",
      "en-trans": "tongnyi changchub sem kyi mazinpé"
    },
    {
      "bo": "ད་དུང་ཆགས་སྡང་འཆིང་བ་དམ་པོས་བཅིང༔",
      "en": "We are fettered by the tight shackles of attachment and aversion and",
      "en-trans": "dadung chakdang chingwa dampö ching"
    },
    {
      "bo": "བདག་ནི་མ་རིག་འཐིབས་པོས་བསྒྲིབས་ལགས་ཀྱང་༔",
      "en": "Are still enveloped by the darkness of non-recognition.",
      "en-trans": "dak ni marik tibpö drib lak kyang"
    },
    {
      "bo": "བླ་མའི་ཐུགས་བསྐྱེད་དུས་སུ་སྨིན་པ་ཡིས༔",
      "en": "But by the timely ripening of the guru’s kind aspirations,",
      "en-trans": "lamé tukkyé dü su minpa yi"
    },
    {
      "bo": "བདག་ཅག་ཡང་གསང་རྡོ་རྗེའི་ལམ་དང་ཕྲད༔",
      "en": "We have met the exceedingly secret indestructible path.",
      "en-trans": "dakchak yangsang dorjé lam dang tré"
    },
    {
      "bo": "ད་ནི་ཆགས་སྡང་སྒྲོག་ལས་གྲོལ་བར་ཤོག༔",
      "en": "May we be freed from the restraints of attachment and aversion this very instant.",
      "en-trans": "dani chakdang drok lé drolwar shok"
    },
    {
      "bo": "གྲངས་མེད་སྐྱེ་བར་ལས་ཀྱིས་འབྲེལ་པ་ཡི༔",
      "en": "Connected by the karma of innumerable lives,",
      "en-trans": "drangmé kyewar lé kyi drelpa yi"
    },
    {
      "bo": "ཐབས་ལམ་རྣམ་པར་རོལ་པའི་བདེ་ཆེན་གྲོགས༔",
      "en": "Companions who enjoy great bliss on the path of skillful means,",
      "en-trans": "tab lam nampar rolpé dechen drok"
    },
    {
      "bo": "བྱམས་དང་བརྩེ་བས་བསྐྱངས་བའི་ཕ་མ་དང་༔",
      "en": "Mothers and fathers who nurture us with love and kindness,",
      "en-trans": "jam dang tsewé kyangwé pama dang"
    },
    {
      "bo": "དམ་ཚིག་གཅིག་ཏུ་འབྲེལ་བའི་རྡོ་རྗེའི་མཆེད༔",
      "en": "Vajra siblings who are connected by sharing tantric commitments,",
      "en-trans": "damtsik chik tu drelwé dorjé ché"
    },
    {
      "bo": "གཙོ་གྱུར་མཁའ་ཁྱབ་སེམས་ཅན་ཐམས་ཅད་ཀུན༔",
      "en": "Essentially, all sentient beings pervading space—",
      "en-trans": "tso gyur khakhyab semchen tamché kün"
    },
    {
      "bo": "བློ་ལྡོག་རྣམ་པ་བཞི་ཡིས་རྒྱུད་བསྐུལ་ནས༔",
      "en": "May we invigorate ourselves through the four [thoughts] that turn the mind [toward practice],",
      "en-trans": "lo dok nampa zhi yi gyü kul né"
    },
    {
      "bo": "རྩེ་གཅིག་དམ་པའི་ཆོས་ལ་བརྩོན་འགྲུས་བསྐྱེད༔",
      "en": "Develop diligence that is single-pointedly focused on the excellent teachings,",
      "en-trans": "tsechik dampé chö la tsöndrü kyé"
    },
    {
      "bo": "བསླབ་པ་གསུམ་གྱི་ཡོན་ཏན་མཐར་ཕྱིན་ཤོག༔",
      "en": "And perfect the qualities of the three trainings!",
      "en-trans": "labpa sum gyi yönten tarchin shok"
    },
    {
      "bo": "མ་ཧཱ་ཨ་ནུ་ཨ་ཏི་ཡོ་ག་ཡི༔",
      "en": "May the ripening blessings and four empowerments of",
      "en-trans": "maha anu atiyoga yi"
    },
    {
      "bo": "སྨིན་བྱེད་བྱིན་རླབས་དབང་བཞིས་རང་རྒྱུད་སྨིན༔",
      "en": "Mahā, Anu, and Ati yoga mature our mind-streams.",
      "en-trans": "min jé jinlab wang zhi ranggyü min"
    },
    {
      "bo": "བསྐྱེད་དང་རྫོགས་པའི་ལམ་མཆོག་མཐར་ཕྱིན་ནས༔",
      "en": "May we perfect the supreme paths of the creation and perfection stages,",
      "en-trans": "kyé dang dzokpé lam chok tarchin né"
    },
    {
      "bo": "མི་ཉམས་རྡོ་རྗེའི་དམ་ལ་གནས་པར་ཤོག༔",
      "en": "And uphold the vajra commitments without any degeneration.",
      "en-trans": "mi nyam dorjé dam la nepar shok"
    },
    {
      "bo": "བདེ་ཆེན་རང་ལུས་རྒྱལ་བའི་དཀྱིལ་འཁོར་རྫོགས༔",
      "en": "May we perfect the maṇḍala of the victors within our own bodies of great bliss—",
      "en-trans": "dechen rang lü gyalwé kyilkhor dzok"
    },
    {
      "bo": "རྩ་འབྱོངས་རླུང་ཆུན་ཐིག་ལེ་ལས་རུང་ཞིང་༔",
      "en": "Train the channels, control the energy, and make the essences pliable,",
      "en-trans": "tsa jong lung chün tiklé lé rung zhing"
    },
    {
      "bo": "དགའ་བཞིའི་ཡེ་ཤེས་སྟེར་བའི་མཛའ་ན་མོར་༔",
      "en": "Inseparably merging energy and mind through",
      "en-trans": "ga zhi yeshe terwé dza namor"
    },
    {
      "bo": "སྦྱོར་བས་རླུང་སེམས་དབྱེར་མེད་འདྲེས་པར་ཤོག༔",
      "en": "Uniting with the consort who bestows the primordial wisdom of the four joys.",
      "en-trans": "jorwé lungsem yermé drepar shok"
    },
    {
      "bo": "ལྟ་བ་འཕོ་མེད་ཆོས་སྐུའི་རྒྱལ་ས་ཟིན༔",
      "en": "May we seize the royal seat of the dharmakāya, the unshifting view,",
      "en-trans": "tawa pomé chökü gyalsa zin"
    },
    {
      "bo": "སྒོམ་པ་ཡེང་མེད་འཁྲུལ་གྲོལ་རེ་དོགས་བྲལ༔",
      "en": "Meditate without hope, fear, distraction, and delusion, and",
      "en-trans": "gompa yengmé trul drol redok dral"
    },
    {
      "bo": "སྤྱོད་པ་སྤང་བླང་བྲལ་བ་ཆོས་ཉིད་རྩལ༔",
      "en": "Conduct ourselves free of rejection and acceptance—",
      "en-trans": "chöpa panglang dralwa chönyi tsal"
    },
    {
      "bo": "ཁྲེགས་ཆོད་འབྲས་བུ་གཞི་ལ་རྫོགས་པར་ཤོག༔",
      "en": "Resulting in the power of suchness completelycutting throughto the ground.",
      "en-trans": "trekchö drebu zhi la dzokpar shok"
    },
    {
      "bo": "ཨ་ཏིའི་ལམ་གྱི་རྩ་བ་འོད་གསལ་གནད༔",
      "en": "May we perfect the fundamental points concerning luminosity on the path of Ati,",
      "en-trans": "ati lam gyi tsawa ösal né"
    },
    {
      "bo": "ཐོད་རྒལ་སྒྲོན་མ་བཞི་ཡི་ལམ་མཆོག་ལ༔",
      "en": "[The meditational stages of] fluctuation, attainment, habituation, stability, and completion",
      "en-trans": "tögal drönma zhi yi lam chok la"
    },
    {
      "bo": "གཡོ་ཐོབ་གོམས་བརྟན་མཐར་ཕྱིན་རྩལ་རྫོགས་ནས༔",
      "en": "Upon the supreme path of the four lamps ofleaping-over;",
      "en-trans": "yo tob gom ten tarchin tsal dzok né"
    },
    {
      "bo": "བློ་བྲལ་ཆོས་ཟད་ཆེན་པོར་སངས་རྒྱས་ཤོག༔",
      "en": "May we awaken to the great exhaustion of phenomena devoid of conceptualization.",
      "en-trans": "lodral chö zé chenpor sangye shok"
    },
    {
      "bo": "ལམ་ལ་མ་ཞུགས་འབྲེལ་པའི་སེམས་ཅན་ཀུན༔",
      "en": "May all connected sentient beings who have not embarked on the path",
      "en-trans": "lam la ma zhuk drelpé semchen kün"
    },
    {
      "bo": "བདག་གིས་དུས་གསུམ་བསགས་པའི་དགེ་ཚོགས་དང་༔",
      "en": "Awaken on the greatly glorious and blissful Mount Potala",
      "en-trans": "dak gi dü sum sakpé gé tsok dang"
    },
    {
      "bo": "རྗེས་འཛིན་སྨོན་ལམ་དྲག་པོའི་མཐུ་ནུས་ཀྱིས༔",
      "en": "Through the power of this caring and fervent aspiration prayer",
      "en-trans": "jedzin mönlam drakpö tu nü kyi"
    },
    {
      "bo": "བདེ་ཆེན་པོ་ཊ་དཔལ་རིར་སངས་རྒྱས་ཤོག༔",
      "en": "And my accumulated virtuous actions of the three times.",
      "en-trans": "dechen pota palrir sangye shok"
    },
    {
      "bo": "བདག་ཉིད་སྐྱེ་ཀུན་རྡོ་རྗེ་སློབ་དཔོན་དང་༔",
      "en": "May the vajra masters and vajra companions in all my lifetimes",
      "en-trans": "daknyi kyé kün dorjé lobpön dang"
    },
    {
      "bo": "ཟབ་ལམ་དགའ་བཞིས་འབྲེལ་པའི་རྡོ་རྗེའི་གྲོགས༔",
      "en": "Who are connected by the four joys of the profound path",
      "en-trans": "zablam ga zhi drelpé dorjé drok"
    },
    {
      "bo": "དམ་ཚིག་གཅིག་པའི་མཆེད་ལྕམ་རིག་འཛིན་ཚོགས༔",
      "en": "And the siblings and knowledge holders who share tantric commitments",
      "en-trans": "damtsik chikpé checham rigdzin tsok"
    },
    {
      "bo": "མི་འབྲལ་དཀྱིལ་འཁོར་གཅིག་ཏུ་འཁོད་པར་ཤོག༔",
      "en": "Never part but be established in the same maṇḍala.",
      "en-trans": "mindral kyilkhor chik tu khöpar shok"
    },
    {
      "bo": "སྣ་ཚོགས་ཐབས་ཀྱིས་སེམས་ཅན་དོན་བྱེད་ཅིང་༔",
      "en": "May the innumerable billions of emanations",
      "en-trans": "natsok tab kyi semchen dönjé ching"
    },
    {
      "bo": "སྤྲུལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་གྲངས་མེད་ཀྱིས༔",
      "en": "Who benefit sentient beings through various means",
      "en-trans": "trulpa jewa trak gya drangmé kyi"
    },
    {
      "bo": "རང་རང་སྐད་དུ་ཐབས་མཁས་ཆོས་སྟོན་ཅིང་༔",
      "en": "Skillfully teach the doctrine in their respective languages,",
      "en-trans": "rang rang ké du tabkhé chö tön ching"
    },
    {
      "bo": "འཁོར་བའི་རྒྱ་མཚོ་དོང་ནས་སྤྲུགས་པར་ཤོག༔",
      "en": "Dredging the depths of the ocean of cyclic existence.",
      "en-trans": "khorwé gyatso dong né trukpar shok"
    },
    {
      "bo": "མཐར་ཐུག་ཡབ་ཡུམ་ཐབས་ཤེས་མཆེད་ལྕམ་སྲས༔",
      "en": "May the children of the father and mother— method and wisdom",
      "en-trans": "tartuk yabyum tabshé checham sé"
    },
    {
      "bo": "ལོངས་སྐུ་ཆེན་པོའི་ཉམས་ལེན་མཐར་ཕྱིན་ནས༔",
      "en": "Ultimately perfect the practice of the great saṃbhogakāya.",
      "en-trans": "longku chenpö nyamlen tarchin né"
    },
    {
      "bo": "ཆོས་དབྱིངས་འོག་མིན་གཞོན་ནུ་བུམ་སྐུའི་ཀློང་༔",
      "en": "May they be liberated as a single maṇḍala",
      "en-trans": "chöying womin zhönnu bumkü long"
    },
    {
      "bo": "ཚོམ་བུ་གཅིག་ཏུ་དབྱེར་མེད་གྲོལ་བར་ཤོག༔",
      "en": "In the Akaniṣṭha space of phenomena, the expanse of the youthful vase body.",
      "en-trans": "tsombu chik tu yermé drolwar shok"
    },
    {
      "bo": "ཆོས་ཉིད་རང་བཞིན་རྣམ་པར་དག་པ་དང་༔",
      "en": "May this aspirational prayer of truthful words be accomplished without obstruction,",
      "en-trans": "chönyi rangzhin nampar dakpa dang"
    },
    {
      "bo": "ཆོས་ཅན་རྒྱུ་འབྲས་བསླུ་བ་མེད་པའི་མཐུས༔",
      "en": "And the exceedingly secret teachings never wane but flourish far and wide",
      "en-trans": "chöchen gyundré luwa mepé tü"
    },
    {
      "bo": "བདེན་ཚིག་སྨོན་ལམ་གེགས་མེད་འགྲུབ་གྱུར་ནས༔",
      "en": "Due to naturally pristine suchness and",
      "en-trans": "dentsik mönlam gekmé drub gyur né"
    },
    {
      "bo": "ཡང་གསང་བསྟན་པ་མི་ནུབ་མཐར་རྒྱས་ཤོག༔",
      "en": "The infallible power of the causes and results of [conditioned] phenomena.",
      "en-trans": "yangsang tenpa mi nub tar gyé shok"
    },
    {
      "bo": "༈ ཆོས་ཚུལ་འདི་ཡང་ཉི་ཟླའི་དཀྱིལ་འཁོར་བཞིན། །",
      "en": "May this teaching like the maṇḍala of the sun and moon",
      "en-trans": "chö tsul di yang nyidé kyilkhor zhin"
    },
    {
      "bo": "ཕྱོགས་ཀྱི་ཐ་གྲུ་ཀུན་ཏུ་གྲགས་གྱུར་ཅིང་། །",
      "en": "Be renowned throughout every region,",
      "en-trans": "chok kyi tadru küntu drak gyur ching"
    },
    {
      "bo": "བློ་གྲོས་སྣང་བ་རབ་ཏུ་རྒྱས་བྱས་ནས། །",
      "en": "Cause the light of intelligence to fully expand, and",
      "en-trans": "lodrö nangwa rabtu gyé jé né"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་པ་དར་ཞིང་རྒྱས་པར་ཤོག །",
      "en": "The teachings of the buddhas to flourish and spread.",
      "en-trans": "sangye tenpa dar zhing gyepar shok"
    },
    {
      "bo": "༈ ངོ་བོ་འགྱུར་མེད་རང་བྱུང་རྡོ་རྗེའི་སྐུ། །",
      "en": "May the teachings of the three vajras flourish and spread:",
      "en-trans": "ngowo gyurmé rangjung dorjé ku"
    },
    {
      "bo": "རང་གདངས་འགག་མེད་བྱང་ཆུབ་རྡོ་རྗེའི་གསུང་། །",
      "en": "The vajra body of the natural, unchanging essence,",
      "en-trans": "rang dang gakmé changchub dorjé sung"
    },
    {
      "bo": "སྤྲོས་བྲལ་དབུ་མ་འཇའ་ལུས་རྡོ་རྗེའི་ཐུགས། །",
      "en": "The vajra speech of the unimpeded, natural enlightened expressions,",
      "en-trans": "trödral uma jalü dorjé tuk"
    },
    {
      "bo": "རྡོ་རྗེ་གསུམ་གྱི་བསྟན་པ་དར་རྒྱས་ཤོག །",
      "en": "The vajra mind of the rainbow body, the middle way devoid of elaborations.",
      "en-trans": "dorjé sum gyi tenpa dargyé shok"
    }
  ]
}