{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/vajra-seat-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ས་ལ་སྤྱོད་པའི་འོག་མིན་རྡོ་རྗེ་གདན་དུ་སྐྱེ་བའི་སྨོན་ལམ།",
    "en": "Aspiration to Be Reborn at the Vajra Seat (Bodhgayā), Akaniṣṭha on Earth"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "འཛམ་གླིང་ས་ཡི་ལྟེ་བ་རྡོ་རྗེ་གདན།  །",
      "en": "The Vajra Seat at the heart of this world of Jambudvīpa,",
      "en-trans": "dzamling sa yi tewa dorjé den"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་མངོན་པར་འཚང་རྒྱ་དང་།  །",
      "en": "A realm where the victorious buddhas of the three times awaken,",
      "en-trans": "dü sum gyalwa ngönpar tsang gya dang"
    },
    {
      "bo": "བདུད་བཏུལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཞིང་།  །",
      "en": "Conquer Māra and turn the Wheel of Dharma—",
      "en-trans": "dü tul chökyi khorlo korwé zhing"
    },
    {
      "bo": "གནས་མཆོག་ཁྱད་པར་ཅན་དུ་སྐྱེ་བར་ཤོག  །",
      "en": "There, in that extraordinarily sublime place, may I take birth.",
      "en-trans": "né chok khyepar chen du kyewar shok"
    },
    {
      "bo": "བསྐལ་བཟང་ཉི་མ་ཐུབ་དབང་སྟོབས་བཅུའི་བདག  །",
      "en": "Sun of the Fortunate Aeon, lord of sages, master of the ten powers,",
      "en-trans": "kalzang nyima tubwang tob chü dak"
    },
    {
      "bo": "སངས་རྒྱས་བྱང་སེམས་ཉན་རང་སོ་སྐྱེ་སོགས།  །",
      "en": "Surrounded by the vast, oceanic gatherings of your retinue—",
      "en-trans": "sangye changsem nyenrang sokyé sok"
    },
    {
      "bo": "འཁོར་ཚོགས་རྒྱ་མཚོས་ཡོངས་སུ་བསྐོར་བ་ཡི།  །",
      "en": "Buddhas, bodhisattvas, śrāvakas, pratyekabuddhas and ordinary beings—",
      "en-trans": "khor tsok gyatsö yongsu korwa yi"
    },
    {
      "bo": "ཤཱཀྱའི་རྒྱལ་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "King of the Śākyas, at your feet I pray.",
      "en-trans": "shakyé gyalpö zhab la solwa deb"
    },
    {
      "bo": "བདེ་གཤེགས་བཞུགས་དང་འཆག་དང་བཞེངས་པ་སོགས།  །",
      "en": "To all those places where the Bliss-gone Buddha dwelled,",
      "en-trans": "deshek zhuk dang chak dang zhengpa sok"
    },
    {
      "bo": "གང་དུ་མཛད་པའི་གནས་རྣམས་ཐམས་ཅད་ལའང་།  །",
      "en": "Where he sat, where he walked, and where he stood,",
      "en-trans": "gangdu dzepé né nam tamché la’ang"
    },
    {
      "bo": "སྒོ་གསུམ་གུས་པ་ཆེན་པོས་ཕྱག་འཚལ་ཞིང་།  །",
      "en": "I pay homage with utmost respect of body, speech and mind,",
      "en-trans": "go sum güpa chenpö chaktsal zhing"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་བ་འདེབས་སོ་བྱིན་གྱིས་རློབས།  །",
      "en": "And offer this heartfelt prayer: inspire me with your blessings!",
      "en-trans": "nying né solwa deb so jingyi lob"
    },
    {
      "bo": "ནོར་བུ་ཆུ་ཤེལ་ལྟར་དཀར་གནྡྷོ་ལ།  །",
      "en": "To thegandholashrine, white as a water-crystal jewel,",
      "en-trans": "norbu chushel tar kar gandho la"
    },
    {
      "bo": "བརྒྱ་བྱིན་འཕྲུལ་གྱིས་བཟོས་པའི་མཆོད་རྟེན་ནི།  །",
      "en": "An offering stūpa which Indra magically created,",
      "en-trans": "gyajin trul gyi zöpé chörten ni"
    },
    {
      "bo": "སྟེང་དང་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡི།  །",
      "en": "And which is filled to overflowing above and below",
      "en-trans": "teng dang oktu dezhin shekpa yi"
    },
    {
      "bo": "རིང་བསྲེལ་ཕྱུར་བུར་གཏམས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "With the precious relics of tathāgatas, I pray.",
      "en-trans": "ringsel churbur tam la solwa deb"
    },
    {
      "bo": "ཆོས་བདུན་ལྡན་པའི་རྡོ་རྗེའི་ས་གཞི་ནི།  །",
      "en": "To the foundational ground with its seven vajra qualities,",
      "en-trans": "chödün denpé dorjé sa zhi ni"
    },
    {
      "bo": "བསྐལ་པ་འཇིག་ཀྱང་བཤིག་པར་མི་ནུས་ཤིང་།  །",
      "en": "Indestructible even at the termination of an age,",
      "en-trans": "kalpa jik kyang shikpar mi nü shing"
    },
    {
      "bo": "རྒྱལ་བའི་ཐུགས་ཀྱི་ཆོས་དབྱིངས་རྡོ་རྗེ་ཆེ།  །",
      "en": "Where the Buddha's dharmadhātu wisdom mind",
      "en-trans": "gyalwé tuk kyi chöying dorjé ché"
    },
    {
      "bo": "རྒྱ་གྲམ་གདན་དུ་བཏིང་ལ་གསོལ་བ་འདེབས།  །",
      "en": "Is represented in the great crossed-vajra throne, I pray.",
      "en-trans": "gyadram den du ting la solwa deb"
    },
    {
      "bo": "སྟོན་པའི་ཞལ་སྐྱིན་བྱང་ཆུབ་ཆེན་པོའི་སྐུ།  །",
      "en": "The teacher's representative, the Mahābodhi image,",
      "en-trans": "tönpé zhalkyin changchub chenpö ku"
    },
    {
      "bo": "ཐུབ་དབང་དངོས་སུ་བཞུགས་དང་ཁྱད་མེད་པ།  །",
      "en": "Which is no different from the Lord of Sages in person,",
      "en-trans": "tubwang ngö su zhuk dang khyé mepa"
    },
    {
      "bo": "སེམས་ཅན་བསོད་ནམས་མོས་པ་ལྟར་སྣང་བ།  །",
      "en": "And appears according to beings' merit and appreciation.",
      "en-trans": "semchen sönam möpa tar nangwa"
    },
    {
      "bo": "ངོ་མཚར་མཐོང་གྲོལ་ཆེན་པོར་གསོལ་བ་འདེབས།  །",
      "en": "To this wondrous, great liberator-upon-sight, I pray.",
      "en-trans": "ngotsar tongdrol chenpor solwa deb"
    },
    {
      "bo": "བྷོ་དྷི་བྲྀཀྵ་སྨོན་ལམ་མཐུས་གྲུབ་ཅིང་།  །",
      "en": "To thebodhivṛkṣa,1created through the power of aspiration,",
      "en-trans": "bhodhi briksha mönlam tü drub ching"
    },
    {
      "bo": "རིན་ཆེན་སྣ་ཚོགས་ལྗོན་ཤིང་འབྲས་བུར་ལྡན།  །",
      "en": "Like a magical fruit-bearing tree of varied jewels,",
      "en-trans": "rinchen natsok jönshing drebur den"
    },
    {
      "bo": "གྲིབ་མ་ཕོག་དང་རླུང་གི་རྫི་ཕྱོགས་ཀྱིས།  །",
      "en": "Which plants the seed of liberation in those it shades",
      "en-trans": "dribma pok dang lung gi dzi chok kyi"
    },
    {
      "bo": "ཐར་པའི་ས་བོན་འདེབས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "And those touched by the same gust of wind, I pray.",
      "en-trans": "tarpé sabön deb la solwa deb"
    },
    {
      "bo": "ཕྱོགས་མཚམས་ཀུན་ཏུ་བྱང་ཆུབ་ལྗོན་པ་དང་།  །",
      "en": "To this place where bodhi trees abound in all directions,",
      "en-trans": "choktsam küntu changchub jönpa dang"
    },
    {
      "bo": "སྐུ་གསུང་ཐུགས་ཀྱི་རྟེན་མཆོག་བགྲང་ལས་འདས།  །",
      "en": "With its countless sublime representations of enlightened body, speech and mind,",
      "en-trans": "ku sung tuk kyi ten chok drang lé dé"
    },
    {
      "bo": "རྡོ་རྗེའི་ས་འཛིན་ཕྱུར་བུར་གཏམས་པ་ཡི།  །",
      "en": "To this magically emanated celestial palace,",
      "en-trans": "dorjé sa dzin chur bur tampa yi"
    },
    {
      "bo": "སྤྲུལ་པའི་གཞལ་མེད་ཁང་ལ་གསོལ་བ་འདེབས།  །",
      "en": "Thronged with holders of vajra realization, I pray.",
      "en-trans": "trulpé zhalmé khang la solwa deb"
    },
    {
      "bo": "རིན་ཆེན་སྣ་ཚོགས་ཨ་མོ་ནིརྐ་ཡི།  །",
      "en": "To this place arrayed with precious stones andamonika,",
      "en-trans": "rinchen natsok amonika yi"
    },
    {
      "bo": "ས་གཞི་བསྟར་ཞིང་མེ་ཏོག་ཡིད་འོང་དང་།  །",
      "en": "Where charming flowers are arranged in rows,",
      "en-trans": "sa zhi tar zhing metok yi ong dang"
    },
    {
      "bo": "ཕྱོགས་མཚམས་རི་བོ་སྨན་སྤོས་རྩི་ཤིང་རྒྱས།  །",
      "en": "And hills of fragrant medicinal plants lie all around,",
      "en-trans": "choktsam riwo men pö tsishing gyé"
    },
    {
      "bo": "རིན་ཆེན་བྲག་རིས་མཛེས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "Enhanced by cliffs of jewel-like rock, I pray.",
      "en-trans": "rinchen drakri dzé la solwa deb"
    },
    {
      "bo": "ལྷ་ཡི་ཆུ་བོ་གངྒཱ་ཡ་མུ་ན།  །",
      "en": "To this blissful, sweet, expansive place,",
      "en-trans": "lha yi chuwo gangga yamu na"
    },
    {
      "bo": "ནེ་རེཉྫ་སོགས་མཆོད་ཡོན་ཕྲེང་བའི་རྒྱུན།  །",
      "en": "Where a heavenly river with its stream of offering waters",
      "en-trans": "né rendza sok chöyön trengwé gyün"
    },
    {
      "bo": "ཆོས་ཀྱི་སྒྲ་ཚིག་དར་དིར་ལྷུང་ལྷུང་སྒྲོགས།  །",
      "en": "From the Gaṅgā, Yamunā and Nairañjanā and more",
      "en-trans": "chökyi dra tsik dar dir lhung lhung drok"
    },
    {
      "bo": "བདེ་འཇམ་ཡངས་པའི་ཞིང་དེར་གསོལ་བ་འདེབས།  །",
      "en": "Burbles and murmurs with the sound of Dharma, I pray.",
      "en-trans": "dé jam yangpé zhing der solwa deb"
    },
    {
      "bo": "སངས་རྒྱས་བྱང་སེམས་ཉན་རང་རིག་འཛིན་དང་།  །",
      "en": "Where buddhas, bodhisattvas, śrāvakas, pratyekabuddhas, vidyādharas,",
      "en-trans": "sangye changsem nyenrang rigdzin dang"
    },
    {
      "bo": "དཔའ་བོ་མཁའ་འགྲོ་སྤྲིན་ལྟར་གཏིབས་པ་ཡིས།  །",
      "en": "And vīras and ḍākinīs all gather like clouds",
      "en-trans": "pawo khandro trin tar tibpa yi"
    },
    {
      "bo": "བསྟོད་དབྱངས་སྒྲོགས་དང་མཆོད་པའི་ཆར་ཆེན་འབེབས།  །",
      "en": "To sing praises and pour down vast showers of offering—",
      "en-trans": "tö yang drok dang chöpé char chen beb"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བས་བསྔགས་དེར་གསོལ་བ་འདེབས།  །",
      "en": "To this place extolled by the victorious ones of the three times, I pray.",
      "en-trans": "dü sum gyalwé ngak der solwa deb"
    },
    {
      "bo": "དེ་ལྟར་ཞིང་གི་མཆོག་གྱུར་དམ་པ་འདིར།  །",
      "en": "In this most sacred, most sublime of locations,",
      "en-trans": "detar zhing gi chokgyur dampa dir"
    },
    {
      "bo": "མ་འོངས་སངས་རྒྱས་བྱམས་ཆེན་ལ་སོགས་པའི།  །",
      "en": "May I take birth, first among the retinue of future buddhas,",
      "en-trans": "ma ong sangye jamchen lasokpé"
    },
    {
      "bo": "འཁོར་གྱི་ཐོག་མར་སྐྱེས་ཤིང་ལུང་བསྟན་ནོས།  །",
      "en": "Maitreya and the rest, to receive their prophecies",
      "en-trans": "khor gyi tokmar kyé shing lungten nö"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པ་སྤྱད་གྱུར་ཅིག  །",
      "en": "And carry out the activity of supreme awakening.",
      "en-trans": "changchub chok gi chöpa ché gyur chik"
    },
    {
      "bo": "དངོས་འབྱོར་ཡིད་སྤྲུལ་མཆོད་སྤྲིན་རྒྱ་མཚོས་མཆོད།  །",
      "en": "I offer vast oceanic clouds of real and imagined gifts,",
      "en-trans": "ngöjor yitrul chötrin gyatsö chö"
    },
    {
      "bo": "སྡིག་ལྷུང་ཀུན་བཤགས་དགེ་ལ་རྗེས་ཡི་རངས།  །",
      "en": "Confess all misdeeds and downfalls, rejoice in virtue,",
      "en-trans": "dik lhung kün shak gé la jé yirang"
    },
    {
      "bo": "ཆོས་འཁོར་བསྐུལ་ཞིང་མྱ་ངན་མི་འདའ་གསོལ།  །",
      "en": "Request the turning of the Dharma Wheel, plead against the passing into nirvāṇa,",
      "en-trans": "chökhor kul zhing nya ngen mi da sol"
    },
    {
      "bo": "དགེ་ཚོགས་འགྲོ་བ་བྱང་ཆུབ་ཕྱིར་བསྔོའོ།  །",
      "en": "And dedicate all amassed virtue towards the awakening of beings.",
      "en-trans": "gé tsok drowa changchub chir ngo o"
    },
    {
      "bo": "དེང་ནས་བཟུང་སྟེ་ཚེ་རབས་ཐམས་ཅད་དུ།  །",
      "en": "From this moment on, throughout all my future lives,",
      "en-trans": "deng né zung té tserab tamché du"
    },
    {
      "bo": "སྟོན་པ་ཤཱཀྱའི་རྒྱལ་པོའི་ཞབས་བསྙེན་ཅིང་།  །",
      "en": "May I always serve the teacher, King of the Śākyas.",
      "en-trans": "tönpa shakyé gyalpö zhab nyen ching"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་གསལ་བར་བྱེད་པ་དང་།  །",
      "en": "May I gain the power to illuminate the precious Dharma",
      "en-trans": "tenpa rinchen salwar jepa dang"
    },
    {
      "bo": "བསྟན་ལ་གནོད་རྣམས་འདུལ་བའི་མཐུ་ཐོབ་ཤོག  །",
      "en": "And subjugate all who would harm the teachings.",
      "en-trans": "ten la nö nam dulwé tu tob shok"
    },
    {
      "bo": "བར་ཆད་བདུད་ཀྱིས་ནམ་ཡང་མི་ཚུགས་ཤིང་།  །",
      "en": "May I never fall prey to obstacles or demons,",
      "en-trans": "barché dü kyi namyang mitsuk shing"
    },
    {
      "bo": "ཚེ་དང་བསོད་ནམས་བློ་གྲོས་རབ་འཕེལ་ཏེ།  །",
      "en": "May my lifespan, merit and intelligence increase,",
      "en-trans": "tsé dang sönam lodrö rab pel té"
    },
    {
      "bo": "མཁྱེན་གཉིས་ཡེ་ཤེས་སྣང་བ་རྒྱས་པ་དང་།  །",
      "en": "And through the expansive light of twofold wisdom,",
      "en-trans": "khyen nyi yeshe nangwa gyepa dang"
    },
    {
      "bo": "གཞན་ལ་ཕན་པ་མཐའ་ཡས་འབྱུང་བར་ཤོག  །",
      "en": "May I bring benefit to others in limitless ways.",
      "en-trans": "zhen la penpa tayé jungwar shok"
    },
    {
      "bo": "ནམ་ཞིག་རྡོ་རྗེ་གདན་དུ་མངོན་བྱང་ཆུབ།  །",
      "en": "When the time comes for me to awaken at the Vajra Seat,",
      "en-trans": "namzhik dorjé den du ngön jang chub"
    },
    {
      "bo": "སངས་རྒྱས་མཛད་པ་མ་ལུས་ཡོངས་རྫོགས་ཤིང་།  །",
      "en": "May I accomplish all the buddhas' deeds without exception,",
      "en-trans": "sangye dzepa malü yongdzok shing"
    },
    {
      "bo": "ཆོས་ཀྱི་འཁོར་ལོ་རྒྱ་ཆེན་རབ་བསྐོར་ནས།  །",
      "en": "Perfectly turn the Wheel of Dharma on an immense scale,",
      "en-trans": "chökyi khorlo gyachen rab kor né"
    },
    {
      "bo": "ནམ་མཁའ་མཉམ་པའི་འགྲོ་བ་རབ་སྒྲོལ་ཤོག  །",
      "en": "And liberate all beings, as infinite as space in number.",
      "en-trans": "namkha nyampé drowa rab drol shok"
    }
  ]
}