{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/vidyadharas-words-of-truth",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་པ་ཆེན་པོ་ཀློང་ཆེན་སྙིང་ཐིག་གི་རྩ་བ་གསུམ་གྱི་ལམ་རིམ་དང་འབྲེལ་བའི་སྨོན་ལམ་རིག་པ་འཛིན་པའི་བདེན་ཚིག",
    "en": "An Aspiration Connected with the Stages of the Path of the Three Roots, from the Heart-Essence of the Vast Expanse"
  },
  "text": [
    {
      "bo": "ཀུན་བཟང་རྡོ་རྗེ་སེམས་དཔའ་དགའ་རབ་རྗེ། །",
      "en": "Samantabhadra, Vajrasattva, Garab Dorje,",
      "en-trans": "kunzang dorjé sempa garab jé"
    },
    {
      "bo": "རབ་འབྱམས་རྒྱལ་བའི་སྤྱི་གཟུགས་པདྨ་འབྱུང་། །",
      "en": "Padmākara—embodiment of infinite buddhas,",
      "en-trans": "rabjam gyalwé chizuk pema jung"
    },
    {
      "bo": "རྗེ་འབངས་གྲོགས་གསུམ་ཀུན་མཁྱེན་ཡབ་སྲས་སོགས། །",
      "en": "King, subject and companion,1Omniscient Father and Son,2",
      "en-trans": "jebang drok sum künkhyen yabsé sok"
    },
    {
      "bo": "བཀའ་བབ་བརྒྱུད་གསུམ་རིག་འཛིན་དགོངས་སུ་གསོལ། །",
      "en": "And vidyādharas of the three lineages of transmission—pray grant me your attention!",
      "en-trans": "kabab gyü sum rigdzin gong su sol"
    },
    {
      "bo": "དགོངས་བརྒྱུད་ཡེ་ཤེས་མངོན་སྩོལ་བླ་མ་རྗེའི། །",
      "en": "Lordly gurus, who confer wisdom’s direct transmission",
      "en-trans": "gonggyü yeshe ngöntsol lama jé"
    },
    {
      "bo": "གསང་གསུམ་སྒྱུ་འཕྲུལ་རྡོ་རྗེ་བཀོད་པའི་སྤྲིན། །",
      "en": "And whose three secrets are the billowing arrays of the Illusory Net,",
      "en-trans": "sang sum gyutrul dorjé köpé trin"
    },
    {
      "bo": "དཔལ་ཆེན་བཀའ་འདུས་ཞི་ཁྲོ་རབ་འབྱམས་དང་། །",
      "en": "Infinite peaceful and wrathful deities of the Collected Teachings of the Awesome Ones,",
      "en-trans": "palchen kadü zhitro rabjam dang"
    },
    {
      "bo": "མཁར་ཆེན་ཌཱ་ཀིའི་དབང་ཕྱུག་དགོངས་སུ་གསོལ། །",
      "en": "And Kharchen, mistress of ḍākinīs, pray grant me your attention!",
      "en-trans": "khar chen daki wangchuk gong su sol"
    },
    {
      "bo": "གདོད་ནས་ལྷུན་གྲུབ་གཉུག་མའི་རྡོ་རྗེ་གསུམ། །",
      "en": "May the three vajras of my original state, spontaneously present from the very beginning,",
      "en-trans": "döné lhündrub nyukmé dorjé sum"
    },
    {
      "bo": "རྒྱལ་ཐབས་སྤྱི་བླུག་དབང་བཞིའི་སྨིན་བྱས་པས། །",
      "en": "Be matured by the four empowerments of the vase that confers majesty;",
      "en-trans": "gyaltab chiluk wang zhi min jepé"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྣམ་བཞིའི་ལམ་ལ་འཇུག་ནུས་པའི། །",
      "en": "May I thereby gain the ability to enter the four maṇḍalas",
      "en-trans": "kyilkhor nam zhi lam la juk nüpé"
    },
    {
      "bo": "རྡོ་རྗེའི་རིགས་ཀྱི་སྐལ་པ་མཆོག་འགྲུབ་ཤོག །",
      "en": "And accomplish the supreme fortune of the vajra family.",
      "en-trans": "dorjé rik kyi kalpa chok drub shok"
    },
    {
      "bo": "སྲིད་ལས་ངེས་འབྱུང་སྔོན་འགྲོའི་ལམ་མཐར་སོན། །",
      "en": "May I perfect the path of the preliminaries by renouncing existence,",
      "en-trans": "si lé ngejung ngöndrö lam tar sön"
    },
    {
      "bo": "གཞན་ཕན་བློ་ཡི་ཐེག་ཆེན་ལམ་རྩ་ཚུགས། །",
      "en": "Establish the foundation of the Great Vehicle through altruism,",
      "en-trans": "zhenpen lo yi tekchen lam tsa tsuk"
    },
    {
      "bo": "བསགས་དང་སྦྱངས་བས་རྒྱུད་དག་ཁྱད་པར་དུ། །",
      "en": "Cleanse my mind by means of accumulation and purification",
      "en-trans": "sak dang jangwé gyü dak khyepardu"
    },
    {
      "bo": "མོས་གུས་མཐར་ཕྱིན་ཐུགས་ཡིད་གཅིག་འདྲེས་ཤོག། །",
      "en": "And, with consummate devotion in particular, cause my mind and the guru’s wisdom to merge as one.",
      "en-trans": "mögü tarchin tuk yi chik dré shok"
    },
    {
      "bo": "ཏིང་འཛིན་ལྔ་དང་གབ་པ་རྣམ་བཞི་ཡིས། །",
      "en": "Through the five samādhis and four hidden instructions,",
      "en-trans": "tingdzin nga dang gabpa nam zhi yi"
    },
    {
      "bo": "སྣོད་བཅུད་བླ་མར་ཤེས་པའི་བསྐྱེད་རིམ་དང་། །",
      "en": "The generation phase that perceives the world and inhabitants as the guru",
      "en-trans": "nöchü lamar shepé kyerim dang"
    },
    {
      "bo": "ཐུགས་ཡིད་གཅིག་འདྲེས་ཟབ་མོའི་རྫོགས་རིམ་གྱིས། །",
      "en": "And the profound perfection phase whereby mind and wisdom merge as one,",
      "en-trans": "tuk yi chik dré zabmö dzokrim gyi"
    },
    {
      "bo": "གཡོ་ཐོབ་གོམས་བརྟན་ཉམས་ལྔ་མཐར་ཕྱིན་ཤོག །",
      "en": "May I master the five experiences of movement, attainment, familiarity, stability and perfection.",
      "en-trans": "yo tob gom ten nyam nga tarchin shok"
    },
    {
      "bo": "སྙན་བརྒྱུད་ཡིད་བཞིན་ནོར་བུའི་རྫོགས་རིམ་དང་། །",
      "en": "Through the perfection stage of theWish-Fulfilling Jewel of the Oral Lineage",
      "en-trans": "nyengyü yizhin norbü dzokrim dang"
    },
    {
      "bo": "མ་བསྒོམ་སངས་རྒྱས་ཕོ་ཉའི་ལམ་མྱུར་གྱིས། །",
      "en": "And the swift path of the messenger-consort known asBuddhahood Without Meditation,",
      "en-trans": "ma gom sangye ponyé lam nyur gyi"
    },
    {
      "bo": "རིག་འཛིན་རྣམ་བཞིའི་གོ་འཕང་བདེ་བླག་གྲུབ། །",
      "en": "May I easily attain the four stages of the vidyādharas",
      "en-trans": "rigdzin nam zhi gopang delak drub"
    },
    {
      "bo": "ས་བཅུ་ལམ་ལྔའི་ཡོན་ཏན་མཐར་སོན་ཤོག །",
      "en": "And perfect the qualities of the ten stages and five paths.",
      "en-trans": "sa chu lam ngé yönten tar sön shok"
    },
    {
      "bo": "ཁྱད་པར་ཐེག་མཆོག་ཤིན་ཏུ་རྣལ་འབྱོར་གྱི། །",
      "en": "In particular, by the power of purifying body, speech and mind",
      "en-trans": "khyepar tek chok shintu naljor gyi"
    },
    {
      "bo": "ཕྱི་ནང་རུ་ཤན་སྒོ་གསུམ་སྦྱངས་བའི་མཐུས། །",
      "en": "Through the Supreme Vehicle’s Atiyoga practices ofseparating3saṃsāra and nirvāṇa on both outer and inner levels",
      "en-trans": "chinang rushen go sum jangwé tü"
    },
    {
      "bo": "སེམས་རིག་ཤན་འབྱེད་ཅོག་བཞག་བཞིའི་ལྟ་བ། །",
      "en": "May Idistinguish4mind from awareness, abide in the view by means of thefour ways of leaving things as they are,5",
      "en-trans": "sem rik shenjé chok zhak zhi tawa"
    },
    {
      "bo": "འོད་གསལ་སྒྲོན་དྲུག་སྒོམས་པས་བོགས་དབྱུང་སྟེ། །",
      "en": "Enhance my experience by meditating on the six lamps of luminosity,",
      "en-trans": "ösal drön druk gompé bokyung té"
    },
    {
      "bo": "འོད་གསལ་སྣང་བཞིའི་ཉམས་ལེན་མཐར་སོན་ནས། །",
      "en": "Perfect the practice of the four visions of luminosity",
      "en-trans": "ösal nang zhi nyamlen tar sön né"
    },
    {
      "bo": "འཇའ་ལུས་རྡོ་རྗེའི་གོ་འཕང་མངོན་གྱུར་ཤོག །",
      "en": "And actualize the stage of the indestructible rainbow body!",
      "en-trans": "jalü dorjé gopang ngöngyur shok"
    },
    {
      "bo": "མཐོང་བའི་ཆོས་ལ་གྲོལ་བའི་སྐལ་དམན་ན། །",
      "en": "If I lack the fortune to be liberated in this life",
      "en-trans": "tongwé chö la drolwé kal men na"
    },
    {
      "bo": "བར་དོ་གསུམ་དུ་གཞི་ཀློང་གྲོལ་བ་དང་། །",
      "en": "May I be freed within the expanse of the ground in any of the three intermediate states,",
      "en-trans": "bardo sum du zhi long drolwa dang"
    },
    {
      "bo": "རང་བཞིན་སྤྲུལ་པའི་ཞིང་བགྲོད་ཕྲིན་ལས་མཐུས། །",
      "en": "Arrive at a natural nirmāṇakāya pure realm, and, through the force of my enlightened activity,",
      "en-trans": "rangzhin trulpé zhing drö trinlé tü"
    },
    {
      "bo": "འགྲོ་ཀུན་གདོད་མའི་ས་ལ་སྐྱེལ་ནུས་ཤོག །",
      "en": "Be able to deliver all beings to the primordial state!",
      "en-trans": "dro kün dömé sa la kyel nü shok"
    }
  ]
}