{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/wisdoms-melody",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དབུ་ཕྱག་རྫོགས་གསུམ་རྟོགས་པའི་སྨོན་ལམ་ཡེ་ཤེས་དབྱངས་སྙན་བཞུགས།",
    "en": "An Aspiration to Realize Madhyamaka, Mahāmudrā, and Mahā Ati"
  },
  "text": [
    {
      "bo": "ཐུབ་དབང་ཉེ་སྲས་ཀུན་བཟང་རྡོ་རྗེ་འཆང༌། །",
      "en": "Samantabhadra, Vajradhara, and you, Mighty Sage, together with your close disciples",
      "en-trans": "tubwang nyesé kunzang dorjé chang"
    },
    {
      "bo": "དཀོན་མཆོག་རྩ་གསུམ་ཆོས་སྲུང་རྒྱ་མཚོའི་ཚོགས། །",
      "en": "And oceanic deities of the Three Jewels, Three Roots, and dharmapālas—",
      "en-trans": "könchok tsa sum chösung gyatsö tsok"
    },
    {
      "bo": "མཚུངས་མེད་བླ་མ་གྲུབ་ཐོབ་རྒྱ་མཚོ་ཡི། །",
      "en": "Incomparable Gurus in whom the three secrets of myriad siddhas are primordially perfected:",
      "en-trans": "tsungmé lama drubtob gyatso yi"
    },
    {
      "bo": "གསང་གསུམ་གདོད་ནས་རྫོགས་ཀུན་དགོངས་སུ་གསོལ། །",
      "en": "Pray listen!",
      "en-trans": "sang sum döné dzok kün gong su sol"
    },
    {
      "bo": "དད་དང་ངེས་འབྱུང་སྙིང་རྗེ་ཤེས་རབ་ཀྱིས། །",
      "en": "Having purified myself with the common and extraordinary preliminary practices:",
      "en-trans": "dé dang ngejung nyingjé sherab kyi"
    },
    {
      "bo": "མཆོག་གསུམ་སྐྱབས་བསྟེན་གཞན་ཕན་བསམ་སྦྱོར་གྱིས། །",
      "en": "Cultivating faith, renunciation, compassion, and wisdom;",
      "en-trans": "chok sum kyab ten zhenpen samjor gyi"
    },
    {
      "bo": "ཐུན་མོང་ཐུན་མིན་ཁྱད་པར་སྔོན་འགྲོ་འབྱོངས། །",
      "en": "With reliance upon the refuge of the Three Jewels, and the altruistic wish to benefit others,",
      "en-trans": "tünmong tünmin khyepar ngöndro jong"
    },
    {
      "bo": "རྒྱལ་བ་དགྱེས་པའི་ལམ་ལ་འཇུག་པར་ཤོག །",
      "en": "May I enter the path pleasing to the victors!",
      "en-trans": "gyalwa gyepé lam la jukpar shok"
    },
    {
      "bo": "དོན་དམ་ཆོས་ཀུན་གནས་ལུགས་སྟོང་པ་ཉིད། །",
      "en": "The ultimate, essential nature of everything isemptiness,",
      "en-trans": "döndam chö kün neluk tongpanyi"
    },
    {
      "bo": "ཀུན་རྫོབ་མཚན་མེད་རྟེན་འབྱུང་ཅིར་སྣང་ཡང༌། །",
      "en": "And the obscuring nature,devoid of self-characteristics, can arise interdependently as anything whatsoever.",
      "en-trans": "kündzob tsenmé tenjung chir nang yang"
    },
    {
      "bo": "ཟུང་འཇུག་མཐའ་བྲལ་སྨོན་པ་མེད་པའི་དབྱིངས། །",
      "en": "Their union lies beyond all extremes and is the dhātubeyond aspiration—",
      "en-trans": "zungjuk tadral mönpa mepé ying"
    },
    {
      "bo": "ཐེག་མཆོག་དབུ་མའི་ལྟ་བ་མངོན་གྱུར་ཤོག །",
      "en": "May I actualize the Middle Way view of the supreme vehicle!",
      "en-trans": "tek chok umé tawa ngöngyur shok"
    },
    {
      "bo": "རང་བབ་གསུམ་གྱིས་སེམས་ཉིད་ལྷན་སྐྱེས་རྟོགས། །",
      "en": "Through the threefold natural occurrence theco-emergenceof mind itself is realized;",
      "en-trans": "rangbab sum gyi semnyi lhenkyé tok"
    },
    {
      "bo": "སྐྱོན་བཞི་རང་གྲོལ་ཉམས་མྱོང་རྣལ་འབྱོར་བཞིས། །",
      "en": "Experiencing the self-liberation of the four faults is thefourfold yoga.",
      "en-trans": "kyön zhi rangdrol nyamnyong naljor zhi"
    },
    {
      "bo": "སྐུ་བཞི་རང་ལ་རྫོགས་པའི་གདེང་རྙེད་ནས། །",
      "en": "Having found the deep confidence that thefour kāyasare perfected within me,",
      "en-trans": "ku zhi rang la dzokpé deng nyé né"
    },
    {
      "bo": "སྒོམ་པ་ཕྱག་རྒྱ་ཆེན་པོ་རྟོགས་པར་ཤོག །",
      "en": "May I realize the meditation of Mahāmudrā!",
      "en-trans": "gompa chakgya chenpo tokpar shok"
    },
    {
      "bo": "སྣང་སེམས་རིག་སྟོང་སྒྱུ་མའི་ཆོ་འཕྲུལ་ལ། །",
      "en": "To realize the magical display of illusion, of appearance and mind as empty awareness,",
      "en-trans": "nang sem riktong gyumé chotrul la"
    },
    {
      "bo": "བསྐྱེད་བཟླས་ཐབས་གྲོལ་མྱུར་ལམ་གནད་དུ་བརྡེག །",
      "en": "Is to strike the vital point of the swift path of creation, recitation, method, and liberation;",
      "en-trans": "kyé dé tab drol nyurlam né du dek"
    },
    {
      "bo": "སྐྱིད་སྡུག་ལམ་ཁྱེར་འཁོར་འདས་ཆོས་སྐུར་ཤར། །",
      "en": "To see saṃsāra and nirvāṇa arise as the dharmakāya is to take both happiness and suffering as the path.",
      "en-trans": "kyiduk lamkhyer khordé chökur shar"
    },
    {
      "bo": "རོ་སྙོམས་སྤྱོད་པས་བོགས་འདོན་གེགས་སེལ་ཤོག །",
      "en": "May I dispel obstacles and enhance the practice through the conduct ofsingle-taste!",
      "en-trans": "ronyom chöpé bokdön gek sel shok"
    },
    {
      "bo": "ཡིད་དཔྱོད་མཚན་འཛིན་ཀ་དག་དབྱིངས་སུ་གྲོལ། །",
      "en": "Having liberated preoccupation with thought and hankering after self-characteristics into theprimordially puredhātu,",
      "en-trans": "yichö tsen dzin kadak ying su drol"
    },
    {
      "bo": "ལྷུན་གྲུབ་སྣང་བཞི་ཟག་པ་རང་སར་ཟད། །",
      "en": "Thefour visions of spontaneous presenceexhaust contamination whence it lies.",
      "en-trans": "lhündrub nang zhi zakpa rang sar zé"
    },
    {
      "bo": "ཆོས་དབྱིངས་གཞོན་ནུ་བུམ་སྐུར་གཏན་སྲིད་ཟིན། །",
      "en": "May I win the citadel of the dharmadhātu, theyouthful kāya within a vase,",
      "en-trans": "chöying zhönnu bumkur tensi zin"
    },
    {
      "bo": "འབྲས་བུ་རྫོགས་ཆེན་སྣང་བཞི་མངོན་གྱུར་ཤོག །",
      "en": "And achieve the four visions of the resultantGreat Perfection!",
      "en-trans": "drebu dzogchen nang zhi ngöngyur shok"
    },
    {
      "bo": "མཁའ་ཁྱབ་འགྲོ་ཀུན་རྗེས་འཛིན་ཐུགས་རྗེ་མྱུར། །",
      "en": "With swift compassion for all beings throughout space,",
      "en-trans": "khakhyab dro kün jedzin tukjé nyur"
    },
    {
      "bo": "གདུལ་དཀའ་འདུལ་ལ་ཐབས་མཁས་ནུས་སྟོབས་བཙན། །",
      "en": "And to obtain the potential, ability, methods, and knowledge to tame those difficult ones —",
      "en-trans": "dul ka dul la tabkhé nü tob tsen"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་རྨད་བྱུང་གྲུབ་ཐོབ་ཆེའི། །",
      "en": "Bringing about the amazing twofold spontaneous benefit —",
      "en-trans": "dön nyi lhündrub mejung drubtob ché"
    },
    {
      "bo": "རྣམ་ཐར་ཇི་བཞིན་བདག་གིས་མངོན་གྱུར་ཤོག །",
      "en": "May I emulate the awe-inspiring siddhas of the past!",
      "en-trans": "namtar jizhin dak gi ngöngyur shok"
    }
  ]
}