{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham/pacifying-ills-of-age-aspiration",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དུས་ཀྱི་རྒུད་པ་ཞི་བའི་བདེན་ཚིག་སྨོན་ལམ་བཞུགས་སོ། །",
    "en": "Words of Truth for Pacifying the Ills of the Age"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ་ཧོཿ །",
      "en": "oṃ āḥ hūṃ hoḥ!",
      "en-trans": "om ah hung ho"
    },
    {
      "bo": "དཀོན་མཆོག་རྩ་གསུམ་རྒྱ་མཚོའི་བྱིན་རླབས་དང་། །",
      "en": "Through the blessings of the ocean-like Three Jewels and Three Roots,",
      "en-trans": "könchok tsa sum gyatsö jinlab dang"
    },
    {
      "bo": "ལྷ་དང་དྲང་སྲོང་དཀར་ཕྱོགས་སྐྱོང་བའི་མཐུས། །",
      "en": "And the power of devas and sages, guardians of virtue and positivity,",
      "en-trans": "lha dang drangsong karchok kyongwé tü"
    },
    {
      "bo": "རྒྱལ་ཁམས་ཀུན་ཏུ་ནད་མུག་འཐབ་རྩོད་སོགས། །",
      "en": "May disease, famine, warfare and all the ills of this age of disharmony",
      "en-trans": "gyalkham küntu né muk tabtsö sok"
    },
    {
      "bo": "མི་མཐུན་དུས་ཀྱི་རྒུད་པ་ཀུན་ཞི་ནས། །",
      "en": "Be pacified throughout every land.",
      "en-trans": "mitün dü kyi güpa kün zhi né"
    },
    {
      "bo": "ཚེ་རིང་ནད་མེད་བདེ་སྐྱིད་དཔལ་འབྱོར་རྒྱས། །",
      "en": "May longevity, good health, happiness and prosperity abound.",
      "en-trans": "tsering nemé dekyi paljor gyé"
    },
    {
      "bo": "དགེ་བའི་སེམས་ལྡན་ཆོས་ཀྱི་བྱ་བ་འཕེལ། །",
      "en": "May we have virtuous minds and ever-increasing dharmic activity.",
      "en-trans": "gewé semden chökyi jawa pel"
    },
    {
      "bo": "མཐའ་ཡས་འགྲོ་ཀུན་བྱང་ཆུབ་ལམ་ལ་འཇུག །",
      "en": "May all infinite beings set out upon the path to awakening,",
      "en-trans": "tayé dro kün changchub lam la juk"
    },
    {
      "bo": "འཇིགས་མེད་བདེ་བ་ཆེན་པོའི་གནས་ཐོབ་ཤོག །",
      "en": "And may we attain the state of fearlessness and great bliss.",
      "en-trans": "jikme dewa chenpö né tob shok"
    },
    {
      "bo": "ཆོས་ཉིད་གདོད་ནས་རྣམ་པར་དག་པ་ལ། །",
      "en": "Dharmatā—reality itself—is perfectly pure from the beginning",
      "en-trans": "chönyi döné nampar dakpa la"
    },
    {
      "bo": "སྡུག་བསྔལ་རྒུད་པ་ཡེ་ནས་མི་མངའ་བའི། །",
      "en": "And has never known any form of suffering or decline.",
      "en-trans": "dukngal güpa yené mi ngawé"
    },
    {
      "bo": "བདེན་དོན་གཟིགས་པ་རྒྱལ་བ་སྲས་བཅས་ཀྱི། །",
      "en": "The Victorious Ones and their heirs, who see this truth,",
      "en-trans": "dendön zikpa gyalwa sé ché kyi"
    },
    {
      "bo": "སྨོན་ལམ་མཐུ་བཙན་ཐུགས་རྗེའི་སྟོབས་ཆེ་བས། །",
      "en": "Possess great strength of aspiration and compassionate might.",
      "en-trans": "mönlam tu tsen tukjé tob chewé"
    },
    {
      "bo": "འཁྲུལ་སྣང་སྙིགས་མའི་རྒུད་པ་རབ་ཞི་ནས། །",
      "en": "Thus, with delusory perception and the ills of degeneration pacified,",
      "en-trans": "trulnang nyikmé güpa rabzhi né"
    },
    {
      "bo": "བཀྲ་ཤིས་བདེ་ལེགས་ངོ་མཚར་སྣང་བ་ཡིས། །",
      "en": "May the wondrous light of auspiciousness, happiness and excellence",
      "en-trans": "tashi delek ngotsar nangwa yi"
    },
    {
      "bo": "ས་གསུམ་ཀུན་ཏུ་ཁྱབ་པའི་དགེ་མཚན་དཔལ། །",
      "en": "Pervade everywhere throughout the three worlds as a sign of splendour,",
      "en-trans": "sa sum küntu khyabpé getsen pal"
    },
    {
      "bo": "ཉིན་མོར་བྱེད་པ་བཞིན་དུ་གསལ་གྱུར་ཅིག །",
      "en": "Illuminating all, just like the sun, creator of the day.",
      "en-trans": "nyinmor jepa zhindu sal gyur chik"
    }
  ]
}