{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-jampa-kunga-tendzin",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཁྱབ་བདག་རྡོ་རྗེ་འཆང་བྱམས་པ་ཀུན་དགའ་བསྟན་འཛིན་ལ་གསོལ་བ་འདེབས་པ་བྱིན་རླབས་མྱུར་འཇུག",
    "en": "A Prayer to the Omnipresent Lord Vajradhara Jampa Kunga Tendzin"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ཝེ།",
      "en": "Namo gurave!",
      "en-trans": "namo guru wé"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བ་ཡོངས་ཀྱི་ཡེ་ཤེས་ཀྱི།    །",
      "en": "Embodiment of the wisdom of all the victorious ones and their heirs,",
      "en-trans": "sé ché gyalwa yong kyi yeshe kyi"
    },
    {
      "bo": "སྤྱི་གཟུགས་ཁྱབ་བདག་དཔལ་ལྡན་རྡོ་རྗེ་འཆང་།    །",
      "en": "Omnipresent lord, glorious Vajradhara,",
      "en-trans": "chizuk khyabdak palden dorjé chang"
    },
    {
      "bo": "སྙིགས་དུས་ངུར་སྨྲིག་འཛིན་པའི་ཁྱུ་མཆོག་ཆེ།    །",
      "en": "Foremost among the saffron-robed monks of this degenerate age,",
      "en-trans": "nyikdü ngurmik dzinpé khyuchok ché"
    },
    {
      "bo": "མཁན་ཆེན་ཐམས་ཅད་མཁྱེན་པར་གསོལ་བ་འདེབས།    །",
      "en": "Great all-knowing khenpo, to you I pray.",
      "en-trans": "khenchen tamché khyenpar solwa deb"
    },
    {
      "bo": "ཕྱི་ལྟར་སོ་སོར་ཐར་པས་རྒྱུད་སྡོམ་ཤིང་།    །",
      "en": "Outwardly restrained through the pratimokṣa vows,",
      "en-trans": "chitar sosor tarpé gyü dom shing"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་གཉིས་ནོར་གྱིས་ཕྱུག  །",
      "en": "Inwardly rich with the wealth of twofold bodhicitta,",
      "en-trans": "nang du changchub sem nyi nor gyi chuk"
    },
    {
      "bo": "གསང་བ་གྲུབ་པ་ཆེན་པོ་མངོན་དུ་མཛད།    །",
      "en": "And secretly realized as a mahāsiddha,",
      "en-trans": "sangwa drubpa chenpo ngön du dzé"
    },
    {
      "bo": "བྱམས༵་ལྡན་འདྲེན་པ༵་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Great benevolent guide, to you I pray.",
      "en-trans": "jamden drenpa chenpor solwa deb"
    },
    {
      "bo": "མཁས་ཀུན༵་དགའ༵་བའི་འཕགས་ནོར་འབྱོར་པ་དང་།    །",
      "en": "Endowed with the noble riches that delight all the learned ones,",
      "en-trans": "khé kün gawé pak nor jorpa dang"
    },
    {
      "bo": "འཆད་རྩོམ་ཟླ་བྲལ་བསྟན༵་འཛིན༵་སློབ་ཚོགས་རྒྱས།    །",
      "en": "Unrivalled teacher and author, whose vast assembly of students uphold the teachings,",
      "en-trans": "ché tsom dadral tendzin lob tsok gyé"
    },
    {
      "bo": "དྲི་མ་མེད་པའི་གཟི་བརྗིད་དང་ལྡན་པ།    །",
      "en": "Possessor of an immaculate resplendence,",
      "en-trans": "drima mepé ziji dang denpa"
    },
    {
      "bo": "ཐུབ་དབང་གཉིས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Second lord of sages, at your feet I pray.",
      "en-trans": "tubwang nyipé zhab la solwa deb"
    },
    {
      "bo": "ཁྱེད་སྐུ་མཐོང་དང་གསུང་གི་ཆ་ཤས་ཀྱིས།    །",
      "en": "You bestow the splendour of great liberation",
      "en-trans": "khyé ku tong dang sung gi chashé kyi"
    },
    {
      "bo": "མཐོང་ཐོས་གྲོལ་བ་ཆེན་པོའི་དཔལ་སྟེར་ཞིང་།    །",
      "en": "On all who see your form or read or hear your words,",
      "en-trans": "tong tödrol ba chenpö pal ter zhing"
    },
    {
      "bo": "ཀུན་དགའི་རིང་ལུགས་ཕྱོགས་བརྒྱར་སྤེལ་བ་ལ།    །",
      "en": "And you spread the tradition of Kunga1in a hundred directions—",
      "en-trans": "kün gé ringluk chok gyar pelwa la"
    },
    {
      "bo": "རྣམ་ཐར་མཚུངས་པ་མེད་ལ་གསོལ་བ་འདེབས།    །",
      "en": "To you whose life of liberation is unequalled, I pray.",
      "en-trans": "namtar tsungpamé la solwa deb"
    },
    {
      "bo": "ཟག་མེད་ཚུལ་ཁྲིམས་གཞོན་ནུ་རིང་དུ་འཕྲོ།    །",
      "en": "Your immaculate discipline enhances your youthfulness,",
      "en-trans": "zakmé tsultrim zhönnu ring du tro"
    },
    {
      "bo": "ཏིང་འཛིན་བདེ་ཆེན་བདུད་རྩིའི་སྟོབས་རྒྱས་ཤིང་།    །",
      "en": "Your meditative absorption strengthens the nectar of great bliss,",
      "en-trans": "tingdzin dechen dütsi tob gyé shing"
    },
    {
      "bo": "ཤེས་རབ་ཟབ་མོས་ཆོས་ཀུན་ཇི་བཞིན་གཟིགས།    །",
      "en": "And your profound wisdom perceives the nature of all things—",
      "en-trans": "sherab zab mö chö kün jizhin zik"
    },
    {
      "bo": "བསླབ་གསུམ་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Great master of the threefold training, to you I pray.",
      "en-trans": "lab sum wangchuk chenpor solwa deb"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་དེ་ཉིད་བཅུ་དང་ལྡན།    །",
      "en": "Employing the ten principles of mantra, outer, inner and secret,",
      "en-trans": "chi nang sangwé denyi chu dangden"
    },
    {
      "bo": "བསྐྱེད་དང་རྫོགས་པའི་རྣལ་འབྱོར་མཐར་ཕྱིན་ཅིང་།    །",
      "en": "You perfected the yogas of generation and completion,",
      "en-trans": "kyé dang dzokpé naljor tarchin ching"
    },
    {
      "bo": "དབང་བཞིའི་ལམ་གྱིས་འགྲོས་བཞི་ཐིམ་པར་ལས།    །",
      "en": "And through fourfold dissolution on the paths of the four empowerments,",
      "en-trans": "wang zhi lam gyi drö zhi timpar lé"
    },
    {
      "bo": "བཅུ་གསུམ་ས་མཆོག་བརྙེས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Attained the supreme thirteenth bhūmi—to you I pray.",
      "en-trans": "chusum sa chok nyé la solwa deb"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་སྤྲོ་བསྡུའི་བྱེད་པོ་ནི།    །",
      "en": "Master who emanates and absorbs an ocean of maṇḍalas,",
      "en-trans": "kyilkhor gyatsö trodü jepo ni"
    },
    {
      "bo": "ཁ་སྦྱོར་མཆོག་ཏུ་མི་འགྱུར་བདེ་བ་ཆེ།    །",
      "en": "Who possesses the supremely immutable great bliss of union,",
      "en-trans": "khajor chok tu mingyur dewa ché"
    },
    {
      "bo": "སྙིང་རྗེའི་ཡོངས་གང་རང་བཞིན་བརྗོད་བྲལ་ཆེ།    །",
      "en": "Entirely filled with compassion, great and inexpressible by nature—",
      "en-trans": "nyingjé yong gang rangzhin jödral ché"
    },
    {
      "bo": "བླ་མ་འཁོར་ལོ་སྡོམ་པར་གསོལ་བ་འདེབས།    །",
      "en": "Guru Cakrasaṃvara, to you I pray.",
      "en-trans": "lama khorlo dompar solwa deb"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་བརླབ་ཀྱིས།    །",
      "en": "Through the blessings of praying in this way,",
      "en-trans": "detar solwa tabpé jin lab kyi"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་བླ་མ་མཆོག་དེ་ཡིས།    །",
      "en": "May the supreme guru always guide and care for me throughout all my lives,",
      "en-trans": "kyewa küntu lama chok dé yi"
    },
    {
      "bo": "རྗེས་བཟུང་རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་འགྲུབ།    །",
      "en": "May we spontaneously accomplish our own and others’ welfare,",
      "en-trans": "jezung rangzhen dön nyi lhün gyi drub"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་ལ་ཕན་བདེའི་དཔལ་སྟེར་ཤོག  །",
      "en": "And bestow the glory of benefit and happiness upon the teachings and beings.",
      "en-trans": "ten dang dro la pendé pal ter shok"
    }
  ]
}