{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/jowo-rinpoche-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཇོ་བོ་རིན་པོ་ཆེར་གསོལ་འདེབས་སྨོན་ལམ་དང་འབྲེལ་བར་དབང་བཞི་ལེན་ཚུལ་བཞུགས།",
    "en": "A Prayer to Jowo Rinpoche Combined with Aspirations and a Means to Receive the Four Empowerments"
  },
  "text": [
    {
      "bo": "རྒྱལ་བ་ཐུབ་དབང་ཉིན་བྱེད་ནི། །",
      "en": "Victorious one, sun-like lord of sages,",
      "en-trans": "gyalwa tubwang nyinché ni"
    },
    {
      "bo": "མི་མཇེད་ཞིང་གི་སྒྲོན་མ་སྟེ། །",
      "en": "Light for this world of Patient Endurance,",
      "en-trans": "mi jé zhing gi drönma té"
    },
    {
      "bo": "སྤྲུལ་པས་འཛམ་བུའི་གླིང་འདུལ་བ། །",
      "en": "Emanating to tame the land of Jambudvīpa—",
      "en-trans": "trulpé dzambü ling dülwa"
    },
    {
      "bo": "གང་ལ་སྙིང་ནས་སྐྱབས་སུ་མཆི། །",
      "en": "In you I take refuge, from the very depths of my heart.",
      "en-trans": "gang la nying né kyab su chi"
    },
    {
      "bo": "ཁྱོད་སྐུ་རིག་གྲོལ་ཉིས་ལྡན་ཏེ། །",
      "en": "Your body is the saṅgha, endowed with knowledge and liberation,",
      "en-trans": "khyö ku rig drol nyi den té"
    },
    {
      "bo": "གསུང་ནི་འགོག་ལམ་བདེན་གཉིས་ཆོས། །",
      "en": "Your speech is the Dharma, true cessation and the path,",
      "en-trans": "sung ni gok lam den nyi chö"
    },
    {
      "bo": "ཐུགས་ནི་བླ་མ་ཆོས་སྐུའི་ཞལ། །",
      "en": "Your mind the face of dharmakāya, unsurpassed—",
      "en-trans": "tuk ni lama chö kü zhal"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་བདག་ཉིད་ལ། །",
      "en": "To you, who embody an ocean-like infinity of maṇḍalas,",
      "en-trans": "kyil khor gyamtsö daknyi la"
    },
    {
      "bo": "རྣམ་དག་བདུན་དང་ཆབ་གཅིག་ཏུ། །",
      "en": "I continually make offerings of sevenfold purity,",
      "en-trans": "namdak dün dang chab chik tu"
    },
    {
      "bo": "ལུས་དང་ལོངས་སྤྱོད་ལྟོས་མེད་འབུལ། །",
      "en": "Together with my own body and possessions.",
      "en-trans": "lü dang longchö tö mé bül"
    },
    {
      "bo": "ལས་ཀྱིས་གཞན་དབང་ཅི་མཐོང་ཡང་། །",
      "en": "Whatever I see of karma’s influence and power,",
      "en-trans": "lé kyi zhen wang chi tong yang"
    },
    {
      "bo": "ཁྱེད་ཤེས་དམ་བཅའ་བརྟན་པོ་འཛིན། །",
      "en": "I maintain my commitment: to place my trust in you.",
      "en-trans": "khyé shé damcha tenpo dzin"
    },
    {
      "bo": "ཁྱོད་ཞལ་མཐོང་བའི་མོས་ཉིད་ལ། །",
      "en": "Now that I behold your perfect face,",
      "en-trans": "khyö zhal tongwé mö nyi la"
    },
    {
      "bo": "མོས་གུས་བཟོད་གླག་མེད་པ་དེ། །",
      "en": "And feel intense, overpowering devotion,",
      "en-trans": "mö gü zö lak mépa dé"
    },
    {
      "bo": "བུམ་པའི་དབང་གི་ངོ་བོ་ཉིད། །",
      "en": "As the very essence of the vase empowerment,",
      "en-trans": "bumpé wang gi ngowo nyi"
    },
    {
      "bo": "ལུས་སྒྲིབ་དག་ནས་སྐུ་རྡོ་རྗེ། །",
      "en": "Inspire me to purify bodily obscurations",
      "en-trans": "lü drip dak né ku dorjé"
    },
    {
      "bo": "ད་ལྟ་ཉིད་དུ་བྱིན་གྱིས་རློབས། །",
      "en": "And attain the vajra body here and now!",
      "en-trans": "data nyi du chin gyi lop"
    },
    {
      "bo": "ཁྱོད་གསུང་སྒྲ་ཚིག་རང་ཚན་ལས། །",
      "en": "Your speech transcends ordinary words and language—",
      "en-trans": "khyö sung dra tsik rang tsen lé"
    },
    {
      "bo": "འདས་པ་གསང་བ་དམ་པའི་དབང་། །",
      "en": "As the empowerment of the perfect secret",
      "en-trans": "dépa sangwa dampé wang"
    },
    {
      "bo": "བདག་གི་ངག་ལ་ཞུགས་པའི་མོད། །",
      "en": "Infuses my own speech, in this very instant,",
      "en-trans": "dak gi ngak la zhukpé mö"
    },
    {
      "bo": "གསུང་གི་རྡོ་རྗེའི་དངོས་གྲུབ་སྩོལ། །",
      "en": "Grant me the attainment of vajra speech!",
      "en-trans": "sung gi dorjé ngödrup tsol"
    },
    {
      "bo": "ཐུགས་ནི་ཟབ་ཞི་སྤྲོས་དང་བྲལ། །",
      "en": "Your mind is profound, peaceful, free from concepts:",
      "en-trans": "tuk ni zab zhi trö dang dral"
    },
    {
      "bo": "བདེ་ཆེན་བྱང་ཆུབ་ཤེས་རབ་དབང་། །",
      "en": "May the wisdom empowerment of awakening through great bliss",
      "en-trans": "dechen changchub sherab wang"
    },
    {
      "bo": "བདག་གི་རྣམ་ཤེས་ཚོགས་བརྒྱད་ལ། །",
      "en": "Merge with my own eight types of consciousness,",
      "en-trans": "dak gi namshé tsok gyé la"
    },
    {
      "bo": "འདྲེས་ནས་ཐུགས་ཀྱི་རྡོར་རྗེར་སྩོལ། །",
      "en": "Transforming them into vajra-like enlightened mind.",
      "en-trans": "dré né tuk kyi dorjer tsol"
    },
    {
      "bo": "རྒྱལ་བའི་མཛོད་སྤུ་ལས་སྐྱེས་པའི། །",
      "en": "Through the supreme empowerment of great light-rays,",
      "en-trans": "gyalwé dzöpu lé kyépé"
    },
    {
      "bo": "འོད་ཟེར་ཆེན་པོའི་དབང་མཆོག་གིས། །",
      "en": "Emerging from theurṇacircle between your brows,",
      "en-trans": "özer chenpö wang chok gi"
    },
    {
      "bo": "ཤེས་བྱའི་སྒྲིབ་པ་རབ་སྤངས་ནས། །",
      "en": "May all that obscures the knowable be cast aside,",
      "en-trans": "shejé dribpa rab pang né"
    },
    {
      "bo": "ཀུན་ཏུ་འོད་ཀྱི་ས་ནོན་ཤོག །",
      "en": "And may I reach the stage of Universal Radiance!",
      "en-trans": "kuntu ö kyi sa nön shok"
    },
    {
      "bo": "བདག་ལ་སྨོད་དམ་གཤེ་ཡང་རུང་། །",
      "en": "Even if they should revile and abuse me,",
      "en-trans": "dak la mö dam shé yang rung"
    },
    {
      "bo": "སེམས་ཅན་ཕ་མའི་རང་བཞིན་ལ། །",
      "en": "May I recognize all beings as my very own parents,",
      "en-trans": "semchen pamé rang zhin la"
    },
    {
      "bo": "བྱས་པ་གཟོ་བའི་སྙིང་རྗེ་ཡིས། །",
      "en": "And, through the compassion of repaying their past kindness,",
      "en-trans": "chépa zowé nyingjé yi"
    },
    {
      "bo": "འཁོར་བ་དོང་ནས་སྤྲུག་པར་ཤོག །",
      "en": "May I empty saṃsāra from its very depths!",
      "en-trans": "khorwa dong né trukpar shok"
    }
  ]
}