{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/prayer-to-marpa-mila-dakpo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྒྲུབ་བརྒྱུད་བསྟན་པའི་བཙས་སུ་བསྔགས་པའི་གསོལ་འདེབས་དོན་ཀུན་གྲུབ་པའི་དབྱངས་སྙན་ཞེས་བྱ་བ་བཞུགས་སོ།།",
    "en": "A Prayer to Those Praised as Ornaments of the Practice Lineage"
  },
  "text": [
    {
      "bo": "བཅོམ་ལྡན་འདས་རྡོ་རྗེ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the transcendent conqueror Vajrasattva!",
      "en-trans": "chomdendé dorjé sempa la chaktsal lo"
    },
    {
      "bo": "སྙིང་སྟོབས་ཆེན༵་པོས༵་འཕགས་ཡུལ་ལན་མང་བགྲོད།   །",
      "en": "With great courage, you travelled many times to the Noble Land of India.",
      "en-trans": "nyingtobchenpöpakyul len mang drö"
    },
    {
      "bo": "བློ་གྲོས་ཆེན༵་པོས༵་ཆོས་ཀུན་དེ་ཉིད་གཟིགས།  །",
      "en": "With great intelligence, you realised the true nature of all things.",
      "en-trans": "lodröchenpöchö kün denyi zik"
    },
    {
      "bo": "གྲུབ་པ་ཆེན༵་པོས༵་ཆོ་འཕྲུལ་ཅིར་ཡང་སྟོན།  །",
      "en": "With great mastery, you displayed all manner of miracles.",
      "en-trans": "drubpachenpöchotrul chiryang tön"
    },
    {
      "bo": "ལོ་ཙཱ་ཆེན༵་པོ༵འི་ཞབས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "To you, Great Lotsāwa, I pray!",
      "en-trans": "lotsachenpözhab la solwa deb"
    },
    {
      "bo": "ནུས་མཐུ་ཆེན༵་པོས༵་སྐུ་དགྲ་རྩད་ནས་བཅད།   །",
      "en": "With great power, you annihilated your enemies.",
      "en-trans": "nütuchenpöku dra tsené ché"
    },
    {
      "bo": "དཀའ་སྤྱད་ཆེན༵་པོས༵་བླ་མ་མཉེས་པར་མཛད།   །",
      "en": "With great austerities, you pleased the Guru.",
      "en-trans": "kachéchenpölama nyepar dzé"
    },
    {
      "bo": "བརྩོན་འགྲུས་ཆེན༵་པོས༵་སྒྲུབ་པའི་རྒྱལ་མཚན་བཙུགས།   །",
      "en": "With great diligence, you planted the victory banner of practice.",
      "en-trans": "tsöndrüchenpödrubpé gyaltsen tsuk"
    },
    {
      "bo": "རས་པ་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།   །",
      "en": "To you, Great Repa, I pray!",
      "en-trans": "repachenpözhab la solwa deb"
    },
    {
      "bo": "ཐེག་པ་ཆེན༵་པོ༵འི་རིགས་མཆོག་ཡོངས་སུ་སད།   །",
      "en": "You awakened the supreme disposition of the Great Vehicle.",
      "en-trans": "tekpachenpörik chok yongsu sé"
    },
    {
      "bo": "ཕྱག་རྒྱ་ཆེན༵་པོ༵འི་རྟོགས་པ་མངོན་དུ་གྱུར།   །",
      "en": "You actualised realisation of the Great Seal.",
      "en-trans": "chakgyachenpötokpa ngön du gyur"
    },
    {
      "bo": "ཕྲིན་ལས་ཆེན༵་པོས༵་མཁའ་དང་མཉམ་པར་བརྡལ།   །",
      "en": "Your great activities spread as far and wide as the sky.",
      "en-trans": "trinléchenpökha dang nyam par dal"
    },
    {
      "bo": "སྙི་སྒོམ་ཆེན༵་པོ༵འི་ཞབས་ལ་གསོལ་བ་འདེབས།  །",
      "en": "To you, Great Meditator of Nyi, I pray!1",
      "en-trans": "nyi gomchenpözhab la solwa deb"
    },
    {
      "bo": "དམ་པ་རྣམས་ལ་གུས་པས་གསོལ་བཏབ་མཐུས།  །",
      "en": "Through the power of praying devotedly to you sublime beings,",
      "en-trans": "dampa nam la güpé soltab tü"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་བསྟན་འཛིན་མཆོག་རྣམས་ཞབས་བརྟན་ཅིང་།  །",
      "en": "May all those upholding the supreme practice lineage live long,",
      "en-trans": "drubgyü tendzin chok nam zhabten ching"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཕྱོགས་བཅུར་རྒྱས་པ་དང་།   །",
      "en": "May the precious teachings flourish in all ten directions,",
      "en-trans": "tenpa rinchen chok chur gyepa dang"
    },
    {
      "bo": "འཇིག་རྟེན་དགེ་ལེགས་ཆེན་པོས་ཁྱབ་པར་ཤོག  །",
      "en": "And may virtuous excellence fill the entire world!",
      "en-trans": "jikten gelek chenpö khyabpar shok"
    }
  ]
}