{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-shantarakshita",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་གསོལ་འདེབས་བྱང་ཆུབ་ལྗོན་ཤིང་ཞེས་བྱ་བ།"
  },
  "text": [
    {
      "bo": "མགོན་པོ་འཇམ་པའི་དབྱངས་ལ་གུས་པས་ཕྱག་འཚལ་ལོ།    །"
    },
    {
      "bo": "རྒྱལ་རིགས་སཱ་ལ་ལྟ་བུའི་རྒྱུད་འཁྲུངས་ཤིང་།    །"
    },
    {
      "bo": "རིག་པའི་གནས་ལྔ་མཐར་ཕྱིན་འཇམ་དབྱངས་ཀྱི།    །"
    },
    {
      "bo": "ཞབས་ཀྱི་པདྨོའི་ཟེའུ་འབྲུ་སྤྱི་བོས་བསྟེན།    །"
    },
    {
      "bo": "མཁན་ཆེན་བྱང་ཆུབ་སེམས་དཔར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བསྐལ་མང་གོང་ནས་གཞན་ཕན་ཐུགས་བསྐྱེད་ཀྱི།    །"
    },
    {
      "bo": "རྩ་བ་གསེར་སྦྲམ་ལྟ་བུ་རབ་བརྟན་པས།    །"
    },
    {
      "bo": "རྩོད་དུས་བསྟན་དང་འགྲོ་བའི་གཉེན་གཅིག་པུ།    །"
    },
    {
      "bo": "མཁན་ཆེན་ཞི་བ་འཚོ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་ལ་འཁུ་བའི་མུ་སྟེགས་ཀྱི།    །"
    },
    {
      "bo": "གླང་ཆེན་གཙུག་འགེམ་དབང་པོའི་རྡོ་རྗེ་ལྟར།    །"
    },
    {
      "bo": "སྒྲ་ཚད་དབུ་མའི་རིགས་པས་བཅོམ་མཛད་པའི།    །"
    },
    {
      "bo": "སྨྲ་བའི་སེངྒེ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཆོས་འདུལ་གསེར་གྱི་རི་བོར་རྟེན་བཅས་ཤིང་།    །"
    },
    {
      "bo": "ཟབ་ཅིང་རྒྱ་ཆེའི་མདོ་སྡེའི་དོན་རབ་གསལ།    །"
    },
    {
      "bo": "ཆོས་མངོན་རྒྱ་མཚོའི་སྤྱན་སྟོང་རྣམ་པར་བཀྲ།    །"
    },
    {
      "bo": "མཁན་ཆེན་ལྷ་ཡི་བླ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་དྲི་ཡིས་ལྷར་བཅས་འགྲོ་རྣམས་དགའ།    །"
    },
    {
      "bo": "ཏིང་འཛིན་ཟབ་མོས་ཟག་མེད་ཡོན་ཏན་སྡུད།    །"
    },
    {
      "bo": "ཤེས་རབ་སྤོབས་པས་ཆོས་ཀྱི་སྒོ་བརྒྱ་འབྱེད།    །"
    },
    {
      "bo": "འཛམ་གླིང་ཐུབ་དབང་གཉིས་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བྱང་ཕྱོགས་གངས་རིའི་ཕྲེང་བས་བསྐོར་བའི་ལྗོངས།    །"
    },
    {
      "bo": "ཤཱཀྱ་སེངྒེའི་བསྟན་པའི་ཤིང་རྟ་འདྲེན།    །"
    },
    {
      "bo": "སྡེ་སྣོད་གསུམ་ལ་ཅི་དགར་ལོངས་སྤྱོད་པའི།    །"
    },
    {
      "bo": "བཀའ་དྲིན་མཉམ་མེད་རྗེ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྒྱལ་བས་ལུང་གིས་བསྟན་པའི་མཁན་པོ་ནི།    །"
    },
    {
      "bo": "བྷོ་དྷི་སཏྭ་ཤཱནྟ་རཀྵི་ཏ།    །"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་དངོས་སྟོན་པའི་རྒྱལ་ཚབ་ཆེར།    །"
    },
    {
      "bo": "དད་མོས་རྩེ་གཅིག་གུས་པས་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁ་ཙམ་མ་ཡིན་སྙིང་ནས་གསོལ་འདེབས་ན།    །"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཕྱོགས་བཅུར་འཕེལ་བ་དང་།    །"
    },
    {
      "bo": "ཚུལ་ལྡན་འདུས་པ་རྒྱ་མཚོས་ཡོངས་གང་ཞིང་།    །"
    },
    {
      "bo": "སྒོ་གསུམ་རྣམ་པར་དག་པར་བྱིན་གྱིས་རློབས།།    །།"
    }
  ]
}