{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dolpopa-sherab-gyaltsen/praise-of-eight-siddhas",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གྲུབ་ཆེན་བརྒྱད་ཀྱི་གསོལ་འདེབས།",
    "en": "In Praise of the Eight Mahāsiddhas"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷྱཿ",
      "en": "Namo Gurubhyaḥ!",
      "en-trans": "namo guru bhye"
    },
    {
      "bo": "ནམ་མཁའི་མདོག་ཅན་ཆོས་སྐུ་རྡོ་རྗེ་འཆང་། །",
      "en": "Dharmakāya Vajradhara having the colour of the sky,",
      "en-trans": "namkhé dokchen chöku dorjé chang"
    },
    {
      "bo": "འགྱིང་བག་རུས་རྒྱན་རྡོ་རྗེ་དྲིལ་བུ་འཛིན། །",
      "en": "Majestic with bone ornaments, holding a vajra and bell,",
      "en-trans": "gying bak rügyen dorjé drilbu dzin"
    },
    {
      "bo": "མཁའ་སྤྱོད་དཀར་དམར་མཁའ་འགྲོ་ཡུམ་དང་བཅས། །",
      "en": "Together with the ḍākinī consort pink Khechari;",
      "en-trans": "khachö kar mar khandro yum dangché"
    },
    {
      "bo": "ཕ་མཆོག་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the supreme father Vajradhara I praise.",
      "en-trans": "pa chok dorjé chang la solwa deb"
    },
    {
      "bo": "ཀུར་གུམ་མདངས་ལྡན་ཀླུ་སྒྲུབ་འཛམ་གླིང་རྒྱན། །",
      "en": "Nāgārjuna, radiantly saffron, ornament of the Southern Continent,",
      "en-trans": "kur gum dangden ludrub dzamling gyen"
    },
    {
      "bo": "ནགས་ཀྱི་ལྷ་མོས་འཆི་མེད་བདུད་རྩི་ཕུལ། །",
      "en": "With a forest goddess offering the nectar of immortality,",
      "en-trans": "nak kyi lha mö chimé dütsi pul"
    },
    {
      "bo": "དངོས་གྲུབ་བརྙེས་ནས་གཞན་དོན་རྒྱུན་མི་འཆད། །",
      "en": "Having gained the attainments, teaching uninterruptedly for the benefit of others;",
      "en-trans": "ngödrub nyé né zhendön gyün mi ché"
    },
    {
      "bo": "མཁས་མཆོག་གྲུབ་ཆེན་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the great accomplished one of supreme space I praise.",
      "en-trans": "khé chok drubchen zhab la solwa deb"
    },
    {
      "bo": "ཨིནྡྲ་བྷུ་ཏི་ལྗང་སྔོན་དུ་བའི་མདོག །",
      "en": "Indrabhūti, the colour of bluish smoke,",
      "en-trans": "indra bhu ti jangngön duwé dok"
    },
    {
      "bo": "རྒྱལ་རིགས་སྤྱོད་པ་ཨོ་རྒྱན་གནས་སུ་བཞུགས། །",
      "en": "Dwelling in the land of Orgyan in the manner of royalty,",
      "en-trans": "gyalrik chöpa orgyen né su zhuk"
    },
    {
      "bo": "སྲས་དང་ལྷན་ཅིག་མཁའ་སྤྱོད་ཞིང་དུ་གཤེགས། །",
      "en": "Together with [his] son departing for Khechara;",
      "en-trans": "sé dang lhenchik khachö zhing du shek"
    },
    {
      "bo": "གསང་སྔགས་བསྟན་འཛིན་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the holder of the teachings of Secret Mantra I praise.",
      "en-trans": "sang ngak tendzin la solwa deb"
    },
    {
      "bo": "རྒྱལ་བའི་མཆོག་ཊྃ་བི་ཧེ་རུ་ཀ །",
      "en": "Ḍombī Heruka, the supreme prince,",
      "en-trans": "gyalwé chok tam bi heruka"
    },
    {
      "bo": "སྨུག་ནག་གཅེར་བུས་རྫུ་འཕྲུལ་སྟག་ལ་ཞོན། །",
      "en": "Maroon and naked, riding on an emanated tiger,",
      "en-trans": "muknak cherbü dzutrul tak la zhön"
    },
    {
      "bo": "གདིང་བ་བཏིང་ནས་ཆུ་བོ་གངྒཱ་བརྒལ། །",
      "en": "Crossing the Ganges River seated on a mat;",
      "en-trans": "dingwa ting né chuwo gangga gal"
    },
    {
      "bo": "རྫུ་འཕྲུལ་དབང་ཐོབ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the feet of the Lord of emanated power I praise.",
      "en-trans": "dzutrul wang tob zhab la solwa deb"
    },
    {
      "bo": "བྲམ་ཟེ་ཆེན་པོ་དཔལ་ལྡན་སཱ་ར་ཧཱ། །",
      "en": "Saraha, glorious great Brahmin, golden in colour,",
      "en-trans": "dramzé chenpo palden sa ra ha"
    },
    {
      "bo": "གསེར་མདོག་ཉོན་མོངས་འབིགས་མདའ་སྤྱོད་ཅིང་། །",
      "en": "Using an arrow to pierce afflictions,",
      "en-trans": "ser dok nyönmong bik da chö ching"
    },
    {
      "bo": "དཔལ་གྱི་རི་ཡི་གནས་སུ་ནམ་མཁར་གཤེགས། །",
      "en": "Flying in the sky to the land of Śrī Parvati;",
      "en-trans": "pal gyi ri yi né su namkhar shek"
    },
    {
      "bo": "རླུང་སེམས་དབང་ཐོབ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the One who has obtained the power of air-mind I praise.",
      "en-trans": "lungsem wang tob la solwa deb"
    },
    {
      "bo": "གྲུབ་ཆེན་རས་མའི་མདོག་ཅན་དྲིལ་བུ་པ། །",
      "en": "Great adept Ghaṇṭapa having the colour of cotton,",
      "en-trans": "drubchen ré mé dokchen drilbu pa"
    },
    {
      "bo": "ཡུམ་སྲས་འཇའ་གུར་འཁྱིལ་བའི་འོད་ལམ་དུ། །",
      "en": "On a trail of light twisting in a rainbow canopy with the consort and son,",
      "en-trans": "yumsé ja gur khyilwé ö lam du"
    },
    {
      "bo": "རྡོ་རྗེ་དྲིལ་བུ་བསིལ་ནས་ནམ་མཁར་གཤེགས། །",
      "en": "Flying into the sky ringing a vajra and bell;",
      "en-trans": "dorjé drilbu sil né namkhar shek"
    },
    {
      "bo": "མཁའ་སྤྱོད་དབང་ཐོབ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the one who has obtained the power of Khechara I praise.",
      "en-trans": "khachö wang tob zhab la solwa deb"
    },
    {
      "bo": "ཀར་ཤམ་མདོག་ཅན་དཔལ་ལྡན་ཀུ་ཀུ་རི། །",
      "en": "Glorious Kukkurīpā, whitish-grey,",
      "en-trans": "kar sham dokchen palden kukuri"
    },
    {
      "bo": "མྱོས་བྱེད་མཁའ་འགྲོ་ཁྱི་གཟུགས་བཾ་ནས་རོལ། །",
      "en": "Madly playing with a ḍākinī in the form of a dog,",
      "en-trans": "nyöjé khandro khyi zuk bam né rol"
    },
    {
      "bo": "དངོས་གྲུབ་བརྙེས་ནས་ཐོག་མེད་མཁ་ལ་གཤེགས། །",
      "en": "Acquiring the attainments and without obstruction flying into the sky;",
      "en-trans": "ngödrub nyé né tokmé kha la shek"
    },
    {
      "bo": "གྲུབ་ཆེན་རྒྱལ་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the feet of the king of great accomplishment I praise.",
      "en-trans": "drubchen gyalpö zhab la solwa deb"
    },
    {
      "bo": "དུད་ཁའི་མདངས་ལྡན་རྒྱལ་སྲས་ལུ་ཧཱི་པ། །",
      "en": "Royal prince, Luipa, of smoky radiance,",
      "en-trans": "dükhé dangden gyalsé lu hipa"
    },
    {
      "bo": "གདུག་པའི་ཉ་ལྟོས་གསོལ་ནས་དངོས་གྲུབ་བརྙེས། །",
      "en": "Acquiring the attainments eating the guts of cruel fish,",
      "en-trans": "dukpé nya tö sol né ngödrub nyé"
    },
    {
      "bo": "དགེ་སློང་ཚུལ་འཛིན་འཁོར་བའི་རྒྱ་མཚོ་བརྒལ། །",
      "en": "Crossing the ocean of existence [while] keeping the behaviour of a monk;",
      "en-trans": "gelong tsul dzin khorwé gyatso gal"
    },
    {
      "bo": "བརྟུལ་ཞུགས་མཆོག་ལྡན་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the feet of the one holding the supreme conduct I praise.",
      "en-trans": "tulzhuk chokden zhab la solwa deb"
    },
    {
      "bo": "པདྨ་བཛྲ་མདོག་དཀར་ཁྱིམ་པའི་གཟུགས། །",
      "en": "Padmavajra in the form of a layman, white in colour,",
      "en-trans": "pema benza dok kar khyimpé zuk"
    },
    {
      "bo": "ཤིང་ཏོག་གསོལ་ཞིང་ལམ་མཆོག་བསྒོམ་པར་མཛད། །",
      "en": "Performing the path of supreme meditation and eating only fruit,",
      "en-trans": "shingtok sol zhing lam chok gompar dzé"
    },
    {
      "bo": "རྫུ་འཕྲུལ་སྟག་མོ་བཅིབས་ཏེ་ནམ་མཁར་གཤེགས། །",
      "en": "Flying in the sky, riding an emanated tigress;",
      "en-trans": "dzutrul takmo chib té namkhar shek"
    },
    {
      "bo": "གདུག་ཅན་འདུལ་མཛད་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the feet of the one who subdues evil I praise.",
      "en-trans": "dukchen dul dzé zhab la solwa deb"
    },
    {
      "bo": "གྲུབ་ཆེན་བརྒྱད་ལ་གསོལ་བ་བཏབ་པའི་མཐུས། །",
      "en": "Through the power of this praise,",
      "en-trans": "drubchen gyé la solwa tabpé tü"
    },
    {
      "bo": "བདག་ཅག་དཔོན་སློབ་ཡོན་མཆོད་འཁོར་བཅས་ཀྱི། །",
      "en": "May we together, teachers, students and sponsors,",
      "en-trans": "dakchak pönlob yönchö khor ché kyi"
    },
    {
      "bo": "གནས་སྐབས་ཀུན་ཏུ་མི་མཐུན་བར་ཆད་སེལ། །",
      "en": "I request, at all times be free from negative obstacles",
      "en-trans": "nekab küntu mitün barché sel"
    },
    {
      "bo": "མཐུན་པའི་ལམ་སྣ་ཆོས་ལ་དྲང་དུ་གསོལ། །",
      "en": "And be taken onto the positive Dharma path.",
      "en-trans": "tünpé lam na chö la drang du sol"
    }
  ]
}