{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/melody-of-deathless-vajra-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཆི་མེད་ཚེ་ལྷ་རྣམ་གསུམ་ལ་འདོད་དོན་དངོས་གྲུབ་བསྐུལ་བ་འཆི་མེད་རྡོ་རྗེའི་དབྱངས་སྙན་ཞེས་བྱ་བ་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ཨརྱ་ཏཱ་རེ་ཡེ།"
    },
    {
      "bo": "ཨོཾ་སྭ་སྟི།"
    },
    {
      "bo": "འཆི་མེད་རྟག་པ་དམ་པའི་སྐུ།    །"
    },
    {
      "bo": "འགགས་མེད་ཚངས་དབྱངས་ནཱ་དའི་གསུང་།    །"
    },
    {
      "bo": "མི་ཤིག་རྡོ་རྗེའི་ཐུགས་མངའ་བ།    །"
    },
    {
      "bo": "བླ་མ་ཡིད་བཞིན་འཁོར་ལོས་སྐྱོངས།    །"
    },
    {
      "bo": "རྡོ་རྗེ་སེམས་དཔའི་ལང་ཚོ་བརྙེས།    །"
    },
    {
      "bo": "བདེ་ཆེན་ཁ་སྦྱོར་གྲུབ་པ་ཡི།    །"
    },
    {
      "bo": "ཟུང་འཇུག་བདུད་རྩིའི་རྟག་མྱོས་པ།    །"
    },
    {
      "bo": "རྩ་བརྒྱུད་བླ་མས་བྱིན་བརླབས་རྩོལ།    །"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་ཀུན་གྱི་ཡུམ།    །"
    },
    {
      "bo": "ཤེས་རབ་ཕ་རོལ་ཕྱིན་མའི་སྐུ།    །"
    },
    {
      "bo": "གྲུབ་གཉིས་དངོས་གྲུབ་སྩོལ་མཛད་མ།    །"
    },
    {
      "bo": "ཡིད་བཞིན་འཁོར་ལོས་རྗེས་གཟུང་མཛོད།    །"
    },
    {
      "bo": "ཟླ་བ་དུང་དང་ཆུ་ཤེལ་གྱི།    །"
    },
    {
      "bo": "འོད་ཀྱི་ཕུང་པོ་བྱེ་བས་ཀྱང་།    །"
    },
    {
      "bo": "ཆ་ཙམ་བསྐྲུན་དུ་མ་མཆིས་པ།    །"
    },
    {
      "bo": "སོ་སོར་རྟོགས་པའི་ཡེ་ཤེས་ཀྱི།    །"
    },
    {
      "bo": "རང་རྩལ་ཚེ་དཔག་མེད་ལ་འདུད།    །"
    },
    {
      "bo": "དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་ལས།    །"
    },
    {
      "bo": "ཉེར་འཁྲུངས་འཆི་བདག་བདུད་ཚོགས་ཀུན།    །"
    },
    {
      "bo": "རིག་སྔགས་ནུས་པས་བཅོམ་མཛད་མ།    །"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་ལ་ཕྱག་འཚལ་བསྟོད།    །"
    },
    {
      "bo": "འཆི་མེད་ཚེ་ལྷ་རྣམ་གསུམ་གྱི།    །"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་ལས་སྦྱོར་མཐར་ཕྱིན་པས།    །"
    },
    {
      "bo": "འཆི་བདག་བདུད་ལས་རྣམ་པར་རྒྱལ།    །"
    },
    {
      "bo": "ཚེ་བསོད་ཡེ་ཤེས་དངོས་གྲུབ་སྩོལ།    །"
    },
    {
      "bo": "དངོས་གྲུབ་དམ་པས་བདག་རྒྱུད་ཕྱུག  །"
    },
    {
      "bo": "སྣོད་བཅུད་འཆི་མེད་དགེ་མཚན་རྒྱས།    །"
    },
    {
      "bo": "སྲིད་ཞིའི་དྭངས་བཅུད་འཕེལ་བ་དང་།    །"
    },
    {
      "bo": "རྟག་པ་དམ་པའི་བཀྲ་ཤིས་ཤོག  །"
    }
  ]
}