{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/supplication-to-realize-the-profound",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཟབ་དོན་རྟོགས་པའི་གསོལ་འདེབས་བཞུགས།",
    "en": "A Supplication to Realize the Profound"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!"
    },
    {
      "bo": "ཆོས་དབྱིངས་མཁའ་ལ་ཐུགས་རྗེའི་སྤྲིན་འཁྲིགས་ཤིང་། །",
      "en": "You cause a pleasant rain of accomplishment and blessings to fall",
      "en-trans": "chöying kha la tukjé trin trik shing"
    },
    {
      "bo": "བྱིན་རླབས་དངོས་གྲུབ་སྦྲང་ཆར་འབེབ་མཛད་པ། །",
      "en": "From the clouds of compassion gathered in the sky-like dharmadhātu,",
      "en-trans": "jinlab ngödrub drang char beb dzepa"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྡོ་རྗེ་མཁྱེན་བརྩེའི་དབང་པོ་ལ། །",
      "en": "Lake-born Vajra, Khyentse Wangpo:",
      "en-trans": "tsokyé dorjé khyentsé wangpo la"
    },
    {
      "bo": "མི་ཕྱེད་སྙིང་ནས་གུས་པས་གསོལ་བ་འདེབས། །",
      "en": "I supplicate you from the very depths of my heart.",
      "en-trans": "miché nying né güpé solwa deb"
    },
    {
      "bo": "རིག་འཛིན་གྲུབ་པ་ཡོངས་ཀྱི་གདུང་འཚོབ་ཏུ། །",
      "en": "As the successor of all the vidyādharas and siddhas,",
      "en-trans": "rigdzin drubpa yong kyi dungtsob tu"
    },
    {
      "bo": "རྒྱལ་སྲས་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་ཡི། །",
      "en": "You are a bodhisattva who has perfected the wisdom",
      "en-trans": "gyalsé sempa kuntuzangpo yi"
    },
    {
      "bo": "འོད་གསལ་སྙིང་པོའི་དགོངས་པའི་རྩལ་རྫོགས་པ། །",
      "en": "Of the clear light heart-essence of Samantabhadra;",
      "en-trans": "ösal nyingpö gongpé tsaldzokpa"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མས་བདག་རྒྱུད་བྱིན་གྱིས་རློབས། །",
      "en": "Glorious Guru, please bless me to realize this myself!",
      "en-trans": "palden lamé dak gyü jingyi lob"
    },
    {
      "bo": "རང་སེམས་གདོད་ནས་སྐྱེ་མེད་རིག་པའི་གཤིས། །",
      "en": "My mind has never been born — this is the nature of awareness.",
      "en-trans": "rangsem döné kyemé rigpé shi"
    },
    {
      "bo": "མ་བཅོས་ཇི་བཞིན་བཞག་པའི་སྒོམ་པ་དང་། །",
      "en": "To settle in this experience without the slightest alteration or contrivance is meditation;",
      "en-trans": "machö jizhin zhakpé gompa dang"
    },
    {
      "bo": "སྤང་བླང་འཛིན་རྩོལ་བྲལ་བའི་སྤྱོད་པ་ཡིས། །",
      "en": "And conduct is to be without effort or concern for what to do or to avoid —",
      "en-trans": "panglang dzin tsol dralwé chöpa yi"
    },
    {
      "bo": "ཀ་དག་ཆོས་སྐུ་མངོན་དུ་འགྱུར་བར་ཤོག །",
      "en": "Through this, may I actualize the primordially pure dharmakāya!",
      "en-trans": "kadak chöku ngön du gyurwar shok"
    }
  ]
}