{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shakya-shri/milarepa-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་བཙུན་དབང་ཕྱུག་མི་ལ་བཞད་པ་རྡོ་རྗེའི་གསོལ་འདེབས།",
    "en": "Supplication to Lord Mila Shepa Dorje"
  },
  "text": [
    {
      "bo": "ན་མོ།",
      "en-trans": "namo"
    },
    {
      "bo": "བདག་དང་མཁའ་ཁྱབ་ཀྱི་སེམས་ཅན། །",
      "en": "I and all beings throughout space,",
      "en-trans": "dak dang kha khyab kyi semchen"
    },
    {
      "bo": "འདི་བཟུང་བྱང་ཆུབ་ཀྱི་བར་དུ། །",
      "en": "Until our own enlightenment is won,",
      "en-trans": "di zung chang chub kyi bar du"
    },
    {
      "bo": "སྐྱབས་གནས་བླ་མ་ཡི་ཚོགས་ལ། །",
      "en": "Respectfully turn for refuge",
      "en-trans": "kyab né lama yi tsok la"
    },
    {
      "bo": "གུས་པའི་ཡིད་ཀྱིས་སྐྱབས་སུ་མཆིའོ། །",
      "en": "To the hosts of gurus who are sources of protection.",
      "en-trans": "güpé yi kyi kyab su chi'o"
    },
    {
      "bo": "མ་གྱུར་སྲིད་པ་ཡི་སེམས་ཅན། །",
      "en": "We generate the supreme attitude —",
      "en-trans": "ma gyur sipa yi sem chen"
    },
    {
      "bo": "མྱུར་དུ་བླ་མེད་ཀྱི་བྱང་ཆུབ། །",
      "en": "Wishing that all beings throughout existence, our very own mothers,",
      "en-trans": "nyur du lamé kyi chang chub"
    },
    {
      "bo": "ཐོབ་པའི་སེམས་མཆོག་ཉིད་བསྐྱེད་དོ། །",
      "en": "May swiftly achieve unsurpassable awakening.",
      "en-trans": "tobpé sem chok nyi kyé do"
    },
    {
      "bo": "བདག་ལུས་ཐ་མལ་གྱི་སྣང་ཞེན་རང་སར་སྟོང་། །",
      "en": "Grasping at my own ordinary form and appearance dissolves into the natural state,",
      "en-trans": "dak lü tamal gyi nang zhen rang sar tong"
    },
    {
      "bo": "མ་འགགས་ཆོས་ཉིད་ཀྱི་རང་མདངས་རྣལ་འབྱོར་མར། །",
      "en": "And, as the unobstructed self-radiance of suchness, I appear clearly as the yoginī.",
      "en-trans": "ma gak chö nyi kyi rang dang naljor mar"
    },
    {
      "bo": "གསལ་བའི་དབུ་སྟེང་གི་ནམ་མཁར་པད་ཟླའི་སྟེང་། །",
      "en": "In the space above my head, upon a lotus and moon,",
      "en-trans": "salwé u teng gi namkhar pé dé teng"
    },
    {
      "bo": "བཀའ་དྲིན་འཁོར་མེད་བཞད་པ་ཡི་རྡོ་རྗེ་ནི། །",
      "en": "Is the guru of unrepayable kindness, Shepa Dorje.",
      "en-trans": "kadrin khormé zhépa yi dorje ni"
    },
    {
      "bo": "སྐུ་མདོག་སྔོ་མདངས་རས་དཀར་གྱི་ན་བཟའ་ཅན། །",
      "en": "Radiant blue, and dressed in a white cotton robe.",
      "en-trans": "ku dok ngo dang ré kar gyi nabza chen"
    },
    {
      "bo": "མཉམ་བཞག་གི་ཕྱག་རྒྱ་སྤྱན་གཉིས་ནམ་མཁར་གཟིགས། །",
      "en": "He shows the gesture of meditation as he gazes into space.",
      "en-trans": "nyam zhak gi chakgya chen nyi namkhar zik"
    },
    {
      "bo": "སྣང་སྟོང་གི་སྐུ་ཅན་ཞབས་གཉིས་སེམས་སྐྱིལ་བཞུགས། །",
      "en": "His form is apparent yet empty, and he sits in the bodhisattva posture.",
      "en-trans": "nang tong gi ku chen zhap nyi sem kyil zhuk"
    },
    {
      "bo": "ཞིང་རབ་འབྱམས་ཀྱི་བླ་མ་སྤྲིན་ལྟར་གཏིབས། །",
      "en": "Hosts of gurus from infinite realms gather around like clouds,",
      "en-trans": "zhing rabjam kyi lama trin tar tib"
    },
    {
      "bo": "མ་མཁའ་འགྲོ་རྒྱ་མཚོའི་དབུས་ན་བཞུགས། །",
      "en": "As he presides amidst an oceanic assembly of ḍākinīs.",
      "en-trans": "ma khandro gyatsöi ü na zhuk"
    },
    {
      "bo": "ཨ་ཧོ་ཡེ།",
      "en-trans": "a ho ye"
    },
    {
      "bo": "དུས་གསུམ་སངས་རྒྱས་ཀྱི་ངོ་བོ། །",
      "en": "Essence of the buddhas of the three times,",
      "en-trans": "dü sum sanggye kyi ngowo"
    },
    {
      "bo": "ཆགས་བྲལ་དམ་ཆོས་ཀྱི་འབྱུང་གནས། །",
      "en": "Source of the sublime Dharma of non-attachment,",
      "en-trans": "chakdral damchö kyi jungné"
    },
    {
      "bo": "རིག་གྲོལ་དགེ་འདུན་གྱི་གཙོ་མཆོག །",
      "en": "Supreme among the saṅgha of knowledge and freedom;",
      "en-trans": "rig drol gendün gyi tso chok"
    },
    {
      "bo": "སྐྱབས་གསུམ་ཀུན་འདུས་ཀྱི་ངོ་བོ། །",
      "en": "You in whom the threefold refuge is complete:",
      "en-trans": "kyab sum kündü kyi ngowo"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །",
      "en": "Kindly Shepa Dorje, care for me!",
      "en-trans": "drinchen zhepa dorje dé khyen no"
    },
    {
      "bo": "སྐྱབས་གནས་བླ་མ་ཡི་སྤྱི་གཟུགས། །",
      "en": "Embodiment of all refuge-granting gurus,",
      "en-trans": "kyab né lama yi chi zuk"
    },
    {
      "bo": "ཡི་དམ་རྒྱལ་བ་ཡི་ངོ་བོ། །",
      "en": "Essence of all awakened yidam deities,",
      "en-trans": "yidam gyalwa yi ngowo"
    },
    {
      "bo": "མཁའ་འགྲོ་རྒྱ་མཚོ་ཡི་གཙོ་མཆོག །",
      "en": "And supreme lord of oceanic hosts of ḍākinīs;",
      "en-trans": "khandro gyatso yi tso chok"
    },
    {
      "bo": "རྩ་གསུམ་ཀུན་འདུས་ཀྱི་ངོ་བོ། །",
      "en": "You in whom the three-root deities are complete:",
      "en-trans": "tsa sum kündü kyi ngowo"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །",
      "en": "Kindly Shepa Dorje, care for me!",
      "en-trans": "drinchen zhepa dorje dé khyen no"
    },
    {
      "bo": "བཀའ་བརྒྱུད་བསྟན་པ་ཡི་གཙུག་རྒྱན། །",
      "en": "Crown ornament of the Kagyü teachings,",
      "en-trans": "kagyü tenpa yi tsuk gyen"
    },
    {
      "bo": "གསང་ལམ་སྙན་རྒྱུད་ཀྱི་བདག་པོ། །",
      "en": "Lord of the ear-whispered secret path,",
      "en-trans": "sang lam nyen gyü kyi dakpo"
    },
    {
      "bo": "སྐལ་ལྡན་སྨིན་གྲོལ་གྱི་ཐབས་མཁས། །",
      "en": "Skilfully maturing and liberating the fortunate;",
      "en-trans": "kalden min drol gyi tab khé"
    },
    {
      "bo": "འགྲོ་དོན་ནམ་མཁའ་དང་མཉམ་པའི། །",
      "en": "You who guide all beings throughout space:",
      "en-trans": "dro dön namkha dang nyampė"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །",
      "en": "Kindly Shepa Dorje, care for me!",
      "en-trans": "drinchen zhepa dorje dé khyen no"
    },
    {
      "bo": "བདག་ནི་འདི་ཕྱི་ཚེ་རབས་ཀུན་ཏུ། །",
      "en": "In this and all my future lives,",
      "en-trans": "dak ni di chi tsé rab kün tu"
    },
    {
      "bo": "སྐྱབས་དང་རེ་ས་གཞན་ན་མེད་དོ། །",
      "en": "I have no other hope or refuge but you.",
      "en-trans": "kyab dang ré sa zhen na mé do"
    },
    {
      "bo": "ཐུགས་རྗེ་ཟུངས་ཤིག་བླ་མ་རྗེ་བཙུན་མཁྱེན་ནོ། །",
      "en": "Pray, hold me in your compassion, and, lordly master, care for me!",
      "en-trans": "tukjé zung shik lama jetsün khyen no"
    },
    {
      "bo": "སྐུ་ཡི་དབང་མཆོག་ལུས་ལ་བསྐུར། །",
      "en": "Bestow the supreme empowerment of your form upon my body,",
      "en-trans": "ku yi wang chok lü la kur"
    },
    {
      "bo": "འཕོ་མེད་འཇའ་ལུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And bless me to accomplish the immutable rainbow body.",
      "en-trans": "po mé jalü drubpar chin gyi lop"
    },
    {
      "bo": "གསུང་གི་དབང་མཆོག་ངག་ལ་བཞུགས། །",
      "en": "Cause the supreme empowerment of your voice to enter my speech,",
      "en-trans": "sung gi wang chok ngak la zhuk"
    },
    {
      "bo": "གྲགས་སྟོང་འགགས་པ་མེད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And bless me to accomplish the ceaseless unity of sound-emptiness.",
      "en-trans": "drak tong gakpa mépar chin gyi lop"
    },
    {
      "bo": "ཐུགས་ཀྱི་དབང་མཆོག་ཡིད་ལ་བཞུགས། །",
      "en": "Bestow the supreme empowerment of your wisdom upon my mind,",
      "en-trans": "tuk kyi wang chok yi la zhuk"
    },
    {
      "bo": "རིག་སྟོང་ཆོས་སྐུར་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And bless me to realize the dharmakāya of empty-awareness.",
      "en-trans": "rig tong chö kur tokpar chin gyi lop"
    },
    {
      "bo": "མཐར་རྗེ་བཙུན་བླ་མ་འོད་དུ་ཞུ། །",
      "en": "Finally, the lordly master dissolves into light",
      "en-trans": "tar jetsün lama ö du zhu"
    },
    {
      "bo": "རང་རིག་པའི་གཤིས་དང་གཉིས་མེད་འདྲེས། །",
      "en": "And becomes inseparable from the nature of my awareness:",
      "en-trans": "rang rigpé shi dang nyi mé dré"
    },
    {
      "bo": "གཞི་རང་གྲོལ་ཆོས་སྐུའི་ཀློང་དུ་ཨཱཿ",
      "en": "The self-liberation of the ground within the expanse of dharmakāya: Āḥ.",
      "en-trans": "zhi rang drol chökü long du ah"
    }
  ]
}