{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/milarepa-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དག་སྣང་ལས་རྗེ་བཙུན་བཞད་པ་རྡོ་རྗེའི་གསོལ་འདེབས་ཐུགས་རྗེའི་མྱུ་གུ་བཞུགས་སོ།།",
    "en": "A Supplication to the Illustrious Zhepa Dorje1"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷྱ༔",
      "en": "Namo gurubhyaḥ!"
    },
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "རྒྱལ་ཀུན་ཐུགས་རྗེའི་རང་གཟུགས་པད་དཀར་འཆང་༔",
      "en": "Holder of the White Lotus,2embodiment of all the buddhas' compassion—",
      "en-trans": "gyal kün tukjé rang zuk pekar chang"
    },
    {
      "bo": "འགྲོ་ལ་རྗེས་བརྩེ་ཡེ་ཤེས་སྒྱུ་མའི་གར༔",
      "en": "Tenderness and wisdom magically displaying for beings.",
      "en-trans": "dro la jé tsé yeshe gyumé gar"
    },
    {
      "bo": "རླུང་སེམས་དབང་ཐོབ་མཐུ་སྟོབས་མངའ་བདག་དཔལ༔",
      "en": "Glorious master ofprāṇa-mind,3commander of sorcery—4",
      "en-trans": "lungsem wang tob tutob ngadak pal"
    },
    {
      "bo": "རྗེ་བཙུན་བཞད་པ་རྡོ་རྗེར་གསོལ་བ་འདེབས༔",
      "en": "Illustrious Laughing Vajra, to you, I pray.",
      "en-trans": "jetsün zhepa dorjér solwa deb"
    },
    {
      "bo": "འདི་ཕྱི་བར་གསུམ་འབྲལ་མེད་རྗེས་བཟུང་སྟེ༔",
      "en": "In this life, future lives, and in the bardos, stay with me and guide me.",
      "en-trans": "di chi bar sum dralmé jezung té"
    },
    {
      "bo": "ཚེ་འདིར་ཡང་དག་ལམ་ལ་བློ་དྲངས་ནས༔",
      "en": "In this life, now that my heart5has been drawn to the authentic path,",
      "en-trans": "tsé dir yangdak lam la lo drang né"
    },
    {
      "bo": "བློ་ལྡོག་བཞི་ཡིས་བདག་རྒྱུད་གྲོལ་བ་དང་༔",
      "en": "With my being liberated by the four reorientations6",
      "en-trans": "lo dok zhi yi dak gyü drolwa dang"
    },
    {
      "bo": "སྨོན་འཇུག་སེམས་ཀྱི་མྱུ་གུས་རྒྱུད་བརླན་ཏེ༔",
      "en": "And saturated by the burgeoning of wishing and engaging bodhicitta,",
      "en-trans": "mönjuk sem kyi nyugü gyü len té"
    },
    {
      "bo": "སྲིད་པ་འཁོར་བའི་རྒྱ་མཚོ་བརྒལ་ནུས་ཤོག༔",
      "en": "May I manage to sail beyond the ocean of cyclic existence.",
      "en-trans": "sipa khorwé gyatso gal nü shok"
    },
    {
      "bo": "ཁྱད་པར་འོད་གསལ་རྡོ་རྗེ་སྙིང་པོའི་དོན༔",
      "en": "Above all, relying on the meaning of the luminous vajra essence7",
      "en-trans": "khyepar ösal dorjé nyingpö dön"
    },
    {
      "bo": "བརྒྱུད་ལྡན་བླ་མའི་མན་ངག་ལ་བརྟེན་ནས༔",
      "en": "Contained in the personal instructions of the lineage-holding guru,",
      "en-trans": "gyüden lamé mengak la ten né"
    },
    {
      "bo": "ལས་གྱི་གནད་ལ་གོལ་འཆུགས་མེད་པ་རུ༔",
      "en": "And never erring in the key points of action,",
      "en-trans": "lé gyi né la gol chuk mepa ru"
    },
    {
      "bo": "སྐུ་གསུམ་འབྲས་བུ་མཉམ་སྦྱོར་དགོངས་པའི་དོན༔",
      "en": "May I maintain a continuous flow of self-knowing dharmakāya—",
      "en-trans": "ku sum drebu nyamjor gongpé dön"
    },
    {
      "bo": "རང་རིག་ཆོས་སྐུའི་གཏན་སྲིད་ཟིན་པར་ཤོག༔",
      "en": "The ultimate meaning of the unified fruition of the three kāyas.",
      "en-trans": "rangrig chökü tensi zinpar shok"
    },
    {
      "bo": "གལ་ཏེ་རང་རིག་ཀློང་དུ་མ་གྱུར་ན༔",
      "en": "If I fail to merge with the self-knowing expanse,",
      "en-trans": "galté rangrig long du ma gyur na"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མ་ཁྱེད་དང་དབྱེར་མེད་པར༔",
      "en": "Then, as I remain connected to you, illustrious guru,",
      "en-trans": "jetsün lama khyé dang yermé par"
    },
    {
      "bo": "དག་པ་མཁའ་སྤྱོད་ཞིང་དུ་འདྲེན་པར་ཤོག༔",
      "en": "Please guide me to the pure paradise of Khecarā.8",
      "en-trans": "dakpa khachö zhing du drenpar shok"
    },
    {
      "bo": "ཞིང་དེར་སྐྱེས་ནས་རིག་འཛིན་སྟོན་འཁོར་གྱི༔",
      "en": "Once I'm born in that paradise, though I will be free in the expanse",
      "en-trans": "zhing der kyé né rigdzin tönkhor gyi"
    },
    {
      "bo": "དགོངས་པ་དབྱེར་མེད་ཀློང་དུ་གྲོལ་ནས་ཀྱང་༔",
      "en": "Of the teacher and retinue's minds merged as one,",
      "en-trans": "gongpa yermé long du drol né kyang"
    },
    {
      "bo": "སླར་ཡང་གང་འདུལ་འགྲོ་བའི་དོན་གཉིས་ཀུན༔",
      "en": "Bless me to appear again before whoever needs me",
      "en-trans": "lar yang gang dul drowé dön nyi kün"
    },
    {
      "bo": "འབད་མེད་ཡོངས་སུ་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔",
      "en": "That I may effortlessly and perfectly bring about the range of beings' two benefits.9",
      "en-trans": "bemé yongsu drubpar jingyi lob"
    }
  ]
}