{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/milarepa-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་བཙུན་བཞད་པའི་རྡོ་རྗེའི་གསོལ་འདེབས།",
    "en": "Supplication to Milarepa"
  },
  "text": [
    {
      "bo": "དག་པའི་རྩ་ཁམས་ལྷ་ཡི་ཕྱག་རྒྱར་སྨིན། །",
      "en": "Your pure channels and elements ripened as themudrāof the deity;",
      "en-trans": "dakpé tsa kham lha yi chakgyar min"
    },
    {
      "bo": "སྲོག་རྩོལ་གཞོམ་བྲལ་རྡོ་རྗེ་ནཱ་དའི་གསུང༌། །",
      "en": "Your speech, throughprāṇāyāma, is the indestructiblenāda;",
      "en-trans": "soktsol zhomdral dorjé na dé sung"
    },
    {
      "bo": "བདེ་ཆེན་ལྷན་སྐྱེས་དགའ་བཞིས་མྱོས་པའི་ཐུགས། །",
      "en": "And your mind, through the experience of the four joys, is co-emergent bliss.",
      "en-trans": "dechen lhenkyé ga zhi nyöpé tuk"
    },
    {
      "bo": "རྗེ་བཙུན་བཞད་པ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Lordly Shepa Dorje, I supplicate you.",
      "en-trans": "jetsün zhepa dorjér solwa deb"
    },
    {
      "bo": "སྲིད་པར་ཞེན་ལོག་ཆོས་བརྒྱད་འཆིང་ལས་གྲོལ། །",
      "en": "Having given up addiction toward existence, let me be freed from the shackles of the eight worldly concerns.",
      "en-trans": "sipar zhenlok chö gyé ching lé drol"
    },
    {
      "bo": "མོས་གུས་ཚད་བྱིན་བླ་མ་སངས་རྒྱས་མཐོང༌། །",
      "en": "With perfect respect, may I receive your blessings and see the guru as a buddha;",
      "en-trans": "mögü tsé jin lama sangye tong"
    },
    {
      "bo": "དབེན་པར་རྩེ་གཅིག་སྒྲུབ་པའི་རྣལ་འབྱོར་གྱིས། །",
      "en": "And, with single-pointed accomplishment of yoga in isolated places,",
      "en-trans": "wenpar tsechik drubpé naljor gyi"
    },
    {
      "bo": "སྐུ་བཞིའི་བཙན་ས་ཚེ་འདིར་ཟིན་པར་མཛོད། །",
      "en": "May I seize the throne of the four kāyas in but a single lifetime.",
      "en-trans": "ku zhi tsensa tsé dir zinpar dzö"
    },
    {
      "bo": "ནམ་ཞིག་ཚེ་འཕོས་མགོན་ཁྱོད་དགྱེས་པའི་ཞིང༌། །",
      "en": "When my time comes, may I be born in your joyful buddha-field, my protector –",
      "en-trans": "namzhik tsé pö gön khyö gyepé zhing"
    },
    {
      "bo": "རང་སྣང་མངོན་པར་དགའ་བའི་ཚལ་སྐྱེས་ཏེ། །",
      "en": "The natural manifestation of the pleasant realm, Intense Joy.",
      "en-trans": "rangnang ngönpar gawé tsal kyé té"
    },
    {
      "bo": "འབྲེལ་ཐོག་མཁའ་ཁྱབ་ཡིད་ཅན་རྒྱ་མཚོ་ཀུན། །",
      "en": "Then, having awakened there, may I lead all the infinite beings",
      "en-trans": "drel tok khakhyab yichen gyatso kün"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་གོ་འཕང་འགོད་ནུས་ཤོག །",
      "en": "With whom I have a connection to the state of the mighty yogin.",
      "en-trans": "naljor wangchuk gopang gö nü shok"
    }
  ]
}