{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/gaton-ngawang-lekpa/bestower-supreme-blessings-prayer-to-khyentse-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཆོག་སྤྲུལ་ཐམས་ཅད་མཁྱེན་པའི་གསོལ་འདེབས་བྱིན་རླབས་མཆོག་སྩོལ་ཞེས་བྱ་བ་བཞུགས་སོ།།"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་རྒྱལ་བའི་ཡབ་གཅིག་འཇ༵མ་པའི་དབྱ༵ངས། །"
    },
    {
      "bo": "ཟབ་རྒྱས་ཆོས༵་ཀྱི༵་དགའ་སྟོན་སྤེལ་སླད་དུ། །"
    },
    {
      "bo": "བློ༵་གྲོ༵ས་མཚུངས་མེད་བཤེས་གཉེན་མཆོག་གི་སྐུར། །"
    },
    {
      "bo": "ཡོངས་ཤར་ཁྱབ་བདག་བླ་མ་ཞབས་བརྟན་གསོལ། །"
    },
    {
      "bo": "ལེགས་གསུང་འདུལ་བའི་ཁྲིམས་ཀྱི་ཡུ་བ་བརྟན། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་གཉིས་དར་གྱི་ལྷབ་ལྷུབ་གཡོ། །"
    },
    {
      "bo": "གསང་ཆེན་སྨིན་གྲོལ་ནོར་བུའི་ཏོག་ལྡན་པ། །"
    },
    {
      "bo": "ཡོངས་འཛིན་བསྟན་པའི་རྒྱལ་མཚན་མཆོག་ལ་འདུད། །"
    },
    {
      "bo": "མང་དུ་ཐོས་པའི་ནོར་གྱིས་རྒྱུད་ཕྱུག་ཅིང་། །"
    },
    {
      "bo": "དེ་དོན་བསམ་པའི་སྒྲོ་འདོགས་ནང་ནས་ཆོད། །"
    },
    {
      "bo": "རྩེ་གཅིག་བསྒོམ་པའི་ཏིང་འཛིན་བདུད་རྩི་ཡིས། །"
    },
    {
      "bo": "རྟོགས་པའི་ལུས་སྟོབས་རྒྱས་པ་དེ་ལ་འདུད། །"
    },
    {
      "bo": "མཁྱེན་པའི་ཡེ་ཤེས་ཟུང་གི་སྤྱན་དང་ལྡན། །"
    },
    {
      "bo": "བརྩེ་བའི་ཐུགས་རྗེ་འགྲོ་ཀུན་རྗེས་སུ་འཛིན། །"
    },
    {
      "bo": "གང་གི་ནུས་པ་ལུང་རྟོགས་བསྟན་པའི་དཔལ། །"
    },
    {
      "bo": "མཚུངས་མེད་བླ་མ་དམ་པའི་ཞབས་ལ་འདུད། །"
    },
    {
      "bo": "འཆད་པའི་ལེགས་བཤད་སྐལ་ལྡན་གདུལ་བྱའི་དཔལ། །"
    },
    {
      "bo": "རྩོད་པའི་རིགས་པས་ཕས་རྒོལ་ལོག་ལྟ་འཇོམས། །"
    },
    {
      "bo": "རྩོམ་ཕྲེང་རྒྱལ་བསྟན་མཛེས་པའི་རྒྱན་གྱུར་པ། །"
    },
    {
      "bo": "སྨྲ་བའི་དབང་པོ་མཆོག་གི་ཞབས་ལ་འདུད། །"
    },
    {
      "bo": "སྙིགས་དུས་གངས་ཅན་བོད་ཀྱི་གདུལ་བྱ་ལ། །"
    },
    {
      "bo": "དམིགས་མེད་བརྩེ་བའི་ཐུགས་ཀྱིས་རྟག་དགོངས་ཤིང་། །"
    },
    {
      "bo": "བསྡུ་དངོས་བཞི་ཡི་ལེགས་མཛད་མཐའ་ཡས་པས། །"
    },
    {
      "bo": "ཕན་བདེའི་དགའ་སྟོན་སྤེལ་མཛད་ཞབས་ལ་འདུད། །"
    },
    {
      "bo": "དེ་ལྟར་རྩེ་གཅིག་གུས་པས་གསོལ་བཏབ་མཐུས། །"
    },
    {
      "bo": "དྲི་མེད་ཐུབ་བསྟན་ཕྱོགས་བཅུར་རྒྱས་པ་དང་། །"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་མཆོག་ཞབས་པད་རྟག་བརྟན་ཅིང་། །"
    },
    {
      "bo": "རྣམ་དཀར་ཕྲིན་ལས་རྒྱས་པར་མཛད་དུ་གསོལ། །"
    },
    {
      "bo": "ཡུལ་ཕྱོགས་ཀུན་ཏུ་ནད་མུག་འཁྲུགས་རྩོད་སོགས། །"
    },
    {
      "bo": "སྙིགས་མའི་དུས་ལྟས་ངན་པ་ཀུན་ཞི་ནས། །"
    },
    {
      "bo": "འགྲོ་ཀུན་དགེ་བཅུའི་དཔལ་ལ་སྤྱོད་པ་སོགས། །"
    },
    {
      "bo": "རྫོགས་ལྡན་གསར་པའི་བདེ་འབྱོར་རྒྱས་པར་མཛོད། །"
    },
    {
      "bo": "ཁྱད་པར་བདག་ཅག་དེང་ནས་བྱང་ཆུབ་བར། །"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ཀྱིས་འབྲལ་མེད་རྗེས་བཟུང་ཞིང་། །"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་རིམ་པ་མཐར་ཕྱིན་ནས། །"
    },
    {
      "bo": "ཐམས་ཅད་གཟིགས་པའི་གོ་འཕང་མྱུར་ཐོབ་ཤོག།"
    }
  ]
}