{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/tsultrim-zangpo-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་གྲུབ་མཆོག་ཚུལ་ཁྲིམས་བཟང་པོར་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་གྱི་རང་བཞིན་ཡེ་ཤེས་ལྔ་ལྡན།    །"
    },
    {
      "bo": "སངས་རྒྱས་སྐུ་ལྔ་འདུས་པའི་བདག་ཉིད།    །"
    },
    {
      "bo": "བླ་མ་གྲུབ་མཆོག་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "ལས་ངན་སྡིག་སྒྲིབ་དག་པར་གྱུར་ཅིག  །"
    },
    {
      "bo": "མ་ནི་སྙིང་རྗེས་འགྲོ་བ་ཀུན་ལ།    །"
    },
    {
      "bo": "བུ་གཅིག་ལྟར་བརྩེ་སྤྱན་རས་གཟིགས་དབང་།    །"
    },
    {
      "bo": "ཐུགས་རྗེ་ཆེན་པོ་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "རིགས་དྲུག་སྡུག་བསྔལ་མཚོ་ལས་དྲོངས་མཛོད།    །"
    },
    {
      "bo": "ཎི་ནི་འཁོར་འདས་མཉམ་པ་ཉིད་བརྡལ།    །"
    },
    {
      "bo": "ཆོས་ཀུན་དུ་མ་རོ་གཅིག་གཟིགས་པའི།    །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "ཆོས་ཀུན་མཉམ་ཉིད་རྟོགས་པར་མཛོད་ཅིག  །"
    },
    {
      "bo": "པད་ནི་ཆགས་མེད་རྡུལ་དང་བྲལ་བར།    །"
    },
    {
      "bo": "ཆོས་ཀུན་མ་འདྲེས་སོ་སོར་རྟོགས་པའི།    །"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་གཟིགས་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "སོ་སོ་རང་རིག་མངོན་གྱུར་མཛོད་ཅིག  །"
    },
    {
      "bo": "མེ་ནི་ཕྲིན་ལས་འབད་མེད་ལྷུན་གྲུབ།    །"
    },
    {
      "bo": "འགྲོ་བའི་རེ་འདོད་ཡིད་བཞིན་བསྐང་བ།    །"
    },
    {
      "bo": "དགོས་འདོད་ཀུན་འབྱུང་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "གདུལ་བྱའི་རེ་སྐོང་ལྷུན་གྱིས་གྲུབ་མཛོད།    །"
    },
    {
      "bo": "ཧཱུྃ་ནི་གཟུང་འཛིན་གཉིས་མེད་ཡེ་ཤེས།    །"
    },
    {
      "bo": "སྒྲིབ་བྲལ་ནམ་མཁའི་དབྱིངས་ལྟར་ཟབ་པ།    །"
    },
    {
      "bo": "ཇི་བཞིན་གཟིགས་པའི་ཚུལ་ཁྲིམས་བཟང་པོར།    །"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་རློབས།    །"
    },
    {
      "bo": "ཐུགས་རྒྱུད་དགོངས་པའི་བྱིན་རླབས་འཕོས་མཛོད།    །"
    },
    {
      "bo": "འདི་ནས་སྐྱེ་དང་ཚེ་རབས་ཀུན་ཏུ།    །"
    },
    {
      "bo": "བླ་མ་གྲུབ་མཆོག་ཚུལ་ཁྲིམ་བཟང་པོས།    །"
    },
    {
      "bo": "རྗེས་བཟུང་རང་གཞན་དོན་གཉིས་ལྷུན་གྲུབ།    །"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་འབྱོང་བར་བྱིན་རློབས།    །"
    },
    {
      "bo": "བདག་བས་གཞན་གཅེས་བྱང་ཆུབ་སེམས་མཆོག  །"
    },
    {
      "bo": "མྱུར་དུ་རྒྱུད་ལ་སྐྱེ་བར་གྱུར་ནས།    །"
    },
    {
      "bo": "འགྲོ་བའི་དོན་སྒྲུབ་བྱེད་ལ་མི་ངལ།    །"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་དང་མཚུངས་པར་བྱིན་རློབས།    །"
    },
    {
      "bo": "འགྲོ་དོན་མཁའ་ཁྱབ་འབྱུང་བར་བྱིན་རློབས།    །"
    }
  ]
}