{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-jigme-lingpa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཀུན་མཁྱེན་འཇིགས་མེད་གླིང་པར་གསོལ་འདེབས་མོས་གུས་སྙིང་གི་གཟེར་འདེབས།",
    "en": "A Prayer to the Omniscient Jigme Lingpa"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཧོ་ཡེ། རྗེ་རིགས་བརྒྱའི་ཁྱབ་བདག་འགྲོ་བའི་མགོན། །",
      "en": "Oṃ ho ye! Lord, sovereign of the hundred families and protector of beings,",
      "en-trans": "om ho yé, je rikgyé khyabdak drowé gön"
    },
    {
      "bo": "ཕ་དྲན་པས་གདུང་སེལ་འཇིགས་མེད་གླིང་། །",
      "en": "Father, Jigme Lingpa, remembering you my suffering is relieved.",
      "en-trans": "pa drenpé dung sel jikme ling"
    },
    {
      "bo": "མཚན་ཐོས་པས་སྲིད་པ་ཧྲུལ་པོར་བྱེད། །",
      "en": "Hearing your name, conditioned existence is torn right through.",
      "en-trans": "tsen töpé sipa hrulpor jé"
    },
    {
      "bo": "རྗེ་ཐོས་གྲོལ་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Lord, great liberator upon hearing, to you I pray!",
      "en-trans": "jé tödrol chenpor solwa deb"
    },
    {
      "bo": "དཔལ་པདྨ་སཾ་བྷས་ལུང་བསྟན་ཅིང་། །",
      "en": "You were prophesied by glorious Padmasambhava",
      "en-trans": "pal pema sambhé lungten ching"
    },
    {
      "bo": "རྗེ་དྲི་མེད་འོད་ཟེར་དགྱེས་ཞལ་མཇལ། །",
      "en": "And had visions of the joyful Lord Drimé Özer,",
      "en-trans": "jé drimé özer gyé zhal jal"
    },
    {
      "bo": "ཆོས་སྡེ་གསུམ་རྫོགས་ཆེན་བསྟན་པ་གཏད། །",
      "en": "Who entrusted you with the teachings of the three piṭakas and Great Perfection.",
      "en-trans": "chö désum dzogchen tenpa té"
    },
    {
      "bo": "མགོན་རང་བྱུང་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Protector Rangjung Dorje,1to you I pray!",
      "en-trans": "gön rangjung dorjér solwa deb"
    },
    {
      "bo": "ཐུགས་མཁྱེན་བརྩེའི་ཡེ་ཤེས་དྲི་མ་མེད། །",
      "en": "Your mind is immaculate, primordial wisdom of insight and love.",
      "en-trans": "tuk khyentsé yeshe drima mé"
    },
    {
      "bo": "གསུང་ཆོས་ཀྱི་སྒྲ་དབྱངས་ཡོངས་ལ་ཁྱབ། །",
      "en": "Your speech is the all-pervading Dharma song.",
      "en-trans": "sung chö kyi drayang yong la khyab"
    },
    {
      "bo": "སྐུ་ངོ་མཚར་མཚན་དཔེས་ཉིན་མོར་བྱེད། །",
      "en": "Your body shines with the major and minor marks, so wondrous.",
      "en-trans": "ku ngotsar tsenpé nyinmor jé"
    },
    {
      "bo": "ཕ་མཁྱེན་བརྩེའི་འོད་ཟེར་གསོལ་བ་འདེབས། །",
      "en": "Father, Khyentse Özer, to you I pray!",
      "en-trans": "pa khyentsé özer solwa deb"
    },
    {
      "bo": "ལམ་རིམ་གཉིས་རྣལ་འབྱོར་བྱེད་པ་ཡི། །",
      "en": "By practising the yogas of the path’s two stages,",
      "en-trans": "lam rimnyi naljor jepa yi"
    },
    {
      "bo": "རྩ་ཐིག་རླུང་མདུད་པ་རང་གྲོལ་བས། །",
      "en": "The knots of your channels, vital essences, and wind-energies were naturally freed,",
      "en-trans": "tsa tik lung düpa rangdrol bé"
    },
    {
      "bo": "ཁྱོད་མ་བསླབ་ཤེས་བྱ་མཐའ་དག་མཁྱེན། །",
      "en": "Enabling you to master, without study, all knowable things.",
      "en-trans": "khyö ma lab sheja tadak khyen"
    },
    {
      "bo": "རྗེ་འཇམ་དབྱངས་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Lord, Guru Mañjughoṣa, to you I pray!2",
      "en-trans": "jé jamyang lamar solwa deb"
    },
    {
      "bo": "ཆོས་བྱང་ཆུབ་སེམས་ཀྱི་ཐུགས་རྒྱུད་འབྱོར། །",
      "en": "Your mind of bodhicitta is rich with Dharma.",
      "en-trans": "chö changchub sem kyi tukgyü jor"
    },
    {
      "bo": "ཁྱོད་འགྲོ་བ་ཀུན་ལ་བུ་ལྟར་བརྩེ། །",
      "en": "You love all beings like your very own child",
      "en-trans": "khyö drowa kün la bu tar tsé"
    },
    {
      "bo": "མ་སེམས་ཅན་ཀུན་གྱི་ཉེར་འཚོའི་གཞི། །",
      "en": "And provide for them, all mother-like beings.",
      "en-trans": "ma semchen kün gyi nyer tsö zhi"
    },
    {
      "bo": "མགོན་སྤྱན་རས་གཟིགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Protector Avalokiteśvara, to you I pray!",
      "en-trans": "gön chenrezik la solwa deb"
    },
    {
      "bo": "ཕ་ཁྱེད་ཀྱི་མཐུ་སྟོབས་ཟླ་མེད་པས། །",
      "en": "Father, with your incomparable strength",
      "en-trans": "pa khyé kyi tutob da mepé"
    },
    {
      "bo": "བདུད་སྲིན་པོའི་གྲོང་ཁྱེར་རྨོངས་ནས་གཞོམ། །",
      "en": "You vanquish the cities of demonic rākṣasas.",
      "en-trans": "dü sinpö drongkhyer mong né zhom"
    },
    {
      "bo": "ཕྱོགས་ཀུན་ལས་རྣམ་པར་རྒྱལ་བའི་ལྷ། །",
      "en": "Deity who is victorious over all,",
      "en-trans": "chok kün lé nampar gyalwé lha"
    },
    {
      "bo": "མགོན་ལག་ན་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Protector Vajrapāṇi, to you I pray!",
      "en-trans": "gön lak na dorjér solwa deb"
    },
    {
      "bo": "སྐྱབས་རྩ་གསུམ་ཀུན་འདུས་གུ་རུ་རྗེའི། །",
      "en": "Source of refuge who embodies all the three roots, Lord Guru,",
      "en-trans": "kyab tsa sum kündü guru jé"
    },
    {
      "bo": "ཐུགས་དགོངས་པའི་གསང་མཛོད་གཏེར་ཆེན་བརྡོལ། །",
      "en": "The secret storehouse of your wisdom mind overflows with treasures.",
      "en-trans": "tuk gongpé sangdzö terchen dol"
    },
    {
      "bo": "རྗེ་སྣང་བཞིའི་ལམ་གྱི་རྩེ་མོར་སོན། །",
      "en": "Lord, you have arrived at the summit of the path of the four visions.",
      "en-trans": "jé nang zhi lam gyi tsemor sön"
    },
    {
      "bo": "ཕ་གདོད་མའི་མགོན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Father, primordial protector, to you I pray!",
      "en-trans": "pa dömé gönpor solwa deb"
    },
    {
      "bo": "མགོན་པད་འབྱུང་དྲི་མེད་འོད་ཟེར་གྱི། །",
      "en": "Protector, Lotus-Born Drimé Özer,",
      "en-trans": "gön pejung drimé özer gyi"
    },
    {
      "bo": "ཐུགས་གཏེར་གྱི་གདམས་པས་འཛམ་གླིང་ཁྱབ། །",
      "en": "The instructions of your wisdom treasures pervade the whole world.",
      "en-trans": "tuk ter gyi dampé dzamling khyab"
    },
    {
      "bo": "རྗེ་འབྲེལ་ཚད་དོན་ལྡན་ཕྲིན་ལས་ཅན། །",
      "en": "Lord whose activity makes every connection meaningful—",
      "en-trans": "jé dreltsé dönden trinlé chen"
    },
    {
      "bo": "དཔལ་པདྨ་དབང་ཆེན་གསོལ་བ་འདེབས། །",
      "en": "Glorious Pema Wangchen, to you I pray!",
      "en-trans": "pal pema wangchen solwa deb"
    },
    {
      "bo": "བུ་བདག་གི་བློ་སྙིང་བྲང་གསུམ་པོ། །",
      "en": "I, your son, from now until awakening,",
      "en-trans": "bu dak gi lo nying drang sumpo"
    },
    {
      "bo": "དུས་དེང་ནས་བྱང་ཆུབ་སྙིང་པོའི་བར། །",
      "en": "With my mind, my heart and soul,3",
      "en-trans": "dü deng né changchub nyingpö bar"
    },
    {
      "bo": "ཕ་སྐྱབས་ཀུན་འདུས་ཞལ་ཆེན་པོ་ལ། །",
      "en": "Rely on you and surrender to you entirely,",
      "en-trans": "pa kyab kündü zhal chenpo la"
    },
    {
      "bo": "རེ་ལྟོས་ལིང་བསྐྱུར་གྱི་འབུལ་ལགས་ན། །",
      "en": "Father—you are the very face and embodiment of all sources of refuge.",
      "en-trans": "ré tö ling kyur gyi bul lak na"
    },
    {
      "bo": "རྗེ་བླ་མས་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས། །",
      "en": "Lord Guru, look upon me with your wisdom eye,",
      "en-trans": "jé lamé yeshe chen gyi zik"
    },
    {
      "bo": "བདག་ཐུགས་རྗེའི་ཕྱག་གིས་མ་འདོར་ཨང་། །",
      "en": "And do not let your hand of compassion forsake me.",
      "en-trans": "dak tukjé chak gi ma dor ang"
    },
    {
      "bo": "བུ་བདག་ལ་སྐྱིད་སྡུག་ཅི་བྱུང་ཡང་། །",
      "en": "Whatever suffering or happiness befalls me, your son,",
      "en-trans": "bu dak la kyiduk chi jung yang"
    },
    {
      "bo": "ཕ་དྲན་མཆོག་བླ་མ་ཁྱེད་རང་མཁྱེན། །",
      "en": "Father, supreme object of remembrance, you know me.",
      "en-trans": "pa dren chok lama khyerang khyen"
    },
    {
      "bo": "བདག་སྙིང་ཁ་འོད་ལྔའི་ཀློང་སྒྲོམ་དུ། །",
      "en": "In the casket of the expanse of five lights within my heart",
      "en-trans": "dak nyingkha ö ngé long drom du"
    },
    {
      "bo": "ཕ་སྐུ་གསུམ་རང་བྱུང་རྡོ་རྗེ་བཞུགས། །",
      "en": "Abides the father, the naturally arisen, indestructible three kāyas.",
      "en-trans": "pa ku sum rangjung dorjé zhuk"
    },
    {
      "bo": "བུ་རིག་སྟོང་དགོངས་པའི་རྩལ་ཆེན་རྫོགས། །",
      "en": "Having perfected the great dynamic energy of awareness and emptiness,",
      "en-trans": "bu riktong gongpé tsal chen dzok"
    },
    {
      "bo": "མགོན་ཀུན་བཟང་ཐུགས་དང་དབྱེར་མེད་ཤོག །",
      "en": "May I become indivisible from the wisdom mind of the protector Samantabhadra!",
      "en-trans": "gön kunzang tuk dang yermé shok"
    }
  ]
}