{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/prayer-recalling-life-and-liberation",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་ཆེན་པ་རང་བྱུང་རྡོ་རྗེའི་རྣམ་ཐར་གསོལ་འདེབས་བཞུགས།",
    "en": "A Prayer Recalling the Life and Liberation of the Great Perfection Adept Rangjung Dorje (‘Naturally Arisen Vajra’), Jigme Lingpa"
  },
  "text": [
    {
      "bo": "སྲིད་ཞི་ཀུན་གྱི་མགོན་པོ་སྤྱན་རས་གཟིགས། །",
      "en": "To Avalokiteśvara, lord of all saṃsāra and nirvāṇa,",
      "en-trans": "sizhi kün gyi gönpo chenrezik"
    },
    {
      "bo": "བཅོམ་ལྡན་འོད་སྲུང་དྲུང་ན་ཀྲྀ་ཀྲྀའི་སྲས། །",
      "en": "To the son of King Kṛkin who went before Buddha Kāśyapa,1",
      "en-trans": "chomden ösung drung na kri kri sé"
    },
    {
      "bo": "ཤཱཀྱ་ཐུབ་པའི་མཆེད་ཟླ་གཅུང་དགའ་བོ། །",
      "en": "To Nanda, the younger half-brother of Śākyamuni,",
      "en-trans": "shakya tubpé chéda chunggawo"
    },
    {
      "bo": "དགྲ་བཅོམ་མཚན་བཟང་ལྡན་ལ་གསོལ་བ་འདེབས། །",
      "en": "And to the arhat Tsen Zangden, I pray!",
      "en-trans": "drachom tsen zang den la solwa deb"
    },
    {
      "bo": "ཐེག་མཆོག་སྟོན་པ་དགའ་རབ་ཤྲཱི་སེང་། །",
      "en": "To Garab Dorjé and Śrī Siṃha, teachers of the Supreme Vehicle,",
      "en-trans": "tek chok tönpa garab shiri seng"
    },
    {
      "bo": "དྲི་མེད་བཤེས་གཉེན་སྲོང་བཙན་ཨ་ཀརྨ། །",
      "en": "To Vimalamitra and Akaramati2who was emanated by Songtsen Gampo,",
      "en-trans": "drimé shenyen songtsen akarma"
    },
    {
      "bo": "རྗེ་འབངས་གྲོགས་གསུམ་རྒྱལ་སྲས་ལྷ་རྗེའི་རྒྱུད། །",
      "en": "The king Tri Songdeutsen, subject Vairotsana, companion Yeshe Tsogyal, and Gyalsé Lharjé—",
      "en-trans": "jebang drok sum gyalsé lharjé gyü"
    },
    {
      "bo": "རྣམ་འཕྲུལ་དུ་མར་ཤར་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you who appeared in these various manifestations, I pray!",
      "en-trans": "namtrul dumar shar la solwa deb"
    },
    {
      "bo": "གཞོན་ནུ་རོལ་རྩེད་དུས་ནས་སྙིང་རྗེ་དང་། །",
      "en": "From when you played games as a child, you were compassionate,",
      "en-trans": "zhönnu roltsé dü né nyingjé dang"
    },
    {
      "bo": "ངེས་འབྱུང་སྐྱོ་ཤས་དྲག་པོས་རྒྱུད་བརླན་ཏེ། །",
      "en": "And your mind was filled with intense renunciation and disenchantment.",
      "en-trans": "ngejung kyoshé drakpö gyü len té"
    },
    {
      "bo": "དབེན་པ་ཁོ་ནར་མོས་པའི་ཞེན་ལོག་གིས། །",
      "en": "Through your disgust for saṃsāra and longing only for solitude,",
      "en-trans": "wenpa khonar möpé zhenlok gi"
    },
    {
      "bo": "འདུ་འཛིའི་གཡུལ་ལས་རྒྱལ་ལ་གསོལ་བ་འདེབས། །",
      "en": "You were victorious in the battle against mindless entertainment—to you I pray!",
      "en-trans": "dudzi yul lé gyal la solwa deb"
    },
    {
      "bo": "ཉི་ཤུ་རྩ་ལྔའི་ལོ་ནས་ཚོགས་སྦྱོར་ལམ། །",
      "en": "From your twenty-fifth year, you traversed the paths of accumulation and joining,",
      "en-trans": "nyishu tsangé loné tsok jor lam"
    },
    {
      "bo": "མོས་གུས་སྙིང་རྗེ་བསྐྱེད་རྫོགས་ཐབས་ལམ་ལ། །",
      "en": "And, through enduring hardships while cultivating devotion and compassion,",
      "en-trans": "mögü nyingjé kyedzok tablam la"
    },
    {
      "bo": "སྒྲུབ་པའི་དཀའ་ཐུབ་བསྟེན་པས་ཆོས་ཉིད་དོན། །",
      "en": "And following the path of skilful means on the generation and perfection stages,",
      "en-trans": "drubpé katub tenpé chönyi dön"
    },
    {
      "bo": "མ་ནོར་མངོན་སུམ་མཐོང་ལ་གསོལ་བ་འདེབས། །",
      "en": "You saw thedharmatānature of reality directly and unerringly—to you, I pray!",
      "en-trans": "manor ngönsum tong la solwa deb"
    },
    {
      "bo": "དཔལ་གྱི་བསམ་ཡས་མཆིམས་ཕུའི་དགེའུ་རུ། །",
      "en": "When, in a cave at glorious Samyé Chimphu,",
      "en-trans": "pal gyi samyé chimpü gé'u ru"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཞལ་གཟིགས་ལུང་བསྟན་ཐོབ་པའི་མོད། །",
      "en": "You beheld the omniscient Longchenpa and received prophecies,",
      "en-trans": "künkhyen zhalzik lungten tobpé mö"
    },
    {
      "bo": "ཇི་ལྟ་ཇི་སྙེད་སྤོབས་པའི་གཏེར་གྲོལ་ཏེ། །",
      "en": "The treasure of courageous eloquence regarding the nature and multiplicity of things was unlocked,",
      "en-trans": "jita jinyé pobpé ter drol té"
    },
    {
      "bo": "མངོན་པའི་ང་རྒྱལ་ཟད་ལ་གསོལ་བ་འདེབས། །",
      "en": "And the pride of conceit3faded away—to you, I pray!",
      "en-trans": "ngönpé ngagyal zé la solwa deb"
    },
    {
      "bo": "རྙིང་བསྟན་རི་མོའི་མར་མེ་ལྟར་གྱུར་དུས། །",
      "en": "When the Nyingma teachings had become just like a painted candle,",
      "en-trans": "nying ten rimö marmé tar gyur dü"
    },
    {
      "bo": "རྒྱུད་འབུམ་གླེགས་བམ་རྫོགས་དང་ཆོས་འབྱུང་བསྐྲུན། །",
      "en": "You compiled the tantras, produced a history of Dharma,",
      "en-trans": "gyübum lekbam dzok dang chöjung trün"
    },
    {
      "bo": "མདོ་སྒྱུ་སེམས་གསུམ་སྙིང་ཏིག་བཀའ་གཏེར་གྱི། །",
      "en": "And upheld without fail the teachings of Kama and Terma,",
      "en-trans": "do gyu sem sum nyingtik kater gyi"
    },
    {
      "bo": "བསྟན་པ་མ་ནོར་འཛིན་ལ་གསོལ་བ་འདེབས། །",
      "en": "The Heart Essence, the Sūtra, Illusory Net and Mind4—to you I pray!",
      "en-trans": "tenpa manor dzin la solwa deb"
    },
    {
      "bo": "སྔ་འགྱུར་གྲུབ་མཐའ་ཆོས་ལུགས་སྣ་ཚོགས་ཀྱིས། །",
      "en": "When the Nyingma tenets were sullied and denigrated",
      "en-trans": "ngagyur drubta chöluk natsok kyi"
    },
    {
      "bo": "རྙོག་མར་གྱུར་ལ་གཞན་སྡེས་གཤུང་བའི་ཚེ། །",
      "en": "By various other traditions,",
      "en-trans": "nyokmar gyur la zhen dé shungwé tsé"
    },
    {
      "bo": "ཡོན་ཏན་རིན་ཆེན་མཛོད་ཀྱི་ཤིང་རྟ་ཆེས། །",
      "en": "Your great chariots of the Treasury of Precious Qualities5",
      "en-trans": "yönten rinchen dzö kyi shingta ché"
    },
    {
      "bo": "རང་སྡེའི་གྲུབ་མཐའ་སློང་ལ་གསོལ་བ་འདེབས། །",
      "en": "Elevated our own tenets—to you I pray!",
      "en-trans": "rang dé drubta long la solwa deb"
    },
    {
      "bo": "ཐོས་པ་ཉུང་དང་བློ་གྲོས་བླུན་པོ་རྣམས། །",
      "en": "Those of little learning and limited intelligence",
      "en-trans": "töpa nyung dang lodrö lünpo nam"
    },
    {
      "bo": "ཁྲོན་པའི་ལག་འགྲོ་རྨོངས་པའི་ཕྱོགས་འཛིན་ཡང་། །",
      "en": "Hold only partial views, just like the frog that lived in a well.6",
      "en-trans": "trönpé lak dro mongpé chok dzin yang"
    },
    {
      "bo": "མཁས་དང་དམ་པའི་རྒྱུ་སྐར་ཆེན་པོའི་དབུས། །",
      "en": "Yet amidst the constellations of scholars and holy beings,",
      "en-trans": "khé dang dampé gyukar chenpö ü"
    },
    {
      "bo": "བསྟན་པའི་ཉིན་བྱེད་འབར་ལ་གསོལ་བ་འདེབས། །",
      "en": "You blaze like the sun of the teachings—to you I pray!",
      "en-trans": "tenpé nyinjé bar la solwa deb"
    },
    {
      "bo": "གང་ཞིག་འཕགས་པའི་སྤངས་རྟོགས་བརྙེས་པ་རྣམས། །",
      "en": "Noble ones, who have obtained qualities of freedom and realization,",
      "en-trans": "gangzhik pakpé pang tok nyepa nam"
    },
    {
      "bo": "རྣམ་རྟོག་རང་རྒྱུད་ལས་འདས་ཆོས་ཉིད་ཕྱིར། །",
      "en": "Transcend ordinary concepts, since they abide in reality.",
      "en-trans": "namtok ranggyü lé dé chönyi chir"
    },
    {
      "bo": "སྒོམ་བྱུང་ཤེས་རབ་ཟླ་བ་ཉ་གང་ནས། །",
      "en": "Thus, when yourprajñāborn of meditation became as complete as a full moon,",
      "en-trans": "gomjung sherab dawa nyagang né"
    },
    {
      "bo": "ཆོས་ཀྱི་གཏེར་མཛོད་རྙེད་ལ་གསོལ་བ་འདེབས། །",
      "en": "You gained a treasure trove of Dharma—to you I pray!",
      "en-trans": "chö kyi terdzö nyé la solwa deb"
    },
    {
      "bo": "དབེན་པ་ཁོ་ནར་སྦས་ཀྱང་ལས་ཅན་རྣམས། །",
      "en": "You remained in solitude, but still those with karmic fortune",
      "en-trans": "wenpa khonar bé kyang lechen nam"
    },
    {
      "bo": "མཚོ་ལ་ངང་པ་ཇི་བཞིན་རིང་ནས་འདུ། །",
      "en": "Gathered from afar, like swans drawn to a lake.",
      "en-trans": "tso la ngangpa jizhin ring né du"
    },
    {
      "bo": "སྐལ་མེད་རྟག་ཏུ་བསྙེན་ཀྱང་མི་ཐུལ་ན། །",
      "en": "Those without fortune, no matter how close, cannot be tamed,",
      "en-trans": "kalmé taktu nyen kyang mi tul na"
    },
    {
      "bo": "མང་པོའི་ཚོགས་དཔོན་སྤངས་ལ་གསོལ་བ་འདེབས། །",
      "en": "And so you renounce positions of leadership—to you, I pray!",
      "en-trans": "mangpö tsok pön pang la solwa deb"
    },
    {
      "bo": "མནོག་ཆུང་ཚེ་འདིའི་ཕུན་ཚོགས་ལ་དམིགས་ནས། །",
      "en": "Thinking of the trifling concerns that are the bounties of this life,",
      "en-trans": "nok chung tsé di püntsok la mik né"
    },
    {
      "bo": "འཇིག་རྟེན་ཆོས་དང་མཐུན་པར་མི་འཇུག་ཀྱང་། །",
      "en": "You do not try to combine worldly ways with Dharma,",
      "en-trans": "jikten chö dang tünpar mi juk kyang"
    },
    {
      "bo": "རྣམ་ཐར་ངོ་ལྐོག་སྤངས་པའི་བརྟུལ་ཞུགས་ལ། །",
      "en": "But practise pure yogic discipline, free from hypocrisy—",
      "en-trans": "namtar ngokok pangpé tulzhuk la"
    },
    {
      "bo": "ས་ར་ཧ་པ་དགྱེས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you whose ways would delight Saraha himself, I pray!",
      "en-trans": "sarahapa gyé la solwa deb"
    },
    {
      "bo": "བློ་སྣ་ཐུང་ཡང་བསྟན་འགྲོའི་དོན་ལ་བརྩོན། །",
      "en": "Though beings are short-tempered, you strive to benefit them and the teachings.",
      "en-trans": "lona tung yang ten drö dön la tsön"
    },
    {
      "bo": "ཡང་དག་ལམ་འཇུག་ཆོས་ཚུལ་ཙམ་མི་དམོད། །",
      "en": "Not belittling basic Dharma methods for setting out upon the genuine path,",
      "en-trans": "yangdak lam juk chö tsul tsam mi mö"
    },
    {
      "bo": "བསྟོད་བསྔགས་བཀུར་སྟིས་མི་ཁེངས་སྒྲོ་སྐུར་གྱིས། །",
      "en": "And not becoming arrogant through praise and respect—",
      "en-trans": "tö ngak kurti mi kheng drokur gyi"
    },
    {
      "bo": "འཇིགས་བྲལ་དཔའ་བོ་ཁྱེད་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you, a warrior unafraid of flattery or disparagement, I pray!",
      "en-trans": "jikdral pawo khyé la solwa deb"
    },
    {
      "bo": "དད་གཤིན་རྫས་ལ་གཟི་བྱིན་མི་བསྒྲུབ་ཅིང་། །",
      "en": "You do not make a show of offerings received out of devotion or on behalf of the dead,",
      "en-trans": "déshin dzé la zijin mi drub ching"
    },
    {
      "bo": "བཀའ་འགྱུར་ལ་སོགས་སྐུ་གསུང་ཐུགས་རྟེན་བསྐྲུན། །",
      "en": "But produce representations of enlightened body, speech and mind, such as the Buddha’s Words.",
      "en-trans": "kangyur lasok ku sung tuk ten trün"
    },
    {
      "bo": "མེས་དབོན་གནས་ལ་ཁྲི་མཆོད་སྲོག་བསླུ་སོགས། །",
      "en": "Make myriad offerings at the sacred sites of the ancestral kings, liberate lives, and so on—",
      "en-trans": "méwön né la tri chö sok lu sok"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་སྦྱོར་ལ་གསོལ་བ་འདེབས། །",
      "en": "To you, who benefits all with whom you are connected, I pray!",
      "en-trans": "dreltsé dönden jor la solwa deb"
    },
    {
      "bo": "མཉམ་རྗེས་ཀུན་ཏུ་ཆགས་སྡང་རེ་དོགས་ཀྱིས། །",
      "en": "In meditation and post-meditation alike, you are unperturbed",
      "en-trans": "nyamjé küntu chakdang redok kyi"
    },
    {
      "bo": "ཁྱོད་སེམས་འཁྲུགས་པ་མ་ཡིན་དབང་པོ་ལ། །",
      "en": "By attachment or aversion, hope or fear.",
      "en-trans": "khyö sem trukpa mayin wangpo la"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་མགོན་བཞུགས་པའི་བྱིན་རླབས་ཀྱིས། །",
      "en": "Through your blessing, Avalokiteśvara in the flesh,",
      "en-trans": "chenrezik gön zhukpé jinlab kyi"
    },
    {
      "bo": "འགྲོ་དོན་འཁོར་བ་དོང་སྤྲུགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "You benefit beings and dredge the depths of saṃsāra—to you I pray!",
      "en-trans": "dro dön khorwa dongtruk la solwa deb"
    },
    {
      "bo": "ད་དུང་སེམས་ཅན་ཁམས་ནི་མ་རྫོགས་པར། །",
      "en": "Yet still, until the realms of beings are brought to perfection,",
      "en-trans": "dadung semchen kham ni madzokpar"
    },
    {
      "bo": "གཞན་དོན་འབྱུང་བ་བྱང་ཆུབ་སེམས་གཉིས་ཀྱི། །",
      "en": "You act for beings’ benefit. Since the special power",
      "en-trans": "zhendön jungwa changchub sem nyi kyi"
    },
    {
      "bo": "ཁྱད་ཆོས་བསླུ་བ་མེད་པ་ཡིན་པའི་ཕྱིར། །",
      "en": "Of the two kinds of bodhicitta is undeceiving,",
      "en-trans": "khyechö luwa mepa yinpé chir"
    },
    {
      "bo": "གདུལ་བྱར་མ་གྱུར་སེམས་ཅན་ཡོད་མིན་ཡང་། །",
      "en": "There is no being who is not your disciple.",
      "en-trans": "duljar magyur semchen yö min yang"
    },
    {
      "bo": "སློབ་མར་གྱུར་ནས་དམ་ཚིག་དག་པ་དང་། །",
      "en": "But still, I pray: having become your disciple, may I keep my samaya pure",
      "en-trans": "lobmar gyur né damtsik dakpa dang"
    },
    {
      "bo": "བཀའ་བཞིན་བསྒྲུབ་ནས་ཐུགས་ཡིད་འདྲེས་པ་རྣམས། །",
      "en": "And act as commanded; may my mind merge with your wisdom.",
      "en-trans": "ka zhin drub né tuk yi drepa nam"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་འབྲལ་མེད་རྟེན་འབྲེལ་འགྲིག །",
      "en": "Throughout all my lives, may circumstances be right for us to never part,",
      "en-trans": "tserab küntu dralmé tendrel drik"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བ་ཅན་དང་དབྱེར་མེད་ཤོག །",
      "en": "And may I become indivisible from you, the Buddha ‘Completely Victorious’!",
      "en-trans": "nampar gyalwachen dang yermé shok"
    }
  ]
}