{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/samten-lodro-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་ཝཱ་གིནྡྲ་ཆོས་དབྱིངས་ཞི་བ་ཆེན་པོར་གཞོལ་སྐབས་ཐུགས་དམ་བསྐུལ་བའི་གསོལ་འདེབས་གདུང་དབྱངས་བྱིན་རླབས་མྱུར་འཇུག་ཅེས་བྱ་བ་བཞུགས་སོ།    །",
    "en": "A Lament and Prayer to Invoke the Wisdom Mind of Khenchen Vāgindra on the Occasion of His Passing into the Great Peace of the Dharmadhātu"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!"
    },
    {
      "bo": "གཟོད་ནས་རྣམ་གྲོལ་བྱང་ཆུབ་མཆོག་བརྙེས་ཀྱང་།    །",
      "en": "Long ago you found perfect freedom and awakening,",
      "en-trans": "zö né namdrol changchub chok nyé kyang"
    },
    {
      "bo": "གདུལ་བྱའི་འགྲོ་ལ་ལྷག་པར་ཐུགས་བརྩེ་བས།    །",
      "en": "Yet still out of exceptional love for beings to be trained",
      "en-trans": "duljé dro la lhakpar tuk tsewé"
    },
    {
      "bo": "དགེ་བའི་བཤེས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡིས།    །",
      "en": "You magically appear in the form of a spiritual friend",
      "en-trans": "geweshé kyi nampar trulpa yi"
    },
    {
      "bo": "བསྟན་འགྲོའི་དོན་ཆེན་མཛད་ལ་གསོལ་བ་འདེབས།    །",
      "en": "And greatly benefit the teachings and beings—to you I pray.",
      "en-trans": "ten drö dön chen dzé la solwa deb"
    },
    {
      "bo": "རྒྱལ་ཀུན་མཐུ་སྟོབས་གཅིག་བསྡུས་གསང་བའི་བདག  །",
      "en": "Lord of Secrets, embodiment of all the buddhas’ power and strength,",
      "en-trans": "gyal kün tutob chikdü sangwé dak"
    },
    {
      "bo": "སྙིགས་དུས་ངུར་སྨྲིག་འཆང་བའི་གཟུགས་སུ་བསྒྱུར།    །",
      "en": "In the guise of a saffron-robed monk for these degenerate times,",
      "en-trans": "nyikdü ngurmik changwé zuk su gyur"
    },
    {
      "bo": "སུམ་ལྡན་རྡོར་འཛིན་བྱེ་བའི་གཙུག་གི་རྒྱན།    །",
      "en": "An adornment on the crown of myriad vajra holders of the triple vows—",
      "en-trans": "sumden dor dzin jewé tsuk gi gyen"
    },
    {
      "bo": "ངག༵་དབ༵ང་བས༵མ་གཏན༵་བློ༵་གྲོས༵་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Ngawang Samten Lodrö, to you I pray.",
      "en-trans": "ngawang samten lodrö la solwa deb"
    },
    {
      "bo": "དུས་དགྲའི་དབང་པོ་ཚར་པ་ཆོས་རྗེ་ཡི།    །",
      "en": "Entirely without equal, you raised aloft in a hundred directions",
      "en-trans": "dü dré wangpo tsarpa chöjé yi"
    },
    {
      "bo": "ཟབ་གསང་སྙན༵་བརྒྱུད༵་བསྟན༵་པའི༵་རྒྱལ༵་མཚ༵ན་ནི།    །",
      "en": "The victory banner of the teachings of the profound, secret oral transmission1",
      "en-trans": "zabsang nyengyü tenpé gyaltsen ni"
    },
    {
      "bo": "ཕྱོགས་བརྒྱར་སྒྲེངས་ལ་འགྲན་ཟླ་ཀུན་སྤངས་པ།    །",
      "en": "From Tsarpa, Lord of Dharma and master of the enemy of time2—",
      "en-trans": "chok gyar dreng la drenda künpang pa"
    },
    {
      "bo": "ཁམས་སྟོན་སངས་རྒྱས་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །",
      "en": "Khamtön Sangye Gyatso, to you I pray.",
      "en-trans": "khamtön sangye gyatsor solwa deb"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པའི་ཞུགས་ལྕེ་འབར་བ་ཡིས།    །",
      "en": "With fiery tongues of power, strength and capacity",
      "en-trans": "tutob nüpé zhuk ché barwa yi"
    },
    {
      "bo": "མ་རུངས་འབྱུང་པོའི་ཚོགས་རྣམས་ཐལ་བར་བརླག  །",
      "en": "You utterly incinerate the hosts of unruly spirits,",
      "en-trans": "marung jungpö tsok nam talwar lak"
    },
    {
      "bo": "བསྟན་འགྲོའི་དཔུང་གཉེན་ཆེན་པོ་རང་བྱུང་བ།    །",
      "en": "Naturally arisen great defender of teachings and beings,",
      "en-trans": "ten drö pungnyen chenpo rangjungwa"
    },
    {
      "bo": "ཁྱབ་བདག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "All-pervasive lord, glorious guru, to you I pray.",
      "en-trans": "khyabdak palden lamar solwa deb"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་དེད་དཔོན་བླ་མ་རྗེ།    །",
      "en": "Precious guru, chief of oceanic maṇḍalas,",
      "en-trans": "kyilkhor gyatsö depön lama jé"
    },
    {
      "bo": "མཁྱེན་ནུས་བརྩེ་བ་འཇམ་དཔལ་དཔའ་བོ་དང་།    །",
      "en": "You are none other than the heroic Mañjuśrī,",
      "en-trans": "khyen nü tsewa jampal pawo dang"
    },
    {
      "bo": "ཐ་དད་མ་མཆིས་རྡོ་རྗེའི་སྐུ་མཆོག་ལ།    །",
      "en": "Wise, powerful and caring in your supreme vajra form",
      "en-trans": "tadé ma chi dorjé ku chok la"
    },
    {
      "bo": "སྐྱེ་འཆིའི་ཟུག་རྔུ་གཞར་ཡང་མ་མཆིས་ཀྱང་།    །",
      "en": "That could never undergo birth or death.",
      "en-trans": "kyechi zukngu zhar yang ma chi kyang"
    },
    {
      "bo": "རྟག་འཛིན་བཟློག་པའི་གཉེན་པོར་གཟུགས་ཀྱི་སྐུའི།    །",
      "en": "Yet, as a means to counteract our impressions of endurance,",
      "en-trans": "tak dzin dokpé nyenpor zuk kyi kü"
    },
    {
      "bo": "སྤྲོས་པ་དབྱིངས་སུ་ཐིམ་པར་བསྟན་པའི་ཚེ།    །",
      "en": "You have displayed the absorption of form into basic space.",
      "en-trans": "tröpa ying su timpar tenpé tsé"
    },
    {
      "bo": "མགོན་མེད་བདག་ནི་མ་རིག་མུན་པར་འཁྱམས།    །",
      "en": "And now, protectorless, I wander alone in delusion’s darkness.",
      "en-trans": "gönmé dak ni marik münpar khyam"
    },
    {
      "bo": "ཐུགས་རྗེས་ངེས་པར་གཟིགས་ཤིག་བླ་མ་མཁྱེན།    །",
      "en": "Look upon me with compassion, O guru: care for me!",
      "en-trans": "tukjé ngepar zik shik lama khyen"
    },
    {
      "bo": "བུ་ཡི་སྡུག་བསྔལ་ཕ་ཡིས་མ་སེལ་ན།    །",
      "en": "When a father does not aid a child in distress,",
      "en-trans": "bu yi dukngal pa yi ma sel na"
    },
    {
      "bo": "ཉེས་པ་སེལ་བྱེད་སྐྱབས་གཞན་སུ་ཞིག་ཚོལ།    །",
      "en": "Who else will assist in the elimination of faults?",
      "en-trans": "nyepa sel jé kyab zhen su zhik tsol"
    },
    {
      "bo": "ཀྱེ་མ་ཀྱི་ཧུད་བླ་མ་རྡོ་རྗེ་འཆང་།    །",
      "en": "Alas and alack! O guru Vajradhara,",
      "en-trans": "kyema kyi hü lama dorjé chang"
    },
    {
      "bo": "སྙིང་ནས་དྲན་པའི་ཤུགས་ཀྱིས་གསོལ་བ་འདེབས།    །",
      "en": "From the depths of my heart, I pray to you.",
      "en-trans": "nying né drenpé shuk kyi solwa deb"
    },
    {
      "bo": "ཆོས་དབྱིངས་མཁའ་ལ་སྤྲུལ་པའི་སྤྲིན་ཕུང་འཁྲིགས།    །",
      "en": "Let your cloud-like emanations gather in the sky of dharmadhātu",
      "en-trans": "chöying kha la trulpé trinpung trik"
    },
    {
      "bo": "གསང་བ་གསུམ་གྱི་བྱིན་རླབས་གྲུ་ཆར་ཕོབས།    །",
      "en": "And rain down the blessings of your secret body, speech and mind.",
      "en-trans": "sangwa sum gyi jinlab druchar pob"
    },
    {
      "bo": "བདག་རྒྱུད་གསང་གསུམ་རྡོ་རྗེར་སྨིན་པར་མཛོད།    །",
      "en": "Through this, may my own character ripen as the three secrets",
      "en-trans": "dak gyü sang sum dorjér minpar dzö"
    },
    {
      "bo": "བླ་མ་སྐུ་བཞིའི་འབྲས་བཟང་དངོས་གྲུབ་སྩོལ།    །",
      "en": "And bring forth the fine crop of accomplishing the guru’s four kāyas.",
      "en-trans": "lama ku zhi dré zang ngödrub tsol"
    },
    {
      "bo": "གང་འདུལ་སྤྲུལ་པ་དཔག་ཡས་རབ་སྟོན་ནས།    །",
      "en": "Perfectly reveal infinite emanations according to disciples’ needs,",
      "en-trans": "gang dul trulpa pakyé rab tön né"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་བའི་དོན་གཉིས་རླབས་ཆེན་སྒྲུབ།    །",
      "en": "To accomplish vast waves of activity on behalf of the teachings and beings.",
      "en-trans": "ten dang drowé dön nyi lab chen drub"
    },
    {
      "bo": "བདག་སོགས་སློབ་འབངས་དམ་ཚིག་རྣམ་པར་དག  །",
      "en": "May I and all your other subjects perfectly maintain purest samaya",
      "en-trans": "dak sok lob bang damtsik nampar dak"
    },
    {
      "bo": "བླ་མ་མཆོག་དང་ནམ་ཡང་མི་འབྲལ་ཤོག  །",
      "en": "And may we never ever part from you, the most sublime of gurus.",
      "en-trans": "lama chok dang namyang mindral shok"
    }
  ]
}