{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/adeu-rinpoche/wangdu-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དབང་སྡུད་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ་ཧྲཱིཿ"
    },
    {
      "bo": "འགྱུར་མེད་ཡེ་ཤེས་འོད་གསལ་ཆོས་སྐུའི་དབྱིངས། །"
    },
    {
      "bo": "ཟག་མེད་རང་བྱུང་འོད་ལྔ་འཁྲུགས་པའི་ཞིང་། །"
    },
    {
      "bo": "བདེ་ཆེན་པདྨ་འཁྱིལ་བའི་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "ཚད་མེད་ཐུགས་རྗེའི་བརྩེ་བས་རྗེས་ཆགས་པའི། །"
    },
    {
      "bo": "བསམ་ཡས་སྒྱུ་འཕྲུལ་དྲྭ་བའི་རོལ་གར་ལས། །"
    },
    {
      "bo": "སོར་རྟོགས་ཡེ་ཤེས་གཟི་བརྗིད་འོད་མཐའ་ཡས། །"
    },
    {
      "bo": "འཇིག་རྟེན་དབང་ཕྱུག་པདྨ་གར་གྱི་དབང་། །"
    },
    {
      "bo": "འཁོར་འདས་སྤྱི་དཔལ་དབང་ཆེན་རྟ་གདོང་བཞད། །"
    },
    {
      "bo": "ཁམས་གསུམ་དབང་སྡུད་པདྨ་རྒྱལ་པོ་མཆོག །"
    },
    {
      "bo": "བདེ་ཆེན་གསང་བ་ཡེ་ཤེས་ཌཱ་ཀྐི་མ། །"
    },
    {
      "bo": "སྲིད་ཞིའི་དངོས་ཀུན་དབང་མཛད་རིག་བྱེད་དབང་། །"
    },
    {
      "bo": "སྣང་སྲིད་ཟིལ་གནོན་བདེ་མཆོག་འདོད་པའི་རྒྱལ། །"
    },
    {
      "bo": "མགོན་དམར་ཆགས་པའི་རྡོ་རྗེ་དྲེགས་ཚོགས་འདུལ། །"
    },
    {
      "bo": "སྲིད་གསུམ་དབང་མཛད་ལྷ་ཆེན་ཚོགས་ཀྱི་བདག །"
    },
    {
      "bo": "ཁམས་གསུམ་ཡིད་འགུག་ཁྲོ་བོ་འདོད་པའི་རྒྱལ། །"
    },
    {
      "bo": "འཇིག་རྟེན་མེས་པོ་དབང་ཕྱུག་ལྷ་ཆེན་པོ། །"
    },
    {
      "bo": "བདེ་ཆེན་དགྱེས་དགུའི་གར་རོལ་འདོད་དབང་མ། །"
    },
    {
      "bo": "སྲིད་ཞིའི་ལེགས་ཚོགས་དབང་སྡུད་གེ་སར་རྒྱལ། །"
    },
    {
      "bo": "དབང་གི་ལས་ལ་མངའ་བརྙེས་རྩ་གསུམ་ལྷ། །"
    },
    {
      "bo": "གསང་བ་དགྱེས་བདེའི་གར་རོལ་དཔའ་བོའི་སྡེ། །"
    },
    {
      "bo": "ཡིད་ཅན་བརྟན་པ་འཕྲོག་མཛད་ཌཀྐིའི་ཚོགས། །"
    },
    {
      "bo": "བདེ་སྟོང་སྒྱུ་མའི་གར་གྱིས་རྗེས་ཆགས་གཟུགས། །"
    },
    {
      "bo": "མཛེས་བརྗིད་སྐུ་ཡི་གར་གྱིས་ནམ་མཁའ་གང་། །"
    },
    {
      "bo": "འགག་མེད་གསུང་གི་སྙན་འགྱུར་སྟོང་ཁམས་ཁྱབ། །"
    },
    {
      "bo": "བདེ་སྟོང་རིག་པའི་རྩལ་སྣང་འཁོར་འདས་གཡོ། །"
    },
    {
      "bo": "ངོ་མཚར་དབང་གི་ཕྲིན་ལས་ལྷ་ཚོགས་ལ། །"
    },
    {
      "bo": "གདུང་བས་གསོལ་འདེབས་བརྩེ་བས་རྗེས་དགོངས་ཏེ། །"
    },
    {
      "bo": "གཞི་གྲོལ་དག་མཉམ་ཡེ་ཤེས་བྱིན་ཆེན་གྱིས། །"
    },
    {
      "bo": "སྒོ་གསུམ་རྡོ་རྗེ་གསུམ་དུ་ལྷུན་རྫོགས་ནས། །"
    },
    {
      "bo": "འཁོར་འདས་ཆོས་ཀུན་བདེ་ཆེན་ཐིག་ལེར་བཟླུམ། །"
    },
    {
      "bo": "སྣང་སྲིད་དབང་སྡུད་མཆོག་ཐུན་དངོས་གྲུབ་སྩོལ། །"
    }
  ]
}