{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/mipham/great-cloud-blessings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྣང་སྲིད་དབང་དུ་སྡུད་པའི་གསོལ་འདེབས་བྱིན་རླབས་སྤྲིན་ཆེན་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྂ་ཧྲཱིཿ"
    },
    {
      "bo": "བདེ་ཆེན་འབར་བ་དབང་གི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "བདེ་སྟོང་སོ་སོར་རྟོག་པའི་ཡེ་ཤེས་སྐུ། །"
    },
    {
      "bo": "མ་ཆགས་བདེ་ལྡན་པདྨའི་རང་བཞིན་ལས། །"
    },
    {
      "bo": "རྡོ་རྗེ་ཉི་མ་སྣང་བ་ཆེན་པོའི་དཔལ། །"
    },
    {
      "bo": "ཆོས་སྐུ་སྣང་བ་མཐའ་ཡས་རྡོ་རྗེ་ཆོས། །"
    },
    {
      "bo": "འཇིག་རྟེན་དབང་ཕྱུག་ཐུགས་རྗེས་རྗེས་ཆགས་གཟུགས། །"
    },
    {
      "bo": "པདྨ་རྒྱལ་པོས་འཁོར་འདས་མངའ་དབང་བསྒྱུར། །"
    },
    {
      "bo": "སྣང་སྲིད་ཟིལ་གནོན་དབང་ཆེན་ཧེ་རུ་ཀ །"
    },
    {
      "bo": "གསང་བ་ཡེ་ཤེས་བཛྲ་ཝཱ་ར་ཧི། །"
    },
    {
      "bo": "བདེ་མཆོག་འདོད་པའི་རྒྱལ་པོ་བདེ་ཆེན་གཏེར། །"
    },
    {
      "bo": "མ་ལུས་སྐྱེ་རྒུའི་ཡིད་འཕྲོག་རིག་བྱེད་མ། །"
    },
    {
      "bo": "མཆོག་ཐུན་ཕྱག་རྒྱའི་དབང་ཕྱུག་བདེ་སྟོང་གར། །"
    },
    {
      "bo": "དབང་མཛད་རྡོ་རྗེ་དཔའ་བོ་ཌཱཀྐིའི་ཚོགས། །"
    },
    {
      "bo": "སྣང་སྟོང་མཉམ་པ་ཆེན་པོའི་ངང་ཉིད་དུ། །"
    },
    {
      "bo": "རྡོ་རྗེ་སྐུ་ཡི་གར་གྱིས་སྲིད་གསུམ་གཡོ། །"
    },
    {
      "bo": "འགག་མེད་གསུང་གི་བཞད་སྒྲས་ཁམས་གསུམ་འགུགས། །"
    },
    {
      "bo": "འོད་ཟེར་དམར་པོས་འཁོར་འདས་ཡོངས་ལ་ཁྱབ། །"
    },
    {
      "bo": "སྲིད་ཞིའི་དྭངས་བཅུད་གཡོ་ཞིང་སྡུད་པར་བྱེད། །"
    },
    {
      "bo": "རྡོ་རྗེ་ཆགས་པ་ཆེན་པོའི་ཐུགས་ཀྱིས་ནི། །"
    },
    {
      "bo": "རྣམ་གཉིས་དངོས་གྲུབ་འདོད་དགུའི་མཆོག་སྩོལ་ཞིང༌། །"
    },
    {
      "bo": "རྡོ་རྗེ་ལྕགས་ཀྱུ་ཞགས་པ་ཆེན་པོ་ཡིས། །"
    },
    {
      "bo": "སྣང་སྲིད་བདེ་བ་ཆེན་པོར་སྡོམ་བྱེད་པ། །"
    },
    {
      "bo": "མཐའ་ཡས་སྒྱུ་འཕྲུལ་དྲྭ་བའི་རོལ་གར་ཅན། །"
    },
    {
      "bo": "ཏིལ་གྱི་གོང་བུ་ཕྱེ་བ་བཞིན་བཞུགས་པའི། །"
    },
    {
      "bo": "རབ་འབྱམས་རྩ་གསུམ་དབང་གི་ལྷ་ཚོགས་ལ། །"
    },
    {
      "bo": "གུས་པས་གསོལ་བ་འདེབས་སོ་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མཆོག་ཐུན་དངོས་གྲུབ་འདོད་དགུའི་དཔལ་མཐའ་དག །"
    },
    {
      "bo": "ཐོགས་མེད་དབང་དུ་བྱེད་པའི་དངོས་གྲུབ་སྩོལ། །"
    }
  ]
}