{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/karma-chakme/gyaltsen-tsemo-pung-gyen",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་མཚན་རྩེ་མོའི་དཔུང་རྒྱན་གྱི་གསོལ་འདེབས་བཞུགས།",
    "en": "Prayer to Gyaltsen Tsemö Pung Gyen1"
  },
  "text": [
    {
      "bo": "ཨོཾ། གུ་རུ་ཡི་དམ་རྒྱལ་མཚན་རྩེ་མོའི་ཏོག །",
      "en": "Oṃ! We take refuge in the gurus, the yidams, and in you, Gyaltsen Tsemö Pung Gyen,",
      "en-trans": "om, guru yidam gyaltsen tsemö tok"
    },
    {
      "bo": "དཔུང་རྒྱན་ལྷ་ཚོགས་ཁྱེད་ལ་སྐྱབས་སུ་མཆི། །",
      "en": "Along with all your retinue!",
      "en-trans": "pung gyen lhatsok khyé la kyab su chi"
    },
    {
      "bo": "བདག་ཅག་སྙིང་ནས་གསོལ་བ་བཏབ་པའི་མཐུས། །",
      "en": "By the power of this fervent prayer of ours,",
      "en-trans": "dakchak nying né solwa tabpé tü"
    },
    {
      "bo": "རྒུད་པ་ཀུན་ལས་མྱུར་དུ་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "Quickly protect us from all failure and misfortune!",
      "en-trans": "güpa kün lé nyurdu kyab tu sol"
    },
    {
      "bo": "ཨོཾ་ཧཱུྂ་སྭཱ་ཧཱ།",
      "en": "Oṃ hūṃ svāhā!",
      "en-trans": "om hung soha"
    },
    {
      "bo": "དཔུང་རྒྱན་ལྷ་ཚོགས་ཁྱེད་ཀྱི་རྫུ་འཕྲུལ་མཐུས། །",
      "en": "O Pung Gyen, and your retinue:",
      "en-trans": "pung gyen lhatsok khyé kyi dzutrul tü"
    },
    {
      "bo": "བདག་དང་རྒྱུ་སྦྱོར་ཡོན་བདག་འཁོར་བཅས་ལ། །",
      "en": "With the force of your magical display, for us, our benefactors, and all those around us",
      "en-trans": "dak dang gyujor yöndak khor ché la"
    },
    {
      "bo": "རྨི་ལམ་ངན་དང་བསམ་ངན་སྦྱོར་རྩུབ་ཟློག །",
      "en": "Avert all bad dreams, and those who have ill thoughts or do us harm!",
      "en-trans": "milam ngen dang sam ngen jor tsub dok"
    },
    {
      "bo": "བྱད་ཁ་ཕུར་ཁ་འཐབ་རྩོད་འཁྲུགས་ལོང་ཟློག །",
      "en": "Avert spells and curses, dispute and conflict!",
      "en-trans": "jekha purkha tabtsö truklong dok"
    },
    {
      "bo": "སྲོག་ལུས་དབང་ཐང་རླུང་རྟ་རྒུད་པ་ཟློག །",
      "en": "Avert all weakening in our life force, body,wangtangand windhorse!",
      "en-trans": "sok lü wangtang lungta güpa dok"
    },
    {
      "bo": "མི་ལ་ན་ཚ་ཕྱུགས་ལ་གོད་ཁ་ཟློག །",
      "en": "Avert all illness in men and women, all loss of our resources!",
      "en-trans": "mi la natsa chuk la gökha dok"
    },
    {
      "bo": "ཚེ་དང་བསོད་ནམས་དཔལ་དང་གྲགས་པ་སོགས། །",
      "en": "Grant us long life, merit, glory and renown, and",
      "en-trans": "tsé dang sönam pal dang drakpa sok"
    },
    {
      "bo": "ཉིན་མཚན་ཀུན་ཏུ་བདེ་ལེགས་མཛད་དུ་གསོལ། །",
      "en": "Make peace and happiness reign, throughout both day and night!",
      "en-trans": "nyintsen küntu delek dzé du sol"
    }
  ]
}