{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/recitable-prayer-to-root-guru-loter-wangpo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྩ་བའི་བླ་མ་ལ་གསོལ་བ་འདེབས་པ་ངག་རྒྱུན་མ་བཞུགས།",
    "en": "Regularly Recitable Prayer to the Root Guru"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་གདན་གསུམ་ཚང་བའི་སྐུ།    །",
      "en": "You embody all sources of refuge, the three seats complete within your form,",
      "en-trans": "kyabné kündü den sum tsangwé ku"
    },
    {
      "bo": "ཉོན་མོངས་གདུང་སེལ་ཆོས་སྒྲ་སྒྲོགས་པའི་གསུང་།    །",
      "en": "Your speech proclaims the Dharma that dispels the torment of the afflictions,",
      "en-trans": "nyönmong dung sel chö dra drokpé sung"
    },
    {
      "bo": "ཡེ་ཤེས་ལྔ་ལྡན་བདེ་གསལ་མི་རྟོག་ཐུགས།    །",
      "en": "And your mind possesses the five wisdoms and bliss, clarity and non-thought—",
      "en-trans": "yeshe ngaden dé sal mitok tuk"
    },
    {
      "bo": "གསང་བ་འཛིན་པའི་བདག་པོ་རྡོ་རྗེ་འཆང་།    །",
      "en": "Sovereign preserver of secrets, Vajra Holder,",
      "en-trans": "sangwa dzinpé dakpo dorjé chang"
    },
    {
      "bo": "བློ་གཏེར་དབང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Loter Wangpo, at your feet I pray:",
      "en-trans": "loter wangpö zhab la solwa deb"
    },
    {
      "bo": "སྒོ་གསུམ་དངོས་པོ་ཀུན་གྱིས་མཆོད་པར་བགྱི།    །",
      "en": "With body, speech and mind, I offer everything to you.",
      "en-trans": "go sum ngöpo kün gyi chöpar gyi"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་བར་ཆད་ཀུན་སེལ་ཞིང་།    །",
      "en": "Dispel all outer, inner and secret obstacles.",
      "en-trans": "chi nang sangwé barché kün sel zhing"
    },
    {
      "bo": "དམ་ཚིག་ཉམས་ཆགས་ཉེས་ལྟུང་དྲི་མ་བཤགས།    །",
      "en": "I confess all faults and impairments and breakages of samaya.",
      "en-trans": "damtsik nyamchak nyetung drima shak"
    },
    {
      "bo": "བསམ་པ་ཐམས་ཅད་ལྷུན་གྱིས་གྲུབ་པ་དང་།    །",
      "en": "Cause all my wishes to be spontaneously fulfilled.",
      "en-trans": "sampa tamché lhün gyi drubpa dang"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོངས་དངོས་གྲུབ་སྩལ་དུ་གསོལ།    །",
      "en": "Grant the supreme and common attainments, I pray.",
      "en-trans": "chok dang tünmong ngödrub tsal du sol"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me to fulfil my own and others’ purpose.",
      "en-trans": "rangzhen dön nyi drubpar jingyi lob"
    },
    {
      "bo": "བྱང་ཆུབ་བར་དུ་འབྲལ་མེད་ཐུགས་རྗེས་ཟུངས།    །",
      "en": "Hold me in your compassion, never parting, until awakening.",
      "en-trans": "changchub bardu dralmé tukjé zung"
    }
  ]
}