{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/dolpopa-sherab-gyaltsen/praise-of-eight-siddhas",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གྲུབ་ཆེན་བརྒྱད་ཀྱི་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷྱཿ"
    },
    {
      "bo": "ནམ་མཁའི་མདོག་ཅན་ཆོས་སྐུ་རྡོ་རྗེ་འཆང་། །"
    },
    {
      "bo": "འགྱིང་བག་རུས་རྒྱན་རྡོ་རྗེ་དྲིལ་བུ་འཛིན། །"
    },
    {
      "bo": "མཁའ་སྤྱོད་དཀར་དམར་མཁའ་འགྲོ་ཡུམ་དང་བཅས། །"
    },
    {
      "bo": "ཕ་མཆོག་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀུར་གུམ་མདངས་ལྡན་ཀླུ་སྒྲུབ་འཛམ་གླིང་རྒྱན། །"
    },
    {
      "bo": "ནགས་ཀྱི་ལྷ་མོས་འཆི་མེད་བདུད་རྩི་ཕུལ། །"
    },
    {
      "bo": "དངོས་གྲུབ་བརྙེས་ནས་གཞན་དོན་རྒྱུན་མི་འཆད། །"
    },
    {
      "bo": "མཁས་མཆོག་གྲུབ་ཆེན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཨིནྡྲ་བྷུ་ཏི་ལྗང་སྔོན་དུ་བའི་མདོག །"
    },
    {
      "bo": "རྒྱལ་རིགས་སྤྱོད་པ་ཨོ་རྒྱན་གནས་སུ་བཞུགས། །"
    },
    {
      "bo": "སྲས་དང་ལྷན་ཅིག་མཁའ་སྤྱོད་ཞིང་དུ་གཤེགས། །"
    },
    {
      "bo": "གསང་སྔགས་བསྟན་འཛིན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱལ་བའི་མཆོག་ཊྃ་བི་ཧེ་རུ་ཀ །"
    },
    {
      "bo": "སྨུག་ནག་གཅེར་བུས་རྫུ་འཕྲུལ་སྟག་ལ་ཞོན། །"
    },
    {
      "bo": "གདིང་བ་བཏིང་ནས་ཆུ་བོ་གངྒཱ་བརྒལ། །"
    },
    {
      "bo": "རྫུ་འཕྲུལ་དབང་ཐོབ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བྲམ་ཟེ་ཆེན་པོ་དཔལ་ལྡན་སཱ་ར་ཧཱ། །"
    },
    {
      "bo": "གསེར་མདོག་ཉོན་མོངས་འབིགས་མདའ་སྤྱོད་ཅིང་། །"
    },
    {
      "bo": "དཔལ་གྱི་རི་ཡི་གནས་སུ་ནམ་མཁར་གཤེགས། །"
    },
    {
      "bo": "རླུང་སེམས་དབང་ཐོབ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་ཆེན་རས་མའི་མདོག་ཅན་དྲིལ་བུ་པ། །"
    },
    {
      "bo": "ཡུམ་སྲས་འཇའ་གུར་འཁྱིལ་བའི་འོད་ལམ་དུ། །"
    },
    {
      "bo": "རྡོ་རྗེ་དྲིལ་བུ་བསིལ་ནས་ནམ་མཁར་གཤེགས། །"
    },
    {
      "bo": "མཁའ་སྤྱོད་དབང་ཐོབ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀར་ཤམ་མདོག་ཅན་དཔལ་ལྡན་ཀུ་ཀུ་རི། །"
    },
    {
      "bo": "མྱོས་བྱེད་མཁའ་འགྲོ་ཁྱི་གཟུགས་བཾ་ནས་རོལ། །"
    },
    {
      "bo": "དངོས་གྲུབ་བརྙེས་ནས་ཐོག་མེད་མཁ་ལ་གཤེགས། །"
    },
    {
      "bo": "གྲུབ་ཆེན་རྒྱལ་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དུད་ཁའི་མདངས་ལྡན་རྒྱལ་སྲས་ལུ་ཧཱི་པ། །"
    },
    {
      "bo": "གདུག་པའི་ཉ་ལྟོས་གསོལ་ནས་དངོས་གྲུབ་བརྙེས། །"
    },
    {
      "bo": "དགེ་སློང་ཚུལ་འཛིན་འཁོར་བའི་རྒྱ་མཚོ་བརྒལ། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་མཆོག་ལྡན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པདྨ་བཛྲ་མདོག་དཀར་ཁྱིམ་པའི་གཟུགས། །"
    },
    {
      "bo": "ཤིང་ཏོག་གསོལ་ཞིང་ལམ་མཆོག་བསྒོམ་པར་མཛད། །"
    },
    {
      "bo": "རྫུ་འཕྲུལ་སྟག་མོ་བཅིབས་ཏེ་ནམ་མཁར་གཤེགས། །"
    },
    {
      "bo": "གདུག་ཅན་འདུལ་མཛད་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་ཆེན་བརྒྱད་ལ་གསོལ་བ་བཏབ་པའི་མཐུས། །"
    },
    {
      "bo": "བདག་ཅག་དཔོན་སློབ་ཡོན་མཆོད་འཁོར་བཅས་ཀྱི། །"
    },
    {
      "bo": "གནས་སྐབས་ཀུན་ཏུ་མི་མཐུན་བར་ཆད་སེལ། །"
    },
    {
      "bo": "མཐུན་པའི་ལམ་སྣ་ཆོས་ལ་དྲང་དུ་གསོལ། །"
    }
  ]
}