{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khandro-tare-lhamo/khenpo-munsel-lives-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྐྱེ་འཕྲེང་གསོལ་འདེབས་རིན་ཆེན་འཕྲེང་མཛེས་བཞུགས་སོ།།",
    "en": "A Prayer to the Succession of Lives"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷྱེཿ",
      "en": "Namo gurubhyaḥ!"
    },
    {
      "bo": "ཀ་དག་རང་བྱུང་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་༔",
      "en": "Primordially pure, self-arisen dharmakāya, Samantabhadra,",
      "en-trans": "kadak rangjung chöku kuntuzang"
    },
    {
      "bo": "རང་བཞིན་མ་འགགས་ཡེ་ཤེས་རིགས་ལྔའི་ཚོགས༔",
      "en": "Naturally unobstructed wisdom assembly of the five families,",
      "en-trans": "rangzhin magak yeshe rik ngé tsok"
    },
    {
      "bo": "ཐུགས་རྗེའི་རོལ་རྩལ་རྒྱལ་ཀུན་ཡོངས་འདུས་པ༔",
      "en": "And display of compassion, embodiment of all victorious ones—",
      "en-trans": "tukjé roltsal gyal kün yongdü pa"
    },
    {
      "bo": "ཁྱབ་བདག་མཉམ་མེད་བླ༵་མ༵་རི༵ན་པོ༵་ཆེ༵༔",
      "en": "To you, the incomparable lord, precious guru,",
      "en-trans": "khyabdak nyammélama rinpoche"
    },
    {
      "bo": "འགྲོ་བློའི་མ་རིག་མུ༵ན་པ་ཡོངས་སེ༵ལ་ཞིང་༔",
      "en": "Who completely dispels the darkness of beings' ignorance",
      "en-trans": "dro lö marikmünpa yongselzhing"
    },
    {
      "bo": "བཤད་སྒྲུབ་བསྟན་པའི་པད་ཚལ་བཞད་མཛད་པ༔",
      "en": "And causes the lotus garden of teaching and practice to bloom –",
      "en-trans": "shedrub tenpé petsal zhé dzepa"
    },
    {
      "bo": "སྨྲ་བའི་ཉི་མ་འཇིག༵ས་མེད་ཆོས༵་ཀྱི༵་དབ༵ང་༔",
      "en": "Sun of speech, Jigme Chökyi Wangpo,",
      "en-trans": "mawé nyimajikme chö kyi wang"
    },
    {
      "bo": "བསྟན་པའི་རྩ་ལག་དེ་ལ་གསོལ་བ་འདེབས༔",
      "en": "To you, great ally of the teachings, I pray.",
      "en-trans": "tenpé tsalak dé la solwa deb"
    },
    {
      "bo": "སྔོན་ཚེ་སངས་རྒྱས་མཐོང་ན་དགའ་བའི་དྲུང་༔",
      "en": "In former times, in the presence of Buddha Priyadarśana,",
      "en-trans": "ngöntsé sangye tong na gawé drung"
    },
    {
      "bo": "བྱང་སེམས་རིན༵་ཆེན༵་ཟླ༵་བ༵འི་འོ༵ད་ཅེས་བྱ༔",
      "en": "You were known as Bodhisattva Ratnacandraprabha;",
      "en-trans": "changsemrinchen dawé öcheja"
    },
    {
      "bo": "ཐུབ་པའི་སྤྱན་སྔར་འཕ༵གས་པ༵་མ༵་ཕ༵མ་པ༵༔",
      "en": "Before the Sage, as Ārya Ajita;1",
      "en-trans": "tubpé chen ngarpakpa mapampa"
    },
    {
      "bo": "འཕགས་པའི་ཡུལ་དབུས་དྷརྨ༵་ཤྲི༵་གྲགས༔",
      "en": "In central India as Dharmaśrī;",
      "en-trans": "pakpé yulüdharma shiridrak"
    },
    {
      "bo": "བལ་བོའི་ཡུལ་དུ་བཱི༵་མ༵་མ༵་ཏི༵་དང་༔",
      "en": "In Nepal, as Vimamati,",
      "en-trans": "balwö yul dubima matidang"
    },
    {
      "bo": "དབུས་གཙང་ཁམས་སུ་ངག༵་དབ༵ང་བློ༵་གྲོས༵་རྗེ༔",
      "en": "In Central Tibet and Kham, as lordly Ngawang Lodrö,",
      "en-trans": "ütsang kham sungawang lodröjé"
    },
    {
      "bo": "ཙི་ནའི་ཡུལ་དུ་ཐང༵་རྗེ༵་པད༵་མ༵་དཀར༔",
      "en": "In China, as Tangjé Pema Karpo,",
      "en-trans": "tsi né yul dutang jé pemakar"
    },
    {
      "bo": "གངས་རིའི་ཁྲོད་དུ་དྲི༵་མེ༵ད་འོད༵་ཟེར༵་དང་༔",
      "en": "In the Land of Snows as Drimé Özer,2",
      "en-trans": "gangri trö dudrimé özerdang"
    },
    {
      "bo": "དྭགས་པོར་ས་སྐྱོང་ཡུལ་འཆང་ཀི༵རྟི༵་ཤྲི༵༔",
      "en": "In Dagpo, as the earth protector Drakpa Pal,",
      "en-trans": "dakpor sakyong yul chang kirti shri"
    },
    {
      "bo": "ད་ལྟ་ཞིང་འདིའི་འགྲོ་ངོར་མི་ཡི་ཚུལ༔",
      "en": "And now, in this realm, you appear in human form",
      "en-trans": "danta zhing di dro ngor mi yi tsul"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་འདྲེན་པའི་དབང་ཕྱུག་མཆོག༔",
      "en": "As the supreme guide with whom any contact is meaningful,",
      "en-trans": "dreltsé dönden drenpé wangchuk chok"
    },
    {
      "bo": "དགེ་བའི་བཤེས་གཉེན་ཚུལ༵་ཁྲིམ༵ས་རྡོ༵་རྗེ༵འི་དཔལ༔",
      "en": "The glorious spiritual friend Tsultrim Dorje.3",
      "en-trans": "geweshé nyentsultrim dorjépal"
    },
    {
      "bo": "འདི་འོག་བདེ༵་ཆེན༵་རི༵ག་པ༵འི་རྡོ༵་རྗེ་ཞེས༔",
      "en": "Later, as Dechen Rigpe Dorje, you will establish all those who",
      "en-trans": "di okdechen rigpé dorjézhé"
    },
    {
      "bo": "མཐོང་ཐོས་དྲན་རེག་སྨིན་གྲོལ་ལམ་ལ་འགོད༔",
      "en": "See, hear, recall, or touch you on the path to ripening and liberation.",
      "en-trans": "tong tö dren rek mindrol lam la gö"
    },
    {
      "bo": "མ་འོངས་སང༵ས་རྒྱ༵ས་ཆོས༵་ཀྱི༵་བློ༵་གྲོས༵་ཅེས༔",
      "en": "And, in future you will be Buddha Dharmamati (Chökyi Lodro) –",
      "en-trans": "ma ongsangye chökyi lodröché"
    },
    {
      "bo": "དུས་གསུམ་འགྲོ་འདྲེན་ཁྱེད་ལ་གསོལ་བ་འདེབས༔",
      "en": "To you, a guide to beings throughout the three times, I pray.",
      "en-trans": "dü sum dro dren khyé la solwa deb"
    },
    {
      "bo": "སྐྱེ་ཀུན་འབྲལ་མེད་ཁྱོད་ཀྱིས་རྗེས་བཟུང་སྟེ༔",
      "en": "May you care for me inseparably throughout all my lives to come,",
      "en-trans": "kyé kün dralmé khyö kyi jezung té"
    },
    {
      "bo": "སྨིན་གྲོལ་གདམས་པའི་ཡོན་ཏན་ལུས་ཟུངས་རྒྱས༔",
      "en": "May you nourish me with qualities of the ripening and liberating instructions,",
      "en-trans": "mindrol dampé yönten lüzung gyé"
    },
    {
      "bo": "རྫོགས་པ་ཆེན་པོའི་གསང་ལམ་མཐར་ཕྱིན་ནས༔",
      "en": "So that I may complete the secret path of the Great Perfection,",
      "en-trans": "dzogpachenpö sang lam tarchin né"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་སངས་རྒྱས་འཐོབ་གྱུར་ཅིག༔",
      "en": "And attain buddhahood whereby twofold benefit is spontaneously accomplished!",
      "en-trans": "dön nyi lhündrub sangye tob gyur chik"
    }
  ]
}