{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tsarchen-dorje-chang",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཚར་ཆེན་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས་པ་བྱིན་རླབས་རོལ་མཚོ་ཞེས་བྱ་བ་བཞུགས་སོ།    །",
    "en": "A Prayer to Tsarchen Dorje Chang"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "སངས་རྒྱས་ཀུན་གྱི་ཐུགས་རྗེ་གཅིག་བསྡུས་པ།    །",
      "en": "Embodiment of all the buddhas’ compassion,",
      "en-trans": "sangye kün gyi tukjé chik dü pa"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་དངོས་ཚར་པ་ཆོས་ཀྱི་རྗེ།    །",
      "en": "Vajradhara in person, Tsarpa Lord of Dharma,",
      "en-trans": "dorjé chang ngö tsarpa chökyi jé"
    },
    {
      "bo": "སྙིང་དབུས་པད་དཀར་བཞད་པའི་རྩེར་མཆོད་དེ།    །",
      "en": "I offer you the blossoming white lotus of my heart",
      "en-trans": "nying ü pekar zhepé tser chö dé"
    },
    {
      "bo": "མི་ཕྱེད་སྙིང་ནས་གུས་པས་གསོལ་བ་འདེབས།    །",
      "en": "And pray to you with unshakeable, heartfelt devotion.",
      "en-trans": "miché nying né güpé solwa deb"
    },
    {
      "bo": "གངས་ཅན་མཁས་དང་གྲུབ་པའི་གཙུག་གི་རྒྱན།    །",
      "en": "The crown adornment of all the Snowy Land’s scholars and adepts",
      "en-trans": "gangchen khé dang drubpé tsuk gi gyen"
    },
    {
      "bo": "བིར་ཝའི་ཞལ་གྱི་གདམས་པ་ས་སྐྱ་པ། །",
      "en": "Was Virūpa, whose teachings passed to the noble Sakya patriarchs",
      "en-trans": "birwé zhal gyi dampa sakyapa"
    },
    {
      "bo": "རྗེ་བཙུན་གོང་མའི་སྙན་བརྒྱུད་སློབ་བཤད་ཀྱི།    །",
      "en": "In an aural lineage of private instruction.",
      "en-trans": "jetsün gongmé nyengyü lobshé kyi"
    },
    {
      "bo": "ཟབ་དོན་བདུད་རྩིས་མྱོས་པའི་ཚར་པ་རྗེ།    །",
      "en": "Lord Tsarpa, who imbibed this nectar of profound meaning,",
      "en-trans": "zab dön dütsi nyöpé tsarpa jé"
    },
    {
      "bo": "ཕ་རྒོད་བློ་གསལ་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །",
      "en": "Heroic father Losal Gyatso, to you I pray.",
      "en-trans": "pa gö losal gyatsor solwa deb"
    },
    {
      "bo": "ནཱ་རོ་པ་དང་བྲམ་ཟེ་མཆོག་སྲེད་དང་།    །",
      "en": "Master of the one-to-one transmission of Golden Dharmas",
      "en-trans": "naropa dang dramzé chok sé dang"
    },
    {
      "bo": "རྭ་ཆེན་འབྲོག་མི་ལ་སོགས་ལེགས་བརྒྱུད་པའི།    །",
      "en": "Of yidam deities, ḍākinīs, dharma guardians and the like,",
      "en-trans": "ra chen drok mi lasok lek gyüpé"
    },
    {
      "bo": "ཡི་དམ་ཌཱ་ཀི་ཆོས་སྐྱོང་ལ་སོགས་པའི།    །",
      "en": "Which was passed from Nāropa and the brahmin Vararuci,",
      "en-trans": "yidam daki chökyong lasokpé"
    },
    {
      "bo": "གསེར་ཆོས་ཆིག་བརྒྱུད་བདག་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Down through the great Ra, Drokmi and others—to you I pray.",
      "en-trans": "ser chö chik gyü dakpor solwa deb"
    },
    {
      "bo": "བསླབ་པའི་ཚུལ་ཁྲིམས་དག་པས་ཡིད་འཕྲོག་ཅིང་།    །",
      "en": "You captivated minds with the purity of your ethical training,",
      "en-trans": "labpé tsultrim dakpé yitrok ching"
    },
    {
      "bo": "ཏིང་འཛིན་སྒོ་བརྒྱར་འཇུག་ལྡང་ཐོགས་པ་མེད།    །",
      "en": "Were unimpeded as you entered and rose from a hundred samādhis,",
      "en-trans": "tingdzin go gyar juk dang tokpamé"
    },
    {
      "bo": "ཤེས་རབ་གསུམ་གྱི་གཏེར་ཆེན་འཇམ་པའི་དབྱངས།    །",
      "en": "And in the great treasury of your threefold wisdom, you were Mañjughoṣa in person—",
      "en-trans": "sherab sum gyi terchen jampé yang"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མ་མཆོག་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Glorious and supreme guru, to you I pray.",
      "en-trans": "palden lama chok la solwa deb"
    },
    {
      "bo": "འཆད་མཁས་བློ་ལྡན་བྱེ་བའི་ཡི་ག་འགུགས།    །",
      "en": "Skilled in exposition, you attracted myriads of brilliant minds,",
      "en-trans": "ché khé loden jewé yi ga guk"
    },
    {
      "bo": "རྩོད་པས་ཕས་རྒོལ་བྲག་རི་ཕྱེ་མར་འཐག  །",
      "en": "In debate you crushed the mountain of your adversaries to dust,",
      "en-trans": "tsöpé pé gol drakri chemar tak"
    },
    {
      "bo": "རྩོམ་པས་ཐུབ་བསྟན་ལྷུན་པོ་གསལ་བར་བྱེད།    །",
      "en": "And through composition illuminated the peak of Buddha’s teachings—",
      "en-trans": "tsompé tubten lhünpo salwar jé"
    },
    {
      "bo": "མཁྱེན་རབ་ཕ་མཐའ་ཡས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "To you whose perfect wisdom was unbounded, I pray.",
      "en-trans": "khyen rab pata yé la solwa deb"
    },
    {
      "bo": "བརྩེ་བ་ཆེན་པོས་གཞན་དོན་འབའ་ཞིག་སྤྱོད།    །",
      "en": "In your vast love, you acted only for the welfare of others;",
      "en-trans": "tsewa chenpö zhendön bazhik chö"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པས་བདུད་སྡེ་ཕྱེ་མར་འཐག  །",
      "en": "With your power and strength, you crushed Māra’s hordes.",
      "en-trans": "tutob nüpé dü dé chemar tak"
    },
    {
      "bo": "ཡི་དམ་ལྷ་ཡི་དགྱེས་ཞལ་རྟག་ཏུ་མཇལ།    །",
      "en": "You constantly beheld the delighted faces of the yidam deities.",
      "en-trans": "yidam lha yi gyé zhal taktu jal"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་རྟགས་ཚད་མངོན་གྱུར་གསོལ་བ་འདེབས།    །",
      "en": "And actualized all the signs of approach and accomplishment—to you I pray.",
      "en-trans": "nyendrub tak tsé ngöngyur solwa deb"
    },
    {
      "bo": "བསྐྱེད་པའི་རིམ་པས་ཅིར་སྣང་ལྷ་སྐུར་ཤར།    །",
      "en": "Through the generation phase, all appearances arose in the form of the deity,",
      "en-trans": "kyepé rimpé chir nang lha kur shar"
    },
    {
      "bo": "རྫོགས་པའི་རིམ་པས་རླུང་ཐིག་འགྲོས་རྣམས་ཐིམ།    །",
      "en": "And through the perfection phase, the motions of winds and essences dissolved.",
      "en-trans": "dzokpé rimpé lung tik drö nam tim"
    },
    {
      "bo": "སྒྲིབ་གསུམ་བག་ཆགས་དང་བཅས་སྤངས་པ་དང་།    །",
      "en": "You overcame the three obscurations together with their habitual traces,",
      "en-trans": "drib sum bakchak dangché pangpa dang"
    },
    {
      "bo": "ས་ལམ་ཡོན་ཏན་རྫོགས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "And perfected the qualities of the paths and stages—to you I pray.",
      "en-trans": "salam yönten dzok la solwa deb"
    },
    {
      "bo": "སྙིགས་དུས་རྡོ་རྗེ་འཛིན་པ་ཀུན་གྱི་རྒྱལ།    །",
      "en": "King of all the vajra-holders of this degenerate age,",
      "en-trans": "nyikdü dorjé dzinpa kün gyi gyal"
    },
    {
      "bo": "རྡོ་རྗེའི་བླ་མ་དྲན་ཆོག་ཚར་པ་རྗེར།    །",
      "en": "Vajra guru, the thought of whom is sufficient, Lord Tsarpa—",
      "en-trans": "dorjé lama dren chok tsarpa jer"
    },
    {
      "bo": "མི་ཕྱེད་གུས་པས་རྟག་ཏུ་གསོལ་འདེབས་ན།    །",
      "en": "As I supplicate you, constantly with unshakeable devotion,",
      "en-trans": "miché güpé taktu soldeb na"
    },
    {
      "bo": "བྱིན་རླབས་དབང་ཆེན་ད་ལྟ་བསྐུར་དུ་གསོལ།    །",
      "en": "Bestow a mighty river of blessings here and now, I pray.",
      "en-trans": "jinlab wangchen danta kur du sol"
    },
    {
      "bo": "རིག་སྟོང་ཆོས་ཉིད་མངོན་སུམ་རྟོགས་པ་དང་།    །",
      "en": "Cause me to realize the nature of awareness-emptiness directly,",
      "en-trans": "riktong chönyi ngönsum tokpa dang"
    },
    {
      "bo": "འགྲོས་བཞི་ཐིམ་ནས་སྐུ་བཞི་མངོན་དུ་བྱས།    །",
      "en": "Dissolve the fourfold motion and actualize the four kāyas,",
      "en-trans": "drö zhi tim né ku zhi ngön du jé"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པ་ཡི།    །",
      "en": "Spontaneously accomplish my own and others’ aims,",
      "en-trans": "rangzhen dön nyi lhün gyi drubpa yi"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོ་ཁྱོད་དང་མཚུངས་པར་ཤོག  །",
      "en": "And become your very equal, O sovereign of Dharma!",
      "en-trans": "chö kyi gyalpo khyö dang tsungpar shok"
    }
  ]
}