{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/terton-sogyal/summoning-of-blessings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༁ྃ༔ ཕུར་པ་ཡང་ཟབ་སྙིང་པོ་ལས༔ བྱིན་འབེབས་བྱིན་རླབས་མྱུར་མགྱོགས་བཞུགས་སོ༔"
  },
  "text": [
    {
      "bo": "ཧཱུྂ༔ ཆོས་ཀྱི་དབྱིངས་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "བདེ་གཤེགས་ཞི་ཁྲོས་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "དུར་ཁྲོད་བརྒྱད་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "རིག་འཛིན་རྣམས་ཀྱིས་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "རྔ་ཡབ་གླིང་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "རྡོ་རྗེ་ཐོད་ཕྲེང་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "ཨོ་རྒྱན་ཡུལ་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "མཁའ་འགྲོའི་ཚོགས་ཀྱིས་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "ནམ་མཁའི་མཐོང་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "རྡོ་རྗེ་ཕྲ་མེན་བྱིན་ཕོག་ཅིག༔"
    },
    {
      "bo": "གངས་དཀར་རྩེ་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "རྡོ་རྗེ་གིང་ཆེན་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "རྒྱ་མཚོའི་གཏིང་ནས་སྐུ་བསྐྱོད་ལ༔"
    },
    {
      "bo": "མཚོ་གླིང་མཁའ་འགྲོས་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "རྒྱ་བལ་བོད་ཀྱི་སྒྲུབ་གནས་སུ༔"
    },
    {
      "bo": "སློབ་དཔོན་པདྨ་འབྱུང་གནས་ཀྱིས༔"
    },
    {
      "bo": "བདེ་གཤེགས་སྒྲུབ་པ་བཀའ་བརྒྱད་དང་༔"
    },
    {
      "bo": "ཕུར་པའི་དངོས་གྲུབ་བརྙེས་པ་ལྟར༔"
    },
    {
      "bo": "དེང་འདིར་བདག་ལ་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོང་དངོས་གྲུབ་སྩོལ༔"
    },
    {
      "bo": "ཧཱུྂ༔ དབུས་ཕྱོགས་སྟོང་གི་འཇིག་རྟེན་གྱི༔"
    },
    {
      "bo": "གཟུགས་སྣང་ཐམས་ཅད་ཕུར་པའི་ལྷ༔"
    },
    {
      "bo": "སྒྲ་གྲགས་བྷུདྡྷ་ཀཱི་ལ་ཡ༔"
    },
    {
      "bo": "བདེ་གཤེགས་ཐུགས་ཀྱི་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "ཤར་ཕྱོགས་སྟོང་གི་འཇིག་རྟེན་གྱི༔"
    },
    {
      "bo": "གཟུགས་སྣང་ཐམས་ཅད་ཕུར་པའི་ལྷ༔"
    },
    {
      "bo": "སྒྲ་གྲགས་བཛྲ་ཀཱི་ལ་ཡ༔"
    },
    {
      "bo": "བདེ་གཤེགས་སྐུ་ཡི་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "ལྷོ་ཕྱོགས་སྟོང་གི་འཇིགས་རྟེན་གྱི༔"
    },
    {
      "bo": "གཟུགས་སྣང་ཐམས་ཅད་ཕུར་པའི་ལྷ༔"
    },
    {
      "bo": "སྒྲ་གྲགས་རཏྣ་ཀཱི་ལ་ཡ༔"
    },
    {
      "bo": "བདེ་གཤེགས་ཡོན་ཏན་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "ནུབ་ཕྱོགས་སྟོང་གི་འཇིག་རྟེན་གྱི༔"
    },
    {
      "bo": "གཟུགས་སྣང་ཐམས་ཅད་ཕུར་པའི་ལྷ༔"
    },
    {
      "bo": "སྒྲ་གྲགས་པདྨ་ཀཱི་ལ་ཡ༔"
    },
    {
      "bo": "བདེ་གཤེགས་གསུང་གི་ཕྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "བྱང་ཕྱོགས་སྟོང་གི་འཇིག་རྟེན་གྱི༔"
    },
    {
      "bo": "གཟུགས་སྣང་ཐམས་ཅད་ཕུར་པའི་ལྷ༔"
    },
    {
      "bo": "སྒྲ་གྲགས་ཀརྨ་ཀཱི་ལ་ཡ༔"
    },
    {
      "bo": "བདེ་གཤེགས་ཕྲིན་ལས་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "རིགས་ལྔ་བདེ་གཤེགས་ཞི་ཁྲོའི་ལྷ༔"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་འཁོར་བཅས་ཀྱིས༔"
    },
    {
      "bo": "སྒྲུབ་པའི་གནས་འདིར་བྱིན་ཕོབ་ཅིག༔"
    },
    {
      "bo": "དཀྱིལ་འཁོར་འདི་ལ་མདངས་གཅིག་ཕྱུངས༔"
    },
    {
      "bo": "རྣལ་འབྱོར་བདག་ལ་དབང་བཞི་བསྐུར༔"
    },
    {
      "bo": "བགེགས་དང་ལོག་འདྲེན་བར་ཆད་སོལ༔"
    },
    {
      "bo": "རྟགས་དང་མཚན་མ་དངོས་སུ་སྟོན༔"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོང་དངོས་གྲུབ་སྩོལ༔"
    },
    {
      "bo": "གུ་རུ་དྷེ་ཝ་དྷཱ་ཀི་ནཱི་ཨ་བེ་ཤ་ཡ་ཕཻཾ་ཕཻཾ༔"
    }
  ]
}