{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/terton-sogyal/falling-rain-of-blessings-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༁ྃ༔ ཕུར་པ་ཡང་ཟབ་སྙིང་པོ་ལས༔ གསོལ་འདེབས་བྱིན་རླབས་ཆར་འབེབས་བཞུགས་སོ༔"
  },
  "text": [
    {
      "bo": "ཨོཾ་བཛྲ་ཀཱི་ལི་ཀཱི་ལ་ཡ་ཧཱུྂ་ཕཊ༔"
    },
    {
      "bo": "ན་མོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ངོ་བོ༔"
    },
    {
      "bo": "ཆོས་ཐམས་ཅད་ཀྱི་བདག་པོ༔"
    },
    {
      "bo": "བྱིན་རླབས་ཀུན་གྱི་འབྱུང་གནས་"
    },
    {
      "bo": "བླ་མ་ལ་གསོལ་བ་འདེབས་སོ༔"
    },
    {
      "bo": "ལུས་ལ་སྐུ་ཡི་བྱིན་གྱིས་རློབས་ཤིག༔"
    },
    {
      "bo": "ངག་ལ་གསུང་གི་བྱིན་གྱིས་རློབས་ཤིག༔"
    },
    {
      "bo": "ཡིད་ལ་ཐུགས་ཀྱི་བྱིན་གྱིས་རློབས་ཤིག༔"
    },
    {
      "bo": "ནམ་ཞིག་བྱང་ཆུབ་མ་ཐོབ་ཀྱི་བར་དུ་ཐུགས་རྗེས་གཟིགས་ལ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ༔"
    },
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྂ༔ ཆོས་སྐུ་སྐྱེ་བ་མེད་པ་དོན་གྱི་སྐུ༔"
    },
    {
      "bo": "ལོངས་སྐུ་འགགས་པ་མེད་པ་ལྷུན་གྱིས་གྲུབ༔"
    },
    {
      "bo": "སྤྲུལ་སྐུ་ཐོག་པ་མེད་པས་འགྲོ་དོན་མཛད༔"
    },
    {
      "bo": "ཡོན་ཏན་དཔག་ཏུ་མེད་པ་རང་ལ་རྫོགས༔"
    },
    {
      "bo": "ཕྲིན་ལས་རྒྱུན་ཆད་མེད་པས་འགྲོ་བ་འདྲེན༔"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་མཁའ་འགྲོ་ཆོས་སྐྱོང་དང་༔"
    },
    {
      "bo": "དཔའ་བོ་དཔའ་མོ་ཀུན་གྱི་བདག་ཉིད་ནི༔"
    },
    {
      "bo": "རྗེ་བཙུན་ཆེན་པོ་པདྨ་འབྱུང་གནས་དངོས༔"
    },
    {
      "bo": "སྐྱབས་དང་རེ་ས་ཁྱེད་ལས་མ་མཆིས་པས༔"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཨོ་རྒྱན་རིན་པོ་ཆེ༔"
    },
    {
      "bo": "ཐུགས་རྗེས་འབྲལ་བ་མེད་པར་བཟུང་དུ་གསོལ༔"
    },
    {
      "bo": "དངོས་གྲུབ་ཐོག་པ་མེད་པར་སྩལ་དུ་གསོལ༔"
    },
    {
      "bo": "ཕྲིན་ལས་འབད་མེད་འགྲུབ་པར་མཛད་དུ་གསོལ༔"
    },
    {
      "bo": "ན་མོ་བདག་ནི་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་བསྐྱེད་དེ༔"
    },
    {
      "bo": "རྡོ་རྗེ་ཕུར་པ་གསང་བའི་དཀྱིལ་འཁོར་དུ༔"
    },
    {
      "bo": "ཁྱེད་ཀྱི་བཀའ་བཞིན་རྗེས་སུ་བསྒྲུབ་ལགས་ན༔"
    },
    {
      "bo": "སྒྲུབ་ལ་བར་ཆད་མེད་པར་བྱིན་གྱིས་རློབས༔"
    },
    {
      "bo": "དངོས་གྲུབ་རྣམ་གཉིས་ཐོབ་པར་བྱིན་གྱིས་རློབས༔"
    },
    {
      "bo": "བཛྲ་གུ་རུ་པདྨ་ཧེ་རུ་ཀ་སརྦ་སིདྡྷི་ཕ་ལ་ཧཱུྂ་ཨཱཿ ཧ་རི་ནི་ས་ར་ཙ་ཧྲི་ཡ་སརྦ་སིདྡྷི་ཧཱུྂ༔"
    },
    {
      "bo": "འཁོར་གྱི་ལས་བྱེད་དཔའ་བོ་དཔའ་མོ་དང་༔"
    },
    {
      "bo": "རིག་འཛིན་མཁའ་འགྲོ་འབུམ་ཕྲག་མང་པོ་རྣམས༔"
    },
    {
      "bo": "མོས་པའི་བུ་ལ་བརྩེ་བའི་ཐུགས་ཀྱིས་དགོངས༔"
    },
    {
      "bo": "རྟག་ཏུ་འདུ་འབྲལ་མེད་པར་བྱིན་གྱིས་རློབས༔"
    },
    {
      "bo": "ཧཱུྂ་ཧཱུྂ་ཧཱུྂ༔"
    }
  ]
}