{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/apang-terton/prayer-to-yumka-tsogyal",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཡུམ་ཀ་མཚོ་རྒྱལ་གྱི་གསོལ་འདེབས་བཞུགས༔",
    "en": "A Prayer to Yumka Tsogyal"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ཆོས་དབྱིངས་སྤྲོས་པ་བྲལ་བའི་ཕོ་བྲང་ནས༔",
      "en": "In the dharmadhātu palace of natural simplicity",
      "en-trans": "chöying tröpa dralwé podrang né"
    },
    {
      "bo": "ཆོས་སྐུ་རྒྱལ་བ་ཡུམ་ཆེན་ལ་གསོལ་བ་འདེབས༔",
      "en": "Is the dharmakāya, Great Mother of the buddhas—to you I pray:",
      "en-trans": "chöku gyalwa yumchen la solwa deb"
    },
    {
      "bo": "མ་དག་རང་བཞིན་ཀུན་གཞིའི་བག་ཆགས་ཚོགས༔",
      "en": "Bless me, so that all habitual patterns of the impure ālaya",
      "en-trans": "ma dak rangzhin künzhi bakchak tsok"
    },
    {
      "bo": "དག་པ་གཉིས་ལྡན་ཆོས་སྐུར་བྱིན་གྱིས་རློབས༔",
      "en": "May be realized as the dharmakāya of twofold purity!",
      "en-trans": "dakpa nyiden chökur jingyi lob"
    },
    {
      "bo": "འགགས་མེད་ཡེ་ཤེས་བཀོད་པ་ལྷུན་གྱིས་གྲུབ༔",
      "en": "In the spontaneously present land of unimpeded wisdom",
      "en-trans": "gakmé yeshe köpa lhün gyi drub"
    },
    {
      "bo": "ལོངས་སྐུ་རྡོ་རྗེ་ཕག་མོ་ལ་གསོལ་བ་འདེབས༔",
      "en": "Is the sambhogakāya Vajravārāhī—to you I pray:",
      "en-trans": "longku dorjé pakmo la solwa deb"
    },
    {
      "bo": "ལས་རླུང་ཀུན་གཞིའི་རྣམ་ཤེས་ཉོན་ཡིད་སོགས༔",
      "en": "Bless me, so that karmic winds, ālaya, defiled mental consciousness and so forth",
      "en-trans": "lé lung künzhi namshé nyön yi sok"
    },
    {
      "bo": "དུག་ལྔ་ཡེ་ཤེས་ལྔ་རུ་བྱིན་གྱིས་རློབས༔",
      "en": "May be purified as the five poisons are realized as the five wisdoms!",
      "en-trans": "duk nga yeshe nga ru jingyi lob"
    },
    {
      "bo": "ཐུགས་རྗེ་འགྲོ་བ་འདུལ་བའི་ཕོ་བྲང་ནས༔",
      "en": "In the palace of taming sentient beings with compassion",
      "en-trans": "tukjé drowa dulwé podrang né"
    },
    {
      "bo": "སྤྲུལ་སྐུ་ཡེ་ཤེས་མཚོ་རྒྱལ་ལ་གསོལ་བ་འདེབས༔",
      "en": "Is the nirmāṇakāya, Yeshe Tsogyal—to you I pray:",
      "en-trans": "tulku yeshe tsogyal la solwa deb"
    },
    {
      "bo": "གློ་བུར་ཀུན་རྟོག་འཁྲུལ་པ་རང་སར་ཞིག༔",
      "en": "Bless me, so that momentary concepts and confusion may naturally vanish,",
      "en-trans": "lobur küntok trulpa rang sar zhik"
    },
    {
      "bo": "སྐུ་གསུམ་དགོངས་པ་མངོན་གྱུར་བྱིན་གྱིས་རློབས༔",
      "en": "And I may realize the enlightened mind of the Three Kāyas!",
      "en-trans": "ku sum gongpa ngöngyur jingyi lob"
    },
    {
      "bo": "འདི་ནས་བཟུང་སྟེ་ཚེ་རབས་ཐམས་ཅད་དུ༔",
      "en": "From now on, throughout all my lives to come,",
      "en-trans": "di né zung té tserab tamché du"
    },
    {
      "bo": "བླ་མ་མཁའ་འགྲོའི་ཐུགས་རྗེས་རྗེས་བཟུང་ཞིང་༔",
      "en": "May the Gurus and Ḍākinīs care for me with compassion!",
      "en-trans": "lama khandrö tukjé jezung zhing"
    },
    {
      "bo": "རྡོ་རྗེ་ཐེག་པའི་ལམ་མཆོག་རབ་ཏུ་རྙེད༔",
      "en": "May I fully engage with the sublime path of the Vajrayāna,",
      "en-trans": "dorjé tekpé lam chok rabtu nyé"
    },
    {
      "bo": "ཀུན་བཟང་གདོད་མའི་གཞི་ལ་བྱང་ཆུབ་ཤོག༔",
      "en": "And awaken into the primordial ground of Samantabhadra!",
      "en-trans": "kunzang dömé zhi la changchub shok"
    }
  ]
}