{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fifteenth-karmapa/prayer-to-yeshe-tsogyal",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་གྱི་གསོལ་འདེབས་བཞུགས་སོ། །",
    "en": "A Prayer to Khandro Yeshé Tsogyal"
  },
  "text": [
    {
      "bo": "རྒྱལ་ཀུན་བསྐྱེད་ཡུམ་ཆོས་དབྱིངས་ཀུན་བཟང་མོ། །",
      "en": "Samantabhadrī, the dharmadhātu mother of all buddhas,",
      "en-trans": "gyal kün kyé yum chöying kunzang mo"
    },
    {
      "bo": "བོད་འབངས་སྐྱོབ་པའི་མ་ཅིག་དྲིན་མོ་ཆེ། །",
      "en": "Supremely kind, sole mother who protects the Tibetan people,",
      "en-trans": "bö bang kyobpé ma chik drinmo ché"
    },
    {
      "bo": "དངོས་གྲུབ་མཆོག་སྩོལ་བདེ་ཆེན་མཁའ་འགྲོའི་གཙོ། །",
      "en": "Chief ḍākinī of great bliss, you bestow the supreme siddhi,",
      "en-trans": "ngödrub chok tsol dechen khandrö tso"
    },
    {
      "bo": "ཡེ་ཤེས་མཚོ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Yeshé Tsogyal, to you I pray.",
      "en-trans": "yeshe tsogyal zhab la solwa deb"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་བར་ཆད་ཞི་བ་དང་། །",
      "en": "Grant your blessing so that all outer, inner, and secret obstacles may be pacified.",
      "en-trans": "chi nang sangwé barché zhiwa dang"
    },
    {
      "bo": "བླ་མའི་སྐུ་ཚེ་བརྟན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessing so that the gurus may live long.",
      "en-trans": "lamé kutsé tenpar jingyi lob"
    },
    {
      "bo": "ནད་མུག་མཚོན་བསྐལ་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessing so that this era’s disease, famine and warfare may be pacified.",
      "en-trans": "né muk tsön kal zhiwar jingyi lob"
    },
    {
      "bo": "བྱད་ཕུར་རྦོད་གཏོང་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessing so that evil sorcery and spells may be overcome.",
      "en-trans": "jepur bötong zhiwar jingyi lob"
    },
    {
      "bo": "ཚེ་དཔལ་ཤེས་རབ་རྒྱས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessing so that my lifespan, glory and wisdom may increase.",
      "en-trans": "tsé pal sherab gyepar jingyi lob"
    },
    {
      "bo": "བསམ་པ་ལྷུན་གྱིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessing so that all my wishes may be spontaneously fulfilled.",
      "en-trans": "sampa lhün gyi drubpar jingyi lob"
    }
  ]
}