{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamgon-kongtrul/auspicious-spiral-chokgyur-lingpa-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྤྲུལ་པའི་གཏེར་ཆེན་མཆོག་གྱུར་གླིང་པའི་རྣམ་ཐར་གསོལ་འདེབས་བཀྲ་ཤིས་འཁྱིལ་བའི་དབྱངས་སྙན་ཞེས་བྱ་བ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ཀུན་ཁྱབ་བདེ་ཆེན་འོད་གསལ་ཆོས་ཀྱི་སྐུ། །"
    },
    {
      "bo": "འཁོར་འདས་སྙིང་པོ་མི་ཤིགས་ཐིག་ལེ་ཆེ། །"
    },
    {
      "bo": "དངོས་པོ་ཀུན་གྱི་ཁྱབ་བདག་གདོད་མའི་མགོན། །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཨོ་རྒྱན་སངས་རྒྱས་གཉིས་པའི་ཐུགས་ཀྱི་སྲས། །"
    },
    {
      "bo": "གཏེར་འབྱིན་གྲུབ་ཐོབ་རྒྱ་མཚོའི་འཁོར་ལོས་སྒྱུར། །"
    },
    {
      "bo": "རྣམ་ཐར་བསམ་ཡས་སྙིགས་དུས་བསྟན་འགྲོའི་མགོན། །"
    },
    {
      "bo": "མཆོག་གྱུར་གླིང་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གདོད་ནས་རབ་ཞིའི་བདུད་རྩི་བརྙེས་གྱུར་ཀྱང༌། །"
    },
    {
      "bo": "སྐུ་དང་ཞིང་ཁམས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་དེ། །"
    },
    {
      "bo": "བཟོ་སྐྱེ་མཆོག་གི་སྤྲུལ་སྐུ་མཐའ་ཡས་པས། །"
    },
    {
      "bo": "འདུལ་བཞིའི་ཆོ་འཕྲུལ་སྟོན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྱད་པར་གངས་ཅན་མངའ་བདག་ཁྲི་སྲོང་རྗེའི། །"
    },
    {
      "bo": "སྲས་ཀྱི་ཚུལ་བཟུང་མཆོག་གི་དངོས་གྲུབ་བརྙེས། །"
    },
    {
      "bo": "སངས་རྒྱས་གླིང་སོགས་ངོ་མཚར་རྨད་བྱུང་བའི། །"
    },
    {
      "bo": "སྒྱུ་འཕྲུལ་གར་བརྒྱས་རོལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐུགས་བསྐྱེད་ཁྱད་འཕགས་སྙིགས་མའི་འགྲོ་ལ་དགོངས། །"
    },
    {
      "bo": "ཕྲིན་ལས་ཁྱད་འཕགས་གང་འདུལ་དེར་མཐུན་སྟོན། །"
    },
    {
      "bo": "རྣམ་ཐར་ཁྱད་འཕགས་སྔོན་མེད་གསང་མཛོད་འཆང༌། །"
    },
    {
      "bo": "ཁྱད་པར་སུམ་ལྡན་ཁྱོད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མདོ་སྟོད་ས་ཡི་ཐིག་ལེར་བསམ་བཞིན་དུ། །"
    },
    {
      "bo": "སྐྱེ་བ་བཞེས་ནས་གཞོན་ནུའི་སྐབས་སུ་ཡང༌། །"
    },
    {
      "bo": "ཕལ་པའི་ཡུལ་འདས་དམ་པའི་རྣམ་ཐར་སད། །"
    },
    {
      "bo": "དད་ལྡན་སྤྲོ་བ་བསྐྱེད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བཅུ་གསུམ་བཞེས་ཚེ་ཨོ་རྒྱན་དངོས་སུ་མཇལ། །"
    },
    {
      "bo": "ཟབ་གཏེར་རྗེས་གནང་བསྩལ་ནས་བྱིན་གྱིས་བརླབས། །"
    },
    {
      "bo": "ལྷ་སྲས་ཐུགས་དམ་རྟེན་སོགས་དངོས་གྲུབ་ཐོབ། །"
    },
    {
      "bo": "དགོངས་གཏེར་ཀློང་ནས་བརྡོལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀར་འབྲུག་འབྲི་སྟག་ཡབ་སྲས་གཙོར་གྱུར་པའི། །"
    },
    {
      "bo": "རིས་མེད་ཚད་མའི་སྐྱེས་ཆེན་དུ་མ་བསྟེན། །"
    },
    {
      "bo": "མཉེས་པ་གསུམ་གྱིས་མདོ་སྔགས་བདུད་རྩིའི་བཅུད། །"
    },
    {
      "bo": "ཐུགས་ཀྱི་དཔལ་བེར་བསྐྱིལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པད་འབྱུང་དངོས་སྣང་པདྨ་དབང་ཆེན་དང༌། །"
    },
    {
      "bo": "དཔལ་ལྡན་དཔའ་བོ་གཙུག་ལག་ཆོས་རྒྱལ་གྱིས། །"
    },
    {
      "bo": "བརྡའ་ཡིས་ལུང་བསྟན་དོན་གྱི་བརྒྱུད་པ་གཏད། །"
    },
    {
      "bo": "བགེགས་སེལ་དངོས་གྲུབ་བརྙེས་ལ་གསོལ་བ་འདེབས།"
    },
    {
      "bo": "ཁྱད་པར་འཇམ་མགོན་མཁྱེན་བརྩེའི་དབང་པོ་དང༌། །"
    },
    {
      "bo": "ཡབ་སྲས་འབྲེལ་བའི་ལས་ཀྱི་འཕྲོ་སད་ནས། །"
    },
    {
      "bo": "ཐུགས་ཡིད་གཅིག་འདྲེས་ངོ་མཚར་རྟེན་འབྲེལ་གྱི། །"
    },
    {
      "bo": "སྒོ་འཕར་བརྒྱ་ཕྲག་ཕྱེས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱེ་བས་ཐོབ་པའི་དྲི་མེད་ཡེ་ཤེས་སྤྱན། །"
    },
    {
      "bo": "དྲང་ངེས་ཆོས་ལ་ལྐོག་ཏུ་མ་གྱུར་བས། །"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པར་རློམ་ཀུན་ཟིལ་ནོན་པའི། །"
    },
    {
      "bo": "མཁྱེན་གཉིས་རྩལ་ཆེན་རྫོགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ས་སྤྱོད་གསུང་གི་འཁོར་ལོ་ལ་སོགས་པར། །"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་རྫོགས་ཆེན་རྣལ་འབྱོར་མཐར་ཕྱིན་ཏེ། །"
    },
    {
      "bo": "འཁྲུལ་པ་ཞིག་ཅིང་ལས་བཞིར་རང་དབང་འབྱོར། །"
    },
    {
      "bo": "གྲུབ་པའི་གཙུག་རྒྱན་གྱུར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དག་པའི་སྣང་བར་པདྨ་འོད་ཞིང་དུ། །"
    },
    {
      "bo": "ཡང་ཡང་ཕེབས་ནས་བླ་མ་སྐུ་གསུམ་དང༌། །"
    },
    {
      "bo": "རྗེ་འབངས་ཚོགས་བཅས་བསྙེན་སྒྲུབ་རྣམ་བཞི་མཛད། །"
    },
    {
      "bo": "དབང་བསྐུར་ལུང་བསྟན་ཐོབ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་བཅས་ཡི་དམ་དཔག་མེད་གཟིགས། །"
    },
    {
      "bo": "མཁའ་འགྲོ་རྣམས་དང་ཚོགས་ཀྱི་འདུ་བར་རོལ། །"
    },
    {
      "bo": "དམ་ཅན་གཏེར་སྲུང་དཀར་ཕྱོགས་སྐྱོང་རྣམས་ཀྱིས། །"
    },
    {
      "bo": "ཅི་བཅོལ་བཀའ་བཞིན་སྒྲུབ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བླ་མ་སྐོར་གསུམ་སྒྲུབ་སྡེ་ཞི་དང་ཁྲོ། །"
    },
    {
      "bo": "མཉམ་སྦྱོར་མདོ་སྒྱུ་རྫོགས་ཆེན་སྡེ་གསུམ་སོགས། །"
    },
    {
      "bo": "སྔོན་ཆད་ས་སྟེང་མ་བྱོན་ཆོས་རྟེན་གྱི། །"
    },
    {
      "bo": "ནོར་བུའི་མཛོད་ཆེན་ཕྱུང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མདོ་ཁམས་གནས་ཆེན་ཉེར་ལྔ་གཙོར་གྱུར་པའི། །"
    },
    {
      "bo": "གནས་མཆོག་བརྒྱ་རྩའི་ཞལ་རས་དངོས་བརྒྱུད་ནས། །"
    },
    {
      "bo": "སྣང་བར་མཛད་ཅིང་སྐྱེ་རྒུ་མཐའ་ཡས་པ། །"
    },
    {
      "bo": "ཐར་པའི་ཁ་ལོ་སྒྱུར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀར་འབྲུག་ཡབ་སྲས་སྔ་འགྱུར་བསྟན་འཛིན་མཆོག །"
    },
    {
      "bo": "གངས་ཅན་དཔལ་མགོན་རྣམས་ཀྱིས་གཙོར་མཛད་པའི། །"
    },
    {
      "bo": "རིས་མེད་སྐྱེས་ཆེན་ཀུན་གྱིས་ཞབས་ལ་བཏུད། །"
    },
    {
      "bo": "བླ་མའི་བླ་མར་གྱུར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཨོ་རྒྱན་རྡོ་རྗེའི་ལུང་གིས་བསྔགས་པ་ཡི། །"
    },
    {
      "bo": "རྩ་བའི་ཆོས་བདག་རྣམ་བཅུས་ཐོག་དྲངས་ཏེ། །"
    },
    {
      "bo": "མངའ་རིས་དབུས་གཙང་མདོ་ཁམས་མཐའ་དབུས་སུ། །"
    },
    {
      "bo": "ཟབ་གཏེར་ཕྲིན་ལས་སྤེལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གནས་མཆོག་རྣམས་ལ་རྡོ་རྗེའི་བྱིན་ཆེན་ཕབ། །"
    },
    {
      "bo": "སྡེ་བརྒྱད་འབྱུང་པོར་བཀའ་ནན་རབ་བརྗིད་བསྩལ། །"
    },
    {
      "bo": "ས་གནད་ཀུན་ཏུ་ཕྱི་ནང་རྟེན་འབྲེལ་བསྒྲིགས། །"
    },
    {
      "bo": "སྙིགས་མའི་སྐལ་ངན་ཟློག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐུན་མོང་ཐུན་མོང་མིན་པའི་སྨིན་གྲོལ་དང༌། །"
    },
    {
      "bo": "སྒྲུབ་ཆེན་གར་འཆམ་མྱོང་གྲོལ་སྦྱིན་པ་སོགས། །"
    },
    {
      "bo": "ཕྱོགས་མེད་སྩལ་པས་སྐྱེ་རྒུ་གྲངས་མེད་པ། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་མཛད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྟག་འཛིན་ཅན་རྣམས་དགེ་ལ་བསྐུལ་བ་དང༌། །"
    },
    {
      "bo": "དོན་མཆོག་རྒྱ་ཆེན་གཞན་ལ་གཟིགས་ནས་ཀྱང༌། །"
    },
    {
      "bo": "སྐལ་ལྡན་སྣང་ངོར་ཆོ་འཕྲུལ་དུ་མར་བཅས། །"
    },
    {
      "bo": "པདྨ་འོད་དུ་གཤེགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པདྨས་ཡོངས་སུ་ཁེབས་པའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "པདྨའི་འོད་ཟེར་རྒྱལ་བའི་སྲས་མཆོག་ནི། །"
    },
    {
      "bo": "པདྨའི་མྱུ་གུ་ལ་སོགས་ཕྱོགས་བཅུ་ན། །"
    },
    {
      "bo": "རྣམ་འཕྲུལ་མཐའ་ཡས་སྟོན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྒོ་གསུམ་གུས་པས་གསོལ་འདེབས་བུ་རྣམས་ལ། །"
    },
    {
      "bo": "སྐུ་གསུང་ཐུགས་ཀྱི་བྱིན་རླབས་སྩོལ་བ་དང༌། །"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་འབྲལ་མེད་རྗེས་བཟུང་ནས། །"
    },
    {
      "bo": "དག་པའི་ཞིང་ཁམས་མཆོག་ཏུ་དྲང་དུ་གསོལ། །"
    },
    {
      "bo": "བྱང་ཆུབ་སྒྲུབ་པའི་འགལ་རྐྱེན་ཀུན་ཞི་ཞིང༌། །"
    },
    {
      "bo": "གནས་སྐབས་བསམ་དོན་ཆོས་བཞིན་འགྲུབ་པ་དང༌། །"
    },
    {
      "bo": "རིག་འཛིན་རྣམ་བཞིའི་གོ་འཕང་བདེ་བླག་བགྲོད། །"
    },
    {
      "bo": "མཐར་ཐུག་བདེ་ཆེན་རྡོ་རྗེ་སེམས་འགྲུབ་ཤོག །"
    },
    {
      "bo": "ཟབ་གཏེར་བསྟན་པ་འཛམ་གླིང་ཀུན་ཏུ་ཁྱབ། །"
    },
    {
      "bo": "དེ་འཛིན་སྐྱེས་མཆོག་སྐུ་ཚེ་བསྐལ་བརྒྱར་བརྟན། །"
    },
    {
      "bo": "ཕྲིན་ལས་རྟག་ཅིང་ཁྱབ་པའི་དགེ་ལེགས་ཀྱིས། །"
    },
    {
      "bo": "བཀྲ་ཤིས་ཉི་མས་ས་གསུམ་སྣང་གྱུར་ཅིག །"
    }
  ]
}