{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/longchenpa-prayer-by-mipham-adapted",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཀློང་ཆེན་པའི་གསོལ་འདེབས་མི་ཕམ་རིན་པོ་ཆེའི་གསུང་ཁ་བསྒྱུར་བ།",
    "en": "Prayer to Longchenpa (Adapted from the Words of Mipham Rinpoche)"
  },
  "text": [
    {
      "bo": "གདོད་ནས་ལྷུན་གྲུབ་འོད་གསལ་རིག་པའི་གཤིས། །",
      "en": "The primordial and spontaneous nature of luminous awareness",
      "en-trans": "döné lhündrub ösal rigpé shi"
    },
    {
      "bo": "འགྱུར་མེད་རྒྱལ་བ་ཀུན་དང་རོ་མཉམ་པ། །",
      "en": "Is unchanging and of one-taste with all the victorious buddhas.",
      "en-trans": "gyurmé gyalwa kün dang ronyam pa"
    },
    {
      "bo": "མངོན་སུམ་གཟིགས་པ་ཀུན་མཁྱེན་ཆོས་ཀྱི་རྗེ། །",
      "en": "To you who have perceived this directly, Omniscient Lord of Dharma,",
      "en-trans": "ngönsum zikpa künkhyen chö kyi jé"
    },
    {
      "bo": "དྲི་མེད་འོད་ཟེར་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Drimé Özer, I pray!",
      "en-trans": "drimé özer zhab la solwa deb"
    },
    {
      "bo": "ཐེག་མཆོག་ལུང་དོན་ཚང་ལ་མ་ནོར་བ། །",
      "en": "With your brilliant, stainless insight you have clearly and unerringly understood",
      "en-trans": "tek chok lung dön tsang la manorwa"
    },
    {
      "bo": "དྲི་མེད་རིགས་པའི་ཚུལ་བཟང་གསལ་བྱེད་ཅིང༌། །",
      "en": "The meaning of the supreme vehicle in its entirety",
      "en-trans": "drimé rikpé tsul zang saljé ching"
    },
    {
      "bo": "ཟབ་མོ་གནད་ཀྱི་མན་ངག་དང་ལྡན་པ། །",
      "en": "And are possessed of the pith instructions of profound key points:",
      "en-trans": "zabmo né kyi mengak dang denpa"
    },
    {
      "bo": "གསུང་རབ་ལེགས་བཤད་ཚོགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the collection of your speech—fine explanations all—I pray!",
      "en-trans": "sung rab lek shé tsok la solwa deb"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བའི་གསུང་དབྱངས་སེང་གེའི་སྒྲས། །",
      "en": "The lion's roar that is the beautiful speech of buddhas and bodhisattvas",
      "en-trans": "sé ché gyalwé sung yang sengé dré"
    },
    {
      "bo": "ལུང་བསྟན་ཇི་བཞིན་ནམ་ཞིག་མགོན་པོ་ཁྱོད། །",
      "en": "Has prophesied that you, protector, will awaken",
      "en-trans": "lungten jizhin namzhik gönpo khyö"
    },
    {
      "bo": "རྣམ་འདྲེན་རི་རབ་མར་མེའི་རྒྱལ་མཚན་དུ། །",
      "en": "And be renowned as the guide Rirab Marmé Gyaltsen.",
      "en-trans": "namdren rirab marmé gyaltsen du"
    },
    {
      "bo": "མངོན་པར་བྱང་ཆུབ་བརྙེས་པ་དེ་ཡི་ཚེ། །",
      "en": "At that time may I and all parent beings gather",
      "en-trans": "ngönpar changchub nyepa dé yi tsé"
    },
    {
      "bo": "བདག་དང་བདག་གི་མ་གྱུར་འགྲོ་བ་ཀུན། །",
      "en": "At the place of your enlightenment as youthful bodhisattvas,",
      "en-trans": "dak dang dak gi magyur drowa kün"
    },
    {
      "bo": "ཞིང་དེར་རྒྱལ་སྲས་གཞོན་ནུའི་རྣམ་རོལ་གྱིས། །",
      "en": "And, having enjoyed the nectar of your true words,",
      "en-trans": "zhing der gyalsé zhönnü namrol gyi"
    },
    {
      "bo": "བདེན་གསུང་ཆོས་ཀྱི་བདུད་རྩིར་ལོངས་སྤྱོད་ནས། །",
      "en": "Receive a prophecy of our very own —",
      "en-trans": "den sung chö kyi dütsir longchö né"
    },
    {
      "bo": "སྟོབས་བཅུ་མངའ་བར་ལུང་བསྟན་རྙེད་གྱུར་ཅིག །",
      "en": "That we too will attain the ten powers!",
      "en-trans": "tob chu ngawar lungten nyé gyur chik"
    }
  ]
}