{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/tsongkhapa/foundation-of-all-qualities",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཡོན་ཏན་གཞིར་གྱུར་མ་བཞུགས་སོ། །",
    "en": "The Foundation of All Qualities"
  },
  "text": [
    {
      "bo": "ཡོན་ཏན་ཀུན་གྱི་གཞིར་གྱུར་དྲིན་ཅན་རྗེ། །",
      "en": "The foundation of all qualities is the gracious guru;",
      "en-trans": "yönten kün gyi zhir gyur drinchen jé"
    },
    {
      "bo": "ཚུལ་བཞིན་བསྟེན་པ་ལམ་གྱི་རྩ་བ་རུ། །",
      "en": "And to rely upon him or her correctly is the root of the path.",
      "en-trans": "tsulzhin tenpa lam gyi tsawa ru"
    },
    {
      "bo": "ལེགས་པར་མཐོང་ནས་འབད་པ་དུ་མ་ཡིས། །",
      "en": "Inspire us to understand this well and rouse our energies,",
      "en-trans": "lekpar tong né bepa duma yi"
    },
    {
      "bo": "གུས་པ་ཆེན་པོས་བསྟེན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "So that we may follow with the greatest respect!",
      "en-trans": "güpa chenpö tenpar jingyi lob"
    },
    {
      "bo": "ལན་ཅིག་རྙེད་པའི་དལ་བའི་རྟེན་བཟང་འདི། །",
      "en": "Inspire us so that we may realize how this excellent support,",
      "en-trans": "len chik nyepé dalwé ten zang di"
    },
    {
      "bo": "ཤིན་ཏུ་རྙེད་དཀའ་དོན་ཆེ་ཤེས་གྱུར་ནས། །",
      "en": "With its once-found freedoms, is so rare and momentous;",
      "en-trans": "shintu nyé ka dön ché shé gyur né"
    },
    {
      "bo": "ཉིན་མཚན་ཀུན་ཏུ་སྙིང་པོ་ལེན་པའི་བློ། །",
      "en": "And let us always be determined, day and night,",
      "en-trans": "nyintsen küntu nyingpo lenpé lo"
    },
    {
      "bo": "རྒྱུན་ཆད་མེད་པར་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "To make the most of this precious opportunity!",
      "en-trans": "gyünché mepar kyewar jingyi lob"
    },
    {
      "bo": "ལུས་སྲོག་གཡོ་བ་ཆུ་ཡི་ཆུ་བུར་བཞིན། །",
      "en": "Let us remember that life and limb are as transient and ephemeral",
      "en-trans": "lü sok yowa chu yi chubur zhin"
    },
    {
      "bo": "མྱུར་དུ་འཇིག་པའི་འཆི་བ་དྲན་པ་དང༌། །",
      "en": "As bubbles in water: death, the destroyer, approaches swiftly;",
      "en-trans": "nyurdu jikpé chiwa drenpa dang"
    },
    {
      "bo": "ཤི་བའི་རྗེས་སུ་ལུས་དང་གྲིབ་མ་བཞིན། །",
      "en": "And after death the results of positive and negative actions",
      "en-trans": "shiwé jesu lü dang dribma zhin"
    },
    {
      "bo": "དཀར་ནག་ལས་འབྲས་ཕྱི་བཞིན་འབྲང་བ་ལ། །",
      "en": "Will accompany us, just as a shadow follows the body.",
      "en-trans": "karnak lé dré chizhin drangwa la"
    },
    {
      "bo": "ངེས་པ་བརྟན་པོ་རྙེད་ནས་ཉེས་པའི་ཚོགས། །",
      "en": "Inspire us so that we may gain firm conviction in this,",
      "en-trans": "ngepa tenpo nyé né nyepé tsok"
    },
    {
      "bo": "ཕྲ་ཞིང་ཕྲ་བ་རྣམས་ཀྱང་སྤོང་བ་དང༌། །",
      "en": "And remain always conscientious:",
      "en-trans": "tra zhing trawa nam kyang pongwa dang"
    },
    {
      "bo": "དགེ་ཚོགས་མཐའ་དག་སྒྲུབ་པར་བྱེད་པ་ལ། །",
      "en": "Avoiding even the slightest harmful actions,",
      "en-trans": "gé tsok tadak drubpar jepa la"
    },
    {
      "bo": "རྟག་ཏུ་བག་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "While cultivating every form of virtue!",
      "en-trans": "taktu bak dang denpar jingyi lob"
    },
    {
      "bo": "སྤྱད་པས་མི་ངོམས་སྡུག་བསྔལ་ཀུན་གྱི་སྒོ། །",
      "en": "Inspire us to see the shortcomings of mundane pleasures,",
      "en-trans": "chepé mi ngom dukngal kün gyi go"
    },
    {
      "bo": "ཡིད་བརྟན་མི་རུང་སྲིད་པའི་ཕུན་ཚོགས་ཀྱི། །",
      "en": "Which only disappoint, lead to every form of suffering",
      "en-trans": "yiten mi rung sipé püntsok kyi"
    },
    {
      "bo": "ཉེས་དམིགས་རིག་ནས་ཐར་བའི་བདེ་བ་ལ། །",
      "en": "And cannot be relied upon;",
      "en-trans": "nyemik rik né tarwé dewa la"
    },
    {
      "bo": "དོན་གཉེར་ཆེན་པོ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Instead let us enthusiastically pursue the bliss of liberation!",
      "en-trans": "dönnyer chenpo kyewar jingyi lob"
    },
    {
      "bo": "རྣམ་དག་བསམ་པ་དེ་ཡིས་དྲངས་པ་ཡི། །",
      "en": "Inspire us so that, motivated by this pure intention,",
      "en-trans": "nam dak sampa dé yi drangpa yi"
    },
    {
      "bo": "དྲན་དང་ཤེས་བཞིན་བག་ཡོད་ཆེན་པོ་ཡིས། །",
      "en": "With mindfulness, vigilance and conscientiousness,",
      "en-trans": "dren dang shezhin bakyö chenpo yi"
    },
    {
      "bo": "བསྟན་པའི་རྩ་བ་སོ་སོར་ཐར་བ་ལ། །",
      "en": "We may take to heart thepratimokṣavows,",
      "en-trans": "tenpé tsawa sosor tarwa la"
    },
    {
      "bo": "སྒྲུབ་པ་སྙིང་པོར་བྱེད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Which are the very root of the teachings.",
      "en-trans": "drubpa nyingpor jepar jingyi lob"
    },
    {
      "bo": "རང་ཉིད་སྲིད་མཚོར་ལྷུང་བ་ཇི་བཞིན་དུ། །",
      "en": "Just as we have fallen into the ocean of existence,",
      "en-trans": "rangnyi si tsor lhungwa jizhin du"
    },
    {
      "bo": "མར་གྱུར་འགྲོ་བ་ཀུན་ཀྱང་དེ་འདྲ་བར། །",
      "en": "All other beings, our very own past mothers, have too—",
      "en-trans": "mar gyur drowa kün kyang dedrawar"
    },
    {
      "bo": "མཐོང་ནས་འགྲོ་བ་སྒྲོལ་བའི་ཁུར་འཁྱེར་བའི། །",
      "en": "Inspire us to see this and to master supreme bodhicitta,",
      "en-trans": "tong né drowa drolwé khur khyerwé"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་འབྱོངས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And to take responsibility for liberating all beings.",
      "en-trans": "changchub sem chok jongpar jingyi lob"
    },
    {
      "bo": "སེམས་ཙམ་བསྐྱེད་ཀྱང་ཚུལ་ཁྲིམས་རྣམ་གསུམ་ལ། །",
      "en": "Inspire us to see that even if we develop the intention,",
      "en-trans": "semtsam kyé kyang tsultrim nam sum la"
    },
    {
      "bo": "གོམས་པ་མེད་ན་བྱང་ཆུབ་མི་འགྲུབ་པར། །",
      "en": "Unless we train in the three types of ethical discipline,",
      "en-trans": "gompamé na changchub mi drubpar"
    },
    {
      "bo": "ལེགས་པར་མཐོང་ནས་རྒྱལ་སྲས་སྡོམ་པ་ལ། །",
      "en": "We will not attain awakening, and thus to apply ourselves",
      "en-trans": "lekpar tong né gyalsé dompa la"
    },
    {
      "bo": "བརྩོན་པ་དྲག་པོས་སློབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "With great energy to upholding the bodhisattva vows.",
      "en-trans": "tsönpa drakpö lobpar jingyi lob"
    },
    {
      "bo": "ལོག་པའི་ཡུལ་ལ་གཡེངས་པ་ཞི་བྱེད་ཅིང༌། །",
      "en": "Inspire us to calm distraction towards the erroneous,",
      "en-trans": "lokpé yul la yengpa zhijé ching"
    },
    {
      "bo": "ཡང་དག་དོན་ལ་ཚུལ་བཞིན་དཔྱོད་པ་ཡིས། །",
      "en": "And to enquire correctly into the genuine nature,",
      "en-trans": "yangdak dön la tsulzhin chöpa yi"
    },
    {
      "bo": "ཞི་གནས་ལྷག་མཐོང་ཟུང་དུ་འབྲེལ་བའི་ལམ། །",
      "en": "So that we may swiftly generate within our minds",
      "en-trans": "zhiné lhaktong zung du drelwé lam"
    },
    {
      "bo": "མྱུར་དུ་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "The path that perfectly unites tranquility and insight.",
      "en-trans": "nyurdu gyü la kyewar jingyi lob"
    },
    {
      "bo": "ཐུན་མོང་ལམ་སྦྱང་སྣོད་དུ་གྱུར་པ་ན། །",
      "en": "Inspire us, so that having trained in the common path",
      "en-trans": "tünmong lam jang nö du gyurpa na"
    },
    {
      "bo": "ཐེག་པ་ཀུན་གྱི་མཆོག་གྱུར་རྡོ་རྗེ་ཐེག།",
      "en": "And become suitable vessels, we may easily set out",
      "en-trans": "tekpa kün gyi chokgyur dorjé tek"
    },
    {
      "bo": "སྐལ་བཟང་སྐྱེ་བོའི་འཇུག་ངོགས་དམ་པ་དེར། །",
      "en": "On the sublime approach of fortunate individuals",
      "en-trans": "kalzang kyewö jukngok dampa der"
    },
    {
      "bo": "བདེ་བླག་ཉིད་དུ་འཇུག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And enter the Vajrayāna, supreme among vehicles.",
      "en-trans": "delak nyi du jukpar jingyi lob"
    },
    {
      "bo": "དེ་ཚེ་དངོས་གྲུབ་རྣམ་གཉིས་སྒྲུབ་པའི་གཞི། །",
      "en": "At that time, inspire us with unfeigned certainty",
      "en-trans": "detsé ngödrub nam nyi drubpé zhi"
    },
    {
      "bo": "རྣམ་དག་དམ་ཚིག་སྡོམ་པར་གསུངས་པ་ལ། །",
      "en": "In the teaching that pure vows and commitment",
      "en-trans": "namdak damtsik dompar sungpa la"
    },
    {
      "bo": "བཅོས་མ་མིན་པའི་ངེས་པ་རྙེད་གྱུར་ནས། །",
      "en": "Are the basis for attaining two types ofsiddhi,",
      "en-trans": "chöma minpé ngepa nyé gyur né"
    },
    {
      "bo": "སྲོག་དང་བསྡོས་ཏེ་སྲུང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "And let us guard them even at the risk of our lives.",
      "en-trans": "sok dang dö té sungwar jingyi lob"
    },
    {
      "bo": "དེ་ནས་རྒྱུད་སྡེ་སྙིང་པོ་རིམ་གཉིས་ཀྱི། །",
      "en": "Then, inspire us, so that having realized they key points",
      "en-trans": "dené gyüdé nyingpo rim nyi kyi"
    },
    {
      "bo": "གནད་རྣམས་ཇི་བཞིན་རྟོགས་ནས་བརྩོན་པ་ཡིས། །",
      "en": "Of the two stages, which are the essence of the tantras,",
      "en-trans": "né nam jizhin tok né tsönpa yi"
    },
    {
      "bo": "ཐུན་བཞིའི་རྣལ་འབྱོར་སྤྱོད་ལས་མི་གཡེལ་བར། །",
      "en": "We may never waver from the yoga of the four sessions",
      "en-trans": "tün zhi naljor chö lé mi yelwar"
    },
    {
      "bo": "དམ་པའི་གསུང་བཞིན་སྒྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And practise according to the noble guru's instructions.",
      "en-trans": "dampé sung zhin drubpar jingyi lob"
    },
    {
      "bo": "དེ་ལྟར་ལམ་བཟང་སྟོན་པའི་བཤེས་གཉེན་དང༌། །",
      "en": "Thus, may you inspire us with your blessings,",
      "en-trans": "detar lamzang tönpé shenyen dang"
    },
    {
      "bo": "ཚུལ་བཞིན་སྒྲུབ་པའི་གྲོགས་རྣམས་ཞབས་བརྟན་ཅིང༌། །",
      "en": "So that the spiritual guides who reveal the excellent path",
      "en-trans": "tsulzhin drubpé drok nam zhabten ching"
    },
    {
      "bo": "ཕྱི་དང་ནང་གི་བར་དུ་གཅོད་པའི་ཚོགས། །",
      "en": "And companions who practise authentically may live long,",
      "en-trans": "chi dang nang gi bardu chöpé tsok"
    },
    {
      "bo": "ཉེ་བར་ཞི་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "And all outer and inner obstacles may be fully pacified!",
      "en-trans": "nyewar zhiwar jingyi lab tu sol"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་ཡང་དག་བླ་མ་དང་། །",
      "en": "In all our lives, may we never be separated from genuine gurus,",
      "en-trans": "kyewa küntu yangdak lama dang"
    },
    {
      "bo": "འབྲལ་མེད་ཆོས་ཀྱི་དཔལ་ལ་ལོངས་སྤྱོད་ཅིང་། །",
      "en": "May we enjoy the splendour of the Dharma,",
      "en-trans": "dralmé chö kyi pal la longchö ching"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་ཡོན་ཏན་རབ་རྫོགས་ནས། །",
      "en": "And by perfecting the qualities of the paths and stages,",
      "en-trans": "sa dang lam gyi yönten rabdzok né"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་གི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །",
      "en": "May we swiftly attain the level of Vajradhara!",
      "en-trans": "dorjé chang gi gopang nyur tob shok"
    }
  ]
}