{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/gaton-ngawang-lekpa/prayer-sakya-pandita-manjughosha-guru",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཇམ་དབྱངས་བླ་མ་ས་སྐྱ་པཎྜི་ཏའི་གསོལ་འདེབས།",
    "en": "Prayer to the Mañjughoṣa Guru, Sakya Paṇḍita1"
  },
  "text": [
    {
      "bo": "འཇམ་དབྱངས་བླ་མ་ས་སྐྱ་པཎྜི་ཏ་ཁྱེད་ཐུགས་དགྱེས་པའི་ཕྲིན་ལས་ཐམས་ཅད་རྗེས་སུ་བསྒྲུབ་པའི་སླད་དུ།",
      "en": "O Mañjughoṣa Guru Sakya Paṇḍita, so that I might carry out all the activity that delights you,",
      "en-trans": "jamyang lama sakya pandita khyé tuk gyepé trinlé tamché jesu drubpé ledu"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མ་སྐྱབས་གནས་ཀུན་འདུས་ཁྱེད་ལ།",
      "en": "Mañjughoṣa Guru, embodiment of all sources of refuge,",
      "en-trans": "jamyang lama kyabné kündü khyé la"
    },
    {
      "bo": "སྙིང་ནས་དད་པས་ཕྱག་འཚལ་ལོ། །",
      "en": "With heartfelt faith, I prostrate myself before you.",
      "en-trans": "nying né depé chaktsal lo"
    },
    {
      "bo": "མཆོད་དོ། །",
      "en": "I make offerings to you.",
      "en-trans": "chö do"
    },
    {
      "bo": "སྐྱབས་སུ་མཆིའོ། །",
      "en": "I take refuge in you.",
      "en-trans": "kyab su chi o"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ། །",
      "en": "I pray to you.",
      "en-trans": "solwa deb so"
    },
    {
      "bo": "ཐབས་འདི་ལ་བརྟེན་ནས་བསྐལ་པ་གྲངས་མེད་གསུམ་གྱི་ཚོགས་གཉིས་སྐད་ཅིག་ཉིད་ལ་རྫོགས་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "On the basis of this method, inspire me with your blessings, that I may perfect the twofold accumulation of three incalculable aeons within a single instant!",
      "en-trans": "tab di la ten né kalpa drangmé sum gyi tsok nyi kechik nyi la dzokpar jingyi lab tu sol"
    },
    {
      "bo": "སྡིག་སྒྲིབ་ཉེས་ལྟུང་དྲི་མའི་ཚོགས་བག་ཆགས་དང་བཅས་པ་ཐམས་ཅད་སྐད་ཅིག་ལ་ད་ལྟ་ཉིད་དུ་བྱང་ཞིང་དག་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, that I may cleanse and purify all my misdeeds, obscurations, faults and downfalls, together with their habitual tendencies, right away within a single instant!",
      "en-trans": "dikdrib nyetung drimé tsok bakchak dang chepa tamché kechik la danta nyi du jang zhing dakpar jingyi lab tu sol"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མའི་བྱིན་རླབས་སྙིང་ལ་ཞུགས་ནས།",
      "en": "Let the blessings of the Mañjughoṣa Guru seep into my heart",
      "en-trans": "jamyang lamé jinlab nying la zhuk né"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་གསུམ་གྱི་ཡོན་ཏན་ཐམས་ཅད་སྐད་ཅིག་ཉིད་ལ་ཡོངས་སུ་རྫོགས་ནས།",
      "en": "And cause all the qualities of study, contemplation and meditation to be perfected within a single moment.",
      "en-trans": "tö sam gom sum gyi yönten tamché kechik nyi la yongsu dzok né"
    },
    {
      "bo": "བསྟན་པ་དང་སེམས་ཅན་གྱི་དོན་ནམ་མཁའི་མཐའ་དང་མཉམ་པར་སྒྲུབ་ནུས་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, that I may be able to benefit the teachings and sentient beings on a scale equal to space itself.",
      "en-trans": "tenpa dang semchen gyi dön namkhé ta dang nyampar drub nüpar jingyi lab tu sol"
    }
  ]
}