{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-shenga/prayer-to-invoke-sakya-pandita",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཇམ་མགོན་ས་སྐྱ་པཎྜི་ཏའི་ཐུགས་རྒྱུད་བསྐུལ་བའི་གསོལ་འདེབས་བཞུགས་སོ།།",
    "en": "Prayer to Invoke the Wisdom Mind of the Gentle Protector Sakya Paṇḍita"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om swati"
    },
    {
      "bo": "མཐའ་ཡས་སེམས་ཅན་ཚོགས་ལ་ཕན་དགོངས་པའི། །",
      "en": "All the victorious ones throughout the ten directions",
      "en-trans": "tayé semchen tsok la pen gongpé"
    },
    {
      "bo": "རབ་འབྱམས་ཕྱོགས་བཅུའི་རྒྱལ་བ་ཐམས་ཅད་དང་། །",
      "en": "Who intend to benefit innumerable sentient beings,",
      "en-trans": "rabjam chok chü gyalwa tamché dang"
    },
    {
      "bo": "ཁྱད་པར་རྒྱལ་སྲས་ཐུ་བོ་འཇམ་པའི་དབྱངས། །",
      "en": "And especially the foremost bodhisattva Mañjughoṣa,",
      "en-trans": "khyepar gyalsé tuwo jampé yang"
    },
    {
      "bo": "མཚན་ལྡན་བླ་མར་སྣང་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Manifest as the authentic guru, to whom I pay homage.",
      "en-trans": "tsenden lamar nang la chaktsal lo"
    },
    {
      "bo": "དེང་དུས་སྙིགས་མའི་སྐྱོན་གྱིས་སྦགས་པ་ཡིས། །",
      "en": "These days, as most beings are corrupted by the taints",
      "en-trans": "dengdü nyikmé kyön gyi bakpa yi"
    },
    {
      "bo": "སྐྱེ་བོ་ཕལ་ཆེར་ཡང་དག་ལམ་ལས་བྱོལ། །",
      "en": "Of the degenerate age and wander far from the genuine path,",
      "en-trans": "kyewo palcher yangdak lam lé jol"
    },
    {
      "bo": "རང་གིས་རང་བསླུས་འདི་ཕྱིའི་དོན་སྟོར་བ། །",
      "en": "Fooling themselves, forsaking their own interests for this and future lives—",
      "en-trans": "rang gi rang lü di chi dön torwa"
    },
    {
      "bo": "འདི་ལས་སྐྱོབས་ཤིག་འཇམ་མགོན་བླ་མ་རྗེ། །",
      "en": "Protect me from such a plight, O Gentle Protector, noble guru!",
      "en-trans": "di lé kyob shik jamgön lama jé"
    },
    {
      "bo": "སྣོད་ཀྱི་འབྱུང་བ་མི་བརྟན་འཕེལ་འགྲིབ་ཆེ། །",
      "en": "The elements of the outer world are unstable and fluctuate greatly;",
      "en-trans": "nö kyi jungwa mi ten peldrib ché"
    },
    {
      "bo": "བཅུད་ཀྱི་སེམས་ཅན་མི་བདེ་སྡུག་བསྔལ་མང་། །",
      "en": "Beings who inhabit the world know much unhappiness and misery.",
      "en-trans": "chü kyi semchen midé dukngal mang"
    },
    {
      "bo": "སྣ་ཚོགས་ལས་ཀྱིས་མནར་བའི་འགྲོ་ཁམས་ལ། །",
      "en": "For these realms, which are so affected by various forms of karma,",
      "en-trans": "natsok lé kyi narwé dro kham la"
    },
    {
      "bo": "དབུགས་འབྱིན་མཛོད་ཅིག་འཇམ་མགོན་བླ་མ་རྗེ། །",
      "en": "Grant some relief, I pray, O Gentle Protector, noble guru!",
      "en-trans": "ukjin dzö chik jamgön lama jé"
    },
    {
      "bo": "སྔོན་ཆད་ལྗོངས་འདིར་ཆོས་ཀྱི་སྤྱན་ལྡན་པ། །",
      "en": "In this land in the past, those possessing the vision of Dharma",
      "en-trans": "ngönché jong dir chökyi chen denpa"
    },
    {
      "bo": "སྤྲུལ་པའི་ལོ་པཎ་ཆེན་པོ་ཁྱེད་རྣམས་ཀྱིས། །",
      "en": "Were well cared for by great emanated translators and scholars,",
      "en-trans": "trulpé lo pen chenpo khyé nam kyi"
    },
    {
      "bo": "རྒྱལ་བསྟན་འཁོར་ལོ་གཉིས་ཀྱིས་ལེགས་བསྐྱངས་པས། །",
      "en": "Such as you, through the two ‘wheels’ of Buddhist teachings,1",
      "en-trans": "gyalten khorlo nyi kyi lek kyangpé"
    },
    {
      "bo": "སྐྱེ་དགུ་ཐམས་ཅད་བདེ་དཔལ་འབྱོར་པ་རྒྱས། །",
      "en": "And everyone’s happiness, wealth and prosperity increased.",
      "en-trans": "kyegu tamché dé pal jorpa gyé"
    },
    {
      "bo": "ད་དུས་སྐྱེ་བོ་འཇིག་རྟེན་ཆོས་ཀྱིས་བསླུས། །",
      "en": "But now beings are deceived by mundane concerns,",
      "en-trans": "da dü kyewo jikten chö kyi lü"
    },
    {
      "bo": "བསྟན་པའི་སྒོར་ཞུགས་ཆོས་མིན་བྱ་བས་གཡེང་། །",
      "en": "And those who’ve entered the teachings are lost in undharmic deeds.",
      "en-trans": "tenpé gor zhuk chö min jawé yeng"
    },
    {
      "bo": "དེ་ལ་དཀར་ཕྱོགས་ལྷ་ཡི་མགོན་མེད་པས། །",
      "en": "As we lack the protection of the gods of positivity,",
      "en-trans": "dé la karchok lha yi gön mepé"
    },
    {
      "bo": "ནད་མཚོན་མུ་གེའི་རྐྱེན་གྱིས་རྣམ་པར་འཐག །",
      "en": "We’re worn down, beset by illness, conflict and famine.",
      "en-trans": "né tsön mugé kyen gyi nampar tak"
    },
    {
      "bo": "དེ་ཕྱིར་བདག་ཅག་ལྔ་བདོའི་འགྲོ་བ་རྣམས། །",
      "en": "Therefore, inspire us, the beings of this time,",
      "en-trans": "dechir dakchak nga dö drowa nam"
    },
    {
      "bo": "བློ་སྣ་ཡང་དག་ཆོས་ལ་བསྒྱུར་བ་དང་། །",
      "en": "When the five degenerations are so rife, to turn our minds towards the Dharma.",
      "en-trans": "lona yangdak chö la gyurwa dang"
    },
    {
      "bo": "དམ་ཆོས་སྒྲུབ་ལ་བར་ཆད་མི་འབྱུང་ཞིང་། །",
      "en": "Prevent the arising of obstacles to Dharma practice,",
      "en-trans": "damchö drub la barché minjung zhing"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And bless us with the accomplishment of our own and others’ aims.",
      "en-trans": "rangzhen dön nyi drubpar jingyi lob"
    },
    {
      "bo": "ཁྱོད་ཀྱིས་སྔོན་ཚེ་འགྲོ་བ་མགོན་མེད་པ། །",
      "en": "If your pledge to watch over all the beings of former times",
      "en-trans": "khyö kyi ngöntsé drowa gön mepa"
    },
    {
      "bo": "ཀུན་ལ་གཟིགས་པའི་ཞལ་བཞེས་བརྟན་ལགས་ན། །",
      "en": "Who lacked protection was a sincere and stable one,",
      "en-trans": "kün la zikpé zhalzhé ten lak na"
    },
    {
      "bo": "གདུང་བའི་ཤུགས་ཀྱིས་མ་ལ་བུ་བཞིན་དུ། །",
      "en": "Why not look upon me too, as I repeatedly recall you",
      "en-trans": "dungwé shuk kyi ma la bu zhindu"
    },
    {
      "bo": "ཡང་ཡང་དྲན་ན་བདག་ལ་ཅིས་མི་དགོངས། །",
      "en": "Like a child desperately missing its mother.",
      "en-trans": "yangyang dren na dak la chi mi gong"
    },
    {
      "bo": "སྐྱེམས་པ་རྣམས་ཀྱིས་ཆབ་ལ་རེ་བ་བཞིན། །",
      "en": "Even though I turn to you, precious guru, in my mind,",
      "en-trans": "kyempa nam kyi chab la rewa zhin"
    },
    {
      "bo": "བདག་ཡིད་རྗེ་བཙུན་བླ་མའི་རྗེས་ཕྱོགས་ཀྱང། །",
      "en": "Like someone plagued by thirst and longing for water,",
      "en-trans": "dak yi jetsün lamé jé chok kyang"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ཀྱི་ཐུགས་རྗེའི་འོད་སྣང་གིས།",
      "en": "Still I am untouched by your compassion’s radiance.",
      "en-trans": "gönpo khyö kyi tukjé ö nang gi"
    },
    {
      "bo": "བདག་ལ་རེག་པ་མེད་པ་འདི་ཅི་ཞིག །",
      "en": "O protector, why have you forsaken me?",
      "en-trans": "dak la rekpa mepa di chizhik"
    },
    {
      "bo": "ད་དུང་དུ་ཡང་བྱང་ཆུབ་སྙིང་པོའི་བར། །",
      "en": "From now until I reach the essence of awakening,",
      "en-trans": "dadung du yang changchub nyingpö bar"
    },
    {
      "bo": "ཆོས་རྗེ་བླ་མ་ཁྱོད་ཀྱི་རྗེས་ཞུགས་པས། །",
      "en": "Guru, Dharma lord, as I follow in your footsteps,",
      "en-trans": "chöjé lama khyö kyi jé zhukpé"
    },
    {
      "bo": "རབ་འབྱམས་ཤེས་བྱའི་ཆོས་ལ་དབང་འབྱོར་ཞིང། །",
      "en": "Help me to learn the infinite dharmas to be known",
      "en-trans": "rabjam shejé chö la wangjor zhing"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་གཉིས་འབྱོང་བར་མཛད་དུ་གསོལ། །",
      "en": "And to master twofold bodhicitta, I implore you.",
      "en-trans": "changchub sem nyi jongwar dzé du sol"
    },
    {
      "bo": "སྙིགས་མའི་དུས་འདིར་རྒྱལ་བསྟན་རིན་པོ་ཆེ། །",
      "en": "At this time of the degenerate age, let the community of the saṅgha,",
      "en-trans": "nyikmé dü dir gyalten rinpoche"
    },
    {
      "bo": "བཤད་སྒྲུབ་འཁོར་ལོ་གཉིས་ཀྱིས་འཛིན་བཟོད་པའི། །",
      "en": "Which is capable of preserving the precious teachings of Buddha",
      "en-trans": "shedrub khorlo nyi kyi dzin zöpé"
    },
    {
      "bo": "དགེ་འདུན་འདུས་པས་ས་སྟེང་ཀུན་འགེངས་ཤིང་།",
      "en": "Though the two activities of teaching and practice, fill the entire world,",
      "en-trans": "gendün düpé sateng kün geng shing"
    },
    {
      "bo": "མི་ཚེ་ཆོས་ཀྱིས་འདའ་བ་མཛད་དུ་གསོལ། །",
      "en": "And let everyone devote their entire lives to the Dharma, I pray.",
      "en-trans": "mitsé chö kyi dawa dzé du sol"
    },
    {
      "bo": "འཕགས་པའི་ཡུལ་གྱི་མདོ་སྔགས་གཞུང་ལུགས་ཀུན། །",
      "en": "Through the activities of disputation and guidance,",
      "en-trans": "pakpé yul gyi do ngak zhungluk kün"
    },
    {
      "bo": "དངོས་སྟོབས་རིགས་པའི་ལམ་ལས་རབ་དྲངས་ཏེ། །",
      "en": "Perfectly inspired by an approach of factual reasoning",
      "en-trans": "ngö tob rikpé lam lé rab drang té"
    },
    {
      "bo": "ཚར་གཅོད་རྗེས་སུ་འཛིན་པའི་ཕྲིན་ལས་ཀྱིས། །",
      "en": "Based on all the textual traditions of sūtra and mantra in the noble land,",
      "en-trans": "tsarchö jesu dzinpé trinlé kyi"
    },
    {
      "bo": "སྐྱེ་དགུའི་བློ་སྣ་ཆོས་ལ་འགྱུར་བར་ཤོག །",
      "en": "May the minds of all beings be turned towards the Dharma.",
      "en-trans": "kyegü lona chö la gyurwar shok"
    },
    {
      "bo": "ཆོས་སྐྱོང་རྒྱལ་པོའི་ཆབ་སྲིད་ཡུན་དུ་བརྟན། །",
      "en": "May the rule of dharma-protecting kings endure,",
      "en-trans": "chökyong gyalpö chabsi yündu ten"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་བུའི་སྐུ་ཚེ་མཛད་ཕྲིན་རྒྱས། །",
      "en": "The lives of dharma-holders remain secure, and their activities flourish,",
      "en-trans": "tendzin kyebü kutsé dzetrin gyé"
    },
    {
      "bo": "རྫོགས་ལྡན་དུས་ཀྱི་དགེ་མཚན་གསར་པ་ཡིས། །",
      "en": "And, through the positive dawn of a new golden era,",
      "en-trans": "dzokden dü kyi getsen sarpa yi"
    },
    {
      "bo": "བསིལ་ལྡན་ལྗོངས་ཀུན་བདེ་བར་གནས་པར་ཤོག །",
      "en": "May everyone throughout this temperate land have lasting happiness.",
      "en-trans": "silden jong kün dewar nepar shok"
    },
    {
      "bo": "བདག་ཀྱང་སྙིགས་མའི་དུས་འདིར་མགོན་ཁྱོད་ཀྱི། །",
      "en": "May I, during this degenerate age, serve to continue your activity,",
      "en-trans": "dak kyang nyikmé dü dir gön khyö kyi"
    },
    {
      "bo": "ཕྲིན་ལས་ཕྱོགས་མཐར་སྤེལ་བའི་བྱེད་པོར་གྱུར། །",
      "en": "Extending it, O protector, to the farthest reaches in every direction.",
      "en-trans": "trinlé chok tar pelwé jepor gyur"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་གཞན་སྣང་དགེ་ལ་བསྒྱུར། །",
      "en": "May all my connections be meaningful and inspire virtue in others,2",
      "en-trans": "dreltsé dönden zhennang gé la gyur"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་ལ་བྱ་བ་བྱེད་པར་ཤོག། །།",
      "en": "And may my own activity be of service to the Buddha’s teachings.",
      "en-trans": "sangye ten la jawa jepar shok"
    }
  ]
}