{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tsarchen-dorje-chang",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཚར་ཆེན་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས་པ་བྱིན་རླབས་རོལ་མཚོ་ཞེས་བྱ་བ་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།"
    },
    {
      "bo": "སངས་རྒྱས་ཀུན་གྱི་ཐུགས་རྗེ་གཅིག་བསྡུས་པ།    །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་དངོས་ཚར་པ་ཆོས་ཀྱི་རྗེ།    །"
    },
    {
      "bo": "སྙིང་དབུས་པད་དཀར་བཞད་པའི་རྩེར་མཆོད་དེ།    །"
    },
    {
      "bo": "མི་ཕྱེད་སྙིང་ནས་གུས་པས་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "གངས་ཅན་མཁས་དང་གྲུབ་པའི་གཙུག་གི་རྒྱན།    །"
    },
    {
      "bo": "བིར་ཝའི་ཞལ་གྱི་གདམས་པ་ས་སྐྱ་པ། །"
    },
    {
      "bo": "རྗེ་བཙུན་གོང་མའི་སྙན་བརྒྱུད་སློབ་བཤད་ཀྱི།    །"
    },
    {
      "bo": "ཟབ་དོན་བདུད་རྩིས་མྱོས་པའི་ཚར་པ་རྗེ།    །"
    },
    {
      "bo": "ཕ་རྒོད་བློ་གསལ་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ནཱ་རོ་པ་དང་བྲམ་ཟེ་མཆོག་སྲེད་དང་།    །"
    },
    {
      "bo": "རྭ་ཆེན་འབྲོག་མི་ལ་སོགས་ལེགས་བརྒྱུད་པའི།    །"
    },
    {
      "bo": "ཡི་དམ་ཌཱ་ཀི་ཆོས་སྐྱོང་ལ་སོགས་པའི།    །"
    },
    {
      "bo": "གསེར་ཆོས་ཆིག་བརྒྱུད་བདག་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བསླབ་པའི་ཚུལ་ཁྲིམས་དག་པས་ཡིད་འཕྲོག་ཅིང་།    །"
    },
    {
      "bo": "ཏིང་འཛིན་སྒོ་བརྒྱར་འཇུག་ལྡང་ཐོགས་པ་མེད།    །"
    },
    {
      "bo": "ཤེས་རབ་གསུམ་གྱི་གཏེར་ཆེན་འཇམ་པའི་དབྱངས།    །"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མ་མཆོག་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཆད་མཁས་བློ་ལྡན་བྱེ་བའི་ཡི་ག་འགུགས།    །"
    },
    {
      "bo": "རྩོད་པས་ཕས་རྒོལ་བྲག་རི་ཕྱེ་མར་འཐག  །"
    },
    {
      "bo": "རྩོམ་པས་ཐུབ་བསྟན་ལྷུན་པོ་གསལ་བར་བྱེད།    །"
    },
    {
      "bo": "མཁྱེན་རབ་ཕ་མཐའ་ཡས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བརྩེ་བ་ཆེན་པོས་གཞན་དོན་འབའ་ཞིག་སྤྱོད།    །"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པས་བདུད་སྡེ་ཕྱེ་མར་འཐག  །"
    },
    {
      "bo": "ཡི་དམ་ལྷ་ཡི་དགྱེས་ཞལ་རྟག་ཏུ་མཇལ།    །"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་རྟགས་ཚད་མངོན་གྱུར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བསྐྱེད་པའི་རིམ་པས་ཅིར་སྣང་ལྷ་སྐུར་ཤར།    །"
    },
    {
      "bo": "རྫོགས་པའི་རིམ་པས་རླུང་ཐིག་འགྲོས་རྣམས་ཐིམ།    །"
    },
    {
      "bo": "སྒྲིབ་གསུམ་བག་ཆགས་དང་བཅས་སྤངས་པ་དང་།    །"
    },
    {
      "bo": "ས་ལམ་ཡོན་ཏན་རྫོགས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སྙིགས་དུས་རྡོ་རྗེ་འཛིན་པ་ཀུན་གྱི་རྒྱལ།    །"
    },
    {
      "bo": "རྡོ་རྗེའི་བླ་མ་དྲན་ཆོག་ཚར་པ་རྗེར།    །"
    },
    {
      "bo": "མི་ཕྱེད་གུས་པས་རྟག་ཏུ་གསོལ་འདེབས་ན།    །"
    },
    {
      "bo": "བྱིན་རླབས་དབང་ཆེན་ད་ལྟ་བསྐུར་དུ་གསོལ།    །"
    },
    {
      "bo": "རིག་སྟོང་ཆོས་ཉིད་མངོན་སུམ་རྟོགས་པ་དང་།    །"
    },
    {
      "bo": "འགྲོས་བཞི་ཐིམ་ནས་སྐུ་བཞི་མངོན་དུ་བྱས།    །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པ་ཡི།    །"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོ་ཁྱོད་དང་མཚུངས་པར་ཤོག  །"
    }
  ]
}