{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/tsongkhapa-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་ཐམས་ཅད་མཁྱེན་པ་ཙོང་ཁ་པ་ཆེན་པོར་གསོལ་བ་འདེབས་པ་མོས་གུས་ཀྱི་དབྱངས་སྙན་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བྷཊྚ་རཱ་ཀཱ་ཡ།"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི།    །"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པ་གཅིག་ཏུ་བསྡུས་པའི་སྐུ།    །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མ་བློ་བཟང་གྲགས་པ་ཡི།    །"
    },
    {
      "bo": "གསང་གསུམ་རྣམ་ཐར་དྲན་བཞིན་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཇམ་དཔལ་དཔའ་བོ་མི་ཡི་གཟུགས་འཛིན་པ།    །"
    },
    {
      "bo": "ཐ་མལ་སྣང་ངོར་དགེ་བའི་བཤེས་སུ་སྟོན།    །"
    },
    {
      "bo": "ཁྲིམས་ལྡན་ངུར་སྨྲིག་འཛིན་པ་ཀུན་གྱི་རྒྱན།    །"
    },
    {
      "bo": "བློ་བཟང་རྒྱལ་བ་གཉིས་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཉེས་པའི་དྲི་མ་དག་ཅིང་གཙང་བའི་སྐུ།    །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པ་ལས།    །"
    },
    {
      "bo": "རྨད་བྱུང་རྒྱལ་བ་དགྱེས་བའི་དྲི་བསུང་འཐུལ།    །"
    },
    {
      "bo": "དགྲ་བཅོམ་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་བརྩེ་བའི་ཤུགས་ཀྱིས་དྲངས།    །"
    },
    {
      "bo": "གཞན་ལ་ཕན་པ་ཁོ་ནའི་ཐུགས་མངའ་བ།    །"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་དྲི་མེད་ཟླ་འདྲས་བརྒྱན།    །"
    },
    {
      "bo": "བློ་ལྡན་ཐུགས་རྗེའི་བདག་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁྲོ་བའི་ཀུན་རྟོག་བག་ཆགས་དང་བཅས་འབྱིན།    །"
    },
    {
      "bo": "འགྲོ་མང་ནམ་མཁའི་མཐའ་དང་མཉམ་པ་ཀུན།    །"
    },
    {
      "bo": "བྱང་ཆུབ་ཁང་བཟང་དམ་པར་བཀྲི་བ་ལ།    །"
    },
    {
      "bo": "ཞུམ་མེད་སྙིང་སྟོབས་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བདག་བས་གཞན་གཅེས་བྱང་ཆུབ་ཐུགས་འབྱོངས་ཤིང་།    །"
    },
    {
      "bo": "སྙིགས་དུས་སྐྱེ་བོའི་ལོག་སྒྲུབ་ཐམས་ཅད་བཟོད།    །"
    },
    {
      "bo": "ཕ་རོལ་ཕྱིན་དྲུག་གོ་ཆ་བཙན་པོ་བགོས།    །"
    },
    {
      "bo": "རྒྱལ་སྲས་སེམས་དཔའ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མདོ་སྔགས་གཞུང་ལུགས་ཀུན་གྱི་དེ་ཉིད་རིག  །"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་ལ་ཆགས་ཐོགས་དྲི་མ་བྲལ།    །"
    },
    {
      "bo": "ཕྲིན་ལས་བཟང་པོས་སྲིད་ཞིའི་ཁྱོན་ཀུན་ཁྱབ།    །"
    },
    {
      "bo": "གངས་ཅན་བསྟན་འཛིན་མཚུངས་མེད་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཕྱི་རུ་སོ་སོར་ཐར་པས་རྒྱུད་བསྡམས་ཤིང་།    །"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་ཀྱི་གཏེར་ལ་དབང་།    །"
    },
    {
      "bo": "གསང་བ་ཟུང་འཇུག་ཡེ་ཤེས་གྲུབ་པའི་གཙོ།    །"
    },
    {
      "bo": "སུམ་ལྡན་རྡོ་རྗེ་འཛིན་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཐའ་བྲལ་དབུ་མའི་ལམ་སྲོལ་རིག་པས་ཕྱེས།    །"
    },
    {
      "bo": "འཇམ་པའི་དབྱངས་ལས་ཟབ་དོན་བདུད་རྩི་བརྙེས།    །"
    },
    {
      "bo": "དབྱངས་ཅན་མགྲིན་པར་རོལ་པའི་སྤོབས་པ་ལྡན།    །"
    },
    {
      "bo": "ཀླུ་སྒྲུབ་གཉིས་པར་སྣང་དེར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁྱད་པར་རྡོ་རྗེ་འཆང་གི་གསང་བའི་མཛོད།    །"
    },
    {
      "bo": "དཔལ་ལྡན་འདུས་པ་སྒྱུ་མ་བདེ་མཆོག་དང་།    །"
    },
    {
      "bo": "དུས་ཀྱི་འཁོར་ལོ་ལ་སོགས་སྔགས་རྒྱུད་ཀྱི།    །"
    },
    {
      "bo": "བདག་པོ་གསང་འཛིན་དབང་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གྱི་ཤིང་རྟའི་བགྲོད་པ་ཡི།    །"
    },
    {
      "bo": "ལམ་བཟང་འཁྲུལ་མེད་ལེགས་པར་བསྙེན་པ་ལས།    །"
    },
    {
      "bo": "སྐུ་བཞིའི་གོ་འཕང་དཀའ་བ་མེད་པར་རྙེད།    །"
    },
    {
      "bo": "ཁྱབ་བདག་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མདོར་ན་ཐུབ་པའི་བསྟན་པ་མ་ལུས་ཀུན།    །"
    },
    {
      "bo": "འགལ་མེད་གདམས་པ་ཐུགས་སུ་ཆུད་པ་ལས།    །"
    },
    {
      "bo": "བསྟན་པའི་བདག་པོ་འགྲན་ཟླ་ཀུན་སྤངས་པ།    །"
    },
    {
      "bo": "རྗེ་བཙུན་ཐམས་ཅད་མཁྱེན་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཤཱཀྱ་སེང་གེའི་བསྟན་པའི་སྲོག་ཤིང་ནི།    །"
    },
    {
      "bo": "ཁྱོད་ལས་གཞན་དུ་ནམ་ཡང་མ་དམིགས་པས།    །"
    },
    {
      "bo": "ཁྱོད་འདྲ་འཇིག་རྟེན་གསུམ་ན་དཀོན་པའི་མཆོག  །"
    },
    {
      "bo": "ཐུབ་དབང་གཉིས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཛད་པའི་རྣམ་ཐར་ཆ་ཤས་ཙམ་རེ་ཡང་།    །"
    },
    {
      "bo": "ལྷ་དང་བཅས་པས་ཉིན་བཞིན་སྒྲོགས་ལ་བྲེལ།    །"
    },
    {
      "bo": "བསྔགས་འོས་བསྔགས་པ་ཀུན་གྱི་གཞིར་གྱུར་པ།    །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ད་ལྟ་བྱམས་ཆེན་རྒྱལ་ཚབ་ཆེན་པོའི་དྲུང་།    །"
    },
    {
      "bo": "འཇམ་དཔལ་སྙིང་པོའི་མཚན་གྱི་མེ་ཏོག་བརྗིད།    །"
    },
    {
      "bo": "ཐེག་ཆེན་ཆོས་ལ་རྟག་ཏུ་ལོངས་སྤྱོད་པ།    །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བདག་ནི་དེང་ནས་ཚེ་རབས་ཐམས་ཅད་དུ།    །"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མའི་ཞབས་པད་གཙུག་ཏུ་བཀུར།    །"
    },
    {
      "bo": "ལེགས་གསུང་གདམས་པའི་བདུད་རྩིས་བདག་རྒྱུད་གྲོལ།    །"
    },
    {
      "bo": "བཀའ་གདམས་རྣམ་ཐར་གཙང་མ་འཛིན་པར་ཤོག  །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཐུགས་བསྐྱེད་སྨོན་ལམ་དང་།    །"
    },
    {
      "bo": "མཛད་པ་ཕྲིན་ལས་མཁྱེན་བརྩེ་ནུས་མཐུ་རྣམས།    །"
    },
    {
      "bo": "མ་ལུས་འགྲོ་བའི་རྒྱུད་ལ་ཡོངས་སུ་རྫོགས།    །"
    },
    {
      "bo": "བསྟན་འགྲོའི་དོན་རྣམས་སྒྲུབ་ལ་མཐུ་ལྡན་ཤོག  །"
    }
  ]
}