{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-tsondru/prayer-to-shechen-kongtrul-as-vajrasattva",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྡོར་སེམས་དངོས་ཞེ་ཆེན་ཀོང་སྤྲུལ་གྱི་གསོལ་འདེབས།",
    "en": "Prayer to Shechen Kongtrul as Vajrasattva"
  },
  "text": [
    {
      "bo": "མཚན་ཙམ་འཛིན་པས་ངན་སོང་འཇིགས་སྐྱོབ་པ། །",
      "en": "You are Vajrasattva, lord of a hundred buddha families, in person,",
      "en-trans": "tsen tsam dzinpé ngensong jik kyobpa"
    },
    {
      "bo": "རིགས་བརྒྱའི་ཁྱབ་བདག་རྡོ་རྗེ་སེམས་དཔའ་དངོས། །",
      "en": "Whose name alone guards against the terrors of the lower realms.",
      "en-trans": "rik gyé khyabdak dorjé sempa ngö"
    },
    {
      "bo": "པདྨ་དྲི་མེད་ལེགས་པའི་བློ་གྲོས་ལ། །",
      "en": "Pema Drimé Lekpé Lodrö, from the depth of my heart, I pray to you:",
      "en-trans": "pema drimé lekpé lodrö la"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་བ་འདེབས་སོ་དབང་བྱིན་སྩོལ། །",
      "en": "Grant me empowerments and blessings!",
      "en-trans": "nying né solwa deb so wang jin tsol"
    },
    {
      "bo": "ཨོཾ་མ་ཧཱ་གུ་རུ་པདྨ་བི་མ་ལ་མ་ཏི་ཤྲཱི་བ་ཛྲ་ས་ཏྭ་ཀཱ་ཡ་ཝཱཀྐ་ཙིཏྟ་ཨ་བྷི་ཥཱཉྩི་སརྦ་སིདྡྷི་ཕ་ལ་ཨཱཿཧཱུྃཿ",
      "en": "oṃ mahāguru padma vimala mati śrī vajrasatva kāya vāk citta abhiṣiñca sarva siddhi phala āḥ hūṃ",
      "en-trans": "om maha guru pema bimala mati shri bendzra sata kaya waka tsitta abhi kintsi sarwa siddhi pala ah hum"
    },
    {
      "bo": "རྨོངས་དང་མ་རིག་འཁྲུལ་པའི་གཞན་དབང་གིས། །",
      "en": "May all impairments of samayas of body, speech and mind,",
      "en-trans": "mong dang marik trulpé zhenwang gi"
    },
    {
      "bo": "སྐུ་གསུང་ཐུགས་ཀྱི་དམ་ཚིག་ཉམས་པ་ཀུན། །",
      "en": "Brought about through bewilderment, ignorance and delusion,",
      "en-trans": "ku sung tuk kyi damtsik nyampa kün"
    },
    {
      "bo": "སྐྱེ་འགགས་གཉིས་མེད་སྟོང་པ་ཉིད་དུ་དག །",
      "en": "Be purified in emptiness that is beyond the duality of arising and ceasing",
      "en-trans": "kyé gak nyimé tongpanyi du dak"
    },
    {
      "bo": "རིག་སྟོང་རྡོ་རྗེ་སེམས་དཔའི་ཞལ་མཐོང་ཤོག །",
      "en": "And may I see awareness and emptiness, the true face of Vajrasattva!",
      "en-trans": "riktong dorjé sempé zhal tong shok"
    }
  ]
}