{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham/daily-prayer-to-gesar",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དགྲ་བླའི་རྒྱལ་པོ་གེ་སར་གྱི་རྒྱུན་གསོལ་བསམ་དོན་ལྷུན་འགྲུབ་བཞུགས་སོ།།",
    "en": "A Daily Prayer to Gesar, King of the Dralas"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ།",
      "en": "oṃ āḥ hūṃ",
      "en-trans": "om ah hung"
    },
    {
      "bo": "གསོལ་ལོ་མཆོད་དོ་རྩ་གསུམ་ཀུན་འདུས་སེང་ཆེན་ནོར་བུ་དགྲ་འདུལ།",
      "en": "We invoke you, we present offerings to you, Great Lion Norbu Dradül, embodiment of all Three Roots,",
      "en-trans": "sol lo chö do tsa sum kündü sengchen norbu dradul"
    },
    {
      "bo": "བདུད་འདུལ་ལས་ཀྱི་དབང་ཕྱུག",
      "en": "Lord of demon-subduing activity,",
      "en-trans": "düdul lé kyi wangchuk"
    },
    {
      "bo": "རྣལ་འབྱོར་ཡོངས་ཀྱི་ཕོ་ཉ།",
      "en": "Herald of all yogis,",
      "en-trans": "naljor yong kyi ponya"
    },
    {
      "bo": "རིག་འཛིན་ཡོངས་ཀྱི་སྲོག་ཤིང་།",
      "en": "Vital support of all vidyādharas,",
      "en-trans": "rigdzin yong kyi sokshing"
    },
    {
      "bo": "སྐྱེས་བུ་ཡོངས་ཀྱི་དགྲ་ལྷ་ཆེན་པོ་ཡབ་ཡུམ་སྲས་འཁོར་དང་བཅས་པ་རྣམས་དང་།",
      "en": "Great drala for all living beings, together with your consort, heirs and retinue,",
      "en-trans": "kyebu yong kyi dralha chenpo yabyum sé khor dang chepa nam dang"
    },
    {
      "bo": "ཕུ་བོ་འབུམ་པ་ཞལ་དཀར་ལ་སོགས་ཕུ་ནུ་སུམ་ཅུ།",
      "en": "And the thirty warrior kinsmen, including Puwo Bumpa and Gyatsa Shalkar,",
      "en-trans": "puwo bumpa zhal kar lasok pu nu sumchu"
    },
    {
      "bo": "དཔལ་ལྡན་ཌཱ་ཀིའི་གཙོ་མོ་སོགས་དྭངས་སྨན་བཅོ་བརྒྱད།",
      "en": "The eighteen maidens, such as the glorious queen of ḍākinīs,",
      "en-trans": "palden daki tsomo sok dangmen chobgyé"
    },
    {
      "bo": "ལྷ་ཀླུ་གཉན་གྱི་དམག་ཚོགས།",
      "en": "The armies of devas, nāgas, andnyen,",
      "en-trans": "lha lunyen gyi mak tsok"
    },
    {
      "bo": "དགྲ་བླ་ཝེར་མའི་དཔུང་རོགས།",
      "en": "The allied forces of dralas and wermas,",
      "en-trans": "drala wermé pung rok"
    },
    {
      "bo": "བཀའ་སྡོད་སྣང་སྲིད་དྲེགས་པ་དང་བཅས་པ་ཁྱེད་རྣམས་ལ་དམ་རྫས་ཕུད་ཀྱི་མཆོད་པ་སོགས་དངོས་འབྱོར་ཡིད་སྤྲུལ་གྱི་མཆོད་པ་རྒྱ་ཆེན་པོས་མཆོད་དོ། བསྟོད་དོ། མངའ་གསོལ་ལོ།",
      "en": "Together with their aides and the arrogant spirits of appearance and existence—to you all, I present vast offerings, both real and imagined, including the select portion of samaya substances. I praise you! I exalt you!",
      "en-trans": "kadö nangsi drekpa dang chepa khyé nam la damdzé pü kyi chöpa sok ngöjor yitrul gyi chöpa gyachenpö chö do tö do ngasol lo"
    },
    {
      "bo": "དུས་འདི་ནས་བྱང་ཆུབ་སྙིང་པོའི་བར་དུ་རྣལ་འབྱོར་པ་བདག་གི་ཕོ་ལྷ་དང་དགྲ་ལྷ་མཛོད་ཅིག",
      "en": "From now until reach the essence of awakening, be a patron deity and warrior spirit to this practitioner!",
      "en-trans": "dü di né changchub nyingpö bardu naljorpa dak gi polha dang dralha dzö chik"
    },
    {
      "bo": "མགོན་སྐྱབས་དང་དཔུང་གྲོགས་མཛོད་ཅིག",
      "en": "Be a refuge and protector, a supportive force!",
      "en-trans": "gön kyab dang pungdrok dzö chik"
    },
    {
      "bo": "ནད་གདོན་བར་ཆད་མི་མཐུན་པའི་ཕྱོགས་ཀུན་ལས་སྲུང་བ་དང་།",
      "en": "Guard against all sickness, obstructing forces, obstacles and disharmony!",
      "en-trans": "nedön barché mitünpé chok kün lé sungwa dang"
    },
    {
      "bo": "ཚེ་བསོད་དཔལ་འབྱོར་མངའ་ཐང་སྙན་གྲགས་གཟི་བརྗིད་སྤོབས་པ་རིགས་རྒྱུད་ལ་སོགས་པ་འདོད་པའི་དོན་ཐམས་ཅད་གོང་ནས་གོང་དུ་འཕེལ་ཞིང་རྒྱས་པ་དང་།",
      "en": "Expand and increase ever further my lifespan, merit, resources, influence, fame, charisma, confidence, and progeny—all the objects of my desire!",
      "en-trans": "tsé sö paljor ngatang nyendrak ziji pobpa rik gyü lasokpa döpé dön tamché gong né gong du pel zhing gyepa dang"
    },
    {
      "bo": "ལྷ་འདྲེ་མི་གསུམ་ལ་སོགས་གང་བསམ་དབང་དུ་འདུ་བ་དང་།",
      "en": "Bring whomsoever we wish, including deities, demons and human beings, under our control!",
      "en-trans": "lha dré mi sum lasok gang sam wang du duwa dang"
    },
    {
      "bo": "གནོད་བྱེད་བསམ་སྦྱོར་ངན་པའི་དགྲ་བགེགས་ཐམས་ཅད་ཚར་གཅོད་པ་དང་ས་དང་ལམ་གྱི་ཡོན་ཏན་མྱུར་དུ་རྫོགས་ཏེ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཐོབ་པ་དང་།",
      "en": "Annihilate all malevolent and malicious enemies and obstacle-makers! Swiftly bring us the qualities of the paths and stages and cause us to attain unsurpassable awakening!",
      "en-trans": "nöjé samjor ngenpé dragek tamché tsarchöpa dang sa dang lam gyi yönten nyurdu dzok té lanamepé changchub tobpa dang"
    },
    {
      "bo": "དགྲ་བླ་ཝེར་མ་རྒྱ་མཚོའི་སྐུ་ཤུགས་བདག་ལ་ཞུགས་ནས་ཕྱོགས་མཐའ་དག་ལས་རྣམ་པར་རྒྱལ་བའི་དངོས་གྲུབ་མ་ལུས་པ་སྩོལ་བར་མཛོད་ཅིག །",
      "en": "Bring us all the physical strength of the oceans of dralas and wermas, and grant us all the siddhis of perfect victory over all!",
      "en-trans": "drala werma gyatsö ku shuk dak la zhuk né chok tadak lé nampar gyalwé ngödrub malüpa tsolwar dzö chik"
    }
  ]
}