{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham/gesar-descent-of-blessings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཛམ་གླིང་སེང་ཆེན་རྒྱལ་པོའི་ཐུགས་རྗེ་བྱིན་འབེབས་བཞུགས།",
    "en": "Descent of the Compassionate Blessings of King Gesar, Great Lion of this World"
  },
  "text": [
    {
      "bo": "ཧྲཱིཿ  རྩ་གསུམ་ཀུན་འདུས་པདྨ་ཐོད་ཕྲེང་གི། །",
      "en": "Hrīḥ! Great lion of this world, emanated through the compassion",
      "en-trans": "hrih, tsa sum kündü pema tötreng gi"
    },
    {
      "bo": "ཐུགས་རྗེའི་སྐུ་སྤྲུལ་འཛམ་གླིང་སེང་ཆེན་རྗེ། །",
      "en": "Of Pema Tötreng Tsal, embodiment of all the Three Roots,",
      "en-trans": "tukjé ku trul dzamling sengchen jé"
    },
    {
      "bo": "དགྲ་ལྷ་ཝེར་མ་དཔའ་རྟུལ་དྭངས་སྨན་བཅས། །",
      "en": "Together with thedralas,wermas, brave warriors and maidens,",
      "en-trans": "dralha werma patul dangmen ché"
    },
    {
      "bo": "མོས་གུས་གདུང་ཤུགས་དྲག་པོས་སྤྱན་འདྲེན་ན། །",
      "en": "I invoke you all with intense and fervent devotion:",
      "en-trans": "mögü dungshuk drakpö chendren na"
    },
    {
      "bo": "ཐུགས་རྗེས་བརྩེ་དགོངས་ད་ལྟ་འདིར་གཤེགས་ལ། །",
      "en": "Consider us lovingly with compassion and come here now.",
      "en-trans": "tukjé tsé gong tanda dir shek la"
    },
    {
      "bo": "སྙིགས་མ་ལྔ་ལྡན་དུས་ཀྱི་ཐ་མ་འདིར། །",
      "en": "During this, the end of time, rife with fivefold degeneration,",
      "en-trans": "nyikma ngaden dü kyi tama dir"
    },
    {
      "bo": "ཁྱེད་ལས་རེ་ས་སྐྱབས་གནས་གཞན་མེད་པར། །",
      "en": "We have no other hope, no other source of refuge but you.",
      "en-trans": "khyé lé resa kyabné zhen mepar"
    },
    {
      "bo": "ཆོས་ལྡན་རིགས་ཀྱི་མྱུ་གུ་བསྲུང་བའི་ཕྱིར། །",
      "en": "To safeguard the fresh seedlings of the dharmic lineage,",
      "en-trans": "chöden rik kyi nyugu sungwé chir"
    },
    {
      "bo": "མངོན་སུམ་བྱིན་རླབས་ཆེན་པོའི་བརྡ་རྟགས་བཅས། །",
      "en": "Confer your compassionate blessings upon this fortunate one",
      "en-trans": "ngönsum jinlab chenpö datak ché"
    },
    {
      "bo": "སྐལ་ལྡན་འདི་ལ་ཐུགས་རྗེས་བྱིན་གྱིས་རློབས། །",
      "en": "And make plain the signs and symbols of great inspiration.",
      "en-trans": "kalden di la tukjé jingyi lob"
    },
    {
      "bo": "ལུས་ལ་དགྲ་བླ་ཝེར་མའི་དཔའ་མཁར་ཆོས། །",
      "en": "Forge from this body a fortress for the dralas and wermas,",
      "en-trans": "lü la drala wermé pakhar chö"
    },
    {
      "bo": "སྒོ་གསུམ་རྡོ་རྗེ་གསུམ་དུ་བྱིན་བརླབས་ནས། །",
      "en": "Bless my body, speech and mind as the three vajras,",
      "en-trans": "go sum dorjé sum du jinlab né"
    },
    {
      "bo": "བློ་གྲོས་སྤོབས་པ་མཐུ་སྟོབས་ནུས་པ་བསྐྱེད། །",
      "en": "Increase my intelligence, confidence, power, strength and capacity,",
      "en-trans": "lodrö pobpa tutob nüpa kyé"
    },
    {
      "bo": "ཁམས་གསུམ་སྲིད་གསུམ་དབང་དུ་འདུ་བ་ཡི། །",
      "en": "And grant me the attainment of universal victory,",
      "en-trans": "kham sum si sum wang du duwa yi"
    },
    {
      "bo": "ཕྱོགས་ལས་རྣམ་པར་རྒྱལ་བའི་དངོས་གྲུབ་སྩོལ། །",
      "en": "Bringing all three realms and planes of existence under my control.",
      "en-trans": "chok lé nampar gyalwé ngödrub tsol"
    }
  ]
}