{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-gyalwa-yangonpa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་བ་ཡང་དགོན་པ་ལ་གསོལ་བ་འདེབས་པ་ཐར་པའི་དེད་དཔོན་ཞེས་བྱ་བ།",
    "en": "A Prayer to Gyalwa Yangönpa"
  },
  "text": [
    {
      "bo": "བླ་མ་ཐུགས་རྗེ་ཅན་ལ་ཕྱག་འཚལ་ལོ།    །",
      "en": "Homage to the compassionate guru!",
      "en-trans": "lama tukjé chen la chaktsal lo"
    },
    {
      "bo": "ངེས་འབྱུང་ཆེན་པོས་སྲིད་ལས་རབ་བརྒལ་ནས།    །",
      "en": "With great renunciation, you cast aside conditioned existence.",
      "en-trans": "ngejung chenpö si lé rab gal né"
    },
    {
      "bo": "ཡོངས་འཛིན་དགེ་བའི་བཤེས་ཀྱི་རྗེས་སུ་བཟུང་།    །",
      "en": "You were guided your teacher, a virtuous spiritual friend,",
      "en-trans": "yongdzin gewé shé kyi jesu zung"
    },
    {
      "bo": "ཉོན་མོངས་ཟག་པ་ཐམས་ཅད་སྤངས་པ་ཡི།    །",
      "en": "And abandoned all mental afflictions and defilements—",
      "en-trans": "nyönmong zakpa tamché pangpa yi"
    },
    {
      "bo": "དགྲ་བཅོམ་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent arhat, ‘foe destroyer’, at your feet I pray.",
      "en-trans": "drachom chenpö zhab la solwa deb"
    },
    {
      "bo": "གཞན་ཕན་བྱང་ཆུབ་སེམས་གྱི་ཐུགས་རྒྱུད་གཏམས།    །",
      "en": "As your wisdom mind filled with altruism and bodhicitta,",
      "en-trans": "zhenpen changchub sem gyi tukgyü tam"
    },
    {
      "bo": "བདག་བས་གཞན་གཅེས་འབྱོངས་བས་རང་སྲོག་ཀྱང་།    །",
      "en": "Your mastery of cherishing others above yourself meant that",
      "en-trans": "dakwé zhen ché jongwé rang sok kyang"
    },
    {
      "bo": "སེམས་ཅན་དོན་ཕྱིར་གཏོང་ལ་མི་ཞུམ་པ།    །",
      "en": "You would not hesitate to sacrifice your own life for beings’s sake—",
      "en-trans": "semchen dönchir tong la mi zhumpa"
    },
    {
      "bo": "རྒྱལ་སྲས་སེམས་དཔའ་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent bodhisattva, heir of the victorious ones, to you I pray.",
      "en-trans": "gyalsé sempa chenpor solwa deb"
    },
    {
      "bo": "དབང་བཞིས་ལམ་གྱི་རྒྱུད་བཞི་རབ་སྦྱངས་ཤིང་།    །",
      "en": "The four empowerments refined the four aspects of your being,",
      "en-trans": "wang zhi lam gyi gyü zhi rab jang shing"
    },
    {
      "bo": "དམ་ཚིག་སྡོམ་པ་སྲོག་ལྟར་གཅེས་པར་བསྐྱངས།    །",
      "en": "And you guarded the samaya as dearly as your own life-force,",
      "en-trans": "damtsik dompa sok tar chepar kyang"
    },
    {
      "bo": "བདག་གཞན་སྣོད་བཅུད་དཀྱིལ་འཁོར་བཞི་རུ་ཤར།    །",
      "en": "So that self and other, world and inhabitants, arose as the four maṇḍalas—",
      "en-trans": "dakzhen nöchü kyilkhor zhi ru shar"
    },
    {
      "bo": "རྡོ་རྗེ་འཛིན་པ་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent Vajradhara, ‘bearer of the adamantine sceptre’, to you I pray.",
      "en-trans": "dorjé dzinpa chenpor solwa deb"
    },
    {
      "bo": "ཕྱི་ལྟར་ཉན་ཐོས་འདུལ་བའི་སྤྱོད་པ་བསྐྱངས།    །",
      "en": "Outwardly you uphold the Vinaya conduct of a śrāvaka disciple,",
      "en-trans": "chitar nyentö dulwé chöpa kyang"
    },
    {
      "bo": "ནང་དུ་འགྲོ་ཀུན་ཕ་མར་ཤེས་པས་སྒྲོལ།    །",
      "en": "Inwardly you possess the liberating recognition of all beings as parents,",
      "en-trans": "nang du dro kün pamar shepé drol"
    },
    {
      "bo": "གསང་བ་ལྷན་སྐྱེས་བདེ་ཆེན་རྡོ་རྗེའི་བདག  །",
      "en": "Secretly you are the embodiment of great, co-emergent vajra bliss—",
      "en-trans": "sangwa lhenkyé dechen dorjé dak"
    },
    {
      "bo": "སྡོམ་གསུམ་ལྡན་པ་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent upholder of the three sets of vows, to you I pray.",
      "en-trans": "dom sumden pa chenpor solwa deb"
    },
    {
      "bo": "མཁྱེན་པས་ཤེས་བྱའི་ཆོས་ཀུན་མངོན་སུམ་གཟིགས།    །",
      "en": "In your wisdom you directly perceive all knowable phenomena,",
      "en-trans": "khyenpé shejé chö kün ngönsum zik"
    },
    {
      "bo": "བརྩེ་བས་དམྱལ་མེ་བཟོད་དཀར་འཇུག་པར་སྤྲོ།    །",
      "en": "In your love, you would happily brave the unbearable fires of hell,",
      "en-trans": "tsewé nyal mé zö kar jukpar tro"
    },
    {
      "bo": "ནུས་པས་ཕྱི་ནང་གསང་བའི་བདུད་ཚོགས་བཅོམ།    །",
      "en": "In your power, you destroy hosts of outer, inner and secret demons—",
      "en-trans": "nüpé chi nang sangwé dü tsok chom"
    },
    {
      "bo": "རིགས་གསུམ་འདུས་ཞལ་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent face and embodiment of the three families, to you I pray.",
      "en-trans": "rik sum dü zhal chenpor solwa deb"
    },
    {
      "bo": "མཁས་པའི་ཚོགས་ཀྱི་དབུས་ན་སྤོབས་པ་མཐོ།    །",
      "en": "Among hosts of learned scholars your courageous eloquence prevails,",
      "en-trans": "khepé tsok kyi ü na pobpa to"
    },
    {
      "bo": "གྲུབ་ཐོབ་རྣལ་འབྱོར་ཀུན་གྱི་དབུས་ན་བརྗིད།    །",
      "en": "Among all the adepts and yogins, you are the most resplendent,",
      "en-trans": "drubtob naljor kün gyi ü na ji"
    },
    {
      "bo": "བཟང་པོའི་མཛད་པའི་གྲགས་སྙན་རིང་འཕྲོ་བ།    །",
      "en": "Your renown and reputation for noble deeds is far-reaching—",
      "en-trans": "zangpö dzepé drak nyen ring trowa"
    },
    {
      "bo": "རྒྱལ་མཚན་དཔལ་བཟང་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Gyaltsen Palzang, ‘splendid banner of victory’, at your feet I pray.",
      "en-trans": "gyaltsen pal zang zhab la solwa deb"
    },
    {
      "bo": "བླུན་སྒོམ་ཡིད་དཔྱོད་ལས་འདས་ཕྱག་རྒྱ་བཞིའི།    །",
      "en": "Having transcended foolish meditation and speculative analysis,",
      "en-trans": "lün gom yichö lé dé chakgya zhi"
    },
    {
      "bo": "རྟོགས་པ་ཇི་བཞིན་མངོན་དུ་གྱུར་པ་ལས།    །",
      "en": "You gained perfect realization of the four types of mudrā,",
      "en-trans": "tokpa jizhin ngön du gyurpa lé"
    },
    {
      "bo": "རྩ་ཡི་མདུད་གྲོལ་ས་ལམ་མཐར་ཕྱིན་པའི།    །",
      "en": "Releasing the knots in your channels as you traversed paths and stages—",
      "en-trans": "tsa yi dü drol salam tarchinpé"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Magnificent and mighty lord among yogins, to you I pray.",
      "en-trans": "naljor wangchuk chenpor solwa deb"
    },
    {
      "bo": "བདག་ནི་ཁྱེད་ལ་མི་ཕྱེད་དད་པའི་མཐུས།    །",
      "en": "Through the force of my unshakeable confidence in you,",
      "en-trans": "dak ni khyé la miché depé tü"
    },
    {
      "bo": "གཅམ་བུའི་ཚིག་སྤངས་སྙིང་ནས་གསོལ་བཏབ་པས།    །",
      "en": "I reject feigned expression and pray from the depths of my heart.",
      "en-trans": "cham bü tsik pang nying né soltab pé"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ཀྱི་རྣམ་ཐར་མ་ལུས་པ།    །",
      "en": "Through this may I be inspired with your blessings",
      "en-trans": "gönpo khyö kyi namtar malüpa"
    },
    {
      "bo": "བདག་གི་ཡོངས་སུ་རྫོགས་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "To accomplish every aspect of your fully liberated life.",
      "en-trans": "dak gi yongsu dzokpar jingyi lob"
    }
  ]
}