{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dzogchen-pema-rigdzin/dzogchen-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་པ་ཆེན་པོ་ཐོད་རྒལ་གསོལ་འདེབས།",
    "en": "A Dzogchen Tögal Prayer"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ།",
      "en": "Oṃ āḥ hūṃ",
      "en-trans": "om ah hung"
    },
    {
      "bo": "ཆོས་སྐུ་ཀུན་བཟང་ཡབ་ཡུམ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the dharmakāya Samantabhadra and consort, I pray!",
      "en-trans": "chöku kunzang yabyum la solwa depso"
    },
    {
      "bo": "དྲུག་པ་རྡོ་རྗེ་འཆང་ཆེན་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the lord of the sixth family, the great Vajradhara, I pray!",
      "en-trans": "drukpa dorje changchen la solwa depso"
    },
    {
      "bo": "སྟོན་པ་རྡོ་རྗེ་སེམས་དཔའ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the teacher Vajrasattva, I pray!",
      "en-trans": "tönpa dorje sempa la solwa depso"
    },
    {
      "bo": "རིག་འཛིན་དགའ་རབ་རྡོ་རྗེ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To thevidyādharaGarab Dorje, I pray!",
      "en-trans": "rigdzin garab dorje la solwa depso"
    },
    {
      "bo": "གུ་རུ་ཤྲཱི་སིངྷ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To Guru Śrī Siṃha, I pray!",
      "en-trans": "guru shiri singha la solwa depso"
    },
    {
      "bo": "རྒྱ་གར་རིག་འཛིན་བརྒྱད་པོ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the eight vidyādharas of India, I pray!",
      "en-trans": "gagar rigdzin gyepo la solwa depso"
    },
    {
      "bo": "འཆི་མེད་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the deathless Padmākara, I pray!",
      "en-trans": "chimé pema jungné la solwa depso"
    },
    {
      "bo": "ལྷ་ལྕམ་མནྡ་ར་བ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the princess Mandāravā, I pray!",
      "en-trans": "lhacham mandarawa la solwa depso"
    },
    {
      "bo": "རྗེ་འབངས་ཉི་ཤུ་རྩ་ལྔ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the king and subjects, the twenty-five disciples, I pray!",
      "en-trans": "jé bang nyi shu tsa nga la solwa depso"
    },
    {
      "bo": "གཏེར་སྟོན་བརྒྱ་དང་རྩ་བརྒྱད་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the one hundred and eight treasure-revealers, I pray!",
      "en-trans": "tertön gya dang tsa gyé la solwa depso"
    },
    {
      "bo": "དྲིན་ཅན་རྩ་བརྒྱུད་བླ་མ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the gracious root and lineage gurus, I pray!",
      "en-trans": "drinchen tsa gyü lama la solwa depso"
    },
    {
      "bo": "ཞི་བ་བཞི་བཅུ་རྩ་གཉིས་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the forty-two peaceful deities, I pray!",
      "en-trans": "zhiwa zhibchu tsa nyi la solwa depso"
    },
    {
      "bo": "དག་པ་རིག་འཛིན་ཡབ་ཡུམ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the pure vidyādhara and consort, I pray!",
      "en-trans": "dakpa rigdzin yabyum la solwa depso"
    },
    {
      "bo": "འབར་བ་ཁྲག་འཐུང་ལྔ་བཅུ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the fifty blazing herukas, I pray!",
      "en-trans": "barwa traktung ngabchu la solwa depso"
    },
    {
      "bo": "ཆོས་བདག་མཁའ་འགྲོ་སྡེ་ལྔ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the five classes of dharma-keeping ḍākinīs, I pray!",
      "en-trans": "chödak khandro dé nga la solwa depso"
    },
    {
      "bo": "བཀའ་སྲུང་དམ་ཅན་རྒྱ་མཚོ་ལ་གསོལ་བ་འདེབས་སོ། །",
      "en": "To the ocean of oath-bound protectors, I pray!",
      "en-trans": "kasung damchen gyatso la solwa depso"
    },
    {
      "bo": "ཆོས་ཉིད་མངོན་སུམ་མཐོང་བར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that I may directly seedharmatāreality!",
      "en-trans": "chönyi ngön sum tongwar chin gyi lop shik"
    },
    {
      "bo": "ཉམས་སྣང་གོང་དུ་འཕེལ་བར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that visionary experiences may develop and increase!",
      "en-trans": "nyam nang gong du pelwar chin gyi lop shik"
    },
    {
      "bo": "རིག་པ་ཚད་ལ་ཕེབས་པར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that pure awareness may reach its full measure!",
      "en-trans": "rigpa tsé pebpar chin gyi lop shik"
    },
    {
      "bo": "ཆོས་ཉིད་ཟད་སར་འཁྱོལ་བར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that I may attain the stage of exhaustion intodharmatā!",
      "en-trans": "chönyi zésar khyolwar chin gyi lop shik"
    },
    {
      "bo": "འཇའ་ལུས་མཁའ་སྤྱོད་འགྲུབ་པར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that I may accomplish the rainbow body!",
      "en-trans": "jalü khachö drubpar chin gyi lop shik"
    },
    {
      "bo": "འཕོ་བ་ཆེན་པོ་འབྱོངས་པར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that I may perfect the great transference!",
      "en-trans": "powa chenpo jongpar chin gyi lop shik"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་འགྲུབ་པར་བྱིན་གྱིས་རློབས་ཤིག །",
      "en": "Inspire me with your blessings, so that I may attain buddhahood in a single lifetime!",
      "en-trans": "tsé chik sangyé drubpar chin gyi lop shik"
    }
  ]
}