{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham-tenpai-nyima/zhabdrung-prayer-jikten-wangchuk",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གསོལ་འདེབས་འཇིག་རྟེན་དབང་ཕྱུག",
    "en": "Prayer to Zhabdrung Ngawang Namgyal"
  },
  "text": [
    {
      "bo": "འཇིག་རྟེན་དབང་ཕྱུག་ཐུགས་རྗེའི་རླབས་འཕྲེང་དབུས། །",
      "en": "Amidst the waves of the Lord of the World’s compassion1",
      "en-trans": "jikten wangchuk tukjé lab treng ü"
    },
    {
      "bo": "རྒྱལ་ཀུན་མཁྱེན་བརྩེའི་འདབ་སྟོང་རྒྱས་པ་ལ། །",
      "en": "Blossoms a thousand-petalled lotus of all the buddhas’ wisdom and love,",
      "en-trans": "gyal künkhyen tsé dab tong gyepa la"
    },
    {
      "bo": "ཕན་བདེའི་དྲི་བསུང་ཅི་ཡང་སྤྲོ་བའི་གཉེན། །",
      "en": "Radiating the sweet fragrance of benefit and happiness—",
      "en-trans": "pendé drisung chiyang trowé nyen"
    },
    {
      "bo": "ངག་དབང་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Ngawang Namgyal, at your feet I pray.",
      "en-trans": "ngawang namgyal zhab la solwa deb"
    },
    {
      "bo": "མཁྱེན་པས་མ་རིག་མུན་པའི་ཚོགས་འཇོམས་ཤིང༌། །",
      "en": "In your wisdom, you conquer the darkness of ignorance;",
      "en-trans": "khyenpé marik münpé tsok jom shing"
    },
    {
      "bo": "བརྩེས་བས་གཞན་དོན་ཡལ་བར་མི་འདོར་བར། །",
      "en": "In your love, you never forsake the welfare of others;",
      "en-trans": "tsewé zhendön yalwar mi dorwar"
    },
    {
      "bo": "ནུས་པས་བདུད་དཔུང་འཇོམས་བྱེད་ལྷ་ཡི་ལྷ། །",
      "en": "In your power, you overcome the forces of Māra—",
      "en-trans": "nüpé düpung jom jé lha yi lha"
    },
    {
      "bo": "ངག་དབང་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Supremely divine Ngawang Namgyal, at your feet I pray.",
      "en-trans": "ngawang namgyal zhab la solwa deb"
    },
    {
      "bo": "ཁམས་གསུམ་སེམས་ཅན་འཁོར་བ་ལས་སྒྲོལ་ཕྱིར། །",
      "en": "To liberate sentient beings from the three realms of saṃsāra,",
      "en-trans": "kham sum semchen khorwa lé drol chir"
    },
    {
      "bo": "འཆི་མེད་རྡོ་རྗེའི་སྐུ་མཆོག་རབ་བརྙེས་ནས། །",
      "en": "Having perfectly attained the supreme, immortal vajra-kāya,",
      "en-trans": "chimé dorjé ku chok rab nyé né"
    },
    {
      "bo": "འཕྲིན་ལས་རྣམ་བཞིས་འགྲོ་བའི་དོན་མཛད་པའི། །",
      "en": "May you bring benefit through the four kinds of activity",
      "en-trans": "trinlé nam zhi drowé dön dzepé"
    },
    {
      "bo": "ཇི་སྲིད་འཚོ་ཞིང་གཞེས་པར་གྱུར་ཅིག་གུ། །",
      "en": "And remain forever, as long as existence itself endures.",
      "en-trans": "jisi tso zhing zhepar gyur chik gu"
    }
  ]
}