{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/shabkar/swift-infusion-blessings-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མའི་གསོལ་འདེབས་བྱིན་རླབས་མྱུར་འཇུག"
  },
  "text": [
    {
      "bo": "འཁོར་བའི་ཕུན་ཚོགས་དུག་སྦྲུལ་ཚང་ལྟ་བུར། །"
    },
    {
      "bo": "མཐོང་ནས་ཚེ་འདིའི་བྱ་བ་ཐམས་ཅད་ལ། །"
    },
    {
      "bo": "མངོན་ཞེན་གཏིང་ནས་ལོག་པའི་བྱ་བཏང་བ། །"
    },
    {
      "bo": "ཚོགས་དྲུག་རང་གྲོལ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྱོད་ཐུགས་ཤེལ་དཀར་བུམ་བཟང་ལས་ཐོན་པའི། །"
    },
    {
      "bo": "ཟབ་ལམ་ལེགས་བཤད་བདུད་རྩིའི་ཆུ་རྒྱུན་གྱིས། །"
    },
    {
      "bo": "རང་སེམས་ནོར་བུའི་ཉོན་མོངས་དྲི་མ་ཀུན། །"
    },
    {
      "bo": "བཀྲུས་ནས་དོན་གཉིས་དགོས་འདོད་ཀུན་འབྱུང་ཤོག །"
    },
    {
      "bo": "ཤེས་བྱའི་ཆོས་རྣམས་མ་ལུས་ས་ལེར་མཁྱེན། །"
    },
    {
      "bo": "བྱམས་དང་བརྩེ་བས་འགྲོ་ལ་ཟབ་རྒྱས་ཆོས། །"
    },
    {
      "bo": "སྟོན་པའི་མཚན་ལྡན་རྩ་བའི་བླ་མ་ཡི། །"
    },
    {
      "bo": "སྐུ་ཚེ་བསྐལ་བརྒྱའི་བར་དུ་བརྟན་པར་ཤོག །"
    },
    {
      "bo": "ཚོགས་གཉིས་ལས་འཁྲུངས་མཚན་དཔེས་མཛེས་པའི་སྐུ། །"
    },
    {
      "bo": "ཡན་ལག་དྲུག་ཅུའི་གདངས་ལྡན་སྙན་པའི་གསུང་། །"
    },
    {
      "bo": "ཉོན་མོངས་རང་གྲོལ་གསལ་སྟོང་འཛིན་མེད་ཐུགས། །"
    },
    {
      "bo": "བླ་མའི་སྐུ་གསུང་ཐུགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལུས་ལ་བླ་མའི་སྐུ་ཡིས་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལུས་ཀྱི་སྒྲིབ་དག་བདེ་དྲོད་འབར་བ་དང་། །"
    },
    {
      "bo": "ལུས་ནི་འཆི་མེད་འཇའ་ལུས་འོད་སྐུར་གྱུར། །"
    },
    {
      "bo": "ལུས་ཀྱིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །"
    },
    {
      "bo": "ངག་ལ་བླ་མའི་གསུང་གིས་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ངག་གི་སྒྲིབ་དག་ནུས་པ་འབྱུང་བ་དང་། །"
    },
    {
      "bo": "ངག་ནི་འགག་མེད་ཚངས་པའི་དབྱངས་སུ་གྱུར། །"
    },
    {
      "bo": "ངག་གིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །"
    },
    {
      "bo": "སེམས་ལ་བླ་མའི་ཐུགས་ཀྱིས་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སེམས་ཀྱི་སྒྲིབ་དག་ཉམས་རྟོགས་འཆར་བ་དང་། །"
    },
    {
      "bo": "སེམས་ནི་འཁྲུལ་མེད་ཆོས་ཀྱི་སྐུ་རུ་གྱུར། །"
    },
    {
      "bo": "སེམས་ཀྱིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །"
    },
    {
      "bo": "སྐྱབས་གསུམ་ཀུན་འདུས་བླ་མ་རྡོ་རྗེ་འཆང་། །"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་བཤེས་གཉེན་ཚུལ་བཟང་ནས། །"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོང་དངོས་གྲུབ་སྩོལ་མཛད་པའི། །"
    },
    {
      "bo": "དྲིན་ཅན་བླ་མ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་ཡང་དག་བླ་མ་དང་། །"
    },
    {
      "bo": "འབྲལ་མེད་ཆོས་ཀྱི་དཔལ་ལ་ལོངས་སྤྱོད་ཅིང་། །"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་ཡོན་ཏན་རབ་རྫོགས་ནས། །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་གི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །"
    },
    {
      "bo": "སྟོན་པ་བླ་ན་མེད་པའི་བསྟན་པ་དང་། །"
    },
    {
      "bo": "མཇལ་བ་འདི་འདྲ་བླ་མའི་དྲིན་ཡིན་པས། །"
    },
    {
      "bo": "དགེ་བ་འདི་ཡང་འགྲོ་བ་མ་ལུས་པ། །"
    },
    {
      "bo": "བཤེས་གཉེན་དམ་པས་འཛིན་པའི་རྒྱུ་རུ་བསྔོ། །"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་རྣམ་པར་ཐར་པ་ལ། །"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་ལོག་ལྟ་མི་སྐྱེ་ཞིང༌། །"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་པར་མཐོང་བའི་མོས་གུས་ཀྱིས། །"
    },
    {
      "bo": "བླ་མའི་བྱིན་རླབས་སེམས་ལ་འཇུག་པར་ཤོག །"
    }
  ]
}