{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenpo-akhyuk-lungtok-gyaltsen/prayer-to-akhyuk-rinpoche",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བཀའ་དྲིན་མཚུངས་མེད་བླ་མ་རིན་པོ་ཆེ་ལུང་རྟོགས་རྒྱལ་མཚན་གྱི་གསོལ་འདེབས། །",
    "en": "A Prayer to the Precious Teacher of Incomparable Kindness, Jamyang Lungtok Gyaltsen"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭ་སྟི། །",
      "en": "Oṃ svasti",
      "en-trans": "om svasti"
    },
    {
      "bo": "འཕགས་ཡུལ་གྲུབ་པའི་དབང་ཕྱུག་ཤཱནྟི་པ། །",
      "en": "In the noble land of India, you were Śāntipa, lord of siddhas,",
      "en-trans": "pak yul drubpé wangchuk shantipa"
    },
    {
      "bo": "བོད་ཡུལ་པདྨས་རྗེས་བཟུང་འབྲོག་མི་དང་། །",
      "en": "In Tibet, you were Drokmi Palgyi Yeshe, Langdro Lotsāwa,",
      "en-trans": "bö yül pemé jé zung drok mi dang"
    },
    {
      "bo": "ལང་གྲོ་ལོ་ཙཱ་རྒྱལ་བ་མཆོག་དབྱངས་སོགས། །",
      "en": "Gyalwa Chokyang and others, guided and cared for by Padmasambhava,",
      "en-trans": "langdro lotsa gyalwa chok yang sok"
    },
    {
      "bo": "གྲུབ་པའི་རིག་འཛིན་རྣམས་ཀྱི་རྣམ་སྤྲུལ་པ། །",
      "en": "Emanation of accomplished vidyādharas,",
      "en-trans": "drubpé rigdzin nam kyi nam trülpa"
    },
    {
      "bo": "སྙིགས་དུས་རྒྱལ་བའི་དབང་པོ་ཀློང་ཆེན་དང་། །",
      "en": "In this degenerate age, you appear as the emanation of Longchenpa, lord of the victorious ones,",
      "en-trans": "nyik dü gyalwé wangpo longchen dang"
    },
    {
      "bo": "ཀློང་གསལ་དཔལ་གྱི་སྤྲུལ་པ་བཤེས་གཉེན་ཚུལ། །",
      "en": "And the glorious Longsal Nyingpo, in the form of a spiritual friend.",
      "en-trans": "long sal palgyi trulpa shenyen tsül"
    },
    {
      "bo": "རིག་འཛིན་གོང་མ་རྣམས་ཀྱིས་ཡོངས་བསྔགས་པ། །",
      "en": "Praised and prophesied by vidyādharas of the past,",
      "en-trans": "rigdzin gongma nam kyi yong ngakpa"
    },
    {
      "bo": "རྫོགས་ཆེན་བསྟན་པའི་སྙིང་པོ་འགྲོ་ལ་སྤེལ། །",
      "en": "You transmit the teachings to beings the essence of the Dzogchen teachings—",
      "en-trans": "dzokchen tenpé nyingpo dro la pel"
    },
    {
      "bo": "ལུང་རྟོགས་རྩ་བའི་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Jamyang Lungtok Gyaltsen, root teacher, to you I pray!",
      "en-trans": "lungtok tsawé lamar solwa dep"
    },
    {
      "bo": "སྐྱེ་དང་ཕྲེང་བ་ཚེ་རབས་ཐམས་ཅད་དུ། །",
      "en": "Throughout the succession of all my lives to come,",
      "en-trans": "kyé dang trengwa tsé rab tamché du"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་དང་ནམ་ཡང་མི་འབྲལ་བར། །",
      "en": "May I never be separate from you, my sole protector.",
      "en-trans": "gönpo khyé dang nam yang mi dralwar"
    },
    {
      "bo": "རྫོགས་སྨིན་སྦྱང་བ་རྒྱ་མཚོ་མཐར་ཕྱིན་ནས། །",
      "en": "Through vast, ocean-like activity of perfecting, maturing and purifying,",
      "en-trans": "dzok min jangwa gyatso tar chin né"
    },
    {
      "bo": "སྐྱེ་འཆི་བར་དོའི་འཁྲུལ་སྣང་དབྱིངས་སུ་དག །",
      "en": "May the deluded perceptions of life, death and the bardo be purified into all-pervading space,",
      "en-trans": "kyé chi bardö trül nang ying su dak"
    },
    {
      "bo": "འགྲོ་རྣམས་བདེ་ཆེན་ཞིང་ལ་ལོངས་སྤྱོད་ཤོག །",
      "en": "And may all beings come to experience the blissful land of Sukhāvatī!",
      "en-trans": "dro nam dechen zhing la longchö shok"
    }
  ]
}