{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/swift-bestowal-prayer-to-jamyang-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཔལ་མགོན་བླ་མའི་གསོལ་འདེབས་བྱིན་རླབས་མྱུར་སྟེར་ཞེས་བྱ་བ་བཞུགས།",
    "en": "A Prayer to the Glorious Protector Guru"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om swasti"
    },
    {
      "bo": "འཇ༵མ་དཔལ་དབྱང༵ས་སོགས་རིགས་གསུམ་རྒྱལ་ཀུན་གྱི། །",
      "en": "Embodiment of all the qualities of knowledge, power and love",
      "en-trans": "jampal yang sok rik sum gyal kün gyi"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་ཆོས༵་ཀུན་འདུས་པའི་གཟུགས། །",
      "en": "Of Mañjughoṣa and all the other conquerors of the three families,",
      "en-trans": "khyen tsé nü pé chö kündüpé zuk"
    },
    {
      "bo": "མཚོ་སྐྱེས་རྡོ་རྗེའི་ཐུགས་ཀྱི༵་འོད་ཟེར་བཅུད། །",
      "en": "Essence of radiant light from the Lake-Born Vajra’s heart,",
      "en-trans": "tsokyé dorjé tuk kyi özer chü"
    },
    {
      "bo": "བློ༵་གྲོས༵་སྤོབས་མཐའ་ཡས་ལ་གསོལ་བ་འདེབས། །",
      "en": "With boundless intelligence and confidence—to you I pray.",
      "en-trans": "lodrö pob tayé la solwa deb"
    },
    {
      "bo": "བདེ་གཤེགས་ཀུན་གྱི་གསང་བ་མི་ཟད་དབྱིངས། །",
      "en": "In the basic space of the inexhaustible secrets of all the bliss-gone buddhas,",
      "en-trans": "deshek kün gyi sangwa mizé ying"
    },
    {
      "bo": "འཇ༵མ་དཔལ་དབྱང༵ས་སོགས་དཔལ་ཆེན་སྒྲུབ་སྡེ་བརྒྱད། །",
      "en": "Including Mañjughoṣa and the eight great glorious sādhana deities,",
      "en-trans": "jampal yang sok palchen drubdé gyé"
    },
    {
      "bo": "ཀུན་གྱི་ཁྱབ་བདག་རྒྱུ་འབྲས་ཆོས༵་ཀུན་གྱི༵། །",
      "en": "You are the all-pervasive lord, the source of all causal and resultant phenomena,",
      "en-trans": "kün gyi khyabdak gyundré chö kün gyi"
    },
    {
      "bo": "འབྱུང་གནས་བློ༵་གྲོས༵་རྨད་བྱུང་གསོལ་བ་འདེབས། །",
      "en": "Master of wondrous intelligence—to you I pray.",
      "en-trans": "jungné lodrö mejung solwa deb"
    },
    {
      "bo": "འཇ༵མ་མཉེན་མཚན་དཔེའི་རྒྱལ་ཀུན་ཡེ་ཤེས་སྐུ། །",
      "en": "Your gentle form embodies the wisdom all the victorious ones with their marks and signs,",
      "en-trans": "jam nyen tsenpé gyal kün yeshe ku"
    },
    {
      "bo": "ཟབ་རྒྱས་དབྱང༵ས་སྙན་ཆོས༵་ཀྱི༵ས་འགྲོ་ཀུན་སྒྲོལ། །",
      "en": "Your melodious voice proclaims the Dharma, vast and profound, which frees all beings,",
      "en-trans": "zabgyé yang nyen chö kyi dro kün drol"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་བློ༵་གྲོས༵་དཔག་ཡས་ཧེ་རུ་ཀ །",
      "en": "Heruka, whose wise and loving intelligence knows no bounds,",
      "en-trans": "khyentsé lodrö pakyé heruka"
    },
    {
      "bo": "གནས་གསུམ་མཁའ་འགྲོའི་མེས་པོར་གསོལ་བ་འདེབས། །",
      "en": "Forefather of the ḍākinīs of the three abodes—to you I pray.",
      "en-trans": "né sum khandrö mepor solwa deb"
    },
    {
      "bo": "རྩ་གསུམ་ལྷ་ཡི་བདེན་པ་རྨད་བྱུང་གིས། །",
      "en": "Through the wondrous truth of the Three Root deities,",
      "en-trans": "tsa sum lha yi denpa mejung gi"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མ་འཆི་མེད་ཡེ་ཤེས་གཟུགས། །",
      "en": "May the glorious guru’s deathless wisdom form",
      "en-trans": "palden lama chimé yeshe zuk"
    },
    {
      "bo": "སྙིང་གི་པདྨོར་རྟག་བརྟན་བཞུགས་པ་དང༌། །",
      "en": "Remain forever in the lotus of my heart",
      "en-trans": "nying gi pemor takten zhukpa dang"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་རྗེས་སུ་འཛིན་གྱུར་ཅིག  །",
      "en": "And guide me throughout all my lives to come!",
      "en-trans": "tserab küntu jesu dzin gyur chik"
    }
  ]
}