{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/billowing-clouds-faith-prayer-to-khyentse-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གསོལ་འདེབས་དད་པའི་སྤྲིན་ཕུང་ཞེས་བྱ་བ།",
    "en": "Billowing Clouds of Faith: A Prayer"
  },
  "text": [
    {
      "bo": "འཇ༵མ་དབྱང༵ས་བླ་མའི་བྱིན་རླབས་སྙིང་ལ་ཞུགས།    །",
      "en": "The blessings of the Mañjughoṣa Guru entered your heart,",
      "en-trans": "jamyanglamé jinlab nying la zhuk"
    },
    {
      "bo": "ཆོས༵་ཀྱི་བ༵དུད་རྩིས་བློ༵་གྲོ༵ས་པདྨོ་བྱེ།    །",
      "en": "Dharma nectar caused the lotus of intelligence to bloom,",
      "en-trans": "chökyidütsilodröpemo jé"
    },
    {
      "bo": "རིས་མེད་བསྟན་པའི་རྒྱལ་མཚན་བསྒྲེང་ཉིད་ལ།    །",
      "en": "And you raised the victory banner of nonsectarian teachings—",
      "en-trans": "rimé tenpé gyaltsen dreng nyi la"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་གྱིས་རློབས།    །",
      "en": "From the depths of my heart, I pray to you: inspire me with your blessings.",
      "en-trans": "nying né soldeb dak gyü jingyi lob"
    },
    {
      "bo": "གཙུག༵་ལག༵་བལྟ་བའི་རྣམ་དཔྱོད་མཐུ་གྲུབ་ཅིང་།    །",
      "en": "You gained critical the strength of insight into the textual tradition",
      "en-trans": "tsug lagtawé namchö tu drub ching"
    },
    {
      "bo": "ལུང༵་རིག༵ས་རྡོ་རྗེའི་གད་མོ་རབ་ཏུ་སྒྲོགས།    །",
      "en": "And loudly proclaimed the vajra laughter of scripture and reasoning.",
      "en-trans": "lung rikdorjé gemo rabtu drok"
    },
    {
      "bo": "ཉི༵་མ༵འི་གཉེན་གྱི་བསྟན་པ་གསལ་བྱེད་ལ།    །",
      "en": "To you, the illuminator of the teachings of Kinsman of the Sun,1",
      "en-trans": "nyiményen gyi tenpa saljé la"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་གྱིས་རློབས།    །",
      "en": "I pray from the depths of my heart: inspire me with your blessings.",
      "en-trans": "nying né soldeb dak gyü jingyi lob"
    },
    {
      "bo": "སྨྲ༵་བའི༵་དབང་ཕྱུག་འཇམ་དཔལ་དཔའ་བོ་བཞིན།    །",
      "en": "Mighty lord of speech, whose great strength of heart",
      "en-trans": "mawéwangchuk jampal pawo zhin"
    },
    {
      "bo": "ལྟ་ངན་རི་དྭགས་ལེགས་བཤད་སེང༵་གེའི༵་སྒྲས།    །",
      "en": "Is like that of valiant Mañjuśrī and who, with a leonine roar",
      "en-trans": "ta ngen ridak lek shésengédré"
    },
    {
      "bo": "བཅོམ་པའི་སྙིང་སྟོབས་ཆེན་པོར་གྱུར་པ་གང་།    །",
      "en": "Of fine explanation, vanquishes the beasts of erroneous views,",
      "en-trans": "chompé nyingtob chenpor gyurpa gang"
    },
    {
      "bo": "གཞོམ་མེད་རྡོ་རྗེའི་ཆོས་བདུན་བརྟན་བཞུགས་གསོལ།    །",
      "en": "May you remain forever indestructible as the seven vajra properties.",
      "en-trans": "zhommé dorjé chödün tenzhuk sol"
    }
  ]
}