{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-khyentse-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཇམ་དབྱངས་མཁྱེན་བརྩེ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱི་གསོལ་འདེབས།",
    "en": "Prayer to Jamyang Khyentse Chökyi Lodrö"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་མ་ལུས་འདུས་པའི་དངོས། །",
      "en": "The actual embodiment of all the victorious buddhas of the three times",
      "en-trans": "dü sum gyalwa malü düpé ngö"
    },
    {
      "bo": "སྙིགས་དུས་བསྟན་འགྲོའི་སྐྱབས་གཅིག་མཁྱེན་བརྩེའི་དབང་། །",
      "en": "And sole refuge for the teachings and beings of this degenerate age was Khyentse Wangpo.",
      "en-trans": "nyikdü ten drö kyab chik khyentsé wang"
    },
    {
      "bo": "མཆོག་གི་བྱིན་རླབས་ཐུགས་རྗེའི་རྣམ་པར་རོལ། །",
      "en": "Manifestation of his supreme blessings and compassion,",
      "en-trans": "chok gi jinlab tukjé nampar rol"
    },
    {
      "bo": "འཇམ་དབྱངས་ཆོས་ཀྱི་བློ་གྲོས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Jamyang Chökyi Lodrö, to you I pray!",
      "en-trans": "jamyang chökyi lodrö la solwa deb"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་བའི་བློ་སྣ་ཆོས་ལ་བསྒྱུར། །",
      "en": "Cause my own and other beings’ minds to turn towards the Dharma,",
      "en-trans": "dak sok drowé lona chö la gyur"
    },
    {
      "bo": "གནས་ལུགས་རང་ཞལ་མཇལ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "And inspire me to encounter my own true face, the natural state!",
      "en-trans": "neluk rang zhal jalwar jingyi lob"
    },
    {
      "bo": "ཕྱི་རོལ་གཟུང་བའི་ཡུལ་གྱིས་མ་གོས་ཤིང་། །",
      "en": "Unstained by any objects perceived as external,",
      "en-trans": "chirol zungwé yul gyi ma gö shing"
    },
    {
      "bo": "ནང་དུ་འཛིན་པའི་རྟོག་པས་མ་བསླད་པར། །",
      "en": "And unspoilt by any inner perceiving thoughts—",
      "en-trans": "nang du dzinpé tokpé malepar"
    },
    {
      "bo": "མ་བཅོས་རང་བབ་སྒོམ་པའི་ངང་བསྐྱང་བས། །",
      "en": "Sustaining an uncontrived experience of settled meditation,",
      "en-trans": "machö rangbab gompé ngang kyangwé"
    },
    {
      "bo": "རང་སེམས་ཆོས་ཉིད་རྗེན་པར་འཆར་བར་ཤོག །",
      "en": "May the dharmatā condition of my own mind nakedly arise!",
      "en-trans": "rangsem chönyi jenpar charwar shok"
    },
    {
      "bo": "འདི་ནི་སངས་རྒྱས་ཀུན་གྱི་དགོངས་པ་སྟེ། །",
      "en": "This is the wisdom intent of all the buddhas.",
      "en-trans": "di ni sangye kün gyi gongpa té"
    },
    {
      "bo": "ཐག་ཆད་བློ་བདེའི་ཉམས་ལེན་ཟབ་མོ་ཡིས། །",
      "en": "Through the profound practice of decisive contentment,",
      "en-trans": "tak ché lo dé nyamlen zabmo yi"
    },
    {
      "bo": "རང་རིག་སྐུ་གསུམ་དགོངས་པ་མངོན་གྱུར་ཏེ། །",
      "en": "Inspire me to realize the three kāyas of my own awareness",
      "en-trans": "rangrig ku sum gongpa ngöngyur té"
    },
    {
      "bo": "འཁོར་བ་དོང་ནས་སྤྲུགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And to empty saṃsāra from its very depths!",
      "en-trans": "khorwa dong né trukpar jingyi lob"
    }
  ]
}