{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-for-ngawang-lobzang",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངག་དབང་བློ་བཟང་གིས་བསྐུལ་ངོར་བྲིས་པའི་གསོལ་འདེབས།",
    "en": "Prayer for Ngawang Lobzang1"
  },
  "text": [
    {
      "bo": "དཔལ་ལྡན་བླ་མ་རིགས་རྣམས་ཀུན་གྱི་བདག  །",
      "en": "Glorious guru, lord of all the buddha families,",
      "en-trans": "palden lama rik nam kün gyi dak"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཡེ་ཤེས་གཅིག་ཏུ་བསྡུས།    །",
      "en": "Unique embodiment of all the victors’ wisdom,",
      "en-trans": "gyalwa kün gyi yeshe chik tu dü"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་པོ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱི།    །",
      "en": "Master of knowledge and love,2Chökyi Lodrö,",
      "en-trans": "khyentsé wangpo chökyi lodrö kyi"
    },
    {
      "bo": "བྱང་ཆུབ་བར་དུ་བརྩེ་བས་རྗེས་སུ་ཟུངས།    །",
      "en": "Guide and care for me until I reach awakening.",
      "en-trans": "changchub bardu tsewé jesu zung"
    },
    {
      "bo": "དད་མོས་གདུང་ཤུགས་དྲག་པོས་གསོལ་བ་འདེབས།    །",
      "en": "I pray to you with ardent faith and devotion,",
      "en-trans": "dé mö dungshuk drakpö solwa deb"
    },
    {
      "bo": "རེ་ལྟོས་མི་འགྱུར་གཅིག་ཆོག་རྒྱལ་པོར་བཟུང་།    །",
      "en": "Rely on you alone with unwavering confidence and trust.",
      "en-trans": "ré tö mingyur chikchok gyalpor zung"
    },
    {
      "bo": "སྐྱེ་དང་ཚེ་རབས་ཀུན་ཏུ་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me with your blessings throughout all my lives to come.3",
      "en-trans": "kyé dang tserab küntu jingyi lob"
    },
    {
      "bo": "ཐུགས་རྗེའི་ཕྱག་གི་ནམ་ཡང་མ་གཏོང་ཤིག  །",
      "en": "Never let me slip from your compassionate embrace.",
      "en-trans": "tukjé chak gi namyang ma tong shik"
    },
    {
      "bo": "སྲིད་ལས་ངེས་པར་འབྱུང་བའི་བློ་སྐྱེ་ཞིང་།    །",
      "en": "Inspire me to develop the determination to escape conditioned existence,",
      "en-trans": "si lé ngepar jungwé lo kyé zhing"
    },
    {
      "bo": "ཐར་མཆོག་ཚུལ་ཁྲིམས་གཙང་མར་གཞིར་བཅས་སྟེ།    །",
      "en": "To make pure ethical discipline the basis of attaining supreme liberation,",
      "en-trans": "tar chok tsultrim tsangmar zhir ché té"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་རྒྱུད་ལ་འབྱོངས་པ་དང་།    །",
      "en": "To train my mind and master supreme bodhicitta,",
      "en-trans": "changchub sem chok gyü la jongpa dang"
    },
    {
      "bo": "ཟབ་མོའི་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "And to realize the profound nature of reality.",
      "en-trans": "zabmö neluk tokpar jingyi lob"
    }
  ]
}