{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/do-khyentse/hook-which-invokes-blessings",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རིག་འཛིན་འཇའ་ལུས་རྡོ་རྗེའི་རྣམ་ཐར་གསོལ་འདེབས་བྱིན་རླབས་འགུགས་པའི་ལྕགས་ཀྱུ་བཞུགས་སོ།།",
    "en": "A Supplication to the Life and Liberation of Rigdzin Jalü Dorje"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "གདོད་མའི་མགོན་པོ་ཀུན་བཟང་འོད་མི་འགྱུར། །",
      "en": "The Primordial Protector, Küntuzangpo, the Buddha of Unchanging Light,",
      "en-trans": "dömé gönpo kunzang ö mingyur"
    },
    {
      "bo": "རྩལ་སྣང་ཡེ་ཤེས་རིགས་ལྔའི་ཚོམ་བུ་ཤར། །",
      "en": "Who arises as the appearing-radiance of the gathering of the five wisdoms;",
      "en-trans": "tsalnang yeshe rik ngé tsombu shar"
    },
    {
      "bo": "ཐུགས་རྗེས་གར་བསྒྱུར་འགྲོ་འདུལ་སྤྲུལ་པའི་སྐུ། །",
      "en": "Transforming into the dance of compassion, the nirmāṇakāya that tames beings",
      "en-trans": "tukjé gar gyur drodul trulpé ku"
    },
    {
      "bo": "སྐུ་གསུམ་དབྱེར་མེད་མགོན་པོ་ཚེ་མཐའ་ཡས། །",
      "en": "And is indivisible from the three kāyas, Lord Amitāyus,",
      "en-trans": "ku sum yermé gönpo tsé tayé"
    },
    {
      "bo": "སྙིང་རྗེའི་རང་གཟུགས་འཕགས་མཆོག་པད་དཀར་འཆང་། །",
      "en": "The embodiment of compassion, noble and supreme Holder of the White Lotus (Avalokiteśvara),",
      "en-trans": "nyingjé rang zuk pakchok pekar chang"
    },
    {
      "bo": "འགྲོ་ངོར་སྣང་བ་མཚོ་སྐྱེས་སྤྲུལ་པའི་སྐུ། །",
      "en": "The Lake Born Nirmāṇakāya (Padmasambhava), who appears in response to beings,",
      "en-trans": "dro ngor nangwa tsokyé trulpé ku"
    },
    {
      "bo": "རིགས་བདག་རྡོར་སེམས་དགའ་རབ་དཔའ་བོ་དང་། །",
      "en": "Lord of the Family, Vajrasattva, hero Garab Dorje,",
      "en-trans": "rikdak dorsem garab pawo dang"
    },
    {
      "bo": "དབྱེར་མེད་ཐོད་ཕྲེང་རྩལ་ལ་གསོལ་བ་འདེབས།",
      "en": "And the inseparable Guru Tötrengtsel, I supplicate.",
      "en-trans": "yermé tötreng tsal la solwa deb"
    },
    {
      "bo": "གང་ཁྱོད་གདོང་དམར་བོད་ཀྱི་གདུལ་བའི་དོན། །",
      "en": "For the sake of those to be tamed, the red-faced Tibetans,",
      "en-trans": "gang khyö dong mar bö kyi dulwé dön"
    },
    {
      "bo": "མཐའ་དབུས་ཐམས་ཅད་གཏེར་གྱིས་བཀང་ནས་ཀྱང་། །",
      "en": "You filled the whole of Tibet from center to its borders with treasures.",
      "en-trans": "ta ü tamché ter gyi kang né kyang"
    },
    {
      "bo": "གང་དང་ཐུགས་སྲས་རྗེ་འབངས་སྤྲུལ་པའི་སྐུ། །",
      "en": "I supplicate you and your emanated heart-disciples, the king and subjects,",
      "en-trans": "gang dang tuksé jebang trulpé ku"
    },
    {
      "bo": "ཟབ་གཏེར་སྒོ་འབྱེད་ཚོགས་ལ་གསོལ་བ་འདེབས།",
      "en": "Who opened the gateway to those profound treasures.",
      "en-trans": "zabter gojé tsok la solwa deb"
    },
    {
      "bo": "དེང་དུས་ལྔ་ཕྲག་ཐ་མའི་སེམས་ཅན་ཀུན། །",
      "en": "Currently, unbearable suffering is greatly increasing",
      "en-trans": "dengdü nga trak tamé semchen kün"
    },
    {
      "bo": "བཟོད་དཀའི་སྡུག་བསྔལ་ཆེས་ཆེར་མཆེད་པའི་ཚེ། །",
      "en": "For all sentient beings of the final five-hundred-year period.",
      "en-trans": "zö ké dukngal ché cher chepé tsé"
    },
    {
      "bo": "དྲི་མེད་དགའ་རབ་པད་འབྱུང་བཱི་མ་ལའི། །",
      "en": "During this time, I supplicate the supreme, single-embodied emanation",
      "en-trans": "drimé garab pejung bi ma lé"
    },
    {
      "bo": "སྤྲུལ་པ་གཅིག་བསྡུས་མཆོག་དེར་གསོལ་བ་འདེབས།",
      "en": "Of Drimé Özer, Garab Dorje, Pema Jungné, and Vimalamitra.",
      "en-trans": "trulpa chikdü chok der solwa deb"
    },
    {
      "bo": "ལྷུམས་སུ་ཞུགས་ནས་ཏིང་འཛིན་མི་གཡོ་ཞིང་། །",
      "en": "You entered the womb never wavering from samādhi.",
      "en-trans": "lhum su zhuk né tingdzin mi yo zhing"
    },
    {
      "bo": "བཙས་པའི་ཞག་གསུམ་མཁའ་འགྲོའི་ཚོགས་གྲལ་འགྲིམས། །",
      "en": "Three days after your birth, you roamed among the assembly of ḍākinīs,",
      "en-trans": "tsepé zhak sum khandrö tsokdral drim"
    },
    {
      "bo": "ཟླ་བཅུའི་དུས་སུ་མཁའ་འགྲོས་དབང་བསྐུར་བའི། །",
      "en": "And when you were ten months old, you received empowerment from them—",
      "en-trans": "da chü dü su khandrö wangkurwé"
    },
    {
      "bo": "རང་བྱུང་སྤྲུལ་པའི་སྐུ་ལ་གསོལ་བ་འདེབས།",
      "en": "I supplicate the naturally arisen nirmāṇakāya.",
      "en-trans": "rangjung trulpé ku la solwa deb"
    },
    {
      "bo": "བགྲང་བྱ་གསུམ་ནས་དཔལ་རི་རིག་འཛིན་ཞིང་། །",
      "en": "At the age of the two, in Zangdokpelri (the Copper-Coloured Mountain), the realm of the awareness-holders,",
      "en-trans": "drangja sum né palri rigdzin zhing"
    },
    {
      "bo": "སྤྲུལ་གཞིར་མཇལ་ནས་དབང་བསྐུར་བྱིན་གྱི་བརླབས། །",
      "en": "You beheld the prominent nirmāṇakāya who conferred empowerment and blessings upon you—",
      "en-trans": "trulzhir jal né wangkur jin gyi lab"
    },
    {
      "bo": "དཔའ་བོ་མཁའ་འགྲོ་རིགས་ལྡན་ཚོགས་ཀུན་གྱིས། །",
      "en": "I supplicate the one who is always watched over",
      "en-trans": "pawo khandro rikden tsok kün gyi"
    },
    {
      "bo": "མེལ་ཚེས་རྟག་ཏུ་བསྐྱངས་དེར་གསོལ་བ་འདེབས།",
      "en": "By the heroes and ḍākinīs of all the noble families.",
      "en-trans": "meltsé taktu kyang der solwa deb"
    },
    {
      "bo": "སྔོན་གནས་རྗེས་དྲན་རིགས་བདག་བླ་མ་བཙལ། །",
      "en": "Recalling your previous lives, you searched for your lama, the Lord of the Family,1",
      "en-trans": "ngön né jedren rikdak lama tsal"
    },
    {
      "bo": "ཐུགས་རྗེས་རྗེས་བཟུང་བདུད་ཀྱི་གཡུལ་ལས་རྒྱལ། །",
      "en": "Who lovingly and compassionately accepted you [as a disciple].",
      "en-trans": "tukjé jezung dü kyi yul lé gyal"
    },
    {
      "bo": "ཆོས་ཀྱི་བདག་པོ་རིགས་ཀྱི་མྱུ་གུ་བཙས། །",
      "en": "Victorious over the hordes of demons, your potential as a Dharma Lord was brought forth—",
      "en-trans": "chö kyi dakpo rik kyi nyugu tsé"
    },
    {
      "bo": "རྟེན་འབྲེལ་དུས་སུ་སྨིན་དེར་གསོལ་བ་འདེབས། །",
      "en": "I supplicate the one whose auspicious connections ripened on time.",
      "en-trans": "tendrel dü su min der solwa deb"
    },
    {
      "bo": "གཞོན་ནུའི་དུས་ནས་ངེས་འབྱུང་སྐྱོ་ཤས་ཀྱིས། །",
      "en": "From a young age, with the sadness born from renunciation,",
      "en-trans": "zhönnü dü né ngejung kyoshé kyi"
    },
    {
      "bo": "རྒྱུད་བསྐུལ་ཉིན་སྣང་རྨི་ལམ་སྒྱུ་མ་དང་། །",
      "en": "You continuously saw daily appearances as an illusory dream,",
      "en-trans": "gyü kul nyin nang milam gyuma dang"
    },
    {
      "bo": "མཚན་སྣང་སྐུ་དང་འཇའ་ཟེར་ཐིག་ལེ་འདྲེས། །",
      "en": "And at night you mingled the kāyas and the spheres of rainbow light—",
      "en-trans": "tsen nang ku dang jazer tiklé dré"
    },
    {
      "bo": "སྔོན་ལས་དུས་སུ་སྨིན་དེར་གསོལ་བ་འདེབས།",
      "en": "I supplicate the one whose previous karma ripened on time.",
      "en-trans": "ngön lé dü su min der solwa deb"
    },
    {
      "bo": "བཅུ་གསུམ་ལོན་ནས་བསྐྱེད་རྫོགས་ལམ་དུ་ཞུགས། །",
      "en": "When you reached twelve, you entered the path of generation and completion [stage practices].",
      "en-trans": "chusum lön né kyedzok lam du zhuk"
    },
    {
      "bo": "ཉིན་དུས་རིགས་བདག་བླ་མའི་ཞལ་ཁྲིད་དང་། །",
      "en": "During the day, you received oral instructions of the Lama, the Lord of the Family,",
      "en-trans": "nyin dü rikdak lamé zhal tri dang"
    },
    {
      "bo": "མཚན་སྣང་དཔའ་བོ་ཌཱཀྐིས་བརྡ་སྤྲོད་པས། །",
      "en": "And during the night the heroes and ḍākinīs symbolically transmitted [the teachings]",
      "en-trans": "tsen nang pawo daki datröpé"
    },
    {
      "bo": "ས་ལམ་སྐད་ཅིག་བསྒྲོད་དེར་གསོལ་བ་འདེབས། །",
      "en": "By which you traversed the stages and paths in an instant— I supplicate you.",
      "en-trans": "salam kechik drö der solwa deb"
    },
    {
      "bo": "བཅོ་ལྔ་ལོན་ནས་གཏེར་གྱི་ཁ་བྱང་ཐོབ། །",
      "en": "When you reached fourteen, you obtained an inventory of treasures.",
      "en-trans": "cho nga lön né ter gyi kha jang tob"
    },
    {
      "bo": "བླ་མའི་ཐུགས་བསྐྱེད་ཨོ་རྒྱན་བྱིན་རླབས་ཀྱིས། །",
      "en": "By the compassion of the Lama and the blessings of Orgyen (Guru Rinpoche),",
      "en-trans": "lamé tukkyé orgyen jinlab kyi"
    },
    {
      "bo": "ས་གཏེར་དགོངས་པའི་གཏེར་དུ་དབང་བསྒྱུར་ནས། །",
      "en": "You had the authority over earth and wisdom-mind treasures—",
      "en-trans": "sa ter gongpé ter du wanggyur né"
    },
    {
      "bo": "མཁའ་འགྲོའི་གསང་མཛོད་དབང་དེར་གསོལ་བ་འདེབས།",
      "en": "I supplicate the one who has the command of the secret ḍākinī treasury.",
      "en-trans": "khandrö sangdzö wang der solwa deb"
    },
    {
      "bo": "ཉི་ཤུ་ལོན་ནས་སྨིན་གྲོལ་བསྐྱེད་རྫོགས་ལ། །",
      "en": "When you reached nineteen, having mastered the generation and completion phases of maturation and liberation,",
      "en-trans": "nyishu lön né mindrol kyedzok la"
    },
    {
      "bo": "མངའ་བརྙེས་རིགས་བདག་གནང་བ་ཐོབ་ནས་སླར། །",
      "en": "You obtained permission from the Lord of the Family.",
      "en-trans": "nga nyé rikdak nangwa tob né lar"
    },
    {
      "bo": "དཔའ་བོ་མཁའ་འགྲོས་ལུང་བསྟན་ཇི་བཞིན་དུ། །",
      "en": "Once again, in keeping with the prophecy of the heroes and ḍākinīs,",
      "en-trans": "pawo khandrö lungten jizhin du"
    },
    {
      "bo": "རྣལ་འབྱོར་སྤྱོད་པ་བསྐྱངས་དེར་གསོལ་བ་འདེབས། །",
      "en": "You maintained the yogic observances—I supplicate you.",
      "en-trans": "naljor chöpa kyang der solwa deb"
    },
    {
      "bo": "བླ་མ་ཡི་དམ་དངོས་གྲུབ་མཆོག་བརྙེས་ཞིང་། །",
      "en": "You attained the supreme accomplishment of the lama and deity",
      "en-trans": "lama yidam ngödrub chok nyé zhing"
    },
    {
      "bo": "བསྙེན་སྒྲུབ་མཐར་ཕྱིན་བསྲེག་མནན་འཕེན་པ་ཡིས། །",
      "en": "And defeated the attacks of unruly demons by completing the approach and accomplishment [stages of deity practice],",
      "en-trans": "nyendrub tarchin sek nen penpa yi"
    },
    {
      "bo": "མ་རུང་བདུད་ཀྱི་གཡུལ་ངོ་ཕམ་མཛད་པའི། །",
      "en": "And by burning, suppressing, and casting away [as found in those practices]—",
      "en-trans": "ma rung dü kyi yulngo pam dzepé"
    },
    {
      "bo": "ཡེ་ཤེས་རོལ་པའི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "I supplicate you, Yeshe Rölpa’i Dorje (Vajra of Primordial-Wisdom Display).",
      "en-trans": "yeshe rolpé dorjér solwa deb"
    },
    {
      "bo": "བསྐྱེད་རིམ་ཕྱག་རྒྱ་ཕྲ་བའི་རྣལ་འབྱོར་བརྙེས། །",
      "en": "You obtained the subtle, yogic mudrā of the generation phase,",
      "en-trans": "kyerim chakgya trawé naljor nyé"
    },
    {
      "bo": "རྫོགས་རིམ་རྟགས་བཅུ་ཡོན་ཏན་མཐའ་རུ་ཕྱིན། །",
      "en": "Perfected the qualities of the ten signs of the completion stage,",
      "en-trans": "dzokrim tak chu yönten ta ru chin"
    },
    {
      "bo": "དྭངས་མའི་ཐིག་ལེ་ཨ་ཝ་དྷུ་ཏིར་བཅིང་། །",
      "en": "And held the pure vital-essence in the central channel—",
      "en-trans": "dangmé tiklé a wa dhu tir ching"
    },
    {
      "bo": "གྲུབ་བརྙེས་རིག་འཛིན་མཆོག་དེར་གསོལ་བ་འདེབས།",
      "en": "I supplicate the supreme and accomplished Awareness-Holder.",
      "en-trans": "drub nyé rigdzin chok der solwa deb"
    },
    {
      "bo": "ཁྲེགས་ཆོད་སྣང་སེམས་འདྲེས་ཤིང་གཟུང་འཛིན་ཞིག །",
      "en": "By the [practice] of Cutting Through (trekchö), you mixed appearances and mind, thus destroying subject-object grasping.",
      "en-trans": "trekchö nang sem dré shing zungdzin zhik"
    },
    {
      "bo": "དབའ་རླབས་ལ་བརྟེན་འབྲས་བུའི་དེ་ཉིད་མཐོང་། །",
      "en": "Relying on the [energy] waves, you beheld the resulting suchness.",
      "en-trans": "walab la ten drebü denyi tong"
    },
    {
      "bo": "ཐོད་རྒལ་ཉམས་སྣང་གོང་འཕེལ་མཐའ་རྫོགས་པའི། །",
      "en": "Through the [practice] of Direct Crossing (tögel), the experiences and visions were increased to their perfect culmination—",
      "en-trans": "tögal nyam nang gongpel ta dzokpé"
    },
    {
      "bo": "འཁྲུལ་ཞིག་འཇའ་ལུས་རྡོ་རྗེར་གསོལ་བ་འདེབས།",
      "en": "I supplicate Trülzhig Jalü Dorje (Indestructible Rainbow Body that Dismantles Delusion).",
      "en-trans": "trulzhik jalü dorjér solwa deb"
    },
    {
      "bo": "རྨི་ལམ་འོད་གསལ་ཉམས་ཀྱི་སྣང་བ་ལ། །",
      "en": "In the experiential appearances of the clear light of dreams,",
      "en-trans": "milam ösal nyam kyi nangwa la"
    },
    {
      "bo": "བདེ་བྱེད་བརྩེགས་དང་མཁའ་སྤྱོད་ས་སྤྱོད་གནས། །",
      "en": "You abided in the Tiers of Bliss and other celestial and terrestrial realms.",
      "en-trans": "dé jé tsek dang khachö sachö né"
    },
    {
      "bo": "རིག་འཛིན་དཔའ་བོ་མཁའ་འགྲོའི་ཚོགས་གྲལ་འགྲིམས། །",
      "en": "You roamed among the assembly of awareness-holders, heroes, and ḍākinīs—",
      "en-trans": "rigdzin pawo kha drötsok dral drim"
    },
    {
      "bo": "ཁྲག་འཐུང་དཔའ་བོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "I supplicate at the feet of Traktung Pawo (Blood Drinking Hero).",
      "en-trans": "traktung pawö zhab la solwa deb"
    },
    {
      "bo": "ཐ་སྙད་ཤེས་བྱའི་གནས་ལ་མ་སྦྱང་ཡང་། །",
      "en": "Although you did not study the conventional fields of knowledge,",
      "en-trans": "tanyé shejé né la ma jang yang"
    },
    {
      "bo": "ལྷན་སྐྱེས་ཡེ་ཤེས་བདེ་བ་ཆེན་པོ་ཡིས། །",
      "en": "You completely unraveled the chakra of the Wheel of Enjoyment",
      "en-trans": "lhenkyé yeshe dewa chenpo yi"
    },
    {
      "bo": "ལོངས་སྤྱོད་འཁོར་ལོའི་རྩ་འཁོར་ཡོངས་ཞིག་པའི། །",
      "en": "By the great bliss of the innate, primordial wisdom—",
      "en-trans": "longchö khorlö tsakhor yong zhikpé"
    },
    {
      "bo": "བདེ་བའི་རྡ་རྗེ་དཔལ་དེར་གསོལ་བ་འདེབས།",
      "en": "I supplicate Dewa’i Dorje Pel (Glorious, Blissful Vajra).",
      "en-trans": "dewé da jé pal der solwa deb"
    },
    {
      "bo": "ངོ་བོ་ཆོས་སྐུའི་རྒྱལ་སར་མངའ་བརྙེས་ཀྱང་། །",
      "en": "You seized the royal seat of the essential Dharmakāya;",
      "en-trans": "ngowo chökü gyalsar nga nyé kyang"
    },
    {
      "bo": "མ་དག་འགྲོ་བའི་ལོས་བློ་མཐུན་སྣང་དང་། །",
      "en": "Still, you performed deeds to tame impure beings",
      "en-trans": "ma dak drowé lö lo tün nang dang"
    },
    {
      "bo": "འཚམས་པར་གང་ལ་གང་འདུལ་དོན་མཛད་པའི། །",
      "en": "According to their devotion, intelligence, and common perceptions—",
      "en-trans": "tsampar gang la gang dul dön dzepé"
    },
    {
      "bo": "མཐུ་སྟོབས་དཔའ་བོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "I supplicate at the feet of Tutob Pawo (Hero of Power and Strength).",
      "en-trans": "tutob pawö zhab la solwa deb"
    },
    {
      "bo": "ཡང་གསང་ལུས་མེད་མཁའ་འགྲོའི་ཐུགས་ཐིག་ཆོས། །",
      "en": "To benefit the fortunate ones of the highest capacity,",
      "en-trans": "yangsang lümé khandrö tuk tik chö"
    },
    {
      "bo": "མན་ངག་སྙན་བརྒྱུད་ཡི་གེ་མོད་པའི་སྐོར། །",
      "en": "You properly taught the cycle without letters, the pith instructions of the hearing lineage,",
      "en-trans": "mengak nyengyü yigé möpé kor"
    },
    {
      "bo": "དབང་རབ་སྐལ་ལྡན་དོན་དུ་ལེགས་བསྟན་ནས། །",
      "en": "The doctrine ofThe Extremely Secret Heart-Essence of the Formless Ḍākinīs.2",
      "en-trans": "wang rab kalden döndu lek ten né"
    },
    {
      "bo": "འཇའ་ལུས་འོད་སྐུའི་ལམ་སྟོན་ལ་གསོལ་བ་འདེབས། །",
      "en": "I supplicate the teacher of the path of the rainbow body of light.",
      "en-trans": "jalü ökü lam tön la solwa deb"
    },
    {
      "bo": "གཟུགས་ཅན་གཟུགས་མེད་འགྲོ་བ་མཐའ་དག་ཀུན། །",
      "en": "With great love and compassion, you held limitless beings,",
      "en-trans": "zukchen zukmé drowa tadak kün"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་ཆེན་པོས་རྗེས་བཟུང་ནས། །",
      "en": "Both those with form and those without form,",
      "en-trans": "jam dang nyingjé chenpö jezung né"
    },
    {
      "bo": "དངོས་སམ་བརྒྱུད་ནས་སྨིན་གྲོལ་སྒོར་བཅུག་ཅིང་། །",
      "en": "And, directly and indirectly, ushered them through the gates of maturation and liberation—",
      "en-trans": "ngö sam gyü né mindrol gor chuk ching"
    },
    {
      "bo": "བཙན་ཐབས་རྫོགས་སངས་རྒྱས་མཛད་ལ་གསོལ་བ་འདེབས། །",
      "en": "I supplicate the one who enacts the robust deeds of a perfected buddha.",
      "en-trans": "tsentab dzoksang gyé dzé la solwa deb"
    },
    {
      "bo": "བདག་སོགས་ཁྱེད་ཀྱི་གདུལ་བྱར་གྱུར་པ་རྣམས། །",
      "en": "We who have become your disciples",
      "en-trans": "dak sok khyé kyi duljar gyurpa nam"
    },
    {
      "bo": "ལས་ཉོན་སྡུག་བསྔལ་དྲག་པོའི་མུན་འཐུམས་ཤིང་། །",
      "en": "Are enveloped in the darkness of the intense sufferings of karma and afflictions.",
      "en-trans": "lé nyön dukngal drakpö mün tum shing"
    },
    {
      "bo": "ཁྱོད་ཀྱི་གསང་གསུམ་གཏིང་དཔག་དཀའ་བ་ཡི། །",
      "en": "We are blind to the qualities of your three secrets, so difficult to fathom,",
      "en-trans": "khyö kyi sang sum ting pak kawa yi"
    },
    {
      "bo": "ཡོན་ཏན་ལྟ་བའི་འདྲེན་བྱེད་ཅེ་རེ་ལོངས། །",
      "en": "And the view that would guide us.",
      "en-trans": "yönten tawé dren jé ché ré long"
    },
    {
      "bo": "ལས་ངན་དབང་གིས་ཐེ་ཚོམ་ལོག་ལྟ་འཁྲུགས། །",
      "en": "By the power of negative karma, we are conflicted with doubt and wrong views",
      "en-trans": "lé ngen wang gi tetsom lokta truk"
    },
    {
      "bo": "ལོག་སྨོན་བདུད་ཀྱི་སྡེ་ཚོགས་དབང་ཤོར་ཞིང་། །",
      "en": "And overpowered by the demonic masses of wrong aspirations.",
      "en-trans": "lok mön dü kyi dé tsok wang shor zhing"
    },
    {
      "bo": "རྩ་བ་ཡན་ལག་དམ་ཚིག་ཉམས་འགལ་རལ། །",
      "en": "Our root and branch samayas have deteriorated, been transgressed, and torn apart.",
      "en-trans": "tsawa yenlak damtsik nyam gal ral"
    },
    {
      "bo": "གཏིང་ནས་འགྱོད་པ་དྲག་པོས་བཟོད་པར་གསོལ།",
      "en": "With fervent, heartfelt regret, we pray for forgiveness.",
      "en-trans": "tingné gyöpa drakpö zöpar sol"
    },
    {
      "bo": "རྨོངས་དང་མཉམ་འགྲོགས་དབང་ཤོར་ལོག་པར་བལྟས། །",
      "en": "Influenced by ignorance and its close friend, wrong views,",
      "en-trans": "mong dang nyam drok wang shor lokpar té"
    },
    {
      "bo": "གཤེ་ཞིང་སྐུར་པ་འདེབས་དང་དད་མེད་ཀྱི། །",
      "en": "I have abused and slandered,",
      "en-trans": "shé zhing kurpa deb dang demé kyi"
    },
    {
      "bo": "སྣང་ངོར་བསམ་བཞིན་མ་དག་ཚུལ་བསྟན་ནས། །",
      "en": "And intentionally demonstrated impure behavior in the presence of those without faith.",
      "en-trans": "nang ngor samzhin ma dak tsul ten né"
    },
    {
      "bo": "ཐེ་ཚོམ་བསྐྱེད་ཅིང་ངན་འབྲེལ་གྱིས་སྡུད་པའི། །",
      "en": "I have given rise to doubt and have amassed negative connections,",
      "en-trans": "tetsom kyé ching ngen drel gyi düpé"
    },
    {
      "bo": "གཏིང་དཔག་དཀའ་བའི་དགོངས་པ་མ་རྟོགས་ཤིང་། །",
      "en": "And because of this, I have not realized your unfathomable and all-subsuming enlightened mind.",
      "en-trans": "ting pak kawé gongpa ma tok shing"
    },
    {
      "bo": "བཀའ་འགལ་ཐུགས་དཀྲུགས་ཐུགས་སུན་སྐྱོན་བརྗོད་ཅིང་། །",
      "en": "I have opposed your command, upset and disturbed your mind, proclaimed faults,",
      "en-trans": "ka gal tuk truk tuk sün kyön jö ching"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་མཐོང་དག་སྣང་འགྲིབ་གྱུར་པ། །",
      "en": "And have diminished my pure perception that sees all that the master does as good.",
      "en-trans": "chi dzé lek tong daknang drib gyurpa"
    },
    {
      "bo": "ཡོན་ཏན་རྗེས་སུ་དྲན་པས་བཟོད་པར་གསོལ།",
      "en": "By remembering your qualities, I pray for forgiveness.",
      "en-trans": "yönten jesu drenpé zöpar sol"
    },
    {
      "bo": "བླ་མའི་ཐུགས་རྒྱུད་དགོངས་པའི་བྱིན་རླབས་འཕོས། །",
      "en": "Now, by the blessings transferred from the wisdom-mind of the guru,",
      "en-trans": "lamé tukgyü gongpé jinlab pö"
    },
    {
      "bo": "ད་ནི་ལས་ངན་བག་ཆགས་སྲབ་གྱུར་པས། །",
      "en": "My negative karma and habitual tendencies are diminished.",
      "en-trans": "dani lé ngen bakchak sab gyurpé"
    },
    {
      "bo": "ལོག་པར་མི་རྟོག་སྙིང་ནས་དམ་བཅའ་འཛིན། །",
      "en": "Thus, from my heart, I vow not to hold onto wrong concepts,",
      "en-trans": "lokpar mi tok nying né damcha dzin"
    },
    {
      "bo": "བརྩེ་བ་ཆེན་པོས་རྗེས་སུ་བཟུང་དུ་གསོལ། །",
      "en": "And I pray you lovingly hold me close.",
      "en-trans": "tsewa chenpö jesu zung du sol"
    },
    {
      "bo": "མགོན་ཁྱོད་ཡོན་ཏན་གབ་ཅིང་སྐྱོན་སྟོན་པས། །",
      "en": "Protector, you hide your qualities and display faults,",
      "en-trans": "gön khyö yönten gab ching kyön tönpé"
    },
    {
      "bo": "མ་དག་སེམས་ཅན་མགོ་བོ་རྨོངས་གྱུར་ཅིང་། །",
      "en": "So that we impure sentient beings are fooled.",
      "en-trans": "ma dak semchen gowo mong gyur ching"
    },
    {
      "bo": "ལས་སྐལ་ལྡན་པའང་ཐེ་ཚོམ་དབང་གྱུར་ཕྱིར། །",
      "en": "For the karmically fortunate beings under the sway of doubt,",
      "en-trans": "lekal denpa ang tetsom wang gyur chir"
    },
    {
      "bo": "གཏིང་དཔག་དཀའ་བའི་ཡོན་ཏན་བསྟན་དུ་གསོལ། །",
      "en": "Please reveal your unfathomable qualities.",
      "en-trans": "ting pak kawé yönten ten du sol"
    },
    {
      "bo": "རྡོ་རྗེའི་སྐུ་ལ་བགྲེས་རྒུད་མི་མངའ་ཡང་། །",
      "en": "The vajra body is not subject to decay or decline;",
      "en-trans": "dorjé ku la dré gü mi nga yang"
    },
    {
      "bo": "སྐུ་ཚེ་མཐར་ཕྱིན་འགྲོ་དོན་ཡོངས་རྫོགས་ཤིང་། །",
      "en": "Yet I pray that your life reaches its fullest extent, so that you fully accomplish the benefit of beings;",
      "en-trans": "kutsé tarchin dro dön yongdzok shing"
    },
    {
      "bo": "ད་དུང་འཁོར་བའི་འཇིག་རྟེན་མ་སྟོངས་བར། །",
      "en": "And thereafter, until cyclic existence is emptied,",
      "en-trans": "dadung khorwé jikten matongwar"
    },
    {
      "bo": "སྣ་ཚོགས་སྤྲུལ་པས་འགྲོ་དོན་མཛད་དུ་གསོལ།",
      "en": "Please act to benefit beings through a myriad of emanations.",
      "en-trans": "natsok trulpé dro dön dzé du sol"
    },
    {
      "bo": "རྩེ་གཅིག་གསོལ་བ་བཏབ་པའི་འབྲས་བུ་ཡིས། །",
      "en": "By the fruit of this one-pointed supplication,",
      "en-trans": "tsechik solwa tabpé drebu yi"
    },
    {
      "bo": "ཞབས་ཏོག་མཐར་ཕྱིན་འགྲོ་དོན་ཡོངས་རྫོགས་ནས། །",
      "en": "May I perfectly serve you and fully benefit beings.",
      "en-trans": "zhabtok tarchin dro dön yongdzok né"
    },
    {
      "bo": "ཟག་པ་བག་ཆགས་བཅས་པ་ཡོངས་ཟད་ཅིང་། །",
      "en": "Having done so, may the defilements and habitual tendencies be completely exhausted;",
      "en-trans": "zakpa bakchak chepa yong zé ching"
    },
    {
      "bo": "སྣང་བཞི་མཐར་ཕྱིན་འཇའ་ལུས་འགྲུབ་པར་ཤོག །",
      "en": "May I perfect the four visions and attain the rainbow body!",
      "en-trans": "nang zhi tarchin jalü drubpar shok"
    },
    {
      "bo": "དགེ་བས་འགྲོ་ཀུན་སྡུག་བསྔལ་མཚོ་སྐེམས་ནས། །",
      "en": "By this virtue, may sentient beings’ ocean of suffering dry up.",
      "en-trans": "gewé dro kün dukngal tso kem né"
    },
    {
      "bo": "བདེ་གཤེགས་སྙིང་པོ་རང་རིག་ངོ་ཤེས་ཤིང་། །",
      "en": "May they recognize the reflexive awareness, the essence of the Sugata.",
      "en-trans": "deshek nyingpo rangrig ngoshé shing"
    },
    {
      "bo": "སྟོང་ཉིད་བྱང་ཆུབ་སེམས་ཀྱི་འབྲས་སྨིན་ནས། །",
      "en": "May the fruit of emptiness-bodhicitta ripen!",
      "en-trans": "tongnyi changchub sem kyi dré min né"
    },
    {
      "bo": "སྐུ་གསུམ་རྒྱལ་བའི་ཞིང་དུ་དབུགས་དབྱུང་ཤོག",
      "en": "May they be assured in the realms of the victors of the three kāyas!",
      "en-trans": "ku sum gyalwé zhing du ukyung shok"
    }
  ]
}