{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/do-dasel-wangmo/sarasvati-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དབྱངས་ཅན་གསོལ་འདེབས་ཆུ་སྐྱེས་འཛུམ་དཀར་བཞུགས།",
    "en": "A Prayer to Sarasvatī"
  },
  "text": [
    {
      "bo": "ལྡེམ་ལྡེམ་ཆུས་སྐྱེས་འདབ་བརྒྱ་དགོད་པའི་ཁར། །",
      "en": "On the ever-so-supple surface of a blossoming hundred-petalled lotus",
      "en-trans": "dem dem chü kyé dabgya göpé khar"
    },
    {
      "bo": "མཛེས་མཛེས་མཚན་དཔེའི་ཡིད་འཕྲོག་དབྱངས་ཅན་མ། །",
      "en": "The ever-so-beautiful Sarasvatī, captivating with her signs and marks,",
      "en-trans": "dzé dzé tsenpé yitrok yangchenma"
    },
    {
      "bo": "ཁྱུག་ཁྱུག་འཇའ་འོད་འཁྲིགས་པའི་དབུས་ན་བཞུགས། །",
      "en": "Is seated amidst a mass of rainbow light that is ever so brilliant:",
      "en-trans": "khyuk khyuk ja ö trikpé ü na zhuk"
    },
    {
      "bo": "འཛུམ་འཛུམ་དགྱེས་པའི་ཞལ་རས་བདག་ལ་ཕྱོགས། །",
      "en": "Direct your ever-so-dazzling smile of delight towards me.",
      "en-trans": "dzum dzum gyepé zhalré dak la chok"
    },
    {
      "bo": "དཀར་དཀར་ཟླ་བ་ཉ་འདྲའི་ཞལ་བཟང་མ། །",
      "en": "Your noble face resembles the full moon that is ever so bright.",
      "en-trans": "kar karda ba nya dré zhal zang ma"
    },
    {
      "bo": "སྙན་སྙན་ཚངས་གསུང་པི་ཝཾ་སྒྲ་དང་འགྲོགས། །",
      "en": "Your divine voice accompanied by the sound of thevīṇāis ever so sweet.",
      "en-trans": "nyen nyen tsang sung piwam dra dang drok"
    },
    {
      "bo": "བརྩེ་བརྩེ་འགྲོ་བ་ཀུན་ལ་བུ་ལྟར་དགོངས། །",
      "en": "The love with which you regard all beings as your children is ever so tender.",
      "en-trans": "tsé tsé drowa kün la bu tar gong"
    },
    {
      "bo": "བླུན་བླུན་རྨོངས་པ་བདག་འདྲ་ཐུགས་རྗེས་ཟུངས། །",
      "en": "Hold deluded ones like me, the ever-so-foolish, in your compassion!",
      "en-trans": "lün lün mongpa dak dra tukjé zung"
    },
    {
      "bo": "མང་མང་ཤེས་བྱ་རིག་པའི་ཚོགས་རྣམས་དང་། །",
      "en": "May I master the fields of knowledge that are ever so numerous",
      "en-trans": "mang mang sheja rigpé tsok nam dang"
    },
    {
      "bo": "ཟབ་ཟབ་མདོ་དང་རྒྱུད་སྡེའི་དགོངས་པའི་དོན། །",
      "en": "And realize the ever-so-profound intent of the sūtras and tantras",
      "en-trans": "zab zab do dang gyüdé gongpé dön"
    },
    {
      "bo": "མཁས་མཁས་ཕུལ་བྱུང་བློ་ཡིས་རབ་རྟོགས་ནས། །",
      "en": "With a mind that is ever so wise, skilful and excellent,",
      "en-trans": "khé khé puljung lo yi rab tok né"
    },
    {
      "bo": "མཐོ་མཐོ་བསྟན་པའི་རྒྱལ་མཚན་བསྒྲེང་ནུས་ཤོག །",
      "en": "And raise ever so high the victory banner of the teachings.",
      "en-trans": "to to tenpé gyaltsen dreng nü shok"
    },
    {
      "bo": "བགྲངས་བགྲངས་གྲངས་ཀྱིས་མི་ལོངས་མཁའ་ཁྱབ་འགྲོ །",
      "en": "As, with the intention to lead all beings, ever so incalculable in number,",
      "en-trans": "drang drang drang kyi mi long khakhyab dro"
    },
    {
      "bo": "བདེ་བདེ་གོ་འཕང་མཆོག་ལ་འགོད་པའི་བློས། །",
      "en": "To the supreme state that is ever so blissful,",
      "en-trans": "dé dé gopang chok la göpé lö"
    },
    {
      "bo": "འབད་འབད་ཚོགས་གཉིས་རྒྱ་མཚོའི་མཐར་སོན་ཏེ། །",
      "en": "I strive ever so hard to complete the two accumulations,",
      "en-trans": "bé bé tsok nyi gyatsö tar sön té"
    },
    {
      "bo": "ལེགས་ལེགས་རྣམ་འདྲེན་རྒྱལ་བའི་དབང་པོར་མཛོད། །",
      "en": "Help me to become an ever-so-excellent guide, supremely victorious!",
      "en-trans": "lek lek namdren gyalwé wangpor dzö"
    }
  ]
}