{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shabkar/swift-infusion-blessings-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མའི་གསོལ་འདེབས་བྱིན་རླབས་མྱུར་འཇུག",
    "en": "The Swift Infusion of Blessings"
  },
  "text": [
    {
      "bo": "འཁོར་བའི་ཕུན་ཚོགས་དུག་སྦྲུལ་ཚང་ལྟ་བུར། །",
      "en": "Having seen the luxuries of saṃsāra as akin to a nest of vipers,",
      "en-trans": "khorwé püntsok dukdrul tsang tabur"
    },
    {
      "bo": "མཐོང་ནས་ཚེ་འདིའི་བྱ་བ་ཐམས་ཅད་ལ། །",
      "en": "You sincerely turned away from compulsive attachment",
      "en-trans": "tong né tsé di jawa tamché la"
    },
    {
      "bo": "མངོན་ཞེན་གཏིང་ནས་ལོག་པའི་བྱ་བཏང་བ། །",
      "en": "To the affairs of the present life, and became a renunciant—",
      "en-trans": "ngön zhen tingné lokpé ja tangwa"
    },
    {
      "bo": "ཚོགས་དྲུག་རང་གྲོལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Tsokdruk Rangdrol, at your feet I pray.",
      "en-trans": "tsok druk rangdrol zhab la solwa deb"
    },
    {
      "bo": "ཁྱོད་ཐུགས་ཤེལ་དཀར་བུམ་བཟང་ལས་ཐོན་པའི། །",
      "en": "May the stream of nectarous explanations of the profound path",
      "en-trans": "khyö tuk shel kar bum zang lé tönpé"
    },
    {
      "bo": "ཟབ་ལམ་ལེགས་བཤད་བདུད་རྩིའི་ཆུ་རྒྱུན་གྱིས། །",
      "en": "That flows from the excellent crystal vase of your wisdom heart",
      "en-trans": "zablam lek shé dütsi chugyün gyi"
    },
    {
      "bo": "རང་སེམས་ནོར་བུའི་ཉོན་མོངས་དྲི་མ་ཀུན། །",
      "en": "Wash away all the afflictions that sully the jewel of my mind",
      "en-trans": "rangsem norbü nyönmong drima kün"
    },
    {
      "bo": "བཀྲུས་ནས་དོན་གཉིས་དགོས་འདོད་ཀུན་འབྱུང་ཤོག །",
      "en": "And bring about the fulfilment of all wishes for twofold benefit.",
      "en-trans": "trü né dön nyi gödö künjung shok"
    },
    {
      "bo": "ཤེས་བྱའི་ཆོས་རྣམས་མ་ལུས་ས་ལེར་མཁྱེན། །",
      "en": "You, the one who clearly understands all that is knowable,",
      "en-trans": "shejé chö nam malü saler khyen"
    },
    {
      "bo": "བྱམས་དང་བརྩེ་བས་འགྲོ་ལ་ཟབ་རྒྱས་ཆོས། །",
      "en": "And who, with loving kindness and compassion,",
      "en-trans": "jam dang tsewé dro la zabgyé chö"
    },
    {
      "bo": "སྟོན་པའི་མཚན་ལྡན་རྩ་བའི་བླ་མ་ཡི། །",
      "en": "Teaches the Dharma, profound and vast, authentic root guru,",
      "en-trans": "tönpé tsenden tsawé lama yi"
    },
    {
      "bo": "སྐུ་ཚེ་བསྐལ་བརྒྱའི་བར་དུ་བརྟན་པར་ཤོག །",
      "en": "May your life remain secure for a hundred aeons!",
      "en-trans": "kutsé kal gyé bardu tenpar shok"
    },
    {
      "bo": "ཚོགས་གཉིས་ལས་འཁྲུངས་མཚན་དཔེས་མཛེས་པའི་སྐུ། །",
      "en": "A handsome form of signs and marks born of twofold accumulation,",
      "en-trans": "tsok nyi lé trung tsenpé dzepé ku"
    },
    {
      "bo": "ཡན་ལག་དྲུག་ཅུའི་གདངས་ལྡན་སྙན་པའི་གསུང་། །",
      "en": "Sweetly melodious speech resonant with the sixty wondrous qualities,",
      "en-trans": "yenlak drukchü dangden nyenpé sung"
    },
    {
      "bo": "ཉོན་མོངས་རང་གྲོལ་གསལ་སྟོང་འཛིན་མེད་ཐུགས། །",
      "en": "And a non-grasping mind, empty clarity, in whichkleśas liberate themselves—",
      "en-trans": "nyönmong rangdrol saltong dzinmé tuk"
    },
    {
      "bo": "བླ་མའི་སྐུ་གསུང་ཐུགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the guru’s enlightened body, speech and mind, I pray.",
      "en-trans": "lamé ku sung tuk la solwa deb"
    },
    {
      "bo": "ལུས་ལ་བླ་མའི་སྐུ་ཡིས་བྱིན་གྱིས་རློབས། །",
      "en": "May my body be infused with the blessings of the guru’s form,",
      "en-trans": "lü la lamé ku yi jingyi lob"
    },
    {
      "bo": "ལུས་ཀྱི་སྒྲིབ་དག་བདེ་དྲོད་འབར་བ་དང་། །",
      "en": "May physical obscurations be purified and blissful warmth ignite,",
      "en-trans": "lü kyi drib dak dé drö barwa dang"
    },
    {
      "bo": "ལུས་ནི་འཆི་མེད་འཇའ་ལུས་འོད་སྐུར་གྱུར། །",
      "en": "May my body become a deathless rainbow form, a kāya of light,",
      "en-trans": "lü ni chimé jalü ökur gyur"
    },
    {
      "bo": "ལུས་ཀྱིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །",
      "en": "And may I physically become a source of benefit to others.",
      "en-trans": "lü kyi zhen la pen tok jungwar shok"
    },
    {
      "bo": "ངག་ལ་བླ་མའི་གསུང་གིས་བྱིན་གྱིས་རློབས། །",
      "en": "May my speech be infused with the blessings of the guru’s speech,",
      "en-trans": "ngak la lamé sung gi jingyi lob"
    },
    {
      "bo": "ངག་གི་སྒྲིབ་དག་ནུས་པ་འབྱུང་བ་དང་། །",
      "en": "May vocal obscurations be purified and my power increase,",
      "en-trans": "ngak gi drib dak nüpa jungwa dang"
    },
    {
      "bo": "ངག་ནི་འགག་མེད་ཚངས་པའི་དབྱངས་སུ་གྱུར། །",
      "en": "May my voice become the unceasing melodious voice of Brahmā,",
      "en-trans": "ngak ni gakmé tsangpé yang su gyur"
    },
    {
      "bo": "ངག་གིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །",
      "en": "And may I vocally become a source of benefit to others.",
      "en-trans": "ngak gi zhen la pen tok jungwar shok"
    },
    {
      "bo": "སེམས་ལ་བླ་མའི་ཐུགས་ཀྱིས་བྱིན་གྱིས་རློབས། །",
      "en": "May my mind be infused with the blessings of the guru’s mind,",
      "en-trans": "sem la lamé tuk kyi jingyi lob"
    },
    {
      "bo": "སེམས་ཀྱི་སྒྲིབ་དག་ཉམས་རྟོགས་འཆར་བ་དང་། །",
      "en": "May mental obscurations be purified and experience and realization unfold,",
      "en-trans": "sem kyi drib dak nyamtok charwa dang"
    },
    {
      "bo": "སེམས་ནི་འཁྲུལ་མེད་ཆོས་ཀྱི་སྐུ་རུ་གྱུར། །",
      "en": "May my mind become the dharmakāya beyond delusion,",
      "en-trans": "sem ni trulmé chö kyi ku ru gyur"
    },
    {
      "bo": "སེམས་ཀྱིས་གཞན་ལ་ཕན་ཐོགས་འབྱུང་བར་ཤོག །",
      "en": "And may I mentally become a source of benefit to others.",
      "en-trans": "sem kyi zhen la pen tok jungwar shok"
    },
    {
      "bo": "སྐྱབས་གསུམ་ཀུན་འདུས་བླ་མ་རྡོ་རྗེ་འཆང་། །",
      "en": "Guru Vajradhara, embodiment of the entire threefold refuge,",
      "en-trans": "kyab sum kündü lama dorjé chang"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་བཤེས་གཉེན་ཚུལ་བཟང་ནས། །",
      "en": "Assuming the form of spiritual guides who trains according to what is needed—",
      "en-trans": "gang la gang dul shenyen tsul zang né"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོང་དངོས་གྲུབ་སྩོལ་མཛད་པའི། །",
      "en": "Those who confer the attainments, ordinary and supreme,",
      "en-trans": "chok dang tünmong ngödrub tsol dzepé"
    },
    {
      "bo": "དྲིན་ཅན་བླ་མ་རྣམས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Gracious gurus, to you I pray.",
      "en-trans": "drinchen lama nam la solwa deb"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་ཡང་དག་བླ་མ་དང་། །",
      "en": "In all my lives, may I never be separated from genuine guru,",
      "en-trans": "kyewa küntu yangdak lama dang"
    },
    {
      "bo": "འབྲལ་མེད་ཆོས་ཀྱི་དཔལ་ལ་ལོངས་སྤྱོད་ཅིང་། །",
      "en": "May I enjoy the splendour of the Dharma,",
      "en-trans": "dralmé chö kyi pal la longchö ching"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་ཡོན་ཏན་རབ་རྫོགས་ནས། །",
      "en": "And by perfecting the qualities of the paths and stages,",
      "en-trans": "sa dang lam gyi yönten rabdzok né"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་གི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །",
      "en": "May I swiftly attain the level of Vajradhara!",
      "en-trans": "dorjé chang gi gopang nyur tob shok"
    },
    {
      "bo": "སྟོན་པ་བླ་ན་མེད་པའི་བསྟན་པ་དང་། །",
      "en": "That I have encountered the teachings of the unsurpassable Teacher",
      "en-trans": "tönpa lanamepé tenpa dang"
    },
    {
      "bo": "མཇལ་བ་འདི་འདྲ་བླ་མའི་དྲིན་ཡིན་པས། །",
      "en": "In this way is due to the guru’s kindness.",
      "en-trans": "jalwa dindra lamé drin yinpé"
    },
    {
      "bo": "དགེ་བ་འདི་ཡང་འགྲོ་བ་མ་ལུས་པ། །",
      "en": "I therefore dedicate all my virtue, so that each and every being",
      "en-trans": "gewa di yang drowa malüpa"
    },
    {
      "bo": "བཤེས་གཉེན་དམ་པས་འཛིན་པའི་རྒྱུ་རུ་བསྔོ། །",
      "en": "May be accepted and cared for by such a noble spiritual guide.",
      "en-trans": "shenyen dampé dzinpé gyu ru ngo"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་རྣམ་པར་ཐར་པ་ལ། །",
      "en": "Towards the lifestyle and activity of the guru,",
      "en-trans": "palden lamé nampar tarpa la"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་ལོག་ལྟ་མི་སྐྱེ་ཞིང༌། །",
      "en": "May wrong view not arise for even an instant, and",
      "en-trans": "kechik tsam yang lokta mi kyé zhing"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་པར་མཐོང་བའི་མོས་གུས་ཀྱིས། །",
      "en": "May I regard whatever is done as a teaching for me.",
      "en-trans": "chi dzé lekpar tongwé mögü kyi"
    },
    {
      "bo": "བླ་མའི་བྱིན་རླབས་སེམས་ལ་འཇུག་པར་ཤོག །",
      "en": "Through such devotion, may the guru’s blessing inspire and fill my mind!",
      "en-trans": "lamé jinlab sem la jukpar shok"
    }
  ]
}