{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-se-pakchok-dorje",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྲས་འཕགས་མཆོག་རྡོ་རྗེ་ལ་གསོལ་འདེབས་བཞུགས།",
    "en": "Prayer to Sé Pakchok Dorje"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "རིག་སྟོང་འོད་གསལ་བདེ་ཆེན་ཕོ་བྲང་ནས།    །",
      "en": "In the palace of great bliss, aware and empty luminosity,",
      "en-trans": "riktong ösal dechen podrang né"
    },
    {
      "bo": "རང་བྱུང་རིག་པའི་རྩལ་རྫོགས་ཆོས་ཀྱི་སྐུ།    །",
      "en": "The self-arisen dharmakāya is the full strength of awareness.",
      "en-trans": "rangjung rigpé tsal dzok chö kyi ku"
    },
    {
      "bo": "ཀུན་བཟང་ཁྱབ་བདག་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "Guru and pervasive sovereign Samantabhadra, to you I pray:",
      "en-trans": "kunzang khyabdak lamar solwa deb"
    },
    {
      "bo": "ཀ་དག་ཁྲེགས་ཆོད་རྟོགས་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me to realize the Trekchö of primordial purity.",
      "en-trans": "kadak trekchö tokpar jingyi lob"
    },
    {
      "bo": "རང་མདངས་འགགས་མེད་རང་གསལ་གཞལ་ཡས་ནས།    །",
      "en": "In the palace of unceasing natural luminosity and self-radiance,",
      "en-trans": "rang dang gakmé rangsal zhalyé né"
    },
    {
      "bo": "ལྷུན་གྲུབ་ལོངས་སྐུའི་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "Is the spontaneously present sambhogakāya guru, to whom I pray:",
      "en-trans": "lhündrub longkü lamar solwa deb"
    },
    {
      "bo": "འོད་གསལ་སྣང་བཞིའི་ལམ་མཆོག་མཐར་ཕྱིན་ནས།    །",
      "en": "Inspire me to complete the supreme path of four luminous visions",
      "en-trans": "ösal nang zhi lam chok tarchin né"
    },
    {
      "bo": "འཇའ་ལུས་འཕོ་ཆེན་འགྲུབ་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "And accomplish the rainbow body of great transference.",
      "en-trans": "jalü pochen drubpar jingyi lob"
    },
    {
      "bo": "རིག་རྩལ་ཐུགས་རྗེ་སྤྲུལ་སྐུའི་ཞིང་ཁམས་ནས།    །",
      "en": "In the pure nirmāṇakāya realm of the creative power of awareness,",
      "en-trans": "riktsal tukjé tulkü zhingkham né"
    },
    {
      "bo": "སྤྲུལ་སྐུ་ཀུན་བཟང་འཕགས་མཆོག་རྡོ་རྗེ་ལ།    །",
      "en": "Is the Tulku Kunzang Pakchok Dorje,",
      "en-trans": "tulku kunzang pakchok dorjé la"
    },
    {
      "bo": "དྲན་རིག་རྒྱུན་ཆད་མེད་པས་གསོལ་བ་འདེབས།    །",
      "en": "To whom I pray with uninterrupted awareness and presence:",
      "en-trans": "dren rik gyünché mepé solwa deb"
    },
    {
      "bo": "འགྲོ་དོན་དཔག་མེད་འབྱུང་བར་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me to bring unlimited benefit to beings.",
      "en-trans": "dro dön pakmé jungwar jingyi lob"
    },
    {
      "bo": "སྐྱབས་ཀུན་སྙིང་པོ་རང་རིག་བླ་མར་ཤེས།    །",
      "en": "May I recognise my own awareness as the very essence of all refuges,",
      "en-trans": "kyab kün nyingpo rangrig lamar shé"
    },
    {
      "bo": "སྐུ་གསུམ་ལྷུན་གྲུབ་གཞོན་ནུ་བུམ་སྐུའི་སྦུབས།    །",
      "en": "Attain full awakening within the nature of the indestructible vajra,",
      "en-trans": "ku sum lhündrub zhönnu bumkü bub"
    },
    {
      "bo": "གཞོམ་མེད་རྡོ་རྗེའི་ངོ་བོར་མངོན་བྱང་ཆུབ།    །",
      "en": "The space of the youthful vase body in which the three kāyas are spontaneously present,",
      "en-trans": "zhommé dorjé ngowor ngönjang chub"
    },
    {
      "bo": "སྲིད་གསུམ་འཁོར་བ་དོང་ནས་སྤྲུགས་པར་ཤོག  །",
      "en": "And empty the three realms of saṃsāra from their very depths.",
      "en-trans": "si sum khorwa dong né trukpar shok"
    }
  ]
}