{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-gotsangpa-gonpo-dorje",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒོད་ཚང་མགོན་པོ་རྡོ་རྗེ་ལ་གསོལ་བ་འདེབས་པ་མོས་གུས་ཀྱི་ཏམྦུ་ར་ཞེས་བྱ་བ།"
  },
  "text": [
    {
      "bo": "རྗེ་བླ་མ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།    །"
    },
    {
      "bo": "གནས་སྤྱི་གཙུག་ཉི་ཟླའི་གདན་སྟེང་ན།    །"
    },
    {
      "bo": "དཔལ་བཀའ་དྲིན་མཉམ་མེད་བླ་མ་རྗེ།    །"
    },
    {
      "bo": "རྗེ་ཁྱབ་བདག་མགོན་པོ་རྡོ་རྗེ་ལ།    །"
    },
    {
      "bo": "བདག་གསོལ་བ་འདེབས་སོ་ཐུགས་རྗེས་ཟུངས།    །"
    },
    {
      "bo": "རྗེ་མི་མངོན་དབྱིངས་ན་བཞུགས་ཙ་ན།    །"
    },
    {
      "bo": "མགོན་སངས་རྒྱས་རྣམས་དང་དགོངས་པ་གཅིག  །"
    },
    {
      "bo": "དཔལ་ཧེ་རུ་ཀ་དང་སྤྱོད་ཡུལ་མཉམ།    །"
    },
    {
      "bo": "རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་གྲུབ་པའི་གཙོ།    །"
    },
    {
      "bo": "རྗེ་ཁྱོད་ལ་གདུང་བས་གསོལ་འདེབས་ན།    །"
    },
    {
      "bo": "གསང་གསུམ་གྱི་བྱིན་རླབས་དབང་བསྐུར་སྩོལ།    །"
    },
    {
      "bo": "དུས་ད་ལྟ་རྡོ་རྗེའི་བྱིན་ཆེན་ཕོབ།    །"
    },
    {
      "bo": "བདག་རྒྱུད་ལ་ཉམས་རྟོགས་བསྐྱེད་དུ་གསོལ།    །"
    },
    {
      "bo": "སྐུ་གདན་གསུམ་ཚང་བའི་དཀྱིལ་འཁོར་ནས།    །"
    },
    {
      "bo": "ལུས་བུམ་པའི་དབང་གིས་སྨིན་པ་དང་།    །"
    },
    {
      "bo": "རྩ་གདོས་བཅས་སྒྲིབ་པ་དག་པ་དང་།    །"
    },
    {
      "bo": "ལུས་སྐུ་ཡི་རྡོ་རྗེར་བདག་སྒྲུབ་མཛོད།    །"
    },
    {
      "bo": "རྗེ་གསུང་གི་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །"
    },
    {
      "bo": "ངག་གསང་བའི་དབང་གིས་སྨིན་པ་དང་།    །"
    },
    {
      "bo": "རླུང་འགྱུར་བཅས་ངག་གི་དྲི་མ་སྦྱངས།    །"
    },
    {
      "bo": "ངག་གསུང་གི་རྡོ་རྗེར་གྲུབ་པར་མཛོད།    །"
    },
    {
      "bo": "ཐུགས་རིག་སྟོང་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །"
    },
    {
      "bo": "ཡིད་ཤེར་ཡེའི་དབང་གིས་སྨིན་པ་དང་།    །"
    },
    {
      "bo": "སེམས་ཐིག་ལེ་འཕོ་བའི་དྲི་མ་སྦྱངས།    །"
    },
    {
      "bo": "ཡིད་ཐུགས་ཀྱི་རྡོ་རྗེར་གྲུབ་པར་མཛོད།    །"
    },
    {
      "bo": "རྗེ་ཡེ་ཤེས་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །"
    },
    {
      "bo": "དབང་བཞི་པའི་རྟོགས་པ་བསྐྱེད་པར་མཛོད།    །"
    },
    {
      "bo": "ཀུན་གཞི་ཡི་སྒྲིབ་པ་སྦྱོང་བ་དང་།    །"
    },
    {
      "bo": "སེམས་རིག་སྟོང་རྡོ་རྗེར་གྲུབ་གྱུར་ཅིག  །"
    },
    {
      "bo": "དད་མོས་ཀྱི་གདུང་ཤུགས་དྲག་ཏུ་བསྐྱེད།    །"
    },
    {
      "bo": "མོས་གུས་ཀྱི་ས་གཞི་གཙང་མ་ལ།    །"
    },
    {
      "bo": "མགོན་ཡེ་ཤེས་སྐུ་ཡི་གཟུགས་བརྙན་འཆར།    །"
    },
    {
      "bo": "ཐུགས་རྒྱུད་ཀྱི་དགོངས་པ་འཕོ་བར་མཛོད།    །"
    },
    {
      "bo": "སྐྱབས་བླ་མ་དཀོན་མཆོག་རྣམ་གསུམ་ལ།    །"
    },
    {
      "bo": "ཡིད་ཁྱེད་ཤེས་དད་པས་རྟག་ཏུ་བསྙེན།    །"
    },
    {
      "bo": "བདག་ལུས་སེམས་བདེ་སྡུག་ཅི་བྱུང་ཡང་།    །"
    },
    {
      "bo": "རྗེ་དམ་པ་རྣམས་ཀྱི་མགོན་སྐྱོབས་མཛོད།    །"
    },
    {
      "bo": "མ་འགྲོ་བ་དྲུག་གི་སེམས་ཅན་རྣམས།    །"
    },
    {
      "bo": "བུ་བདག་གི་ཕ་མར་གྱུར་པས་ན།    །"
    },
    {
      "bo": "སྡུག་བསྔལ་གྱི་རྒྱ་མཚོ་ཆེན་པོ་ལས།    །"
    },
    {
      "bo": "ཐར་པ་དམ་པར་འགོད་ནུས་ཤོག  །"
    },
    {
      "bo": "ལུས་ཡི་དམ་ལྷ་ཡི་གསལ་སྣང་བརྟན།    །"
    },
    {
      "bo": "ངག་བཟླས་བརྗོད་ཆུ་བོའི་གཞུང་ལྟར་བརྩོན།    །"
    },
    {
      "bo": "སེམས་རང་གྲོལ་ཕྱག་རྒྱ་ཆེན་པོའི་ངང་།    །"
    },
    {
      "bo": "དུས་རྟག་ཏུ་ཡེངས་མེད་བརྩོན་པར་ཤོག  །"
    },
    {
      "bo": "དུས་གསུམ་དུ་བསགས་པའི་དགེ་ཚོགས་རྣམས།    །"
    },
    {
      "bo": "བློས་གཅིག་ཏུ་བསྡུས་ནས་འགྲོ་ལ་སྦྱིན།    །"
    },
    {
      "bo": "མ་མཁའ་ཁྱབ་སེམས་ཅན་མ་ལུས་པ།    །"
    },
    {
      "bo": "དཔལ་སྐུ་བཞིའི་དབང་ཕྱུག་ཐོབ་པར་ཤོག  །"
    },
    {
      "bo": "རྗེ་གྲུབ་པའི་དབང་ཕྱུག་ཁྱེད་མཁྱེན་ནོ།    །"
    },
    {
      "bo": "དུས་ད་ལྟ་ཉིད་དུ་བྱིན་གྱིས་རློབས།    །"
    },
    {
      "bo": "འདུག་ས་འདི་ཉིད་དུ་བྱིན་གྱིས་རློབས།    །"
    },
    {
      "bo": "སྟན་ཐོག་འདི་ཉིད་དུ་བྱིན་གྱིས་རློབས་ཤིག  །"
    },
    {
      "bo": "བླ་མ་གྲུབ་བརྒྱའི་གཙུག་རྒྱན།    །"
    },
    {
      "bo": "རྒྱལ་བ་རྒོད་ཚང་པ་མགོན་པོ་རྡོ་རྗེ་མཁྱེན་ནོ།    །"
    }
  ]
}