{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jigme-lingpa/prayer-recalling-life-and-liberation",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྫོགས་ཆེན་པ་རང་བྱུང་རྡོ་རྗེའི་རྣམ་ཐར་གསོལ་འདེབས་བཞུགས།"
  },
  "text": [
    {
      "bo": "སྲིད་ཞི་ཀུན་གྱི་མགོན་པོ་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "བཅོམ་ལྡན་འོད་སྲུང་དྲུང་ན་ཀྲྀ་ཀྲྀའི་སྲས། །"
    },
    {
      "bo": "ཤཱཀྱ་ཐུབ་པའི་མཆེད་ཟླ་གཅུང་དགའ་བོ། །"
    },
    {
      "bo": "དགྲ་བཅོམ་མཚན་བཟང་ལྡན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐེག་མཆོག་སྟོན་པ་དགའ་རབ་ཤྲཱི་སེང་། །"
    },
    {
      "bo": "དྲི་མེད་བཤེས་གཉེན་སྲོང་བཙན་ཨ་ཀརྨ། །"
    },
    {
      "bo": "རྗེ་འབངས་གྲོགས་གསུམ་རྒྱལ་སྲས་ལྷ་རྗེའི་རྒྱུད། །"
    },
    {
      "bo": "རྣམ་འཕྲུལ་དུ་མར་ཤར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞོན་ནུ་རོལ་རྩེད་དུས་ནས་སྙིང་རྗེ་དང་། །"
    },
    {
      "bo": "ངེས་འབྱུང་སྐྱོ་ཤས་དྲག་པོས་རྒྱུད་བརླན་ཏེ། །"
    },
    {
      "bo": "དབེན་པ་ཁོ་ནར་མོས་པའི་ཞེན་ལོག་གིས། །"
    },
    {
      "bo": "འདུ་འཛིའི་གཡུལ་ལས་རྒྱལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཉི་ཤུ་རྩ་ལྔའི་ལོ་ནས་ཚོགས་སྦྱོར་ལམ། །"
    },
    {
      "bo": "མོས་གུས་སྙིང་རྗེ་བསྐྱེད་རྫོགས་ཐབས་ལམ་ལ། །"
    },
    {
      "bo": "སྒྲུབ་པའི་དཀའ་ཐུབ་བསྟེན་པས་ཆོས་ཉིད་དོན། །"
    },
    {
      "bo": "མ་ནོར་མངོན་སུམ་མཐོང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དཔལ་གྱི་བསམ་ཡས་མཆིམས་ཕུའི་དགེའུ་རུ། །"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཞལ་གཟིགས་ལུང་བསྟན་ཐོབ་པའི་མོད། །"
    },
    {
      "bo": "ཇི་ལྟ་ཇི་སྙེད་སྤོབས་པའི་གཏེར་གྲོལ་ཏེ། །"
    },
    {
      "bo": "མངོན་པའི་ང་རྒྱལ་ཟད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྙིང་བསྟན་རི་མོའི་མར་མེ་ལྟར་གྱུར་དུས། །"
    },
    {
      "bo": "རྒྱུད་འབུམ་གླེགས་བམ་རྫོགས་དང་ཆོས་འབྱུང་བསྐྲུན། །"
    },
    {
      "bo": "མདོ་སྒྱུ་སེམས་གསུམ་སྙིང་ཏིག་བཀའ་གཏེར་གྱི། །"
    },
    {
      "bo": "བསྟན་པ་མ་ནོར་འཛིན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྔ་འགྱུར་གྲུབ་མཐའ་ཆོས་ལུགས་སྣ་ཚོགས་ཀྱིས། །"
    },
    {
      "bo": "རྙོག་མར་གྱུར་ལ་གཞན་སྡེས་གཤུང་བའི་ཚེ། །"
    },
    {
      "bo": "ཡོན་ཏན་རིན་ཆེན་མཛོད་ཀྱི་ཤིང་རྟ་ཆེས། །"
    },
    {
      "bo": "རང་སྡེའི་གྲུབ་མཐའ་སློང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐོས་པ་ཉུང་དང་བློ་གྲོས་བླུན་པོ་རྣམས། །"
    },
    {
      "bo": "ཁྲོན་པའི་ལག་འགྲོ་རྨོངས་པའི་ཕྱོགས་འཛིན་ཡང་། །"
    },
    {
      "bo": "མཁས་དང་དམ་པའི་རྒྱུ་སྐར་ཆེན་པོའི་དབུས། །"
    },
    {
      "bo": "བསྟན་པའི་ཉིན་བྱེད་འབར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གང་ཞིག་འཕགས་པའི་སྤངས་རྟོགས་བརྙེས་པ་རྣམས། །"
    },
    {
      "bo": "རྣམ་རྟོག་རང་རྒྱུད་ལས་འདས་ཆོས་ཉིད་ཕྱིར། །"
    },
    {
      "bo": "སྒོམ་བྱུང་ཤེས་རབ་ཟླ་བ་ཉ་གང་ནས། །"
    },
    {
      "bo": "ཆོས་ཀྱི་གཏེར་མཛོད་རྙེད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དབེན་པ་ཁོ་ནར་སྦས་ཀྱང་ལས་ཅན་རྣམས། །"
    },
    {
      "bo": "མཚོ་ལ་ངང་པ་ཇི་བཞིན་རིང་ནས་འདུ། །"
    },
    {
      "bo": "སྐལ་མེད་རྟག་ཏུ་བསྙེན་ཀྱང་མི་ཐུལ་ན། །"
    },
    {
      "bo": "མང་པོའི་ཚོགས་དཔོན་སྤངས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མནོག་ཆུང་ཚེ་འདིའི་ཕུན་ཚོགས་ལ་དམིགས་ནས། །"
    },
    {
      "bo": "འཇིག་རྟེན་ཆོས་དང་མཐུན་པར་མི་འཇུག་ཀྱང་། །"
    },
    {
      "bo": "རྣམ་ཐར་ངོ་ལྐོག་སྤངས་པའི་བརྟུལ་ཞུགས་ལ། །"
    },
    {
      "bo": "ས་ར་ཧ་པ་དགྱེས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བློ་སྣ་ཐུང་ཡང་བསྟན་འགྲོའི་དོན་ལ་བརྩོན། །"
    },
    {
      "bo": "ཡང་དག་ལམ་འཇུག་ཆོས་ཚུལ་ཙམ་མི་དམོད། །"
    },
    {
      "bo": "བསྟོད་བསྔགས་བཀུར་སྟིས་མི་ཁེངས་སྒྲོ་སྐུར་གྱིས། །"
    },
    {
      "bo": "འཇིགས་བྲལ་དཔའ་བོ་ཁྱེད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དད་གཤིན་རྫས་ལ་གཟི་བྱིན་མི་བསྒྲུབ་ཅིང་། །"
    },
    {
      "bo": "བཀའ་འགྱུར་ལ་སོགས་སྐུ་གསུང་ཐུགས་རྟེན་བསྐྲུན། །"
    },
    {
      "bo": "མེས་དབོན་གནས་ལ་ཁྲི་མཆོད་སྲོག་བསླུ་སོགས། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་སྦྱོར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཉམ་རྗེས་ཀུན་ཏུ་ཆགས་སྡང་རེ་དོགས་ཀྱིས། །"
    },
    {
      "bo": "ཁྱོད་སེམས་འཁྲུགས་པ་མ་ཡིན་དབང་པོ་ལ། །"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་མགོན་བཞུགས་པའི་བྱིན་རླབས་ཀྱིས། །"
    },
    {
      "bo": "འགྲོ་དོན་འཁོར་བ་དོང་སྤྲུགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ད་དུང་སེམས་ཅན་ཁམས་ནི་མ་རྫོགས་པར། །"
    },
    {
      "bo": "གཞན་དོན་འབྱུང་བ་བྱང་ཆུབ་སེམས་གཉིས་ཀྱི། །"
    },
    {
      "bo": "ཁྱད་ཆོས་བསླུ་བ་མེད་པ་ཡིན་པའི་ཕྱིར། །"
    },
    {
      "bo": "གདུལ་བྱར་མ་གྱུར་སེམས་ཅན་ཡོད་མིན་ཡང་། །"
    },
    {
      "bo": "སློབ་མར་གྱུར་ནས་དམ་ཚིག་དག་པ་དང་། །"
    },
    {
      "bo": "བཀའ་བཞིན་བསྒྲུབ་ནས་ཐུགས་ཡིད་འདྲེས་པ་རྣམས། །"
    },
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་འབྲལ་མེད་རྟེན་འབྲེལ་འགྲིག །"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བ་ཅན་དང་དབྱེར་མེད་ཤོག །"
    }
  ]
}