{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/drime-osal-lingpa/seeds-faith-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རིག་འཛིན་གཏེར་ཆེན་ལས་རབ་གླིང་པའི་གསོལ་འདེབས་དད་པའི་ས་བོན།"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།"
    },
    {
      "bo": "གངས་ལྗོངས་ལྷ་གཅིག་མངའ་བདག་ཁྲི་སྲོང་རྗེའི། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བློན་པོ་སྣ་ནམ་རིགས་སུ་འཁྲུངས། །"
    },
    {
      "bo": "སྐྱེ་མང་ཨོ་རྒྱེན་པད་མས་རྗེས་སུ་བཟུངས། །"
    },
    {
      "bo": "སྔགས་འཆང་རྡོ་རྗེ་བདུད་འཇོམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྱོད་ཉིད་རྒྱལ་བའི་ས་མཆོག་གྲུབ་བརྙེས་ཀྱང་། །"
    },
    {
      "bo": "གདུལ་བྱ་ཡལ་བ་མི་འདོར་རྗེས་བཟུང་ཕྱིར། །"
    },
    {
      "bo": "དངོས་གྲུབ་རྒྱལ་མཚན་ལེགས་ལྡན་པད་ཕྲིན་སོགས། །"
    },
    {
      "bo": "བསྟན་འགྲོའི་དཔལ་མགོན་བྱོན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྦས་ཡུལ་ཀོ་ས་ལ་ཡི་དབུ་རྩེའི་ཆར། །"
    },
    {
      "bo": "རབ་བྱུང་བཅུ་བཞི་མེ་ཕོ་འབྲུག་གི་ལོར། །"
    },
    {
      "bo": "སྤྲ་རིགས་ཞི་པའི་ཁྱིམ་དུ་སྐུ་སྐྱེ་བཞེས། །"
    },
    {
      "bo": "སྤྲུལ་སྐུ་བསོད་ནམས་རྒྱལ་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསྟན་པའི་སྒོར་ཞུགས་ཀློགས་བྲིས་ཐོགས་མེད་མཁྱེན། །"
    },
    {
      "bo": "དབེན་པའི་རི་ལ་གཟིམ་པའི་མནལ་ལམ་དུ། །"
    },
    {
      "bo": "སྔགས་བདག་རལ་གཅིག་མ་ཡི་ཞལ་བསྟན་ནས། །"
    },
    {
      "bo": "ཚེམ་དཀར་སྙིང་ལ་བཙུག་པའི་རྐྱེན་གྱིས་སྔངས། །"
    },
    {
      "bo": "སྐུ་ལ་བསྙུན་ཕོག་ཕ་ཁྱིམ་ཡུལ་སྤང་ནས། །"
    },
    {
      "bo": "གྲུབ་དབང་འཇའ་ལུས་པ་ཡི་ཆོས་སྒར་ཕེབས། །"
    },
    {
      "bo": "རྗེ་བཙུན་བཅོམ་ལྡན་རྡོ་རྗེའི་རྗེས་སུ་བཟུང་། །"
    },
    {
      "bo": "གདམས་པས་ཐུགས་རྒྱུད་གྲོལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྔོན་གྱིས་རིགས་སད་གཏེར་གྱི་སྲུང་མ་ཡིས། །"
    },
    {
      "bo": "གཏེར་སྒྲོམ་དངོས་སུ་ཕུལ་ཞིང་ཀཿཐོག་བྱོན། །"
    },
    {
      "bo": "གྲོ་ལོད་དངོས་སྣང་བསྟན་པའི་རྒྱལ་མཚན་སོགས། །"
    },
    {
      "bo": "སློབ་དཔོན་མང་བརྟེན་སྨིན་གྲོལ་དཔག་མེད་གསན། །"
    },
    {
      "bo": "ཤོག་སེར་ངོས་ལས་བརྡ་འབེབས་དཔག་མེད་གནང་། །"
    },
    {
      "bo": "གསང་བའི་རྒྱས་ཐབས་རང་ཉམས་རྩེ་གཅིག་བླང་། །"
    },
    {
      "bo": "གྲུབ་པའི་རྟགས་ཐོན་ལྷ་དང་གཉིས་སུ་མེད། །"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་ཁྱེད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཛཿཀར་ཕེབ་སྟེ་མཆོག་སྤྲུལ་རིན་པོ་ཆེར། །"
    },
    {
      "bo": "རྡོ་རྗེ་སྙིང་པོའི་ཟབ་ཁྲིད་རྒྱས་པ་གསན། །"
    },
    {
      "bo": "ལུང་རྟོགས་བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གཏུག །"
    },
    {
      "bo": "གདམས་པའི་བདུད་རྩི་བཞེས་ནས་མཁྱེན་རབ་རྫོགས། །"
    },
    {
      "bo": "འཇམ་དབྱངས་མཁྱེན་བརྩེ་བློ་གྲོས་མཐའ་ཡས་དང་། །"
    },
    {
      "bo": "འཇམ་དཔལ་རྡོ་རྗེ་ལ་སོགས་མཁས་གྲུབ་ལས། །"
    },
    {
      "bo": "སྨིན་གྲོལ་མཐའ་ཡས་གསན་བསམ་མཐར་ཕྱིན་མཛད། །"
    },
    {
      "bo": "མཁས་པའི་ཁྱུ་མཆོག་ཁྱོད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བོད་དང་བོད་ཆེན་ལྗོངས་དང་རྒྱ་སོགས་ཡུལ། །"
    },
    {
      "bo": "གནས་ཆེན་ཀུན་བྱོན་ལྷ་རྟེན་ཐམས་ཅད་ལ། །"
    },
    {
      "bo": "སྒྲུབ་དང་མཆོད་པ་ཕྱག་སྐོར་དུ་མ་མཛད། །"
    },
    {
      "bo": "ཟབ་གཏེར་མང་བཞེས་ཕྱོགས་མེད་སྐལ་ལྡན་ལ། །"
    },
    {
      "bo": "སྨིན་གྲོལ་དཔག་མེད་གནང་ཞིང་ཐར་ལམ་བཀོད། །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་ལ་སྨིན་པའི་མཛད་བཟང་གིས། །"
    },
    {
      "bo": "སྐུ་ཚེ་སྟོད་སྨད་ཀུན་ཏུ་འདའ་བར་མཛད། །"
    },
    {
      "bo": "རྨད་བྱུང་ཐུགས་རྗེ་ཅན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྩེ་གཅིག་ཕྱོགས་མེད་དབེན་རིར་བཞུགས་ནས་སུ། །"
    },
    {
      "bo": "ནང་གི་ཉམས་ལེན་དག་ལ་གཅིག་ཏུ་དྲིལ། །"
    },
    {
      "bo": "གཞན་གནོད་གཞི་དང་བཅས་པ་ཡང་སྤང་ཤིང་། །"
    },
    {
      "bo": "གཞན་ཕན་གང་འདུལ་ཐབས་མཁས་རྒྱུན་ཆད་མེད། །"
    },
    {
      "bo": "རིས་མེད་བསྟན་ལ་གུས་ཤིང་དག་སྣང་ཤར། །"
    },
    {
      "bo": "ཤེས་ལྡན་དག་ལ་ཕྱི་ནང་ཆོས་ཀུན་གྱི། །"
    },
    {
      "bo": "སྒྲོ་གླེང་ཞིབ་མོའི་བསྟན་པའི་གསལ་བྱེད་སྦར། །"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་འཛིན་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་ལ་ཆགས་ཐོགས་སྒྲིབ་པ་བྲལ། །"
    },
    {
      "bo": "བར་མེད་ཉིན་མཚན་འོད་གསལ་འཁོར་ཡུག་འདྲེས། །"
    },
    {
      "bo": "གྲུབ་པའི་རྟགས་སུ་མར་མེ་རང་འབར་དང་། །"
    },
    {
      "bo": "སྒྲུབ་གཏོར་ལྷ་ཕུར་བདུད་རྩིའི་ཆར་ཆེན་གཡོ། །"
    },
    {
      "bo": "རིང་བའི་ས་གནད་ཏིང་འཛིན་མཐུ་ཡིས་གསོལ། །"
    },
    {
      "bo": "ཟབ་གཏེར་སྦས་འདོན་སྲུང་མར་བཅོལ་བས་གྲུབ། །"
    },
    {
      "bo": "གཞན་སེམས་ཤེས་སོགས་མངོན་པ་བཀྲ་ནའང་། །"
    },
    {
      "bo": "ཡོན་ཏན་ངོམ་མེད་སྦས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐུ་ཚེ་རིལ་པོར་བསྟན་འགྲོའི་དོན་ལ་བརྩོན། །"
    },
    {
      "bo": "རྒྱལ་བའི་སྐུ་གསུང་ཐུགས་རྟེན་དཔག་མེད་བཀྲུན། །"
    },
    {
      "bo": "གང་འདུལ་ཐབས་ཀྱི་རོལ་རྩེད་སྣ་ཚོགས་སྟོན། །"
    },
    {
      "bo": "དག་པའི་སྣང་བས་ལྷ་དང་བླ་མ་མཇལ། །"
    },
    {
      "bo": "སྙེན་རྒྱུད་སྨིན་གྲོལ་དག་སྣང་མང་པོ་ཐོབ། །"
    },
    {
      "bo": "ས་གཏེར་དགོངས་གཏེར་ཆོས་ཀྱི་སྒོ་ཆེན་ཕྱེས། །"
    },
    {
      "bo": "མཛད་ཕྲིན་ནམ་མཁའ་མཉམ་པའི་ཕྲིན་ལས་བརྡལ། །"
    },
    {
      "bo": "ཕྲིན་ལས་འགྲོ་འདུལ་རྩལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ལྟར་ནམ་མཁའ་མཉམ་པའི་ཕྲིན་ལས་བཅས། །"
    },
    {
      "bo": "རྟག་འཛིན་ཅན་རྣམས་ཆོས་ལ་བསྐུལ་བའི་སླད། །"
    },
    {
      "bo": "རབ་བྱུང་བཅོ་ལྔ་མེ་སྟག་ཟླ་ཚེས་ལ། །"
    },
    {
      "bo": "སྐུ་ལུས་དྲང་པོར་བཞུགས་བཞིན་གཞན་དོན་གཤེགས། །"
    },
    {
      "bo": "སྐུ་ལས་གདུང་རིགས་ལྔ་བྱོན་རྫོགས་སངས་རྒྱས། །"
    },
    {
      "bo": "སྲིད་པའི་འགྲོ་ཀུན་ཐུགས་རྗེས་མི་གཏོང་བའི། །"
    },
    {
      "bo": "ཡང་སྲིད་ཟུང་ཅིག་འབྱོན་པའི་བཀའ་ལུང་གསལ། །"
    },
    {
      "bo": "མངོན་རྫོགས་སྟོན་པ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་མཐུ་བྱིན་གྱིས། །"
    },
    {
      "bo": "ཡང་སའི་རྒྱལ་ཁམས་བསྟན་འགྲོ་མི་ཉམས་འཕེལ། །"
    },
    {
      "bo": "བདག་དང་མར་གྱུར་འགྲོ་བ་རིས་མེད་པའི། །"
    },
    {
      "bo": "ལས་སྒྲིབ་ཀུན་བྱང་རྗེ་བཙུན་ཁྱེད་ཉིད་དང་། །"
    },
    {
      "bo": "ནམ་ཡང་འབྲལ་མེད་གདམས་པའི་སྣོད་གྱུར་ཏེ། །"
    },
    {
      "bo": "རྗེས་སུ་འཛིན་ཅིང་བྱིན་གྱིས་རླབས་དུ་གསོལ། །"
    },
    {
      "bo": "ལྷ་གཅིག་ཁྱེད་དང་དབྱེར་མེད་གྱུར་ནས་སུ། །"
    },
    {
      "bo": "ནམ་མཁའ་མཉམ་པའི་འགྲོ་རྣམས་སྒྲོལ་ནུས་ཤོག །"
    }
  ]
}