{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/amitayus-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཚེ་དཔག་གསོལ་འདེབས།",
    "en": "Prayer to Amitāyus"
  },
  "text": [
    {
      "bo": "འཇིག་རྟེན་འདྲེན་པའི་གཙོ་བོ་ཚེ་དཔག་མེད།    །",
      "en": "Infinite Life, foremost guide for beings in this world,",
      "en-trans": "jikten drenpé tsowo tsepakmé"
    },
    {
      "bo": "དུས་མིན་འཆི་བ་མ་ལུས་འཇོམས་མཛད་པ།    །",
      "en": "You are the one who overcomes all untimely death,",
      "en-trans": "dümin chiwa malü jom dzepa"
    },
    {
      "bo": "མགོན་མེད་སྡུག་བསྔལ་གྱུར་པ་རྣམས་ཀྱི་སྐྱབས།    །",
      "en": "A refuge for those who suffer without protection—",
      "en-trans": "gönmé dukngal gyurpa nam kyi kyab"
    },
    {
      "bo": "སངས་རྒྱས་ཚེ་དཔག་མེད་ལ་ཕྱག་འཚལ་བསྟོད།    །",
      "en": "Buddha Amitāyus, homage and praise to you!",
      "en-trans": "sangye tsepakmé la chaktsal tö"
    },
    {
      "bo": "ཀུན་ནས་ཀུན་ཏུ་འོད་ཟེར་རབ་འབར་ཞིང་།    །",
      "en": "Everywhere ablaze with everlasting radiance,",
      "en-trans": "künné küntu özer rab bar zhing"
    },
    {
      "bo": "ཚེ་དང་ཡེ་ཤེས་དཔག་མེད་སྩོལ་མཛད་པ།    །",
      "en": "You bestow boundless life and boundless wisdom.",
      "en-trans": "tsé dang yeshe pakmé tsol dzepa"
    },
    {
      "bo": "དྲན་པས་དུས་མིན་འཆི་བའི་འཇིགས་པ་འཇོམས།    །",
      "en": "The thought of you dispels the fear of untimely death.",
      "en-trans": "drenpé dümin chiwé jikpa jom"
    },
    {
      "bo": "བཅོམ་ལྡན་ཚེ་དཔག་མེད་ལ་ཕྱག་འཚལ་བསྟོད།    །",
      "en": "Bhagavān Amitāyus, homage and praise to you!",
      "en-trans": "chomden tsepakmé la chaktsal tö"
    },
    {
      "bo": "ཁྱོད་སྐུ་པདྨ་རཱ་གའི་ལྷུན་པོ་ལ།    །",
      "en": "Your form is resplendent, like a mountain of ruby",
      "en-trans": "khyö ku pema ragé lhünpo la"
    },
    {
      "bo": "ཉིན་བྱེད་སྟོང་གིས་འཁྱུད་པའི་གཟི་བརྗིད་ཅན།    །",
      "en": "Held in the light of a thousand suns,",
      "en-trans": "nyinjé tong gi khyüpé ziji chen"
    },
    {
      "bo": "མཚན་དང་དཔེ་བྱད་མེ་ཏོག་རྣམ་པར་བཀྲ།    །",
      "en": "And strewn with the vivid flowers of the signs and marks.",
      "en-trans": "tsen dang pejé metok nampar tra"
    },
    {
      "bo": "སྣང་མཐའ་ཚེ་དཔག་མེད་ལ་ཕྱག་འཚལ་བསྟོད།    །",
      "en": "Amitāyus of Boundless Light, homage and praise to you!",
      "en-trans": "nangta tsepakmé la chaktsal tö"
    },
    {
      "bo": "གསུང་དབྱངས་ཡན་ལག་དྲུག་ཅུའི་སྒྲ་སྒྲོགས་ཤིང་།    །",
      "en": "Your speech resounds with sixty melodious tones,",
      "en-trans": "sung yang yenlak drukchü dra drok shing"
    },
    {
      "bo": "མཐའ་ཡས་ཞིང་ན་གསུང་གཅིག་གིས་ཁྱབ་པ།    །",
      "en": "A single voice extending through infinite realms.",
      "en-trans": "tayé zhing na sung chik gi khyabpa"
    },
    {
      "bo": "ཟད་མི་ཤེས་པའི་གསུང་མཐའ་ཡས་པའི་བདག  །",
      "en": "Master of limitless and inexhaustible discourse,",
      "en-trans": "zé mishepé sung tayepé dak"
    },
    {
      "bo": "གསུང་གི་རྡོ་རྗེ་ཚེ་མཐའ་ཡས་ལ་བསྟོད།    །",
      "en": "Amitāyus of Vajra Speech, to you I offer praise.",
      "en-trans": "sung gi dorjé tsé tayé la tö"
    },
    {
      "bo": "ཏིང་འཛིན་རྒྱ་མཚོར་འཇུག་ཅིང་ལྡང་བ་དང་།    །",
      "en": "You enter and arise from an ocean of samādhi,",
      "en-trans": "tingdzin gyatsor juk ching dangwa dang"
    },
    {
      "bo": "སྟོབས་བཅུའི་དབང་ཕྱུག་སྒྲིབ་པ་ཀུན་ལས་གྲོལ།    །",
      "en": "Master of the ten powers freed from every veil,",
      "en-trans": "tob chü wangchuk dribpa kün lé drol"
    },
    {
      "bo": "ཡེ་ཤེས་རྒྱ་མཚོ་ལྷུན་གྱིས་གྲུབ་པ་ཡི།    །",
      "en": "Your oceanic wisdom spontaneously present,",
      "en-trans": "yeshe gyatso lhüngyi drubpa yi"
    },
    {
      "bo": "མགོན་པོ་འོད་སྣང་ཕ་མཐའ་ཡས་ལ་བསྟོད།    །",
      "en": "Lord of Boundless Radiance, to you I offer praise.",
      "en-trans": "gönpo önang pata yé la tö"
    },
    {
      "bo": "ཞིང་དང་གཞལ་ཡས་བཀོད་པ་མཐའ་ཡས་ཤིང་།    །",
      "en": "In immense palaces within infinite realms you preside",
      "en-trans": "zhing dang zhalyé köpa tayé shing"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་རྒྱལ་དང་དེ་སྲས་ཚོགས་ཀྱིས་དབུས།    །",
      "en": "Amidst the buddhas and their heirs from every direction,",
      "en-trans": "chok chü gyal dang dé sé tsok kyi ü"
    },
    {
      "bo": "ལྷན་ཅིག་ཐེག་ཆེན་ཆོས་ལ་ལོངས་སྤྱོད་ཅིང་།    །",
      "en": "As you savour together the Dharma of the Great Vehicle.",
      "en-trans": "lhenchik tekchen chö la longchö ching"
    },
    {
      "bo": "རིན་ཆེན་གཟི་བརྗིད་རྒྱལ་པོ་ཁྱོད་ལ་བསྟོད།    །",
      "en": "King of Jewel-like Brilliance, to you I offer praise.",
      "en-trans": "rinchen ziji gyalpo khyö la tö"
    },
    {
      "bo": "ཕྲིན་ལས་འཛད་མེད་ནམ་མཁའི་མཐའ་དང་མཉམ།    །",
      "en": "Your activity is unending, equal to space itself,",
      "en-trans": "trinlé dzemé namkhé ta dang nyam"
    },
    {
      "bo": "གདུལ་བྱ་རྒྱ་མཚོ་སྨིན་ཅིང་གྲོལ་བར་མཛད།    །",
      "en": "You ripen and liberate oceans of disciples.",
      "en-trans": "dulja gyatso min ching drolwar dzé"
    },
    {
      "bo": "རྣམ་འཕྲུལ་མཐའ་ཡས་བདེ་ལྡན་ཞིང་གི་མགོན།    །",
      "en": "Your emanations are limitless, lord of the blissful realm,",
      "en-trans": "namtrul tayé deden zhing gi gön"
    },
    {
      "bo": "མཛད་པ་དཔག་མེད་ཚེ་མཐའ་ཡས་ལ་བསྟོད།",
      "en": "Amitāyus of Infinite Deeds, to you I offer praise.",
      "en-trans": "dzepa pakmé tsé tayé la tö"
    },
    {
      "bo": "དེ་ལྟར་བསྟོད་པས་དུས་མིན་འཆི་བ་ཞི།    །",
      "en": "Through praising you in this way, may untimely death be pacified,",
      "en-trans": "detar töpé dümin chiwa zhi"
    },
    {
      "bo": "སྒོ་གསུམ་རྡོ་རྗེ་གསུམ་དུ་རབ་གྲུབ་ནས།    །",
      "en": "And, having fully actualized the three doors as the three vajras,",
      "en-trans": "go sum dorjé sum du rab drub né"
    },
    {
      "bo": "ཚེ་སྲོག་མི་ཤིག་རྡོ་རྗེའི་ལྕགས་སྡོང་ཚུགས།    །",
      "en": "May I plant the iron tree of indestructible, vajra-like vitality",
      "en-trans": "tsesok mi shik dorjé chak dong tsuk"
    },
    {
      "bo": "རྡོ་རྗེ་ཚེ་དཔག་མེད་མགོན་འགྲུབ་པར་ཤོག  །",
      "en": "And attain the level of the protector Vajra Amitāyus.",
      "en-trans": "dorjé tsepakmé gön drubpar shok"
    }
  ]
}