{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/samten-lingpa/prayer-lives-and-liberation-of-mandarava",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "ཌཱ་ཀིའི་གཙོ་མོ་མནྡྷ་ར་བའི་རྣམ་ཐར་གསོལ་འདེབས། །",
    "en": "A Prayer Recounting the Lives and Liberation of the Exalted Ḍākinī Mandāravā1"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔ སྔོན་ཚེ་བསྐལ་པ་སྣང་བྱེད་རྒྱལ་པོ་ནི༔",
      "en": "Emaho! Previously, in the aeon of the Illuminating King Bhāskara,",
      "en-trans": "emaho ngöntsé kalpa nangjé gyalpo ni"
    },
    {
      "bo": "དབང་ཕྱུག་ལྷ་ཡི་སྲས་མོ་གོས་དཀར་མོ༔",
      "en": "You were Pāṇḍarāvasinī, Clad in White—Iśvara’s divine daughter, .",
      "en-trans": "wangchuk lha yi semo gökarmo"
    },
    {
      "bo": "ལམ་སྦྱངས་འཁོར་བ་སྤངས་ནས་མངོན་སངས་རྒྱས༔",
      "en": "Training on the path, you renounced saṃsāra and attained true awakening.",
      "en-trans": "lam jang khorwa pang né ngön sangye"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "དེ་འོག་བསྐལ་པ་རིན་ཆེན་བརྡལ་བ་ན༔",
      "en": "Later, in the aeon of All-Pervading Jewels2,",
      "en-trans": "dé ok kalpa rinchen dalwa na"
    },
    {
      "bo": "བྲམ་ཟེའི་རྒྱལ་རིགས་སྲས་མོ་གར་དབང་སྤྲུལ༔",
      "en": "You were born into the royal Brahmin class as Princess Nāṭyeśvarī, Lady of Dance.",
      "en-trans": "dramzé gyalrik semo gar wang trul"
    },
    {
      "bo": "ཉི་མའི་སྙིང་པོའི་རྒྱལ་སྲིད་ཆོས་ལ་བཀོད༔",
      "en": "You established the kingdom of Sūryagarbha in the Dharma.",
      "en-trans": "nyimé nyingpö gyalsi chö la kö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "བསྐལ་པ་སྒྲོན་མེད་གསེར་ཐུབ་བསྟན་པ་ལ༔",
      "en": "In the bright eon of Kanakamuni,",
      "en-trans": "kalpa drönmé sertub tenpa la"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་རྣམས་ཀྱིས་བྱིན་བརླབས་ནས༔",
      "en": "Blessed by the buddhas of past, present and future,",
      "en-trans": "dü sum gyalwa nam kyi jinlab né"
    },
    {
      "bo": "སྐུ་ལྔའི་རང་བཞིན་གདུལ་བྱའི་གླིང་ལྔར་སྤྲོས༔",
      "en": "You manifested five embodiments to tame beings on all five continents.",
      "en-trans": "ku ngé rangzhin duljé ling ngar trö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "དབང་ཆེན་ཡབ་ཡུམ་སྲས་མོར་སྐུ་འཁྲུངས་ནས༔",
      "en": "Taking birth as the Princess Maheśvara and consort,",
      "en-trans": "wangchen yabyum semor ku trung né"
    },
    {
      "bo": "འོད་ཟེར་སྣང་བརྒྱན་ཞེས་གྱུར་རྒྱ་གར་གྱི༔",
      "en": "You were called Adorning Light3.",
      "en-trans": "özer nang gyen zhé gyur gyagar gyi"
    },
    {
      "bo": "ཀ་ཎི་ཀ་ཡི་ཡུལ་ཁམས་ཆོས་ལ་བཀོད༔",
      "en": "The Indian kingdom of Kaṇika was established in the Dharma.",
      "en-trans": "ka ni ka yi yul kham chö la kö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "འཕགས་པས་བྱིན་བརླབས་མུན་གླིང་ཌཱ་མ་རུར༔",
      "en": "Blessed by the Āryas, in the dark land of Ḍāmaru,",
      "en-trans": "pakpé jinlab mün ling da ma rur"
    },
    {
      "bo": "པདྨ་སྐྱེས་སྤྲུལ་རྟ་མགྲིན་གྲོགས་སུ་བཀུག༔",
      "en": "You manifested from a lotus and summoned Hayagrīva.",
      "en-trans": "pema kyé trul tamdrin drok su kuk"
    },
    {
      "bo": "ཞི་དང་དྲག་པོས་རྒྱལ་ཁམས་དཀར་པོར་བསྒྱུར༔",
      "en": "Through peaceful and wrathful means, the kingdom became virtuous.",
      "en-trans": "zhi dang drakpö gyalkham karpor gyur"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ལྷ་ཡུལ་བརྒྱ་བྱིན་གནས་སུ་ཀཾ་ཀ་རི༔",
      "en": "In the abode of the god Indra, in Kaṅkari,",
      "en-trans": "lha yul gyajin né su kam ka ri"
    },
    {
      "bo": "དམ་པ་ཏོག་དཀར་མར་གྱུར་ལྷ་མིན་དཔུང་ཚོགས་བརྟུལ༔",
      "en": "You were the mother of Sacred White Zenith4and you tamed the asura hordes.",
      "en-trans": "dampa tok kar mar gyur lhamin pungtsok tul"
    },
    {
      "bo": "གཡུལ་འཇོམས་ཞེས་གྲགས་ལྷ་ཁམས་སངས་རྒྱས་བསྒྱུར༔",
      "en": "You were famed as The Vanquisher, as the god realms entered the Buddhist path.",
      "en-trans": "yul jom zhé drak lha kham sangye gyur"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "འོག་ཕྱོགས་རི་བོ་ནོར་བུའི་རྩེ་མོ་རུ༔",
      "en": "In the lower world, on the peak of a mountain of jewels,",
      "en-trans": "okchok riwo norbü tsemo ru"
    },
    {
      "bo": "ཀླུ་མོར་སྤྲུལ་ཏེ་ཀླུ་ཡི་ནད་ཀུན་བསལ༔",
      "en": "You emanated as a nāginī to dispel disease among the nāgas.",
      "en-trans": "lumor trul té lu yi né kün sal"
    },
    {
      "bo": "དྷརྨིན་དྲ་ཞེས་ཀླུ་རྣམས་བྱང་ཆུབ་བཀོད༔",
      "en": "Known then as Dharmendrā, Lady of Justice, you placed the nāgas on the path of enlightenment.",
      "en-trans": "dhar min dra zhé lu nam changchub kö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ལྷ་མིན་སྲས་མོར་སྤྲུལ་པའི་དཔུང་ཚོགས་ཀུན༔",
      "en": "In your emanation as an asura princess,",
      "en-trans": "lhamin semor trulpé pungtsok kün"
    },
    {
      "bo": "གདུག་པའི་ཕྲག་དོག་ཐུལ་བས་ཀུན་བཟང་མོར༔",
      "en": "You tamed the hordes of jealous asuras.",
      "en-trans": "dukpé trakdok tulwé kunzang mor"
    },
    {
      "bo": "གྲགས་ཏེ་ལྷ་མིན་བདུད་ཚོགས་སྨིན་གྲོལ་བཀོད༔",
      "en": "Known as Samantabhadrī, All-Perfect Lady, you ripened the demon asuras and assured their liberation.",
      "en-trans": "drak té lhamin dü tsok mindrol kö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "འོད་སྲུང་དྲུང་དུ་བྱང་ཆུབ་མཆོག་བརྙེས་པ༔",
      "en": "Before Buddha Kāśyapa, you attained supreme awakening.",
      "en-trans": "ösung drung du changchub chok nyepa"
    },
    {
      "bo": "རྒྱལ་པོ་བདེ་སྐྱོང་སྲས་མོར་དཔལ་མཚོར་སྤྲུལ༔",
      "en": "Emanating as Śrī Sāgarā, Glorious Ocean—daughter of King Sukhapāla, Protector of Bliss—",
      "en-trans": "gyalpo dekyong semor pal tsor trul"
    },
    {
      "bo": "དགེ་སློང་མ་ནི་འབུམ་ཕྲག་རྫོགས་བྱང་ཐོབ༔",
      "en": "You brought hundreds of thousands of nuns to perfect awakening.",
      "en-trans": "gelongma ni bumtrak dzok jang tob"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཤཱཀ་ཐུབ་བསྟན་པར་སྤྲུལ་པ་ཉི་ཤུ་ལྔ༔",
      "en": "At the time of Buddha Śākyamuni’s teachings, you manifested twenty-five emanations;",
      "en-trans": "shakya tubten par trulpa nyishu nga"
    },
    {
      "bo": "དེ་ལས་ཡང་སྤྲུལ་བསམ་མི་ཁྱབ་པར་མཛད༔",
      "en": "Your re-emanations were inconceivable, defying the imagination.",
      "en-trans": "dé lé yangtrul sam mi khyabpar dzé"
    },
    {
      "bo": "གསང་སྔགས་ཐེག་པའི་གྲོལ་ལམ་སྒོ་ཀུན་ཕྱེས༔",
      "en": "You flung wide every door to the Secret Mantra’s path of liberation.",
      "en-trans": "sang ngak tekpé drollam go kün ché"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "དེ་ནས་ནུབ་ཕྱོགས་བདེ་ཆེན་ཞིང་ཁམས་ནས༔",
      "en": "Then, from the western buddhafield, Sukhāvatī, realm of great bliss,",
      "en-trans": "dené nubchok dechen zhingkham né"
    },
    {
      "bo": "གསང་སྔགས་སྟོན་པ་བྱེ་བ་ཕྲག་འབུམ་སྤྲུལ༔",
      "en": "You emanated Secret Mantra teachers by the trillion.",
      "en-trans": "sang ngak tönpa jewa trak bum trul"
    },
    {
      "bo": "དེ་དང་མཉམ་པའི་མཁའ་འགྲོའི་སྐུ་རེ་སྤྲུལ༔",
      "en": "And to accompany each of these you sent your ḍākinī emanations.",
      "en-trans": "dé dang nyampé khandrö ku ré trul"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཚེ་དཔག་ཡུམ་མཆོག་གོས་དཀར་གནས་ལྔའི་འོད༔",
      "en": "From the five places of Pāṇḍarāvasinī, supreme consort of Amitāyus,",
      "en-trans": "tsé pak yum chok gö kar né ngé ö"
    },
    {
      "bo": "ཞིང་ཁམས་ཀུན་སྤྲོས་དབྱིངས་ཕྱུག་རིགས་ལྔའི་སྤྲུལ༔",
      "en": "Light flooded the pure realms as the fivefold form of Dhātviśvarī, Queen of Space.",
      "en-trans": "zhingkham kün trö yingchuk rik ngé trul"
    },
    {
      "bo": "བྱིན་བརླབས་ཧྲཱིཿཡིག་ཟ་ཧོར་ཡུལ་དུ་འཕྲོས༔",
      "en": "Blessings in the form of the syllable hrīḥ streamed into the country of Zahor.",
      "en-trans": "jinlab hrih yik zahor yul du trö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཡབ་ཡུམ་གཟིགས་སྣང་རྨི་ལམ་ངོ་མཚར་བལྟས༔",
      "en": "Your father and mother had marvelous dreams,",
      "en-trans": "yabyum zik nang milam ngotsar té"
    },
    {
      "bo": "བསམ་མི་ཁྱབ་པ་ཤིང་ཕོ་རྟ་ཟླ་ཡི༔",
      "en": "And incredibly—in the year of the male wood-horse, on the tenth of the month—",
      "en-trans": "sam mi khyabpa shing po ta da yi"
    },
    {
      "bo": "ཚེས་བཅུར་སྐུ་འཁྲུངས་ཞལ་ནས་དབྱངས་གསལ་སྒྲོགས༔",
      "en": "You were born reciting the alphabet.",
      "en-trans": "tsé chur ku trung zhal né yangsal drok"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "འཁྲུངས་མ་ཐག་ནས་ཡབ་ཡུམ་དྲིན་ཕྱག་འཚལ༔",
      "en": "As soon as you took birth, you prostrated to your kind parents.",
      "en-trans": "trung ma tak né yabyum drin chaktsal"
    },
    {
      "bo": "སྙན་པའི་ཀླུ་ཡིས་འཁོར་བར་དགྱེས་པར་སྐྱེད༔",
      "en": "You sang sweet songs, bringing joy to everyone gathered there.",
      "en-trans": "nyenpé lu yi khorwar gyepar kyé"
    },
    {
      "bo": "ལྷ་ཡི་ཁྲུས་གསོལ་སྙན་པས་འཇིག་རྟེན་ཁྱབ༔",
      "en": "The gods came to bathe you, and your fame resounded throughout the world.",
      "en-trans": "lha yi trü sol nyenpé jikten khyab"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "སྐྱེ་རྒ་ན་འཆིའི་སྡུག་བསྔལ་གཟིགས་པ་ཡིས༔",
      "en": "You saw the sufferings of birth, old age, sickness, and death.",
      "en-trans": "kyé ga na chi dukngal zikpa yi"
    },
    {
      "bo": "སྐྱོ་ཤས་དྲག་པོས་འཁོར་བར་བློ་ལྡོག་སྟེ༔",
      "en": "Intense weariness arose in you, and your mind turned from saṃsāra.",
      "en-trans": "kyoshé drakpö khorwar lo dok té"
    },
    {
      "bo": "དམ་ཆོས་རིག་པའི་གནས་ལྔར་མཁས་པར་སྦྱངས༔",
      "en": "You excelled in your studies of the five sciences and the sacred Dharma.",
      "en-trans": "damchö rigpé né ngar khepar jang"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "སློབ་དཔོན་དྲི་མེད་ཕག་མོས་ལུང་བསྟན་བཞིན༔",
      "en": "As foretold by the prophecies of Ācārya Vimala and Vajravārāhī,",
      "en-trans": "lobpön drimé pak mö lungten zhin"
    },
    {
      "bo": "གོ་ཏ་མ་ཡི་མུ་སྟེགས་ཁྱབ་བསལ་དུ༔",
      "en": "You debated with the tīrthika named Gautama, Refuter of All5.",
      "en-trans": "go ta ma yi mutek khyab sal du"
    },
    {
      "bo": "རྩོད་པ་འགྲན་པས་མུ་སྟེགས་རྒོལ་བ་བཅོམ༔",
      "en": "Soundly you defeated him and your other opponents.",
      "en-trans": "tsöpa drenpé mutek golwa chom"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཟ་ཧོར་བུ་མོ་སུམ་བརྒྱ་ཆོས་ལ་བསྐུལ༔",
      "en": "In Zahor, you led three hundred women to the Dharma,",
      "en-trans": "zahor bumo sumgya chö la kul"
    },
    {
      "bo": "དཔལ་སྡེ་ཚེ་འདས་ཡབ་ཡུམ་སྡུག་བསྔལ་བསལ༔",
      "en": "You dispelled the suffering of the king and queen at the death of Prince Śrīsena,",
      "en-trans": "pal dé tsedé yabyum dukngal sal"
    },
    {
      "bo": "བྲམ་ཟེའི་ཤ་རྙེད་རྟེན་གྱི་གཙོ་བོར་བཟུང་༔",
      "en": "And you found Brahmin flesh—which you kept as a sacred substance.",
      "en-trans": "dramzé sha nyé ten gyi tsowor zung"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "བེ་ཏ་ཟ་ཧོར་འཁྲུགས་པ་ཐབས་ཀྱིས་བསྡུམ༔",
      "en": "You reconciled the warring factions in Vedalī and Zahor.",
      "en-trans": "bé ta zahor trukpa tab kyi dum"
    },
    {
      "bo": "གོས་དཀར་ལུང་བསྟན་འཁོར་གཡོག་ཆོས་ལ་བཙུད༔",
      "en": "You established the people in the Dharma, as Pāṇḍarāvasinī had predicted.",
      "en-trans": "gö kar lungten khoryok chö la tsü"
    },
    {
      "bo": "འཁོར་བར་སྐྱོ་བའི་ཐུགས་བསྐྱེད་སྨོན་ལམ་བཏབ༔",
      "en": "Weary of saṃsāra, you made prayers and aspirations.",
      "en-trans": "khorwar kyowé tukkyé mönlam tab"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཕྱོགས་ཀྱི་མཉེ་མོ་སློང་ཏེ་ཡབ་དང་བསྒྲོས༔",
      "en": "When discussing with your father the requests for your hand in marriage,",
      "en-trans": "chok kyi nyemo long té yab dang drö"
    },
    {
      "bo": "འཁོར་བར་མི་ཆགས་རྡོར་སེམས་ལུང་བསྟན་ཐོབ༔",
      "en": "You had already abandoned saṃsāra, and you received a prophecy from Vajrasattva.",
      "en-trans": "khorwar mi chak dorsem lungten tob"
    },
    {
      "bo": "ཐབས་ཀྱི་བྲོས་ཏེ་མཁན་པོར་རབ་ཏུ་བྱུང་༔",
      "en": "With great skill you escaped and took ordination from the abbot Śāntarakṣita.",
      "en-trans": "tab kyi drö té khenpor rabtu jung"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "མདོ་ཆོས་ཀུན་སྦྱངས་ཁོལ་མོ་ལྔ་བརྒྱ་བཅས༔",
      "en": "You became learned in the Dharma of sūtra and, with five hundred attendants,",
      "en-trans": "do chö kün jang kholmo ngabgya ché"
    },
    {
      "bo": "ཀུན་དགའ་ར་བར་སྡེ་སྣོད་འཆད་སྤེལ་མཛད༔",
      "en": "You expounded the tripiṭaka within the confines of a nunnery.",
      "en-trans": "kün ga rawar denö ché pel dzé"
    },
    {
      "bo": "པད་འབྱུང་སྤྲུལ་པས་བྱིན་བརླབས་ལུང་བསྟན་ཐོབ༔",
      "en": "You then received blessings and prophecies from Padmākara.",
      "en-trans": "pejung trulpé jinlab lungten tob"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "སྐྱོ་སངས་བྱོན་པས་ཨོ་རྒྱན་དངོས་དང་མཇལ༔",
      "en": "Out among the flowers, you met the master of Uḍḍiyāna.",
      "en-trans": "kyo sang jönpé orgyen ngö dang jal"
    },
    {
      "bo": "གདན་དྲངས་ཆོས་ཞུས་ཚེ་ན་བ་རྫིས་མཐོང་།",
      "en": "Leading him to his throne, you requested the Dharma.",
      "en-trans": "dendrang chö zhü tsé nawa dzi tong"
    },
    {
      "bo": "སྐུར་འདེབས་ལ་ཡོག་རྒྱལ་པོས་ཆད་པ་ཕོག༔",
      "en": "A cowherd noticed, and slander began to spread,And the king took action to have the two of you punished.",
      "en-trans": "kurdeb la yok gyalpö chepa pok"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "པད་འབྱུང་གསོན་བསྲེགས་ཞུས་ཀྱང་རྫུ་འཕྲུལ་བསྟན༔",
      "en": "They tried to burn Padmākara alive, but he thwarted them with miracles.",
      "en-trans": "pejung sön sek zhü kyang dzutrul ten"
    },
    {
      "bo": "རྒྱལ་བློན་གནོང་འགྱོད་ཡབ་ཡུམ་ལྷན་ཅིག་བཞུགས༔",
      "en": "Ashamed and sad, king and ministers repented,And the Guru was invited to live with the king and queen.",
      "en-trans": "gyal lön nonggyö yabyum lhenchik zhuk"
    },
    {
      "bo": "ཡབ་ཀྱིས་ཨོ་རྒྱན་ལྷ་ལྕམ་ཕུལ་བར་མཛད༔",
      "en": "Then, the king offered his daughter to the Master of Uḍḍiyāna.",
      "en-trans": "yab kyi orgyen lhacham pulwar dzé"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཟ་ཧོར་རྒྱལ་ཁམས་ཕོ་རྣམས་ཨོ་རྒྱན་བསྐོར༔",
      "en": "The men of Zahor became followers of Uḍḍiyāna’s master,",
      "en-trans": "zahor gyalkham po nam orgyen kor"
    },
    {
      "bo": "མོ་རྣམས་ལྷ་ལྕམ་ཆོས་བསྟན་ཐམས་ཅད་གྲོལ༔",
      "en": "And Mandāravā taught the Dharma to the women.",
      "en-trans": "mo nam lhacham chö ten tamché drol"
    },
    {
      "bo": "སློབ་དཔོན་གདམས་པས་ལྷ་ལྕམ་རབ་ཏུ་སྨིན༔",
      "en": "Thus all gained liberation—and you, through the Master’s instructions, reached perfect maturity.",
      "en-trans": "lobpön dampé lhacham rabtu min"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཆོས་བྲོས་བརྡ་ཆོས་མཐོང་ནས་པད་འབྱུང་དང་༔",
      "en": "You saw the signs that told you to escape and practice the Dharma,",
      "en-trans": "chö drö da chö tong né pejung dang"
    },
    {
      "bo": "ལྷན་ཅིག་བྲག་ཕུག་མཱ་ར་ཏི་ཀར་བྱོན༔",
      "en": "And together with Padmākara you left for Māratika Cave.",
      "en-trans": "lhenchik drakpuk ma ra tikar jön"
    },
    {
      "bo": "འཆི་མེད་ཚེ་ཡི་རིག་འཛིན་མངོན་དུ་བསྒྲུབ༔",
      "en": "There you accomplished immortality, vidyādhara mastery over life.",
      "en-trans": "chimé tsé yi rigdzin ngön du drub"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ཀོ་ཏ་ལ་ཡུལ་རྫུ་འཕྲུལ་ཐབས་ཀྱིས་བརྟུལ༔",
      "en": "In Kotala, you tamed beings by miraculous means,",
      "en-trans": "ko tala yul dzutrul tab kyi tul"
    },
    {
      "bo": "མུ་སྟེགས་སྟོན་པའི་མཐུ་ལས་རབ་ཏུ་རྒྱལ༔",
      "en": "Victorious, curtailing the powers of heretic teachers.",
      "en-trans": "mutek tönpé tu lerab tu gyal"
    },
    {
      "bo": "ཡོངས་འདུའི་ཚལ་དུ་བགེགས་ཚོགས་དམ་ལ་བཞག༔",
      "en": "In the Pārijāta grove you bound hordes of obstructors.",
      "en-trans": "yongdü tsal du gek tsok dam la zhak"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "པད་འབྱུང་ལུང་བསྟན་ཀོའུ་མ་རི་ལ་བྱོན༔",
      "en": "In line with Padmākara’s prophecy, you left for the mountains of Cāmara.",
      "en-trans": "pejung lungten ko'u ma ri la jön"
    },
    {
      "bo": "སྲིན་པོ་ཕོ་མོ་ཐམས་ཅད་ཆོས་ལ་བཀོད༔",
      "en": "There you led all the male and female demons to the Dharma.",
      "en-trans": "sinpo pomo tamché chö la kö"
    },
    {
      "bo": "འཇའ་ལུས་འགྲུབ་སྟེ་ཡུལ་ཁམས་སྟོང་པར་སྒྱུར༔",
      "en": "Each attained rainbow body, and the land was left empty.",
      "en-trans": "jalü drub té yul kham tongpar gyur"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "རྔམ་པ་ཚལ་ཆེན་ལ་སོགས་ཡུལ་ཆེན་བརྒྱད༔",
      "en": "In the Eight Great Places such as the Great Awe-Inspiring Grove,",
      "en-trans": "ngampa tsal chen lasok yul chen gyé"
    },
    {
      "bo": "ཀཱི་ལ་སྒྲོགས་སོགས་ཡུལ་ཆུང་བརྒྱད་རྣམས་སུ༔",
      "en": "And in the Eight Lesser Lands such as the one renowned as Kīla,",
      "en-trans": "ki la drok sok yul chung gyé nam su"
    },
    {
      "bo": "སྐུ་ཡི་རྫུ་འཕྲུལ་ཆེ་བརྒྱད་ཆུང་བརྒྱད་བསྟན༔",
      "en": "You revealed your miraculous emanations – eight major and eight minor.",
      "en-trans": "ku yi dzutrul ché gyé chung gyé ten"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "དེ་ནས་པད་འབྱུང་ཡབ་ཡུམ་ལྷན་ཅིག་ཏུ༔",
      "en": "Then, together with Guru Padmākara, you traveled to the land of Uḍḍiyāna,",
      "en-trans": "dené pejung yabyum lhenchik tu"
    },
    {
      "bo": "ཨོ་རྒྱན་ཡུལ་བྱོན་ལོག་ལྟ་ཐབས་ཀྱིས་བསྣུབས༔",
      "en": "Crushing those of wrong view through skillful means.",
      "en-trans": "orgyen yul jön lokta tab kyi nub"
    },
    {
      "bo": "ཆོས་འཁོར་བསྐོར་བས་ལྷག་མེད་འཇའ་སྐུར་གྲོལ༔",
      "en": "You turned the wheel of Dharma, and all without exception were liberated into rainbow body.",
      "en-trans": "chökhor korwé lhakmé ja kur drol"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "གུ་རུའི་ལུང་བསྟན་ཤམ་བྷ་ལ་རུ་བྱོན༔",
      "en": "Following the Guru’s prophecy you traveled to Śambhala,",
      "en-trans": "gurü lungten sham bha la ru jön"
    },
    {
      "bo": "གླིང་ཆེན་ཉེར་ལྔ་རྫུ་འཕྲུལ་ཁོ་ནས་བརྟུལ༔",
      "en": "Taming the beings of the twenty-five lands solely through miracles.",
      "en-trans": "ling chen nyernga dzutrul khoné tul"
    },
    {
      "bo": "སྐལ་ལྡན་འབུམ་ཕྲག་བཅུ་གསུམ་འཇའ་སྐུར་གྲོལ༔",
      "en": "In this way, fortunate beings—one million and three hundred thousand—were liberated into rainbow body.",
      "en-trans": "kalden bumtrak chusum ja kur drol"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "དེ་ནས་བྷེ་བྱེད་གཡའ་རིའི་རྩེ་མོར་བྱོན༔",
      "en": "Next, you left for Bhejé, to Slate Rock mountain peak,",
      "en-trans": "dené bhé jé ya ri tsemor jön"
    },
    {
      "bo": "གདམས་པ་ལྷག་མ་མ་ལུས་རྫོགས་པར་གནང་༔",
      "en": "Where the remaining instructions in their entirety were bestowed to perfection.",
      "en-trans": "dampa lhakma malü dzokpar nang"
    },
    {
      "bo": "སྤྲུལ་པའི་ཨུཏྤལ་དཀར་དམར་བལ་བོད་སྤྲོས༔",
      "en": "Then, in Nepal and Tibet, you came as a red-white utpala flower.",
      "en-trans": "trulpé utpal kar mar bal bö trö"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "ལྷག་མེད་འཇའ་སྐུར་ནམ་མཁའི་ཀློང་དུ་ཡལ༔",
      "en": "Your rainbow body dissolved without remainder into the expanse of space.",
      "en-trans": "lhakmé ja kur namkhé long du yal"
    },
    {
      "bo": "འོག་མིན་པདྨོ་བཀོད་དུ་རབ་གཤེགས་ནས༔",
      "en": "You departed to Padmavyūhā, Lotus Array",
      "en-trans": "womin pemo kö du rab shek né"
    },
    {
      "bo": "ཡུམ་མཆོག་གསང་བ་ཡེ་ཤེས་སྐུ་རུ་གྱུར༔",
      "en": "Where you became the supreme consort, Guhyajñānā, Secret Wisdom.",
      "en-trans": "yum chok sangwa yeshe ku ru gyur"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "སློབ་འབངས་རིག་འཛིན་དགུ་བརྒྱ་ལྷན་ཅིག་ཏུ༔",
      "en": "Together with nine hundred followers—all awareness-holders—",
      "en-trans": "lob bang rigdzin gugya lhenchik tu"
    },
    {
      "bo": "འཇའ་སྐུར་ཐིམ་ནས་སྤྲུལ་པས་དོན་བྱེད་གྱུར༔",
      "en": "You dissolved into rainbow body and sent emanations to benefit beings.",
      "en-trans": "ja kur tim né trulpé dönjé gyur"
    },
    {
      "bo": "གང་འདུལ་མཁའ་འགྲོའི་སྤྲུལ་པ་རྒྱུན་མ་འཆད༔",
      "en": "Thus,your ḍākinī emanations go on endlessly, taming beings.",
      "en-trans": "gang dul khandrö trulpa gyün ma ché"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "བདེ་བ་ཅན་དུ་གོས་དཀར་གསང་ཡེ་ཡུམ༔",
      "en": "In Sukhāvatī, you are Pāṇḍarāvasinī, the secret wisdom consort.",
      "en-trans": "dewachen du gö kar sang yé yum"
    },
    {
      "bo": "མཁའ་སྤྱོད་གནས་སུ་གར་གྱི་དབང་མོར་གྲགས༔",
      "en": "In Khecarī, you are Nāṭyeśvarī, the renowned Lady of Dance.",
      "en-trans": "khachö né su gar gyi wangmor drak"
    },
    {
      "bo": "ཟ་ཧོར་ཡུལ་དུ་དུང་སྨན་དཀར་མོ་ཞེས༔",
      "en": "In the country of Zahor, your name is White Conch Medicine.",
      "en-trans": "zahor yul du dung men karmo zhé"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔",
      "en": "Mandāravā, at your feet I pray!",
      "en-trans": "man dha ra wé zhab la solwa deb"
    },
    {
      "bo": "བདག་སོགས་སྐྱེ་དང་ཚེ་རབས་ཐམས་ཅད་དུ༔",
      "en": "May I and all others, throughout all our lifetimes,",
      "en-trans": "dak sok kyé dang tserab tamché du"
    },
    {
      "bo": "ཡུམ་མཆོག་ཌཱ་ཀྐི་ཁྱོད་དང་མི་འབྲལ་ཞིང་༔",
      "en": "Never be apart from you, Ḍākinī and Supreme Mother!",
      "en-trans": "yum chok dakki khyö dang mindral zhing"
    },
    {
      "bo": "གནས་སྐབས་མཐར་ཐུག་འཇིགས་པ་ཀུན་གྲོལ་ཏེ༔",
      "en": "Liberated from all fears, both temporary and ultimate,",
      "en-trans": "nekab tartuk jikpa kün drol té"
    },
    {
      "bo": "རྣམ་ཐར་འགྲུབ་ནས་མངོན་སངས་རྒྱས་པར་མཛོད༔",
      "en": "Thus shall we attain complete liberation and awakening!",
      "en-trans": "namtar drub né ngön sangyé par dzö"
    },
    {
      "bo": "མི་མཐུན་ཀུན་ཞི་བར་ཆད་མ་ལུས་ཞི༔",
      "en": "Bless us, that all misfortunes and obstacles are pacified!",
      "en-trans": "mitün kün zhi barché malü zhi"
    },
    {
      "bo": "བསམ་དོན་མྱུར་འགྲུབ་གཞན་དོན་མཐར་ཕྱིན་ནས༔",
      "en": "Bless us, that all our wishes be quickly fulfilled!",
      "en-trans": "samdön nyur drub zhendön tarchin né"
    },
    {
      "bo": "འཁོར་བའི་གནས་སྟོང་རྒྱལ་ཡུམ་གོ་འཕང་ལ༔",
      "en": "Others’ benefit accomplished, may saṃsāra be emptied!",
      "en-trans": "khorwé né tong gyalyum gopang la"
    },
    {
      "bo": "འགོད་པའི་མཐུ་ནུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔",
      "en": "Through your blessing, may we all accomplish the Victorious Mother!",
      "en-trans": "göpé tu nü drubpar jingyi lob"
    }
  ]
}