{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/prayer-to-thangtong-gyalpo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཐང་སྟོང་རྒྱལ་པོར་གསོལ་འདེབས།",
    "en": "Prayer to Thangtong Gyalpo"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "བདུད་དཔུང་འཇོམས་མཛད་སྨུག་ནག་ཁྲོ་བོའི་སྐུ། །",
      "en": "Subduer of māra's forces, in your wrathful form with its dark complexion,",
      "en-trans": "düpung jom dzé muknak trowö ku"
    },
    {
      "bo": "ལྟ་བའི་གདེང་ལྡན་བརྟུལ་ཞུགས་སྤྱོད་པ་སྐྱོང་། །",
      "en": "Confident in the view, you maintain the unconventional actions of a yogi,",
      "en-trans": "tawé dengden tulzhuk chöpa kyong"
    },
    {
      "bo": "ཨོ་རྒྱན་ལུང་བསྟན་སྐྱེས་མཆོག་སྤྲུལ་པའི་སྐུ། །",
      "en": "Prophesied by the Oḍḍiyāna Guru, you are a supreme being a nirmāṇakāya:",
      "en-trans": "orgyen lungten kyechok trulpé ku"
    },
    {
      "bo": "ཐང་སྟོང་རྒྱལ་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Thangtong Gyalpo, 'King of the Empty Plain', to you I pray!",
      "en-trans": "tangtong gyalpö zhab la solwa deb"
    },
    {
      "bo": "ཞི་བ་འཕགས་མཆོག་ཐུགས་རྗེ་ཆེན་པོ་དང་། །",
      "en": "The peaceful, supreme and noble Great Compassionate One",
      "en-trans": "zhiwa pakchok tukjé chenpo dang"
    },
    {
      "bo": "དྲག་པོ་ཁྲོ་བོའི་རྒྱལ་པོ་རྟ་མགྲིན་རྒྱལ། །",
      "en": "And the wrathful, king of the fearsome, Hayagrīva,",
      "en-trans": "drakpo trowö gyalpo tamdrin gyal"
    },
    {
      "bo": "དབྱེར་མེད་ཟུང་འཇུག་མཆོག་གི་སྤྲུལ་པའི་སྐུ། །",
      "en": "Are inseparably united in you, the supreme manifestation:",
      "en-trans": "yermé zungjuk chok gi trulpé ku"
    },
    {
      "bo": "གྲུབ་པའི་འཁོར་ལོས་བསྒྱུར་ལ་གསོལ་བ་འདེབས། །",
      "en": "Supreme sovereign of siddhas, to you I pray!",
      "en-trans": "drubpé khorlö gyur la solwa deb"
    },
    {
      "bo": "རྒྱལ་བས་ལུང་བསྟན་བརྩོན་འགྲུས་བཟང་པོའི་ཞབས། །",
      "en": "Prophesied by the victorious ones, venerable Tsöndrü Zangpo,",
      "en-trans": "gyalwé lungten tsöndrü zangpö zhab"
    },
    {
      "bo": "རྒྱ་བོད་ཡུལ་གྲུ་ཀུན་ཏུ་བརྟུལ་ཞུགས་ཀྱི། །",
      "en": "You practised yogic conduct throughout the lands of India and Tibet,",
      "en-trans": "gya bö yuldru küntu tulzhuk kyi"
    },
    {
      "bo": "སྤྱོད་མཛད་ཐང་སྟོང་རྒྱལ་པོར་སྙན་པར་གྲགས། །",
      "en": "And became renowned as Thangtong Gyalpo, 'King of the Empty Plain':",
      "en-trans": "chö dzé tangtong gyalpor nyenpar drak"
    },
    {
      "bo": "ཨོ་རྒྱན་གཉིས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Like a second guru of Oḍḍiyāna, to you I pray!",
      "en-trans": "orgyen nyipé zhab la solwa deb"
    },
    {
      "bo": "སྐུ་གསུང་ཐུགས་རྟེན་ཆུ་ལ་ལྕགས་ཟམ་སོགས། །",
      "en": "You sponsored supports of enlightened body, speech and mind,",
      "en-trans": "ku sung tuk ten chu la chak zam sok"
    },
    {
      "bo": "རྣམ་པར་དཀར་བའི་དགེ་ཚོགས་དཔག་མེད་ཀྱིས། །",
      "en": "The construction of bridges and so on — boundless acts of merit,",
      "en-trans": "nampar karwé gé tsok pakmé kyi"
    },
    {
      "bo": "སྔོན་མེད་ཉི་མ་གསར་པའི་དགེ་མཚན་ཅན། །",
      "en": "Bringing signs of virtue like the unheralded dawn of a new sun,",
      "en-trans": "ngönmé nyima sarpé getsen chen"
    },
    {
      "bo": "གྲུབ་ཆེན་ཆོས་ཀྱི་རྗེ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Mahāsiddha, Lord of Dharma, to you I pray!",
      "en-trans": "drubchen chö kyi jé la solwa deb"
    },
    {
      "bo": "ཁྱོད་ལ་གུས་པས་གསོལ་བ་བཏབས་པའི་མཐུས། །",
      "en": "Through the power of praying reverently to you,",
      "en-trans": "khyö la güpé solwa tabpé tü"
    },
    {
      "bo": "བདག་སོགས་གང་དུ་གནས་པའི་ས་ཕྱོགས་སུ། །",
      "en": "In the places where I and others reside",
      "en-trans": "dak sok gangdu nepé sachok su"
    },
    {
      "bo": "ནད་གདོན་དབུལ་ཕོངས་འཐབ་རྩོད་ཞི་བ་དང་། །",
      "en": "May illness, harmful influences, poverty and conflict be relieved,",
      "en-trans": "nedön ulpong tabtsö zhiwa dang"
    },
    {
      "bo": "ཆོས་དང་བཀྲ་ཤིས་འཕེལ་བར་མཛད་དུ་གསོལ། །",
      "en": "And may Dharma thrive and auspiciousness increase!",
      "en-trans": "chö dang tashi pelwar dzé du sol"
    }
  ]
}