{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/shakya-shri/milarepa-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་བཙུན་དབང་ཕྱུག་མི་ལ་བཞད་པ་རྡོ་རྗེའི་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ན་མོ།"
    },
    {
      "bo": "བདག་དང་མཁའ་ཁྱབ་ཀྱི་སེམས་ཅན། །"
    },
    {
      "bo": "འདི་བཟུང་བྱང་ཆུབ་ཀྱི་བར་དུ། །"
    },
    {
      "bo": "སྐྱབས་གནས་བླ་མ་ཡི་ཚོགས་ལ། །"
    },
    {
      "bo": "གུས་པའི་ཡིད་ཀྱིས་སྐྱབས་སུ་མཆིའོ། །"
    },
    {
      "bo": "མ་གྱུར་སྲིད་པ་ཡི་སེམས་ཅན། །"
    },
    {
      "bo": "མྱུར་དུ་བླ་མེད་ཀྱི་བྱང་ཆུབ། །"
    },
    {
      "bo": "ཐོབ་པའི་སེམས་མཆོག་ཉིད་བསྐྱེད་དོ། །"
    },
    {
      "bo": "བདག་ལུས་ཐ་མལ་གྱི་སྣང་ཞེན་རང་སར་སྟོང་། །"
    },
    {
      "bo": "མ་འགགས་ཆོས་ཉིད་ཀྱི་རང་མདངས་རྣལ་འབྱོར་མར། །"
    },
    {
      "bo": "གསལ་བའི་དབུ་སྟེང་གི་ནམ་མཁར་པད་ཟླའི་སྟེང་། །"
    },
    {
      "bo": "བཀའ་དྲིན་འཁོར་མེད་བཞད་པ་ཡི་རྡོ་རྗེ་ནི། །"
    },
    {
      "bo": "སྐུ་མདོག་སྔོ་མདངས་རས་དཀར་གྱི་ན་བཟའ་ཅན། །"
    },
    {
      "bo": "མཉམ་བཞག་གི་ཕྱག་རྒྱ་སྤྱན་གཉིས་ནམ་མཁར་གཟིགས། །"
    },
    {
      "bo": "སྣང་སྟོང་གི་སྐུ་ཅན་ཞབས་གཉིས་སེམས་སྐྱིལ་བཞུགས། །"
    },
    {
      "bo": "ཞིང་རབ་འབྱམས་ཀྱི་བླ་མ་སྤྲིན་ལྟར་གཏིབས། །"
    },
    {
      "bo": "མ་མཁའ་འགྲོ་རྒྱ་མཚོའི་དབུས་ན་བཞུགས། །"
    },
    {
      "bo": "ཨ་ཧོ་ཡེ།"
    },
    {
      "bo": "དུས་གསུམ་སངས་རྒྱས་ཀྱི་ངོ་བོ། །"
    },
    {
      "bo": "ཆགས་བྲལ་དམ་ཆོས་ཀྱི་འབྱུང་གནས། །"
    },
    {
      "bo": "རིག་གྲོལ་དགེ་འདུན་གྱི་གཙོ་མཆོག །"
    },
    {
      "bo": "སྐྱབས་གསུམ་ཀུན་འདུས་ཀྱི་ངོ་བོ། །"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །"
    },
    {
      "bo": "སྐྱབས་གནས་བླ་མ་ཡི་སྤྱི་གཟུགས། །"
    },
    {
      "bo": "ཡི་དམ་རྒྱལ་བ་ཡི་ངོ་བོ། །"
    },
    {
      "bo": "མཁའ་འགྲོ་རྒྱ་མཚོ་ཡི་གཙོ་མཆོག །"
    },
    {
      "bo": "རྩ་གསུམ་ཀུན་འདུས་ཀྱི་ངོ་བོ། །"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །"
    },
    {
      "bo": "བཀའ་བརྒྱུད་བསྟན་པ་ཡི་གཙུག་རྒྱན། །"
    },
    {
      "bo": "གསང་ལམ་སྙན་རྒྱུད་ཀྱི་བདག་པོ། །"
    },
    {
      "bo": "སྐལ་ལྡན་སྨིན་གྲོལ་གྱི་ཐབས་མཁས། །"
    },
    {
      "bo": "འགྲོ་དོན་ནམ་མཁའ་དང་མཉམ་པའི། །"
    },
    {
      "bo": "དྲིན་ཅན་བཞད་པ་རྡོ་རྗེ་དེ་མཁྱེན་ནོ། །"
    },
    {
      "bo": "བདག་ནི་འདི་ཕྱི་ཚེ་རབས་ཀུན་ཏུ། །"
    },
    {
      "bo": "སྐྱབས་དང་རེ་ས་གཞན་ན་མེད་དོ། །"
    },
    {
      "bo": "ཐུགས་རྗེ་ཟུངས་ཤིག་བླ་མ་རྗེ་བཙུན་མཁྱེན་ནོ། །"
    },
    {
      "bo": "སྐུ་ཡི་དབང་མཆོག་ལུས་ལ་བསྐུར། །"
    },
    {
      "bo": "འཕོ་མེད་འཇའ་ལུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གསུང་གི་དབང་མཆོག་ངག་ལ་བཞུགས། །"
    },
    {
      "bo": "གྲགས་སྟོང་འགགས་པ་མེད་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཐུགས་ཀྱི་དབང་མཆོག་ཡིད་ལ་བཞུགས། །"
    },
    {
      "bo": "རིག་སྟོང་ཆོས་སྐུར་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མཐར་རྗེ་བཙུན་བླ་མ་འོད་དུ་ཞུ། །"
    },
    {
      "bo": "རང་རིག་པའི་གཤིས་དང་གཉིས་མེད་འདྲེས། །"
    },
    {
      "bo": "གཞི་རང་གྲོལ་ཆོས་སྐུའི་ཀློང་དུ་ཨཱཿ"
    }
  ]
}