{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/thangtong-gyalpo/bhikshu-padma-karpo-prayer-to-avalokiteshvara",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་གྲུབ་ཐོབ་ཆེན་པོ་དགེ་སློང་པདྨ་དཀར་པོ་སྐྱེ་བ་བཞེས་པའི་ཚེ་འཕགས་པ་སྤྱན་རས་གཟིགས་ལ་གསོལ་བ་བཏབ་པའི་རྡོ་རྗེའི་གསུང་བཞུགས་སོ།།"
  },
  "text": [
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བླ་མ་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཡི་དམ་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་སྐྱབས་མགོན་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱམས་མགོན་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་རྒྱལ་བ་ཐུགས་རྗེ་ཅན། །"
    },
    {
      "bo": "མཐའ་མེད་འཁོར་བར་གྲངས་མེད་འཁྱམས་གྱུར་ཅིང་། །"
    },
    {
      "bo": "བཟོད་མེད་སྡུག་བསྔལ་མྱོང་བའི་འགྲོ་བ་ལ། །"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་ལས་སྐྱབས་གཞན་མ་མཆིས་སོ། །"
    },
    {
      "bo": "རྣམ་མཁྱེན་སངས་རྒྱས་ཐོབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "ཞེ་སྡང་དབང་གིས་དམྱལ་བར་སྐྱེས་གྱུར་ཏེ། །"
    },
    {
      "bo": "ཚ་གྲང་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །"
    },
    {
      "bo": "ལྷ་མཆོག་ཁྱེད་ཀྱི་དྲུང་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "སེར་སྣའི་དབང་གིས་ཡི་དྭགས་གནས་སུ་སྐྱེས། །"
    },
    {
      "bo": "བཀྲེས་སྐོམ་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །"
    },
    {
      "bo": "ཞིང་མཆོག་པོ་ཏཱ་ལ་རུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "གཏི་མུག་དབང་གིས་དུད་འགྲོར་སྐྱེས་གྱུར་ཏེ། །"
    },
    {
      "bo": "གླེན་ལྐུགས་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་ཀྱི་དྲུང་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "ཕྲག་དོག་དབང་གིས་ལྷ་མིན་གནས་སུ་སྐྱེས། །"
    },
    {
      "bo": "འཐབ་རྩོད་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "ང་རྒྱལ་དབང་གིས་ལྷ་ཡིས་གནས་སུ་སྐྱེས། །"
    },
    {
      "bo": "འཕོ་ལྟུང་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །"
    },
    {
      "bo": "འདོད་ཆགས་དབང་གིས་མི་ཡི་གནས་སུ་སྐྱེས། །"
    },
    {
      "bo": "སྐྱེ་རྒ་ན་འཆིའི་སྡུག་བསྔལ་མྱོང་བ་རྣམས། །"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "བདག་ནི་སྐྱེ་ཞིང་སྐྱེ་བ་ཐམས་ཅད་དུ། །"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་དང་མཛད་པ་མཚུངས་པ་ཡིས། །"
    },
    {
      "bo": "མ་དག་ཞིང་གི་འགྲོ་རྣམས་སྒྲོལ་བ་དང་། །"
    },
    {
      "bo": "གསུང་མཆོག་ཡིག་དྲུག་ཕྱོགས་བཅུར་རྒྱས་པར་ཤོག །"
    },
    {
      "bo": "འཕགས་མཆོག་ཁྱེད་ལ་གསོལ་བ་བཏབ་པའི་མཐུས། །"
    },
    {
      "bo": "བདག་གི་གདུལ་བྱར་གྱུར་པའི་འགྲོ་བ་རྣམས། །"
    },
    {
      "bo": "ལས་འབྲས་ལྷུར་ལེན་དགེ་བའི་ལས་ལ་བརྩོན། །"
    },
    {
      "bo": "འགྲོ་བའི་དོན་དུ་ཆོས་དང་ལྡན་པ་ཤོག །"
    }
  ]
}