{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-adzom-drukpa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བཀའ་དྲིན་མཉམ་མེད་རིག་འཛིན་འགྲོ་འདུལ་དཔའ་བོ་རྡོ་རྗེ་ལ་གསོལ་བ་འདེབས་པ་བྱིན་རླབས་བདུད་རྩི་ཞེས་བྱ་བ།",
    "en": "A Prayer to Drodül Pawo Dorje, Vidyādhara of Unparalleled Kindness"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti.",
      "en-trans": "om swasti"
    },
    {
      "bo": "རྩ་གསུམ་ཀུན་འདུས་ཨོ་རྒྱན་རྡོ་རྗེ་འཆང་། །",
      "en": "The Vajradhara of Oḍḍiyāna, embodiment of the Three Roots,",
      "en-trans": "tsa sum kündü orgyen dorjé chang"
    },
    {
      "bo": "གང་གི་ཡེ་ཤེས་གཅིག་གི་རྣམ་རོལ་ལས། །",
      "en": "In his manifestation of the one primordial wisdom,",
      "en-trans": "gang gi yeshe chik gi namrol lé"
    },
    {
      "bo": "འབངས་རིགས་ཉེར་ལྔའི་ཁྱུ་མཆོག་རྨ་ཐོག་རྗེ། །",
      "en": "Had twenty-five disciples, of whom you were the foremost,",
      "en-trans": "bang rik nyerngé khyuchok ma tok jé"
    },
    {
      "bo": "རིན་ཆེན་མཚན་འཆང་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Lord Matok with the name of Rinchen—to you I pray.1",
      "en-trans": "rinchen tsen chang zhab la solwa deb"
    },
    {
      "bo": "དེ་ཉིད་ལྔ་བདོའི་སྨག་རུམ་གསལ་བའི་སླད། །",
      "en": "Then, to illuminate this dark age of fivefold degeneration,",
      "en-trans": "denyi nga dö makrum salwé lé"
    },
    {
      "bo": "ཟླ་བའི་འོད་ལྟར་གསལ་བའི་ཐུགས་རྗེ་ཅན། །",
      "en": "Like the light of the moon, you appeared in your compassion,",
      "en-trans": "dawé ö tar salwé tukjé chen"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་ཡོན་ཏན་བསམ་མི་ཁྱབ། །",
      "en": "With inconceivable qualities of knowledge, love and power,",
      "en-trans": "khyen tsé nüpé yönten sam mikhyab"
    },
    {
      "bo": "འགྲོ་འདུལ་དཔའ་བོ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །",
      "en": "Drodül Pawo Dorje, to you I pray.",
      "en-trans": "drodul pawo dorjér solwa deb"
    },
    {
      "bo": "དགོངས་བརྡའ་སྙན་བརྒྱུད་བླ་མའི་ཚོགས་རྣམས་ཀྱི། །",
      "en": "You received the essence of the wisdom minds of hosts of gurus",
      "en-trans": "gong da nyengyü lamé tsok nam kyi"
    },
    {
      "bo": "ཐུགས་ཀྱི་བཅུད་ཐོབ་ཀུན་བཟང་དགོངས་མཛོད་དབང་། །",
      "en": "From mind-direct, symbolic and whispered transmissions and mastered the treasury of Samantabhadra’s realization,",
      "en-trans": "tuk kyi chü tob kunzang gong dzö wang"
    },
    {
      "bo": "རིག་འཛིན་གྲུབ་པ་ཡོངས་ཀྱི་གཙུག་གི་བརྒྱན། །",
      "en": "To became the crown-ornament of all accomplished vidyādharas—",
      "en-trans": "rigdzin drubpa yong kyi tsuk gi gyen"
    },
    {
      "bo": "སྣ་ཚོགས་རང་གྲོལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Natsok Rangdrol, to you I pray.",
      "en-trans": "natsok rangdrol zhab la solwa deb"
    },
    {
      "bo": "སྐུ་ཡི་དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱིས་གྲོལ། །",
      "en": "Merely to glimpse the maṇḍala of your form brings liberation,",
      "en-trans": "ku yi kyilkhor tongwa tsam gyi drol"
    },
    {
      "bo": "གསུང་གི་གདངས་སྐད་འབྲུག་གི་སྒྲ་ལྟར་ལྡིར། །",
      "en": "Your voice resounds like the thunderous roar of a dragon,",
      "en-trans": "sung gi dang ké druk gi dra tar dir"
    },
    {
      "bo": "ཐུགས་ཀྱི་དགོངས་པ་རྒྱ་མཚོ་ལྟར་ཟབ་པ། །",
      "en": "And your wisdom realization is as deep as the ocean—",
      "en-trans": "tuk kyi gongpa gyatso tar zabpa"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Glorious guru, at your feet I pray.",
      "en-trans": "palden lamé zhab la solwa deb"
    },
    {
      "bo": "འཆད་ན་ཚིག་དོན་འབྲེལ་ལེགས་རྣ་བར་སྙན། །",
      "en": "In teaching, your elegant association of words and meanings is a delight to hear,",
      "en-trans": "ché na tsikdön drel lek nawar nyen"
    },
    {
      "bo": "རྩོད་པས་ཕས་རྒོལ་བྲག་རི་ཕྱེ་མར་འཐགས། །",
      "en": "Through debate, you crush opponents like a mountain that grinds them to dust,",
      "en-trans": "tsöpé pé gol drakri chemar tak"
    },
    {
      "bo": "རྩོམ་པ་སྙིང་པོའི་བསྟན་པའི་མཆོད་སྡོང་ཆེ། །",
      "en": "And your compositions are like a sacred monument of essential teachings—",
      "en-trans": "tsompa nyingpö tenpé chö dong ché"
    },
    {
      "bo": "རྒྱལ་སྲས་སེམས་དཔའ་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Great bodhisattva, heir of the victorious ones, to you I pray.",
      "en-trans": "gyalsé sempa chenpor solwa deb"
    },
    {
      "bo": "རྟག་ཏུ་འོད་གསལ་ངང་ལས་མི་གཡོ་ཞིང་། །",
      "en": "Never wavering from the constant experience of clear light,",
      "en-trans": "taktu ösal ngang lé mi yo zhing"
    },
    {
      "bo": "འཁྲུལ་རྟོག་བག་ཆགས་ཐམས་ཅད་དབྱིངས་སུ་ནུབ། །",
      "en": "All deluded thoughts and habitual patterns have faded into absolute space,",
      "en-trans": "trul tok bakchak tamché ying su nub"
    },
    {
      "bo": "དམིགས་མེད་སྙིང་རྗེ་ཆེན་པོ་འགྲོ་ལ་འཇུག །",
      "en": "And with great non-referential compassion you come to beings' aid—",
      "en-trans": "mikmé nyingjé chenpo dro la juk"
    },
    {
      "bo": "བླ་མ་གདོད་མའི་མགོན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Primordial lord and guru, to you I pray.",
      "en-trans": "lama dömé gönpor solwa deb"
    },
    {
      "bo": "དེང་ནས་བཟུང་སྟེ་བྱང་ཆུབ་སྙིང་པོའི་བར། །",
      "en": "From this moment on, until I reach the essence of awakening,",
      "en-trans": "deng né zung té changchub nyingpö bar"
    },
    {
      "bo": "རིག་འཛིན་བླ་མས་འབྲལ་མེད་རྗེས་སུ་བཟུང་། །",
      "en": "Care for me, vidyādhara guru, without ever parting,",
      "en-trans": "rigdzin lamé dralmé jesu zung"
    },
    {
      "bo": "ཐུགས་བརྒྱུད་དགོངས་པའི་བྱིན་བརླབ་ཐོབ་པ་དང་། །",
      "en": "So that I may receive the blessings of the wisdom-mind transmission—",
      "en-trans": "tuk gyü gongpé jin lab tobpa dang"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་འགྲུབ་པར་གསོལ་བ་འདེབས། །",
      "en": "To you who accomplish your own and others' welfare, I pray.",
      "en-trans": "rangzhen dön nyi drubpar solwa deb"
    },
    {
      "bo": "ཕན་བདེའི་འབྱུང་གནས་བསྟན་པ་དར་ཞིང་རྒྱས། །",
      "en": "May the teachings, the source of benefit and happiness, spread far and wide.",
      "en-trans": "pendé jungné tenpa dar zhing gyé"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་མཆོག་ཞབས་པད་བརྟན་པ་དང་། །",
      "en": "May the lives of the sublime holders of the teachings remain secure.",
      "en-trans": "tendzin kyechok zhabpé tenpa dang"
    },
    {
      "bo": "དགེ་འདུན་འཕེལ་ཞིང་འཇིག་རྟེན་དགེ་བཅུར་སྤྱོད། །",
      "en": "May the saṅgha increase and the whole world practise the ten virtues.",
      "en-trans": "gendün pel zhing jikten gé chur chö"
    },
    {
      "bo": "སྣོད་བཅུད་རྒུད་ཞི་དགེ་ལེགས་འཕེལ་རྒྱས་ཤོག །",
      "en": "May the decline of the environment and beings be halted, and may virtue and goodness abound.",
      "en-trans": "nöchü gü zhi gelek pelgyé shok"
    }
  ]
}