{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-gotsangpa-gonpo-dorje",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒོད་ཚང་མགོན་པོ་རྡོ་རྗེ་ལ་གསོལ་བ་འདེབས་པ་མོས་གུས་ཀྱི་ཏམྦུ་ར་ཞེས་བྱ་བ།",
    "en": "A Prayer to Götsang Gönpo Dorje"
  },
  "text": [
    {
      "bo": "རྗེ་བླ་མ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།    །",
      "en": "Homage to the noble gurus!",
      "en-trans": "jé lama nam la chaktsal lo"
    },
    {
      "bo": "གནས་སྤྱི་གཙུག་ཉི་ཟླའི་གདན་སྟེང་ན།    །",
      "en": "Upon sun and moon-disc seats at my crown,",
      "en-trans": "né chitsuk nyidé den teng na"
    },
    {
      "bo": "དཔལ་བཀའ་དྲིན་མཉམ་མེད་བླ་མ་རྗེ།    །",
      "en": "Sits the glorious guru unmatched in kindness,",
      "en-trans": "pal kadrin nyammé lama jé"
    },
    {
      "bo": "རྗེ་ཁྱབ་བདག་མགོན་པོ་རྡོ་རྗེ་ལ།    །",
      "en": "The sovereign lord and master, Gönpo Dorje—",
      "en-trans": "jé khyabdak gönpo dorjé la"
    },
    {
      "bo": "བདག་གསོལ་བ་འདེབས་སོ་ཐུགས་རྗེས་ཟུངས།    །",
      "en": "To you I pray: hold me in your compassion!",
      "en-trans": "dak solwa deb so tukjé zung"
    },
    {
      "bo": "རྗེ་མི་མངོན་དབྱིངས་ན་བཞུགས་ཙ་ན།    །",
      "en": "Lord, as you remain in unmanifest basic space,",
      "en-trans": "jé mi ngön ying na zhuk tsana"
    },
    {
      "bo": "མགོན་སངས་རྒྱས་རྣམས་དང་དགོངས་པ་གཅིག  །",
      "en": "You are one with the buddhas in realization,",
      "en-trans": "gön sangye nam dang gongpa chik"
    },
    {
      "bo": "དཔལ་ཧེ་རུ་ཀ་དང་སྤྱོད་ཡུལ་མཉམ།    །",
      "en": "And equal to the glorious heruka in activity,",
      "en-trans": "pal heruka dang chöyul nyam"
    },
    {
      "bo": "རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་གྲུབ་པའི་གཙོ།    །",
      "en": "Mightiest of yogins, foremost among adepts.",
      "en-trans": "naljor gyi wangchuk drubpé tso"
    },
    {
      "bo": "རྗེ་ཁྱོད་ལ་གདུང་བས་གསོལ་འདེབས་ན།    །",
      "en": "Lord, as I pray to you with fervent devotion,",
      "en-trans": "jé khyö la dungwé soldeb na"
    },
    {
      "bo": "གསང་གསུམ་གྱི་བྱིན་རླབས་དབང་བསྐུར་སྩོལ།    །",
      "en": "Confer the blessings and empowerments of your three secrets.",
      "en-trans": "sang sum gyi jinlab wangkur tsol"
    },
    {
      "bo": "དུས་ད་ལྟ་རྡོ་རྗེའི་བྱིན་ཆེན་ཕོབ།    །",
      "en": "Shower down a great rain of vajra blessings, here and now,",
      "en-trans": "dü danta dorjé jin chen pob"
    },
    {
      "bo": "བདག་རྒྱུད་ལ་ཉམས་རྟོགས་བསྐྱེད་དུ་གསོལ།    །",
      "en": "And cause experience and realization to develop in my mind.",
      "en-trans": "dak gyü la nyamtok kyé du sol"
    },
    {
      "bo": "སྐུ་གདན་གསུམ་ཚང་བའི་དཀྱིལ་འཁོར་ནས།    །",
      "en": "From the maṇḍala of your form, complete with the three seats,",
      "en-trans": "ku den sum tsangwé kyilkhor né"
    },
    {
      "bo": "ལུས་བུམ་པའི་དབང་གིས་སྨིན་པ་དང་།    །",
      "en": "May the vase empowerment serve to ripen my body,",
      "en-trans": "lü bumpé wang gi minpa dang"
    },
    {
      "bo": "རྩ་གདོས་བཅས་སྒྲིབ་པ་དག་པ་དང་།    །",
      "en": "Purify any blockages within my physical channels,",
      "en-trans": "tsa dö ché dribpa dakpa dang"
    },
    {
      "bo": "ལུས་སྐུ་ཡི་རྡོ་རྗེར་བདག་སྒྲུབ་མཛོད།    །",
      "en": "And refine my body as the vajra of enlightened form.",
      "en-trans": "lü ku yi dorjér dak drub dzö"
    },
    {
      "bo": "རྗེ་གསུང་གི་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །",
      "en": "Lord, from the maṇḍala of your enlightened vajra speech,",
      "en-trans": "jé sung gi dorjé kyilkhor né"
    },
    {
      "bo": "ངག་གསང་བའི་དབང་གིས་སྨིན་པ་དང་།    །",
      "en": "May the secret empowerment serve to ripen my speech,",
      "en-trans": "ngak sangwé wang gi minpa dang"
    },
    {
      "bo": "རླུང་འགྱུར་བཅས་ངག་གི་དྲི་མ་སྦྱངས།    །",
      "en": "Purify any defects of speech or dynamic wind-energy,",
      "en-trans": "lung gyur ché ngak gi drima jang"
    },
    {
      "bo": "ངག་གསུང་གི་རྡོ་རྗེར་གྲུབ་པར་མཛོད།    །",
      "en": "And refine my voice as the vajra of enlightened speech.",
      "en-trans": "ngak sung gi dorjér drubpar dzö"
    },
    {
      "bo": "ཐུགས་རིག་སྟོང་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །",
      "en": "From the maṇḍala of the vajra mind of awareness and emptiness,",
      "en-trans": "tuk riktong dorjé kyilkhor né"
    },
    {
      "bo": "ཡིད་ཤེར་ཡེའི་དབང་གིས་སྨིན་པ་དང་།    །",
      "en": "May the knowledge-wisdom empowerment ripen my mind,",
      "en-trans": "yi sher yé wang gi minpa dang"
    },
    {
      "bo": "སེམས་ཐིག་ལེ་འཕོ་བའི་དྲི་མ་སྦྱངས།    །",
      "en": "Purify any faults of mind or the emission of subtle essences,",
      "en-trans": "sem tiklé powé drima jang"
    },
    {
      "bo": "ཡིད་ཐུགས་ཀྱི་རྡོ་རྗེར་གྲུབ་པར་མཛོད།    །",
      "en": "And refine my intellect as the vajra of enlightened mind.",
      "en-trans": "yi tuk kyi dorjér drubpar dzö"
    },
    {
      "bo": "རྗེ་ཡེ་ཤེས་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ནས།    །",
      "en": "Lord, from the maṇḍala of your enlightened vajra wisdom,",
      "en-trans": "jé yeshe dorjé kyilkhor né"
    },
    {
      "bo": "དབང་བཞི་པའི་རྟོགས་པ་བསྐྱེད་པར་མཛོད།    །",
      "en": "May the realization of the fourth empowerment develop,",
      "en-trans": "wang zhipé tokpa kyepar dzö"
    },
    {
      "bo": "ཀུན་གཞི་ཡི་སྒྲིབ་པ་སྦྱོང་བ་དང་།    །",
      "en": "Purifying any obscurations of the all-ground consciousness,",
      "en-trans": "künzhi yi dribpa jongwa dang"
    },
    {
      "bo": "སེམས་རིག་སྟོང་རྡོ་རྗེར་གྲུབ་གྱུར་ཅིག  །",
      "en": "And refining my mind as vajra awareness and emptiness.",
      "en-trans": "sem riktong dorjér drub gyur chik"
    },
    {
      "bo": "དད་མོས་ཀྱི་གདུང་ཤུགས་དྲག་ཏུ་བསྐྱེད།    །",
      "en": "Help me to generate intense and longing devotion,",
      "en-trans": "dé mö kyi dungshuk drak tu kyé"
    },
    {
      "bo": "མོས་གུས་ཀྱི་ས་གཞི་གཙང་མ་ལ།    །",
      "en": "So that upon the pure ground of ardent veneration,",
      "en-trans": "mögü kyi sa zhi tsangma la"
    },
    {
      "bo": "མགོན་ཡེ་ཤེས་སྐུ་ཡི་གཟུགས་བརྙན་འཆར།    །",
      "en": "The reflection of your wisdom form may arise,",
      "en-trans": "gön yeshe ku yi zuknyen char"
    },
    {
      "bo": "ཐུགས་རྒྱུད་ཀྱི་དགོངས་པ་འཕོ་བར་མཛོད།    །",
      "en": "O protector, and your realization be transmitted.",
      "en-trans": "tukgyü kyi gongpa powar dzö"
    },
    {
      "bo": "སྐྱབས་བླ་མ་དཀོན་མཆོག་རྣམ་གསུམ་ལ།    །",
      "en": "May I always follow the sources of refuge—the guru",
      "en-trans": "kyab lama könchok nam sum la"
    },
    {
      "bo": "ཡིད་ཁྱེད་ཤེས་དད་པས་རྟག་ཏུ་བསྙེན།    །",
      "en": "And the Three Jewels—with total trust and reliance.",
      "en-trans": "yi khyé shé depé taktu nyen"
    },
    {
      "bo": "བདག་ལུས་སེམས་བདེ་སྡུག་ཅི་བྱུང་ཡང་།    །",
      "en": "And no matter what befalls me physically or mentally,",
      "en-trans": "dak lü sem deduk chi jung yang"
    },
    {
      "bo": "རྗེ་དམ་པ་རྣམས་ཀྱི་མགོན་སྐྱོབས་མཛོད།    །",
      "en": "Whether joy or sorrow, may the sublime ones protect me!",
      "en-trans": "jé dampa nam kyi gön kyob dzö"
    },
    {
      "bo": "མ་འགྲོ་བ་དྲུག་གི་སེམས་ཅན་རྣམས།    །",
      "en": "Since the sentient beings of the six realms",
      "en-trans": "madrowa druk gi semchen nam"
    },
    {
      "bo": "བུ་བདག་གི་ཕ་མར་གྱུར་པས་ན།    །",
      "en": "Have been my father and mother in the past,",
      "en-trans": "bu dak gi pamar gyurpé na"
    },
    {
      "bo": "སྡུག་བསྔལ་གྱི་རྒྱ་མཚོ་ཆེན་པོ་ལས།    །",
      "en": "May I be able to free them from the ocean of misery",
      "en-trans": "dukngal gyi gyatso chenpo lé"
    },
    {
      "bo": "ཐར་པ་དམ་པར་འགོད་ནུས་ཤོག  །",
      "en": "And deliver them to the state of perfect freedom.",
      "en-trans": "tarpa dampar gö nü shok"
    },
    {
      "bo": "ལུས་ཡི་དམ་ལྷ་ཡི་གསལ་སྣང་བརྟན།    །",
      "en": "Clearly and steadily visualizing my body as the yidam deity,",
      "en-trans": "lü yidam lha yi sal nang ten"
    },
    {
      "bo": "ངག་བཟླས་བརྗོད་ཆུ་བོའི་གཞུང་ལྟར་བརྩོན།    །",
      "en": "With my speech a constant river-like flow of mantra recitation,",
      "en-trans": "ngakdé jö chuwö zhung tar tsön"
    },
    {
      "bo": "སེམས་རང་གྲོལ་ཕྱག་རྒྱ་ཆེན་པོའི་ངང་།    །",
      "en": "And my mind in the state of self-liberation, Mahāmudrā—",
      "en-trans": "sem rangdrol chakgya chenpö ngang"
    },
    {
      "bo": "དུས་རྟག་ཏུ་ཡེངས་མེད་བརྩོན་པར་ཤོག  །",
      "en": "May I strive at all times with unwavering enthusiasm.",
      "en-trans": "dü taktu yengmé tsönpar shok"
    },
    {
      "bo": "དུས་གསུམ་དུ་བསགས་པའི་དགེ་ཚོགས་རྣམས།    །",
      "en": "All virtues amassed throughout the three times,",
      "en-trans": "dü sum du sakpé gé tsok nam"
    },
    {
      "bo": "བློས་གཅིག་ཏུ་བསྡུས་ནས་འགྲོ་ལ་སྦྱིན།    །",
      "en": "I mentally gather together and offer to all beings.",
      "en-trans": "lö chik tu dü né dro la jin"
    },
    {
      "bo": "མ་མཁའ་ཁྱབ་སེམས་ཅན་མ་ལུས་པ།    །",
      "en": "May each and every one throughout the whole of space",
      "en-trans": "ma khakhyab semchen malüpa"
    },
    {
      "bo": "དཔལ་སྐུ་བཞིའི་དབང་ཕྱུག་ཐོབ་པར་ཤོག  །",
      "en": "Attain the level of this splendid master of the four kāyas.",
      "en-trans": "pal ku zhi wangchuk tobpar shok"
    },
    {
      "bo": "རྗེ་གྲུབ་པའི་དབང་ཕྱུག་ཁྱེད་མཁྱེན་ནོ།    །",
      "en": "Mighty lord of siddhas, know me! Care for me!",
      "en-trans": "jé drubpé wangchuk khyé khyen no"
    },
    {
      "bo": "དུས་ད་ལྟ་ཉིད་དུ་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me with your blessings, this very instant!",
      "en-trans": "dü danta nyi du jingyi lob"
    },
    {
      "bo": "འདུག་ས་འདི་ཉིད་དུ་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me with your blessings, in this very place!",
      "en-trans": "duk sa di nyi du jingyi lob"
    },
    {
      "bo": "སྟན་ཐོག་འདི་ཉིད་དུ་བྱིན་གྱིས་རློབས་ཤིག  །",
      "en": "Inspire me with your blessings, upon this very seat!",
      "en-trans": "ten tok di nyi du jingyi lob shik"
    },
    {
      "bo": "བླ་མ་གྲུབ་བརྒྱའི་གཙུག་རྒྱན།    །",
      "en": "Guru, crowning ornament of a hundred siddhas,",
      "en-trans": "lama drub gyé tsukgyen"
    },
    {
      "bo": "རྒྱལ་བ་རྒོད་ཚང་པ་མགོན་པོ་རྡོ་རྗེ་མཁྱེན་ནོ།    །",
      "en": "Gyalwa Götsangpa Gönpo Dorje, care for me!",
      "en-trans": "gyalwa götsang pa gönpo dorjé khyen no"
    }
  ]
}