{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/anguished-prayer-buddhas-bodhisattvas",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སངས་རྒྱས་བྱང་སེམས་ལ་སྨྲེ་སྔགས་ཀྱི་གསོལ་བ་འདེབས་པ་བཞུགས།    །",
    "en": "Anguished Prayer to the Buddhas and Bodhisattvas"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Namo guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "བླ་མ་མཉམ་མེད་ཐུབ་པའི་དབང་པོ་དང་།    །",
      "en": "Peerless guru, the Lord of Sages,",
      "en-trans": "lama nyammé tubpé wangpo dang"
    },
    {
      "bo": "འཇམ་དབྱངས་བྱམས་པ་ཕྱག་རྡོར་སྤྱན་གཟིགས་སོགས།    །",
      "en": "Mañjughoṣa, Maitreya, Vajrapāṇi, Avalokiteśvara and the rest,",
      "en-trans": "jamyang jampa chakdor chenzik sok"
    },
    {
      "bo": "དམིགས་མེད་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པའི།    །",
      "en": "Possessors of great, non-referential compassion,",
      "en-trans": "mikmé tukjé chenpo dang denpé"
    },
    {
      "bo": "རྒྱལ་དང་དེ་སྲས་ཚོགས་རྣམས་དགོངས་སུ་གསོལ།   །",
      "en": "Victors and your heirs, turn your attention towards me.",
      "en-trans": "gyal dang dé sé tsok nam gong su sol"
    },
    {
      "bo": "ཀྱེ་མ།  བདག་འདྲའི་སེམས་ཅན་ལས་ངན་པ།    །",
      "en": "Kyema! Sentient beings like me possess such evil karma.",
      "en-trans": "kyema dak dré semchen lé ngenpa"
    },
    {
      "bo": "ལུས་ལ་སྣ་ཚོགས་ནད་ཀྱིས་གདུང་བས་མནར།    །",
      "en": "Our bodies are racked by various forms of illness,",
      "en-trans": "lü la natsok né kyi dungwé nar"
    },
    {
      "bo": "ངག་ནི་མི་དགེའི་གཏེར་གྱི་འབྱུང་གནས་གྱུར།    །",
      "en": "Our speech is like a treasury of the non-virtuous,",
      "en-trans": "ngak ni mi gé ter gyi jungné gyur"
    },
    {
      "bo": "སེམས་ལ་བྱིང་རྨུགས་གཉིད་དང་བརྗེད་ངས་ཆེ།    །",
      "en": "Our minds are drowsy, dull, torpid and forgetful.",
      "en-trans": "sem la jing muk nyi dang jengé ché"
    },
    {
      "bo": "སྒོ་གསུམ་འཁྲུལ་པའི་རང་བཞིན་འདི་འདྲ་བའི།    །",
      "en": "May the victorious ones and their heirs",
      "en-trans": "go sum trulpé rangzhin dindra bé"
    },
    {
      "bo": "གནས་ངན་ལེན་ལ་སྲས་བཅས་རྒྱལ་བ་ཡི།    །",
      "en": "Look with great compassion upon the deluded nature of our three doors,",
      "en-trans": "né ngen len la sé ché gyalwa yi"
    },
    {
      "bo": "ཐུགས་རྗེ་ཆེན་པོས་ངེས་པར་གཟིགས་སུ་གསོལ།    །",
      "en": "And their tendencies which lead to states of misery.",
      "en-trans": "tukjé chenpö ngepar zik su sol"
    },
    {
      "bo": "བདག་ནི་བླང་དོར་ཅུང་ཟད་ཤེས་ནའང་།    །",
      "en": "I know a little of what to adopt and to avoid,",
      "en-trans": "dak ni langdor chungzé shé na ang"
    },
    {
      "bo": "ཤེས་བཞིན་ཉོན་མོངས་ཆང་གི་རབ་མྱོས་པས།    །",
      "en": "But my vigilance is as if intoxicated by the kleśas,",
      "en-trans": "shezhin nyönmong chang gi rab nyöpé"
    },
    {
      "bo": "དབང་མེད་གྱུར་པའི་སྐྱེ་ངན་བདག་ཉིད་ལ།    །",
      "en": "And I am helpless—O buddhas and bodhisattvas,",
      "en-trans": "wangmé gyurpé kyé ngen daknyi la"
    },
    {
      "bo": "རྒྱལ་སྲས་རྣམས་ཀྱིས་སྐྱོབ་པར་མཛད་དུ་གསོལ།    །",
      "en": "Protect me, I pray, wretched as I am.",
      "en-trans": "gyalsé nam kyi kyobpar dzé du sol"
    },
    {
      "bo": "ལས་ཉོན་འཁྲུལ་འཁོར་དྲག་པོ་བཟློག་པ་དང་།    །",
      "en": "Stop the process of karma and the kleśas",
      "en-trans": "lé nyön trulkhor drakpo dokpa dang"
    },
    {
      "bo": "འཁོར་བའི་མུན་པ་སྨུག་པོ་བསལ་དུ་གསོལ།    །",
      "en": "And dispel the dense darkness of saṃsāra!",
      "en-trans": "khorwé münpa mukpo sal du sol"
    },
    {
      "bo": "ཡེ་ཤེས་ཟེར་གྱིས་སྣང་བའི་སྒོ་ཕྱེས་ལ།    །",
      "en": "Open the way to light through your wisdom rays,",
      "en-trans": "yeshe zer gyi nangwé go ché la"
    },
    {
      "bo": "མ་འཁྲུལ་གནས་ལུགས་ཟབ་མོ་དེ་ཁོ་ནའི།    །",
      "en": "And reveal to me, I pray, the undeluded state,",
      "en-trans": "ma trul neluk zabmo dé khoné"
    },
    {
      "bo": "རང་བཞིན་མངོན་གྱུར་བདག་ལ་མཛད་དུ་གསོལ།    །",
      "en": "The profound nature of reality, exactly as it is.",
      "en-trans": "rangzhin ngöngyur dak la dzé du sol"
    },
    {
      "bo": "ཀྱེ་མ་ཀྱི་ཧུད་རྒྱལ་བ་ཐུགས་རྗེ་ཅན།    །",
      "en": "Kyema Kyihü! O compassionate conquerors,",
      "en-trans": "kyema kyihü gyalwa tukjé chen"
    },
    {
      "bo": "ད་ལྟ་ཉིད་དུ་སྲིད་པའི་འདམ་ལས་དྲོངས།    །",
      "en": "Lead me from the mire of existence, here and now,",
      "en-trans": "danta nyi du sipé dam lé drong"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་གི་ལམ་ལ་དྲོང་དུ་གསོལ།    །",
      "en": "And guide me along the path of supreme awakening.",
      "en-trans": "changchub chok gi lam la drong du sol"
    },
    {
      "bo": "སྒྲིབ་པའི་དྲི་མ་དག་ཅིང་བྱང་བ་དང་།    །",
      "en": "Cleanse and purify the stains of my obscurations,",
      "en-trans": "dribpé drima dak ching jangwa dang"
    },
    {
      "bo": "རྟོགས་པའི་ཡོན་ཏན་ཉམས་འོག་ཆུད་པ་དང་།    །",
      "en": "Help me to experience the qualities of realization,",
      "en-trans": "tokpé yönten nyam ok chüpa dang"
    },
    {
      "bo": "སྐུ་བཞིའི་རྒྱལ་ས་ཐོབ་པར་མཛད་དུ་གསོལ།    །",
      "en": "And cause me to attain the kingdom of the four kāyas!",
      "en-trans": "ku zhi gyalsa tobpar dzé du sol"
    }
  ]
}