{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chatral-rinpoche/essence-of-all-the-buddhas",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དུས་གསུམ་སངས་རྒྱས་ཐམས་ཅད་སོགས།",
    "en": "Essence of All the Buddhas of Past, Present and Future"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ངོ་བོ་བླ་མ་རིན་པོ་ཆེ་མཁྱེན་ནོ།",
      "en": "Essence of all the buddhas of past, present and future, precious guru, watch over me.",
      "en-trans": "dü sum sangye tamché kyi ngowo lama rinpoche khyen no"
    },
    {
      "bo": "བདག་གི་རྒྱུད་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire my mind with your blessings, I pray.",
      "en-trans": "dak gi gyü jingyi lab tu sol"
    },
    {
      "bo": "བློ་ཆོས་སུ་འགྲོ་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that my mind may turn towards the Dharma.",
      "en-trans": "lo chö su drowar jingyi lab tu sol"
    },
    {
      "bo": "ཆོས་ལམ་དུ་འགྲོ་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that Dharma may progress along the path.",
      "en-trans": "chö lam du drowar jingyi lab tu sol"
    },
    {
      "bo": "ལམ་འཁྲུལ་བར་ཞིག་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that the path may overcome delusion.",
      "en-trans": "lam trulwar zhikpar jingyi lab tu sol"
    },
    {
      "bo": "འཁྲུལ་སྣང་ཡེ་ཤེས་སུ་འཆར་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that deluded perception may dawn as wisdom.",
      "en-trans": "trulnang yeshe su charwar jingyi lab tu sol"
    },
    {
      "bo": "ཆོས་མིན་རྣམ་རྟོག་འགགས་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that all non-dharmic thoughts may cease.",
      "en-trans": "chö min namtok gakpar jingyi lab tu sol"
    },
    {
      "bo": "ཉིན་མཚན་ཆོས་ལ་འདའ་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།",
      "en": "Inspire me with your blessings, I pray, so that day and night may be dedicated to Dharma.",
      "en-trans": "nyintsen chö la dawar jingyi lab tu sol"
    }
  ]
}