{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/prayer-for-disciples",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སློབ་མས་བསྐུལ་བའི་གསོལ་འདེབས།",
    "en": "fromA Shower of Precious Blessings"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོཿ",
      "en": "How amazing!",
      "en-trans": "emaho"
    },
    {
      "bo": "གདོད་མའི་མགོན་པོ་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་། །",
      "en": "Primordial protector, dharmakāya Samantabhadra;",
      "en-trans": "dömé gönpo chöku kuntuzang"
    },
    {
      "bo": "ལོངས་སྤྱོད་རྫོགས་སྐུ་རིགས་ལྔ་ཡབ་ཡུམ་བཅུ། །",
      "en": "Five sambhogakāya families, the ten Lords and Ladies;",
      "en-trans": "longchö dzok ku rik nga yabyum chu"
    },
    {
      "bo": "སྤྲུལ་སྐུ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དང་། །",
      "en": "Nirmāṇakāya buddhas, Śākyamuni and all thousand and two teachers;",
      "en-trans": "tulku sangye shakya tubpa dang"
    },
    {
      "bo": "སྟོན་པ་སྟོང་རྩ་ཉེ་བའི་སྲས་ཆེན་སོགས། །",
      "en": "Cose heart-son heirs and all such noble beings;",
      "en-trans": "tönpa tong tsa nyewé sé chen sok"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་བྱོན་པ་རྒྱལ་བའི་ཚོགས། །",
      "en": "Assembly of victorious ones of the ten directions and three times—",
      "en-trans": "chok chu dü sum jönpa gyalwé tsok"
    },
    {
      "bo": "བདེ་བར་གཤེགས་པ་རྣམས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To all the sugatas, I pray!",
      "en-trans": "dewar shekpa nam la solwa deb"
    },
    {
      "bo": "བདག་དང་འགྲོ་དྲུག་འཁོར་བའི་གནས་ནས་དྲོངས། །",
      "en": "Guide me and all beings, all six classes, out of samsara!",
      "en-trans": "dak dang dro druk khorwé né né drong"
    },
    {
      "bo": "འཇིག་རྟེན་མིག་གྱུར་འཕགས་ཡུལ་སློབ་དཔོན་བརྒྱད་། །",
      "en": "Eight teachers of the noble land, eyes of the world;",
      "en-trans": "jikten mik gyur pakyul lobpön gyé"
    },
    {
      "bo": "གསང་ཆེན་སྟོན་གཙོ་གུ་རུ་རིན་པོ་ཆེ། །",
      "en": "Chief teacher of the great secret, Guru Rinpoche;",
      "en-trans": "sang chen tön tso guru rinpoche"
    },
    {
      "bo": "གསང་སྔགས་བཀའ་ཡི་བསྡུ་དཔོན་མཚོ་རྒྱལ་མ། །",
      "en": "Lady Tsogyal, compiler of the secret mantra teachings and",
      "en-trans": "sang ngak ka yi du pön tsogyalma"
    },
    {
      "bo": "ཐུགས་བྱོན་མུ་ཏྲ་མངའ་བདག་ཡབ་སྲས་བཞི། །",
      "en": "The guru’s heart-mudrā consort; the monarch and his three sons;",
      "en-trans": "tuk jön mu tra ngadak yabsé zhi"
    },
    {
      "bo": "རྗེ་འབངས་ཉེར་ལྔ་མཁས་དང་གྲུབ་པའི་གཙོ། །",
      "en": "The twenty-five subjects, foremost scholars and siddhas—",
      "en-trans": "jebang nyernga khé dang drubpé tso"
    },
    {
      "bo": "བོད་ལ་དྲིན་ཅན་མཛད་ལ་གསོལ་བ་འདེབས། །",
      "en": "To all who have shown such kindness to Tibet, I pray!",
      "en-trans": "bö la drinchen dzé la solwa deb"
    },
    {
      "bo": "སྙིགས་མའི་བོད་འབངས་རྣམས་ལ་ཐུགས་རྗེའི་གཟིགས། །",
      "en": "Please look with compassion upon the Tibetan people of this degenerate age.",
      "en-trans": "nyikmé bö bang nam la tukjé zik"
    },
    {
      "bo": "འཇིག་རྟེན་སྒྲོན་མེ་གཏེར་ཆེན་བརྒྱ་རྩའི་ཞབས། །",
      "en": "Lamps of the world—the hundred and eight great tertöns;",
      "en-trans": "jikten drönmé terchen gya tsé zhab"
    },
    {
      "bo": "རིས་མེད་འགྲོ་འདྲེན་གཏེར་ཕྲན་སྟོང་རྩ་གཉིས། །",
      "en": "The thousand and two minor tertöns, unbiased guides of beings;",
      "en-trans": "rimé dro dren tertren tong tsa nyi"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ཡང་གཏེར་བྱེ་བའི་ཚོགས། །",
      "en": "And the millions of tertöns who find treasures anew, benefiting all they encounter;",
      "en-trans": "dreltsé dönden yangter jewé tsok"
    },
    {
      "bo": "ཆོས་བདག་བརྒྱུད་འཛིན་ཁྱད་པར་ད་ལྟའི་དུས། །",
      "en": "The Dharma lords and lineage holders; and, in particular, all those in this present age",
      "en-trans": "chödak gyü dzin khyepar danté dü"
    },
    {
      "bo": "མཁས་བཙུན་ཕུལ་བྱུང་བསྟན་འགྲོའི་མིག་རྣམས་སུ། །",
      "en": "Who are perfectly learned and disciplined, unerring and supreme,",
      "en-trans": "khé tsün puljung ten drö mik nam su"
    },
    {
      "bo": "མཛེས་པར་གར་སྒྱུར་འཁྲུལ་མེད་གང་ཟག་མཆོག །",
      "en": "And whose entrancing dance beautifies the doctrine and beings—",
      "en-trans": "dzepar gar gyur trulmé gangzak chok"
    },
    {
      "bo": "ཐེ་ཚོམ་གནས་མེད་རྣམས་ལ་གསོལ་བ་འདེབས། །",
      "en": "To all of you who are beyond all doubt, I pray!",
      "en-trans": "tetsom nemé nam la solwa deb"
    },
    {
      "bo": "ཁྱད་པར་སྙིགས་མའི་བསྟན་འཛིན་པཎྜི་ཏ། །",
      "en": "And especially, the paṇḍita who upholds the doctrine in this dark age,",
      "en-trans": "khyepar nyikmé tendzin pandita"
    },
    {
      "bo": "ཆེ་མཆོག་འདུས་རྩལ་བྱང་སེམས་ཚད་མེད་ཅིང་། །",
      "en": "Chemchok Dütsal of immeasurable awakened mind,",
      "en-trans": "chemchok dü tsal changsem tsemé ching"
    },
    {
      "bo": "འགྲུ་རྗེའི་སྡོང་འཁྲུངས་མཛད་པ་བཅུ་གཉིས་ཀྱི། །",
      "en": "Who took birth on the anthers of a lotus and displayed the twelve deeds,",
      "en-trans": "dru jé dong trung dzepa chunyi kyi"
    },
    {
      "bo": "འགྲོ་འདྲེན་མགོན་པོ་དཔལ་ལྡན་འགྱུར་མེད་ཅེས། །",
      "en": "The guide and guardian of beings,  Palden Gyurmé",
      "en-trans": "dro dren gönpo palden gyurmé ché"
    },
    {
      "bo": "བཀའ་དྲིན་ཅན་གྱི་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Ever-gracious guru, to you I pray!",
      "en-trans": "kadrinchen gyi lamar solwa deb"
    },
    {
      "bo": "གཅིག་ཆོག་གྱུར་པར་གསོལ་བ་བཏབ་པའི་མཐུས། །",
      "en": "Through the power of this prayer to you, all-encompassing embodiments,",
      "en-trans": "chikchok gyurpar solwa tabpé tü"
    },
    {
      "bo": "ཕྱི་ནང་བར་ཆད་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me that outer, inner, and secret obstacles are quelled!",
      "en-trans": "chi nang barché zhiwar jingyi lob"
    },
    {
      "bo": "དངོས་གྲུབ་རྣམ་གཉིས་ཐོབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless me that the two siddhis are attained!",
      "en-trans": "ngödrub nam nyi tobpar jingyi lob"
    },
    {
      "bo": "རང་སེམས་སངས་རྒྱས་མངོན་སུམ་མཐོང་བ་དང་། །",
      "en": "Bless me that I may directly see my own mind as the buddha,",
      "en-trans": "rangsem sangye ngönsum tongwa dang"
    },
    {
      "bo": "ནམ་ཞིག་སྐྱེ་འཆིའི་ཁ་ལོ་གར་བསྒྱུར་ཀྱང་། །",
      "en": "And that throughout all lifetimes, wherever birth and death lead me,",
      "en-trans": "namzhik kyechi khalo gar gyur kyang"
    },
    {
      "bo": "ཚེ་རབས་ཨོ་རྒྱན་པདྨས་རྗེས་འཛིན་ཤོག །",
      "en": "I am accepted and embraced by Orgyen Pema, Lotus of Uḍḍiyāna!",
      "en-trans": "tserab orgyen pemé jedzin shok"
    }
  ]
}