{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/prayer-for-lama-choying",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མ་ཆོས་དབྱིངས་དང་སྒྲུབ་པ་ཡོན་ཏན་གྱིས་བསྐུལ་བའི་གསོལ་འདེབས།",
    "en": "fromA Shower of Precious Blessings"
  },
  "text": [
    {
      "bo": "རྗེ་སྐུ་གསུམ་གྱི་བདག་ཉིད་བླ་མ་ལ། །",
      "en": "Lord Guru, embodiment of the three kāyas,",
      "en-trans": "jé ku sum gyi daknyi lama la"
    },
    {
      "bo": "ཡིད་གདུང་བ་དྲག་པོས་གསོལ་བ་འདེབས། །",
      "en": "I pray to you with intense and ferocious longing!",
      "en-trans": "yi dungwa drakpö solwa deb"
    },
    {
      "bo": "ཕ་ཁྱེད་ཀྱི་ཐུགས་རྗེས་མ་གཟིགས་ན། །",
      "en": "Father, if you don’t look upon me with compassion,",
      "en-trans": "pa khyé kyi tukjé ma zik na"
    },
    {
      "bo": "མི་བདག་ལ་རེ་ས་གཞན་ན་མེད། །",
      "en": "I will have nowhere else to place my hope!",
      "en-trans": "mi dak la resa zhen namé"
    },
    {
      "bo": "ང་ཆོས་སྒོ་ལ་ཞུགས་ནས་ད་ལྟའི་བར། །",
      "en": "In the time since I first entered the gateway of Dharma,",
      "en-trans": "nga chögo la zhuk né danté bar"
    },
    {
      "bo": "སེམས་མི་འཇིགས་གཏད་སོའི་གདེང་མི་འདུག །",
      "en": "I have yet to find the fearless stronghold of certainty.",
      "en-trans": "sem mi jik tesö deng mi duk"
    },
    {
      "bo": "ད་ལྟ་རང་ཤི་ན་ཅི་ཞིག་བྱ། །",
      "en": "What will I do if death comes to me right now?",
      "en-trans": "danta rang shi na chizhik ja"
    },
    {
      "bo": "ཆོས་སྙིང་ནས་བྱེད་པ་ཞིག་བྱིན་གྱིས་རློབས། །",
      "en": "Please bless me that I may practice the Dharma from my heart!",
      "en-trans": "chö nying né jepa zhik jingyi lob"
    },
    {
      "bo": "སྡོམ་གསུམ་ལ་བརྩོན་པ་བྱས་ཁུལ་ཀྱང་། །",
      "en": "Though I make a pretense of striving in the threefold vows,",
      "en-trans": "dom sum la tsönpa jé khul kyang"
    },
    {
      "bo": "བདག་འཛིན་གཏན་ནས་མ་ཆོད་པས། །",
      "en": "I have still not cut through self-clinging, not one bit;",
      "en-trans": "dakdzin ten né machöpé"
    },
    {
      "bo": "འཁོར་བ་ལས་ཐར་ཐབས་ཅི་ཞིག་ཡོད། །",
      "en": "How on earth will I ever go beyond saṃsāra?",
      "en-trans": "khorwa lé tar tab chizhik yö"
    },
    {
      "bo": "བདག་མེད་རྟོགས་པ་ཞིག་བྱིན་གྱིས་རློབས། །",
      "en": "Please bless me that I may realize selflessness!",
      "en-trans": "dakmé tokpa zhik jingyi lob"
    },
    {
      "bo": "སྒྲུབ་ལ་མི་ཚེ་ཕུད་ན་ཡང་། །",
      "en": "Even though I have spent my whole life practicing,",
      "en-trans": "drub la mitsé pü na yang"
    },
    {
      "bo": "དུག་མཉམ་ཕྱོགས་ཙམ་མ་མཐོང་བས། །",
      "en": "I still don’t see purity and equality, not even slightly;",
      "en-trans": "duk nyam chok tsam matongwé"
    },
    {
      "bo": "ཚེ་འདིར་སངས་རྒྱས་ག་ལ་འགྲུབ། །",
      "en": "How will I ever reach awakening in this life?",
      "en-trans": "tsé dir sangye gala drub"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་མྱུར་དུ་སྨིན་པ་ཞིག་བྱིན་གྱིས་རློབས། །",
      "en": "Please bless me to swiftly ripen in generation and completion!",
      "en-trans": "kyedzok nyurdu minpa zhik jingyi lob"
    }
  ]
}