{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-supreme-deities",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལྷག་པའི་ལྷའི་གསོལ་འདེབས། །",
    "en": "Prayer to the Supreme Deities"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།",
      "en": "Homage to the guru!",
      "en-trans": "namo guru"
    },
    {
      "bo": "རྩ་གསུམ་རབ་འབྱམས་འདུས་པའི་བདག་ཉིད་ཆེ། །",
      "en": "Great being, perfect embodiment of the infinite Three Roots,",
      "en-trans": "tsa sum rabjam düpé daknyi ché"
    },
    {
      "bo": "མ་ཧཱ་གུ་རུ་པདྨ་འབྱུང་གནས་ལ། །",
      "en": "Mahāguru Padmasambhava,",
      "en-trans": "maha guru pema jungné la"
    },
    {
      "bo": "བཟོད་མེད་གདུང་ཤུགས་དྲག་པོས་གསོལ་བ་འདེབས། །",
      "en": "With unbearably intense and fervent longing, I pray to you:",
      "en-trans": "zömé dungshuk drakpö solwa deb"
    },
    {
      "bo": "བར་ཆད་ཀུན་སེལ་མཆོག་ཐུན་དངོས་གྲུབ་སྩོལ། །",
      "en": "Dispel all obstacles and grant me supreme and common siddhis!",
      "en-trans": "barché kün sel choktün ngödrub tsol"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་དང་བཅས་པའི་ཕྲིན་ལས་ཀྱི། །",
      "en": "Natural expression of the enlightened activities of the buddhas and their heirs,",
      "en-trans": "gyalwa sé dang chepé trinlé kyi"
    },
    {
      "bo": "རང་གཟུགས་རྗེ་བཙུན་འཕགས་མ་སྒྲོལ་མ་ལ། །",
      "en": "Reverend lady Tārā,",
      "en-trans": "rang zuk jetsün pakma drolma la"
    },
    {
      "bo": "ཡིད་ཆེས་གདུང་ཤུགས་དྲག་པོས་གསོལ་བ་འདེབས། །",
      "en": "To you I pray with confident and fervent longing:",
      "en-trans": "yiché dungshuk drakpö solwa deb"
    },
    {
      "bo": "རྟག་ཏུ་བདག་ལ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "May you always inspire me with your blessing!",
      "en-trans": "taktu dak la jingyi lab tu sol"
    },
    {
      "bo": "འཆི་མེད་མཆོག་སྦྱིན་ཟླ་བའི་མདངས་ལྡན་མ། །",
      "en": "Bestower of supreme deathlessness glowing like the moon,",
      "en-trans": "chimé chok jin dawé dangden ma"
    },
    {
      "bo": "ཡེ་ཤེས་སྤྱན་བདུན་རྣམ་པར་བཀྲ་བ་ཡི། །",
      "en": "Your seven eyes of wisdom bright and distinct.",
      "en-trans": "yeshe chen dün nampar trawa yi"
    },
    {
      "bo": "འཆི་མེད་འཕགས་མ་ཡིད་བཞིན་འཁོར་ལོ་ལ། །",
      "en": "Noble lady of immortality, Wish-Fulfilling Wheel—",
      "en-trans": "chimé pakma yizhin khorlo la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཚེ་ཡི་དངོས་གྲུབ་སྩོལ། །",
      "en": "To you I pray: grant me siddhi of longevity!",
      "en-trans": "solwa deb so tsé yi ngödrub tsol"
    },
    {
      "bo": "བདུད་དང་དམ་སྲི་ཐམས་ཅད་འདུལ་བའི་གཤེད། །",
      "en": "Destroyer who subjugates all māras and samaya violators,",
      "en-trans": "dü dang damsi tamché dulwé shé"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཕྲིན་ལས་བྱེད་པོའི་གཟུགས། །",
      "en": "In a form that carries out the enlightened activity of all the victorious ones,",
      "en-trans": "gyalwa kün gyi trinlé jepö zuk"
    },
    {
      "bo": "དཔལ་ཆེན་རྡོ་རྗེ་གཞོན་ནུ་ཁྲོ་བོའི་རྒྱལ། །",
      "en": "Great and glorious Vajrakumāra, king of the wrathful—",
      "en-trans": "palchen dorjé zhönnu trowö gyal"
    },
    {
      "bo": "རྟག་ཏུ་ཁྱོད་སྒྲུབ་བདུད་ལས་རྒྱལ་བར་མཛོད། །",
      "en": "As I constantly carry out your practice, grant me victory over the māras!",
      "en-trans": "taktu khyö drub dü lé gyalwar dzö"
    },
    {
      "bo": "འཇིགས་རུང་སྐུ་ནི་གར་དགུའི་ཉམས་ལྡན་པས། །",
      "en": "With a terrifying form possessing the nine wrathful expressions,",
      "en-trans": "jikrung ku ni gar gü nyam denpé"
    },
    {
      "bo": "བདུད་བགེགས་ལོག་འདྲེན་ཐམས་ཅད་རྡུལ་དུ་བརླག །",
      "en": "You annihilate all māras, obstructors and negative forces.",
      "en-trans": "dü gek lokdren tamché dul du lak"
    },
    {
      "bo": "བསྟན་སྲུང་ཀུན་གྱི་སྡེ་དཔོན་རྡོ་རྗེ་གུར། །",
      "en": "Pañjaranātha Mahākāla, chief of all Dharma guardians—",
      "en-trans": "tensung kün gyi depön dorjé gur"
    },
    {
      "bo": "བདག་དང་མི་འབྲལ་བུ་བཞིན་སྐྱོང་བར་མཛོད། །",
      "en": "Never be apart from me, but care for me as your own child!",
      "en-trans": "dak dang mindral bu zhin kyongwar dzö"
    }
  ]
}