{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/lobzang-chokyi-gyaltsen/prayer-for-lobzang-chodzin",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །པཎ་ཆེན་བློ་བཟང་ཆོས་རྒྱན་གྱིས་ལྕང་ར་ཆོས་མཛད་མ་བློ་བཟང་ཆོས་འཛིན་ལ་གསུངས་པ།",
    "en": "Prayer for Lobzang Chödzin, Dharma Practitioner of Changra"
  },
  "text": [
    {
      "bo": "སྭ་སྟི།",
      "en": "Svasti!",
      "en-trans": "swasti"
    },
    {
      "bo": "མཉམ་མེད་ཟས་གཙང་སྲས་དང་མར་མེ་མཛད། །",
      "en": "Glorious one who holds the victory banner of teaching and practice",
      "en-trans": "nyammé zetsang sé dang marmé dzé"
    },
    {
      "bo": "ཀུན་མཁྱེན་གཉིས་པ་བློ་བཟང་གྲགས་པ་ཡི། །",
      "en": "In the Dharma tradition of the peerless son of Śuddhodana,1",
      "en-trans": "künkhyen nyipa lo zang drakpa yi"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཆོས་ཀྱི་རྒྱལ་མཚན་འཛིན་པའི་དཔལ། །",
      "en": "Dīpaṃkara2and the second omniscient one, Lobzang Drakpa—3",
      "en-trans": "shedrub chökyi gyaltsen dzinpé pal"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Venerable guru, at your feet I pray.",
      "en-trans": "jetsün lamé zhab la solwa deb"
    },
    {
      "bo": "མཐའ་ཡས་འགྲོ་བའི་བསླུ་མེད་སྐྱབས་ཀྱི་མཆོག །",
      "en": "Supreme, unfailing refuge for all beings, infinite in number,",
      "en-trans": "tayé drowé lumé kyab kyi chok"
    },
    {
      "bo": "བློ་བཟང་རྒྱལ་བ་ཀུན་གྱི་མཛད་པའི་ཕུལ། །",
      "en": "With noble mind, as the excellent activity of all the victorious ones,",
      "en-trans": "lo zang gyalwa kün gyi dzepé pul"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་སྲིད་སྐྱོང་བའི་དགེ་མཚན་གྱི། །",
      "en": "You preside auspiciously over the kingdom of Dharma—",
      "en-trans": "chö kyi gyalsi kyongwé getsen gyi"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Glorious guru, at your feet I pray.",
      "en-trans": "palden lamé zhab la solwa deb"
    },
    {
      "bo": "འདིས་མཚོན་དུས་གསུམ་རྣམ་དཀར་དགེ་བའི་ཚོགས། །",
      "en": "With this token deed, I dedicate all the virtue of the three times,",
      "en-trans": "di tsön dü sum namkar gewé tsok"
    },
    {
      "bo": "དངོས་གྲུབ་འབྱུང་གནས་དྲིན་ཆེན་བླ་མ་ཡིས། །",
      "en": "So that I may always be guided and cared for by the gracious guru,",
      "en-trans": "ngödrub jungné drinchen lama yi"
    },
    {
      "bo": "འབྲལ་མེད་རྗེས་བཟུང་ས་ལམ་མཐར་ཕྱིན་ཏེ། །",
      "en": "The source of all attainment, complete the paths and stages,",
      "en-trans": "dralmé jezung salam tarchin té"
    },
    {
      "bo": "སྐུ་གསུམ་གོ་འཕང་མྱུར་དུ་ཐོབ་ཕྱིར་བསྔོ། །",
      "en": "And swiftly attain the level of the three kāyas.",
      "en-trans": "ku sum gopang nyurdu tob chir ngo"
    },
    {
      "bo": "ཡུལ་ཕྱོགས་འདིར་ཡང་འཐབ་རྩོད་ལོ་ཉེས་དང་། །",
      "en": "May this region be free from every source of difficulty,",
      "en-trans": "yul chok dir yang tabtsö lonyé dang"
    },
    {
      "bo": "ནད་རིམས་ལ་སོགས་རྒུད་པ་ཀུན་བྲལ་ཞིང་། །",
      "en": "Such as conflict, poor harvests, disease and epidemics.",
      "en-trans": "né rim lasok güpa kündral zhing"
    },
    {
      "bo": "ཚེ་རིང་ནད་མེད་དཔལ་འབྱོར་ལོངས་སྤྱོད་རྒྱས། །",
      "en": "Let everyone enjoy long life, good health and prosperity,",
      "en-trans": "tsering nemé paljor longchö gyé"
    },
    {
      "bo": "བཀྲ་ཤིས་རྒྱ་མཚོས་ཕྱོགས་ཀུན་གང་བར་ཤོག །",
      "en": "And oceans of auspiciousness fill the land in every direction.",
      "en-trans": "tashi gyatsö chok kün gangwar shok"
    },
    {
      "bo": "ཆོས་གྲྭ་འདིར་ཡང་དགེ་འདུན་ཐུགས་མཐུན་ཞིང་། །",
      "en": "In this dharma centre may the saṅgha always be harmonious,",
      "en-trans": "chö dra dir yang gendün tuktün zhing"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་རྣམ་དག་འདོད་དགུའི་འབྱོར་བ་རྒྱས། །",
      "en": "Observe pure discipline and gain everything they might need.",
      "en-trans": "tsultrim namdak dögü jorwa gyé"
    },
    {
      "bo": "བཤད་དང་སྒྲུབ་པས་ཉིན་མཚན་འདའ་བ་ཡིས། །",
      "en": "Through their pursuit of learning and practice by day and night,",
      "en-trans": "shé dang drubpé nyintsen dawa yi"
    },
    {
      "bo": "ཐུབ་བསྟན་དར་རྒྱས་ཡུན་རིང་གནས་གྱུར་ཅིག །",
      "en": "May Śākyamuni’s teachings flourish and endure long into the future.",
      "en-trans": "tubten dargyé yün ring né gyur chik"
    }
  ]
}