{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/short-prayer-for-rigdzin-paljor",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རིག་འཛིན་དཔལ་འབྱོར་གྱིས་བསྐུལ་བའི་གསོལ་འདེབས་བསྡུས་པ།",
    "en": "fromA Shower of Precious Blessings"
  },
  "text": [
    {
      "bo": "ཨོྃ་ཨཱཿཧཱུྃ།"
    },
    {
      "bo": "རིག་པའི་རྒྱལ་པོ་པདྨ་འོད་འབར་གྱི། །",
      "en": "To the manifold display of Blazing Light Lotus—sovereign of awareness—",
      "en-trans": "rigpé gyalpo pema öbar gyi"
    },
    {
      "bo": "རྣམ་པར་རོལ་པ་བླ་མ་ཡི་དམ་དང་། །",
      "en": "The gurus, the yidams, the ḍākinīs, and the Dharma protectors,",
      "en-trans": "nampar rolpa lama yidam dang"
    },
    {
      "bo": "མཁའ་འགྲོ་ཆོས་སྐྱོང་ཁྱད་པར་སངས་རྒྱས་གླིང་། །",
      "en": "And particularly to Sangye Lingpa",
      "en-trans": "khandro chökyong khyepar sangye ling"
    },
    {
      "bo": "བླ་མ་དགོངས་འདུས་ལྷ་ལ་གསོལ་བ་འདེབས། །",
      "en": "And the deities of the Assembled Realization of the Gurus2—to all of you, I pray!",
      "en-trans": "lama gongdü lha la solwa deb"
    },
    {
      "bo": "རིག་པ་ཐབས་མཆོག་ཁྲག་འཐུང་བདུད་འདུལ་གླིང་། །",
      "en": "To awareness, the supreme method, the blood-drinker Düdül Lingpa;",
      "en-trans": "rigpa tab chok traktung düdul ling"
    },
    {
      "bo": "སྟོང་པའི་བདག་ཉིད་གསང་ཡུམ་མེ་ཏོག་འཆང་། །",
      "en": "To the identity of emptiness, the secret consort, Flower-Holder;",
      "en-trans": "tongpé daknyi sang yum metok chang"
    },
    {
      "bo": "རིག་སྟོང་དབྱེར་མེད་མཆོག་གྱུར་གླིང་པའི་ངང་། །",
      "en": "To awareness and emptiness indivisible, Chokgyur Lingpa—",
      "en-trans": "riktong yermé chokgyur lingpé ngang"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བདག་རྒྱུད་བྱིན་གྱིས་རློབས། །",
      "en": "To all of you, I pray! Please bless my mindstream!",
      "en-trans": "solwa deb so dak gyü jingyi lob"
    },
    {
      "bo": "གནས་སྐབས་བདེ་སྐྱིད་ཉེས་ཞི་ལེགས་འཕེལ་ནས། །",
      "en": "In this temporary state, may we have bliss and joy, may negativity be subdued, and may the positive increase.",
      "en-trans": "nekab dekyi nyé zhi lek pel né"
    },
    {
      "bo": "རྫོགས་ལྡན་དང་པོའི་དཔལ་ལ་སྤྱོད་གྱུར་ནས། །",
      "en": "May we enjoy the splendor of the first eon, the Golden Age,",
      "en-trans": "dzokden dangpö pal la chö gyur né"
    },
    {
      "bo": "འཆི་ཚེ་པདྨ་འོད་དུ་མྱུར་བགྲོད་ཤོག །",
      "en": "And at death go swiftly to the palace of Lotus Light!",
      "en-trans": "chi tsé pema ö du nyur drö shok"
    },
    {
      "bo": "ཨོྃ་ཨཱཿཧཱུྃ་བཛྲ་གུ་རུ་དྷེ་ཝ་དྷཱ་ཀི་ནཱི་སརྦ་སིདྡྷི་ཕ་ལ་ཧཱུྃ་ཨཱཿ"
    }
  ]
}