{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/yukhok-chatralwa/synthesis-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁས་གྲུབ་བླ་མ་དུ་མའི་གསུང་བྱིན་རླབས་ཅན་ཕྱོགས་གཅིག་ཏུ་བསྡུས་པ།",
    "en": "Prayer That Synthesizes the Blessed Speech of Several Learned and Accomplished Masters"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་དྲིན་ཆེན་བླ་མ་ལ།",
      "en": "To the gracious guru, who embodies all sources of refuge,",
      "en-trans": "kyabné kündü drinchen lama la"
    },
    {
      "bo": "།གསོལ་བ་འདེབས་སོ་ཐུགས་རྗེའི་སྤྱན་གྱིས་གཟིགས། །",
      "en": "I pray; please look upon me with your eyes of compassion.",
      "en-trans": "solwa deb so tukjé chen gyi zik"
    },
    {
      "bo": "འཁོར་བར་ཞེན་པ་ལོག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may dispel my attachment to saṃsāra.",
      "en-trans": "khorwar zhenpa lokpar jingyi lob"
    },
    {
      "bo": "ངེས་འབྱུང་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that renunciation may arise in my mindstream.",
      "en-trans": "ngejung gyü la kyewar jingyi lob"
    },
    {
      "bo": "ཚེ་འདི་བློ་ཡིས་ཐོང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may let go my concerns for this life.",
      "en-trans": "tsé di lo yi tongwar jingyi lob"
    },
    {
      "bo": "ཉམས་དགའ་རི་ཁྲོད་འགྲིམ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may journey to pleasant mountain retreats.",
      "en-trans": "nyamga ritrö drimpar jingyi lob"
    },
    {
      "bo": "གྲོགས་མེད་བློ་བདེ་དྲན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may bring to mind contentment while alone.",
      "en-trans": "drokmé lo dé drenpar jingyi lob"
    },
    {
      "bo": "དགོས་མེད་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that freedom from compulsion1may arise in my mindstream.",
      "en-trans": "gömé gyü la kyewar jingyi lob"
    },
    {
      "bo": "དལ་འབྱོར་སྙིང་པོ་ལོན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may make the most of the freedoms and advantages.",
      "en-trans": "daljor nyingpo lönpar jingyi lob"
    },
    {
      "bo": "འཆི་བ་སྙིང་ནས་དྲན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may remember mortality from the depths of my heart.",
      "en-trans": "chiwa nying né drenpar jingyi lob"
    },
    {
      "bo": "མི་རྟག་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that recognition of impermanence may arise in my mindstream.",
      "en-trans": "mi tak gyü la kyewar jingyi lob"
    },
    {
      "bo": "ནམ་འཆི་ཆ་མེད་དྲན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may remember it is uncertain when I will die.",
      "en-trans": "namchi chamé drenpar jingyi lob"
    },
    {
      "bo": "འགྲོ་དྲུག་ཕ་མར་ཤེས་པར་བྱིན་་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may recognize the beings of the six classes as my parents.",
      "en-trans": "dro druk pamar shepar jin gyi lob"
    },
    {
      "bo": "ཚད་མེད་སྙིང་རྗེ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may develop boundless compassion.",
      "en-trans": "tsemé nyingjé kyewar jingyi lob"
    },
    {
      "bo": "དགེ་སྡིག་བླང་དོར་ཤེས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may know the virtues to adopt and non-virtues to avoid.",
      "en-trans": "gedik langdor shepar jingyi lob"
    },
    {
      "bo": "རྒྱུ་འབྲས་བསླུ་མེད་མཐོང་བར་བྱིན་་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may see the infallible law of cause and effect.",
      "en-trans": "gyundré lumé tongwar jin gyi lob"
    },
    {
      "bo": "ཆོས་ལ་སྙིང་རུས་ནུས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may have the determination2to practice the Dharma.",
      "en-trans": "chö la nyingrü nüpar jingyi lob"
    },
    {
      "bo": "རང་སེམས་ཆོས་དང་འདྲེས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that my mind may merge with the Dharma.",
      "en-trans": "rangsem chö dang drepar jingyi lob"
    },
    {
      "bo": "རྐྱེན་ངན་གྲོགས་སུ་འཆར་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that adverse circumstances may become my allies.",
      "en-trans": "kyen ngen drok su charwar jingyi lob"
    },
    {
      "bo": "གཟུང་འཛིན་འཁྲུལ་བ་ཞིག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that the delusion of dualistic grasping may be destroyed.",
      "en-trans": "zungdzin trulwa zhikpar jingyi lob"
    },
    {
      "bo": "འཁྲུལ་སྣང་བདེན་མེད་འཆར་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that delusive appearances may manifest as unreal.",
      "en-trans": "trulnang denmé charwar jingyi lob"
    },
    {
      "bo": "རྟག་ཏུ་བླ་མ་དྲན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may always remember the guru.",
      "en-trans": "taktu lama drenpar jingyi lob"
    },
    {
      "bo": "མོས་གུས་གཏིང་ནས་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that devotion may arise from the depths of my being.",
      "en-trans": "mögü tingné kyewar jingyi lob"
    },
    {
      "bo": "སྣང་སྲིད་བླ་མར་འཆར་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that all appearances and existence may arise as the guru.",
      "en-trans": "nangsi lamar charwar jingyi lob"
    },
    {
      "bo": "ཐུགས་ཡིད་དབྱེར་མེད་འདྲེས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that my mind and your wisdom mind may merge inseparably.",
      "en-trans": "tuk yi yermé drepar jingyi lob"
    },
    {
      "bo": "ལྟ་བ་མཐའ་བྲལ་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may realize the view beyond extremes.",
      "en-trans": "tawa tadral tokpar jingyi lob"
    },
    {
      "bo": "སྒོམ་པ་འཁོར་ཡུག་འདྲེས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that meditation may be integrated continuously.",
      "en-trans": "gompa khoryuk drepar jingyi lob"
    },
    {
      "bo": "སྤྱོད་པ་བླང་དོར་བྲལ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that my conduct may be free from acceptance and rejection.",
      "en-trans": "chöpa langdor dralwar jingyi lob"
    },
    {
      "bo": "འབྲས་བུ་སྐུ་གསུམ་ཐོབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings so that I may attain the result of the three kāyas.",
      "en-trans": "drebu ku sum tobpar jingyi lob"
    }
  ]
}