{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shechen-rabjam-rinpoche/potent-nectar-of-accomplishment",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།།བརྒྱུད་གསུམ་རིག་འཛིན་བླ་མར་གསོལ་སྨོན་དངོས་གྲུབ་བདུད་རྩིའི་བཅུད་འཛིན་ཞེས་བྱ་བ་བཞུགས་སོ།",
    "en": "A Prayer and Supplication to the Vidyādhara Gurus of the Three Lineages1"
  },
  "text": [
    {
      "bo": "གཞི་དབྱིངས་འགྱུར་མེད་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་། །",
      "en": "The unchanging basic space of the ground is the dharmakāya Samantabhadra;",
      "en-trans": "zhi ying gyurmé chöku kuntuzang"
    },
    {
      "bo": "གཞི་སྣང་ལོངས་སྐུ་ཡེ་ཤེས་རིགས་ལྔའི་སྤྲིན། །",
      "en": "Its appearances, saṃbhogakāya, are cloud-like formations, the wisdom of the five buddha families;",
      "en-trans": "zhi nang longku yeshe rik ngé trin"
    },
    {
      "bo": "འགྲོ་འདུལ་རིགས་གསུམ་དགོངས་བརྒྱུད་བླ་མ་ལ། །",
      "en": "And the three emanated lineages2destined to benefit beings are the gurus of the mind lineage –",
      "en-trans": "drodul rik sum gonggyü lama la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab char chen pob"
    },
    {
      "bo": "སྤྲུལ་པའི་རིག་འཛིན་དགའ་རབ་ཤྲཱི་སིང་། །",
      "en": "The emanated vidyādharas: Garab Dorje, Śrī Siṃha,",
      "en-trans": "trulpé rigdzin garab shiri sing"
    },
    {
      "bo": "རྒྱལ་ཀུན་ངོ་བོ་པད་འབྱུང་བི་མ་ལ། །",
      "en": "Padmasambhava, who is the embodiment of all buddhas, Vimalamitra,",
      "en-trans": "gyal kün ngowo pejung bimala"
    },
    {
      "bo": "གྲུབ་པའི་རིག་འཛིན་རྩལ་འཆང་རྣམ་བརྒྱད་ལ། །",
      "en": "And the eight highly accomplished and powerful vidyādhara masters3–",
      "en-trans": "drubpé rigdzin tsal chang nam gyé la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab char chen pob"
    },
    {
      "bo": "ཆོས་རྒྱལ་ཡབ་སྲས་བཻ་རོ་ནམ་སྙིང་འབངས། །",
      "en": "The Dharma King Tri Songdetsen, and sons; Vairotsana, Namkhai Nyingpo, and other loyal subjects;",
      "en-trans": "chögyal yabsé bairo namnying bang"
    },
    {
      "bo": "དབྱིངས་ཕྱུགས་ཡུམ་ལྔའི་རྣམ་རོལ་མཁའ་འགྲོ་ལྔ། །",
      "en": "Dhātviśvarī, Queen of Space, and the other awakened ones, whose play is as five ḍākinī consorts,4",
      "en-trans": "ying chuk yum ngé namrol khandro nga"
    },
    {
      "bo": "བཀའ་བབ་སྙན་བརྒྱུད་རིག་འཛིན་ཚོགས་བཅས་ལ། །",
      "en": "Together with the assembly of awareness-holders who have the fortune to receive the oral tradition –",
      "en-trans": "kabab nyengyü rigdzin tsok ché la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab char chen pob"
    },
    {
      "bo": "ཉང་གུར་ཀུན་མཁྱེན་ཡབ་སྲས་མངའ་པཎ་རྗེ། །",
      "en": "Omniscient father and [spiritual] son, Nyangrel Nyima Özer and Guru Chöwang;",
      "en-trans": "nyang gur künkhyen yabsé nga pen jé"
    },
    {
      "bo": "བྱང་བདག་རྡོ་རྗེ་ཐོག་མེད་ཆོས་རྗེ་གླིང་། །",
      "en": "Ngari Paṇchen, Jangdak, Dorje Thokme, Chöje Lingpa,",
      "en-trans": "jang dak dorjé tokmé chöjé ling"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་སོགས་རྣམ་རོལ་བསམས་ཡས་ལ། །",
      "en": "Jamyang Khyentse Wangpo,5and the rest – limitless emanations defying the imagination –",
      "en-trans": "khyentsé wang sok namrol samyé la"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab char chen pob"
    },
    {
      "bo": "འགྱུར༵་མེད༵་རྒྱལ་ཀུན་ངོ་བོ་རིགས་ཀྱི་བདག །",
      "en": "Unchanginglord of all buddha families – in essence you are all buddhas –",
      "en-trans": "gyurmégyal kün ngowo rik kyi dak"
    },
    {
      "bo": "སྙིགས་དུས་ཐེ༵ག་མཆོ༵ག་བཀའ་གཏེར་བཤད་སྒྲུབ་མགོན། །",
      "en": "In these decadent times you were the protector of thesupreme vehicle’s long and short lineages.6",
      "en-trans": "nyikdü tek chok kater shedrub gön"
    },
    {
      "bo": "བསྟ༵ན་པའི༵་རྒྱལ༵་མཚ༵ན་འཛིན་ཀུན་གཙུག་གི་རྒྱན། །",
      "en": "You are the crown ornament of all who hold thevictory banner of the buddhas’ teaching7–",
      "en-trans": "tenpé gyaltsen dzin kün tsuk gi gyen"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab char chen pob"
    },
    {
      "bo": "འཇམ་མགོན་མཁྱེན་བརྩེའི་ཕྲིན་ལས་རང་དབང་བསྒྱུར། །",
      "en": "Sovereign, the very activity of Jamgön Khyentse,",
      "en-trans": "jamgön khyentsé trinlé rangwang gyur"
    },
    {
      "bo": "ཀུན་གཟིགས་པདྨ་ཡེ་ཤེས་རྡོ་རྗེ་དང་། །",
      "en": "Renowned as the omniscient Pema Yeshe Dorje;8",
      "en-trans": "künzik pema yeshe dorjé dang"
    },
    {
      "bo": "བཻ་རོའི་རྣམ་རོལ་འཁྲུལ་ཞིག་དྷརྨའི་མཚན། །",
      "en": "And the emanation of Vairotsana, Trulshik Dharmamati –",
      "en-trans": "bairö namrol trulzhik dharmé tsen"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཕྲིན་ལས་ཆར་ཆེན་ཕོབས། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so trinlé char chen pob"
    },
    {
      "bo": "རབ་འབྱམས་ཆོས་ཚུལ་རྒྱ་མཚོའི་སྣོད་དུ་གྱུར། །",
      "en": "A vessel for the oceanic ways of dharma in all their immensity,9",
      "en-trans": "rabjam chö tsul gyatsö nö du gyur"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཆོས་ཀྱི་སེངྒེའི་མཚན་གྱིས་སྤུད། །",
      "en": "You are renowned as a veritable lion of the dharma of learning and accomplishment.10",
      "en-trans": "shedrub chö kyi sengé tsen gyi pü"
    },
    {
      "bo": "ཆོས་བདག་དབུགས་དབྱུངས་དགོངས་རྒྱུད་བྱིན་རླབས་ཐོབ། །",
      "en": "Confirmed as the custodian of these teachings, you received the blessing of the wisdom mind transmission.",
      "en-trans": "chödak uk yung gong gyü jinlab tob"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་མཆོག་དངོས་སྩོལ། །",
      "en": "I supplicate you: please shower down a great rain of blessings!",
      "en-trans": "solwa deb so jinlab chok ngö tsol"
    },
    {
      "bo": "སྐུ་མཆོག་འཇམ་དཔལ་གསུང་མཆོག་ཚེ་ཡི་ལྷ། །",
      "en": "Supreme body, Mañjuśrī; speech, the deities of life;",
      "en-trans": "ku chok jampal sung chok tsé yi lha"
    },
    {
      "bo": "ཐུགས་མཆོག་ཡང་དག་ཡོན་ཏན་བླ་མའི་ཚོགས། །",
      "en": "Mind, Yangdak Heruka; quality, the various Guru cycles;",
      "en-trans": "tuk chok yangdak yönten lamé tsok"
    },
    {
      "bo": "ཕྲིན་ལས་ཕུར་པ་ཟབ་ཡངས་དགོངས་པའི་གཏེར། །",
      "en": "And supreme activity, Kīlaya – mind treasures, profound and vast –",
      "en-trans": "trinlé purpa zab yang gongpé ter"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་ཚོགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Deities of their oceanic maṇḍalas, I supplicate you!",
      "en-trans": "kyilkhor gyatsö tsok la solwa deb"
    },
    {
      "bo": "ཟག་བཅས་འཁོར་བའི་ཡུལ་ལ་མི་ཆགས་པར། །",
      "en": "With no desire for the tainted objects of saṃsāra,",
      "en-trans": "zakché khorwé yul la mi chakpar"
    },
    {
      "bo": "ལམ་གྱི་མཐུན་རྐྱེན་སྡོམ་གསུམ་རྣམ་པར་དག །",
      "en": "Upholding the three sets of vows – the concordant condition of the path –",
      "en-trans": "lam gyi tünkyen dom sum nampar dak"
    },
    {
      "bo": "དད་བརྩོན་དྲག་པོས་ཐོས་བསམས་མིག་རྙེད་ནས། །",
      "en": "And, having found an eye for study and reflection through fierce devotion and endeavor,",
      "en-trans": "dé tsön drakpö tö sam mik nyé né"
    },
    {
      "bo": "ཞི་བའི་གནས་སུ་སྒྲུབ་ལ་གཞོལ་བར་ཤོག །",
      "en": "May I devote myself to practice in peaceful isolation.",
      "en-trans": "zhiwé né su drub la zholwar shok"
    },
    {
      "bo": "གཞི་རྒྱུད་བྱང་ཆུབ་སེམས་ཀྱི་ཞིང་ས་བརླན། །",
      "en": "May I moisten the field of being, the primordial ground, with bodhicitta;",
      "en-trans": "zhi gyü changchub sem kyi zhingsa len"
    },
    {
      "bo": "ལམ་རྒྱུད་སྨིན་གྲོལ་སྐུ་བཞི་ས་བོན་ཐེབས། །",
      "en": "Plant the seeds of the four kāyas through the path of ripening and liberation;",
      "en-trans": "lam gyü mindrol ku zhi sabön teb"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གྱི་དྲོད་རྟགས་མཐར་ཕྱིན་ནས། །",
      "en": "And perfect the signs of warmth on the path of the two stages",
      "en-trans": "rim nyi lam gyi drötak tarchin né"
    },
    {
      "bo": "འབྲས་རྒྱུད་ལྷུན་གྲུབ་རིག་འཛིན་མངོན་གྱུར་ཤོག །",
      "en": "To reveal the resultant state, the innate and spontaneous state of a vidyādhara.",
      "en-trans": "dré gyü lhündrub rigdzin ngöngyur shok"
    },
    {
      "bo": "གནས་སྐབས་སུ་ཡང་དོན་གཉིས་སྒྲུབ་པ་ལ། །",
      "en": "Until that time, may there be no outer, inner, or secret obstacle",
      "en-trans": "nekab su yang dön nyi drubpa la"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་བར་ཆད་མི་འབྱུང་ཞིང་། །",
      "en": "When accomplishing the twofold aim of self and other.",
      "en-trans": "chi nang sangwé barché minjung zhing"
    },
    {
      "bo": "ནད་མེད་ཚེ་རིང་བསམ་རྒུ་ཡིད་བཞིན་འགྲུབ། །",
      "en": "With my life long and free of illness, may I accomplish everything I wish for,",
      "en-trans": "nemé tsering sam gu yizhin drub"
    },
    {
      "bo": "ཉམས་རྟོགས་རིག་པའི་རྩལ་ཆེན་འབར་གྱུར་ཅིག །",
      "en": "And may the expression of awareness blaze forth as experience and realization.",
      "en-trans": "nyamtok rigpé tsal chen bar gyur chik"
    },
    {
      "bo": "འདི་ལ་བཟང་ངན་ལས་འབྲེལ་ཤི་གསོན་ཀུན། །",
      "en": "May all those with whom I’m karmically connected, whether positively or negatively, be they dead or alive,",
      "en-trans": "di la zang ngen ledrel shi sön kün"
    },
    {
      "bo": "རང་སྣང་འཁྲུལ་པ་བར་དོའི་འཇིགས་སྐྲག་ལ། །",
      "en": "Come to recognize the seemingly terrifying appearances of the intermediate (bardo) state as the appearances of confusion;",
      "en-trans": "rangnang trulpa bardö jiktrak la"
    },
    {
      "bo": "རང་ངོ་ཤེས་ནས་སྣང་མཆེད་ཐོབ་གསུམ་གྱི། །",
      "en": "Realizing them to be their own self-display, may they experience them as ‘appearance, increase and attainment’",
      "en-trans": "rang ngoshé né nang ché tob sum gyi"
    },
    {
      "bo": "རང་སྣང་དག་པའི་སྐུ་གསུམ་མངོན་གྱུར་ཤོག །",
      "en": "And render evident the pure three kāyas.",
      "en-trans": "rangnang dakpé ku sum ngöngyur shok"
    },
    {
      "bo": "རིག་འཛིན་བླ་མའི་ཐུགས་ཀྱི་དྭངས་མའི་བཅུད། །",
      "en": "The pure concentrated essences of the Vidyādhara Guru’s wisdom-heart",
      "en-trans": "rigdzin lamé tuk kyi dangmé chü"
    },
    {
      "bo": "ཆོས་མཆོག་དྲི་མེད་ཟབ་མོ་དགོངས་པའི་གཏེར། །",
      "en": "Are the sublime dharmas of his pure and profound mind treasures.",
      "en-trans": "chö chok drimé zabmo gongpé ter"
    },
    {
      "bo": "འཇིག་རྟེན་ཀུན་ཁྱབ་ཀུན་ཀྱང་སྣོད་གྱུར་ནས། །",
      "en": "May they spread throughout the entire world and be well received,",
      "en-trans": "jikten künkhyab kün kyang nö gyur né"
    },
    {
      "bo": "དངོས་བརྒྱུད་རིག་འཛིན་ས་ལ་དབུགས་དབྱུངས་ཤོག །",
      "en": "Bringing everyone, directly and indirectly, to the state of an awareness-holder.",
      "en-trans": "ngö gyü rigdzin sa la uk yung shok"
    },
    {
      "bo": "སྣོད་བཅུད་རྒུད་པའི་ཉེས་ཚོགས་ཀུན་ཞི་ཞིང་། །",
      "en": "May the decline and shortcomings of this world and its inhabitants be arrested.",
      "en-trans": "nöchü güpé nyé tsok kün zhi zhing"
    },
    {
      "bo": "ཚེ་བསོད་དབང་རླུང་ཉམས་རྟོགས་ངང་གིས་རྒྱས། །",
      "en": "May longevity, merit, charisma, wind-horse, experience and spiritual realization increase.",
      "en-trans": "tsesö wang lung nyamtok ngang gi gyé"
    },
    {
      "bo": "ཁམས་གསུམ་ཆེ་རྒུའི་རླུང་སེམས་རང་དབང་འདུས། །",
      "en": "May the wind-mind of all who rank highly within the three realms be brought under control,",
      "en-trans": "kham sum chegü lungsem rangwang dü"
    },
    {
      "bo": "མི་མཐུན་དགྲ་བགེགས་ཡོངས་སྒྲོལ་བཀྲ་ཤིས་ཤོག །",
      "en": "And usher in the auspiciousness that is liberation from all adversity, hostility and obstructing forces.",
      "en-trans": "mitün dragek yong drol tashi shok"
    }
  ]
}