{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham/three-prayers-from-earth-pig",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ས་ཕག་ལོར་བྲིས་པའི་གསོལ་འདེབས་རྣམ་གསུམ།",
    "en": "Three Prayers from the Earth Pig Year"
  },
  "text": [
    {
      "bo": "བཅོམ་ལྡན་ཞི་ཁྲོ་རབ་འབྱམས་དགོངས་སུ་གསོལ། །",
      "en": "Infinite blessed deities, peaceful and wrathful, turn your attention towards me, I pray!",
      "en-trans": "chomden zhitro rabjam gong su sol"
    },
    {
      "bo": "ཡེ་ཤེས་ཐུགས་རྗེ་ཆེན་པོས་འབྲེལ་པས་ན། །",
      "en": "Since we are connected through your great wisdom and compassion,",
      "en-trans": "yeshe tukjé chenpö drelpé na"
    },
    {
      "bo": "བདག་སོགས་དམ་ཚིག་ཉམས་ཆག་ཐམས་ཅད་ཀུན། །",
      "en": "May all the impairments and breakages of samaya that I and others have committed",
      "en-trans": "dak sok damtsik nyamchak tamché kün"
    },
    {
      "bo": "ཐུགས་དམ་ཆེན་པོའི་དབང་གིས་དག་པར་མཛོད། །",
      "en": "Be purified through the power of your great sacred pledge.",
      "en-trans": "tukdam chenpö wang gi dakpar dzö"
    },
    {
      "bo": "ཧོཿ འཇམ་དཔལ་གཞོན་ནུ་རང་བྱུང་ཡེ་ཤེས་སྐུ། །",
      "en": "Ho! Youthful Mañjuśrī, the body of self-arisen original wisdom,",
      "en-trans": "ho, jampal zhönnu rangjung yeshe ku"
    },
    {
      "bo": "སྙིང་ལ་དབྱེར་མེད་བཞུགས་པའི་འོད་ཟེར་གྱིས། །",
      "en": "Dwelling inseparably within my heart—through radiating rays of light,",
      "en-trans": "nying la yermé zhukpé özer gyi"
    },
    {
      "bo": "འཁྲུལ་སྣང་འཁོར་བའི་མུན་པ་མ་ལུས་པ། །",
      "en": "Cause all the darkness of deluded perception within saṃsāra",
      "en-trans": "trulnang khorwé münpa malüpa"
    },
    {
      "bo": "མཉམ་ཉིད་བདེ་ཆེན་དབྱིངས་སུ་དག་པར་མཛོད། །",
      "en": "To be cleared away in the basic space of equality and great bliss.",
      "en-trans": "nyamnyi dechen ying su dakpar dzö"
    },
    {
      "bo": "ཧོཿ བརྒྱུད་གསུམ་རིག་འཛིན་བླ་མ་ཐུགས་རྗེ་ཅན། །",
      "en": "Ho!  Vidyādhara gurus of the three lineages with your compassion,",
      "en-trans": "ho, gyü sum rigdzin lama tukjé chen"
    },
    {
      "bo": "ཡི་དམ་ཞི་ཁྲོ་རབ་འབྱམས་བྱིན་རླབས་ཅན། །",
      "en": "Infinite peaceful and wrathful yidam deities with your blessings,",
      "en-trans": "yidam zhitro rabjam jinlab chen"
    },
    {
      "bo": "གནས་གསུམ་དཔའ་བོ་མཁའ་འགྲོ་མཐུ་རྩལ་ཅན། །",
      "en": "Ḍākas and ḍākinīs of the three places with your power and strength,",
      "en-trans": "né sum pawo khandro tutsal chen"
    },
    {
      "bo": "དམ་ཅན་ཆོས་སྐྱོང་སྲུང་མ་ཐུགས་དམ་ཅན། །",
      "en": "Protectors, dharmapālas and guardian deities with your scared pledges,",
      "en-trans": "damchen chökyong sungma tukdam chen"
    },
    {
      "bo": "མ་ལུས་ཐམས་ཅད་བདག་ལ་དགོངས་སུ་གསོལ། །",
      "en": "All of you, please turn your attention towards me, I pray!",
      "en-trans": "malü tamché dak la gong su sol"
    },
    {
      "bo": "ཉམ་ཐག་གདུང་བའི་ཡིད་ཀྱིས་གསོལ་བ་འདེབས། །",
      "en": "With a mind that is tormented by weariness and sorrow, I beg you:",
      "en-trans": "nyamtak dungwé yi kyi solwa deb"
    },
    {
      "bo": "ཐུགས་དམ་མ་གཡེལ་ཐུགས་རྗེས་མྱུར་དུ་གཟིགས། །",
      "en": "Do not forget your sacred pledge, but gaze upon me at once with your compassion,",
      "en-trans": "tukdam ma yel tukjé nyurdu zik"
    },
    {
      "bo": "བྱིན་གྱིས་རློབས་ཤིག་མཆོག་ཐུན་དངོས་གྲུབ་སྩོལ། །",
      "en": "Grant me your blessings, and bestow the supreme and ordinary accomplishments!",
      "en-trans": "jingyi lob shik choktün ngödrub tsol"
    }
  ]
}