{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/samten-lodro-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་ཝཱ་གིནྡྲ་ཆོས་དབྱིངས་ཞི་བ་ཆེན་པོར་གཞོལ་སྐབས་ཐུགས་དམ་བསྐུལ་བའི་གསོལ་འདེབས་གདུང་དབྱངས་བྱིན་རླབས་མྱུར་འཇུག་ཅེས་བྱ་བ་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།"
    },
    {
      "bo": "གཟོད་ནས་རྣམ་གྲོལ་བྱང་ཆུབ་མཆོག་བརྙེས་ཀྱང་།    །"
    },
    {
      "bo": "གདུལ་བྱའི་འགྲོ་ལ་ལྷག་པར་ཐུགས་བརྩེ་བས།    །"
    },
    {
      "bo": "དགེ་བའི་བཤེས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡིས།    །"
    },
    {
      "bo": "བསྟན་འགྲོའི་དོན་ཆེན་མཛད་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྒྱལ་ཀུན་མཐུ་སྟོབས་གཅིག་བསྡུས་གསང་བའི་བདག  །"
    },
    {
      "bo": "སྙིགས་དུས་ངུར་སྨྲིག་འཆང་བའི་གཟུགས་སུ་བསྒྱུར།    །"
    },
    {
      "bo": "སུམ་ལྡན་རྡོར་འཛིན་བྱེ་བའི་གཙུག་གི་རྒྱན།    །"
    },
    {
      "bo": "ངག༵་དབ༵ང་བས༵མ་གཏན༵་བློ༵་གྲོས༵་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དུས་དགྲའི་དབང་པོ་ཚར་པ་ཆོས་རྗེ་ཡི།    །"
    },
    {
      "bo": "ཟབ་གསང་སྙན༵་བརྒྱུད༵་བསྟན༵་པའི༵་རྒྱལ༵་མཚ༵ན་ནི།    །"
    },
    {
      "bo": "ཕྱོགས་བརྒྱར་སྒྲེངས་ལ་འགྲན་ཟླ་ཀུན་སྤངས་པ།    །"
    },
    {
      "bo": "ཁམས་སྟོན་སངས་རྒྱས་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པའི་ཞུགས་ལྕེ་འབར་བ་ཡིས།    །"
    },
    {
      "bo": "མ་རུངས་འབྱུང་པོའི་ཚོགས་རྣམས་ཐལ་བར་བརླག  །"
    },
    {
      "bo": "བསྟན་འགྲོའི་དཔུང་གཉེན་ཆེན་པོ་རང་བྱུང་བ།    །"
    },
    {
      "bo": "ཁྱབ་བདག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་དེད་དཔོན་བླ་མ་རྗེ།    །"
    },
    {
      "bo": "མཁྱེན་ནུས་བརྩེ་བ་འཇམ་དཔལ་དཔའ་བོ་དང་།    །"
    },
    {
      "bo": "ཐ་དད་མ་མཆིས་རྡོ་རྗེའི་སྐུ་མཆོག་ལ།    །"
    },
    {
      "bo": "སྐྱེ་འཆིའི་ཟུག་རྔུ་གཞར་ཡང་མ་མཆིས་ཀྱང་།    །"
    },
    {
      "bo": "རྟག་འཛིན་བཟློག་པའི་གཉེན་པོར་གཟུགས་ཀྱི་སྐུའི།    །"
    },
    {
      "bo": "སྤྲོས་པ་དབྱིངས་སུ་ཐིམ་པར་བསྟན་པའི་ཚེ།    །"
    },
    {
      "bo": "མགོན་མེད་བདག་ནི་མ་རིག་མུན་པར་འཁྱམས།    །"
    },
    {
      "bo": "ཐུགས་རྗེས་ངེས་པར་གཟིགས་ཤིག་བླ་མ་མཁྱེན།    །"
    },
    {
      "bo": "བུ་ཡི་སྡུག་བསྔལ་ཕ་ཡིས་མ་སེལ་ན།    །"
    },
    {
      "bo": "ཉེས་པ་སེལ་བྱེད་སྐྱབས་གཞན་སུ་ཞིག་ཚོལ།    །"
    },
    {
      "bo": "ཀྱེ་མ་ཀྱི་ཧུད་བླ་མ་རྡོ་རྗེ་འཆང་།    །"
    },
    {
      "bo": "སྙིང་ནས་དྲན་པའི་ཤུགས་ཀྱིས་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཆོས་དབྱིངས་མཁའ་ལ་སྤྲུལ་པའི་སྤྲིན་ཕུང་འཁྲིགས།    །"
    },
    {
      "bo": "གསང་བ་གསུམ་གྱི་བྱིན་རླབས་གྲུ་ཆར་ཕོབས།    །"
    },
    {
      "bo": "བདག་རྒྱུད་གསང་གསུམ་རྡོ་རྗེར་སྨིན་པར་མཛོད།    །"
    },
    {
      "bo": "བླ་མ་སྐུ་བཞིའི་འབྲས་བཟང་དངོས་གྲུབ་སྩོལ།    །"
    },
    {
      "bo": "གང་འདུལ་སྤྲུལ་པ་དཔག་ཡས་རབ་སྟོན་ནས།    །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་བའི་དོན་གཉིས་རླབས་ཆེན་སྒྲུབ།    །"
    },
    {
      "bo": "བདག་སོགས་སློབ་འབངས་དམ་ཚིག་རྣམ་པར་དག  །"
    },
    {
      "bo": "བླ་མ་མཆོག་དང་ནམ་ཡང་མི་འབྲལ་ཤོག  །"
    }
  ]
}