{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/tara-prayer-protect-all-fears",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཆོས་ཉིད་མཁའ་འགྲོའི་གསང་མཛོད་ལས༔ འཕགས་མའི་གསོལ་འདེབས་འཇིགས་པ་ཀུན་སྐྱོབ་བཞུགས༔",
    "en": "A Prayer to Ārya Tārā"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ཀ་དག་སྤྲོས་བྲལ་འོད་གསལ་རིག་པའི་དབྱིངས༔",
      "en": "Out of the primordially pure unelaborate space of luminous awareness,",
      "en-trans": "kadak trödral ösal rigpé ying"
    },
    {
      "bo": "ལྷུན་གྲུབ་སྣང་ཆ་མ་འགགས་སྒྱུ་འཕྲུལ་གར༔",
      "en": "As the magical manifestation of unobstructed spontaneous presence,",
      "en-trans": "lhündrub nangcha magak gyutrul gar"
    },
    {
      "bo": "ཐུགས་རྗེ་རྒྱལ་བ་ཀུན་གྱི་ཡུམ་གཅིག་མ༔",
      "en": "Arises the compassionate one, the one and only mother of all victorious ones,",
      "en-trans": "tukjé gyalwa kün gyi yum chik ma"
    },
    {
      "bo": "རྗེ་བཙུན་ཨཱརྱ་ཏཱ་རེ་ཚེ་སྦྱིན་དཔལ༔",
      "en": "Noble Lady Ārya Tārā, glorious bestower of longevity,",
      "en-trans": "jetsün arya taré tsé jin pal"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་རླུང་སེམས་དབང་བསྡུས་ནས༔",
      "en": "To you I pray! Take control of my vital winds and mind,",
      "en-trans": "solwa deb so lungsem wangdü né"
    },
    {
      "bo": "ཚེ་དང་བསོད་ནམས་འཕེལ་བར་མཛད་དུ་གསོལ༔",
      "en": "And increase my lifespan and merit!",
      "en-trans": "tsé dang sönam pelwar dzé du sol"
    },
    {
      "bo": "ཨོཾ་ཏཱ་རེ་ཏུ་ཏྟཱ་རེ་ཏུ་རེ་མ་མ་ཨ་ཡུར་ཛྙཱ་ན་སིདྡྷི་བྷྲཱུྃ་སྭཱ་ཧཱ༔"
    },
    {
      "bo": "ཁྱེད་ལ་བསྟོད་ཅིང་གསོལ་བ་བཏབ་པའི་མཐུས༔",
      "en": "Through the power of praising and praying to you,",
      "en-trans": "khyé la tö ching solwa tabpé tü"
    },
    {
      "bo": "བདག་གི་ཚེ་བསོད་དཔལ་འབྱོར་རྒྱས་པ་དང་༔",
      "en": "May my lifespan, merit, splendour and wealth increase,",
      "en-trans": "dak gi tsé sö paljor gyepa dang"
    },
    {
      "bo": "འཇིགས་པ་བཅུ་དྲུག་རྐྱེན་ངན་བར་ཆད་སོལ༔",
      "en": "And the sixteen fears,1adversity and obstacles be dispelled.",
      "en-trans": "jikpa chudruk kyen ngen barché sol"
    },
    {
      "bo": "འགྲོ་ལ་གནོད་པའི་གདོན་འགེགས་འབྱུང་པོ་ཐུལ༔",
      "en": "Subjugate spirits and disruptive forces who prey upon beings,",
      "en-trans": "dro la nöpé dön gek jungpo tul"
    },
    {
      "bo": "བསྟན་ལ་འཚེ་བྱེད་དམ་སྲི་མ་ལུས་པ༔",
      "en": "And may all thosedamsidemons who would harm the teachings",
      "en-trans": "ten la tsé jé damsi malüpa"
    },
    {
      "bo": "མ་ཁྱོད་ཐུགས་རྗེ་ནུས་མཐུའི་སྟོབས་རྩལ་གྱིས༔",
      "en": "Be pacified through the force of your compassionate power and strength,",
      "en-trans": "ma khyö tukjé nütü tob tsal gyi"
    },
    {
      "bo": "མ་ལུས་ཞི་ཞིང་བསྟན་པ་རྒྱས་པར་མཛོད༔",
      "en": "So that the teachings spread far and wide.",
      "en-trans": "malü zhi zhing tenpa gyepar dzö"
    },
    {
      "bo": "བསྟན་འཛིན་དམ་པའི་སྐུ་ཚེ་བསྲིང་བ་དང་༔",
      "en": "Grant your blessings, so that the lives of the noble holders of the teachings may be extended,",
      "en-trans": "tendzin dampé kutsé singwa dang"
    },
    {
      "bo": "དགེ་འདུན་སྡེ་ཚོགས་འཕེལ་བར་བྱིན་གྱིས་རློབས༔",
      "en": "And the saṅgha community may flourish and grow.",
      "en-trans": "gendün dé tsok pelwar jingyi lob"
    }
  ]
}