{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jetsun-drakpa-gyaltsen/tara-prayer-jetsun-chomden",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་བཙུན་སྒྲོལ་མ་ལ་འདོད་དོན་གསོལ་འདེབས།",
    "en": "Prayer to Jetsün Tārā for the Fulfilment of Wishes"
  },
  "text": [
    {
      "bo": "རྗེ་བཙུན་བཅོམ་ལྡན་འདས་མ་ཐུགས་རྗེ་ཅན། །",
      "en": "Noble and compassionate Tārā, we pray to you:",
      "en-trans": "jetsün chomden dema tukjé chen"
    },
    {
      "bo": "བདག་དང་མཐའ་ཡས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །",
      "en": "May I and all sentient beings, infinite in number,",
      "en-trans": "dak dang tayé semchen tamché kyi"
    },
    {
      "bo": "སྒྲིབ་གཉིས་བྱང་ཞིང་ཚོགས་གཉིས་མྱུར་རྫོགས་ནས། །",
      "en": "Purify the two obscurations and swiftly perfect the two accumulations,",
      "en-trans": "drib nyi jang zhing tsok nyi nyur dzok né"
    },
    {
      "bo": "རྫོགས་པའི་སངས་རྒྱས་ཐོབ་པར་མཛད་དུ་གསོལ། །",
      "en": "And in so doing may we gain perfect enlightenment.",
      "en-trans": "dzokpé sangye tobpar dzé du sol"
    },
    {
      "bo": "དེ་མ་ཐོབ་ཀྱི་ཚེ་རབས་ཀུན་ཏུ་ཡང༌། །",
      "en": "Until then, in all our lives,",
      "en-trans": "dé matob kyi tserab küntu yang"
    },
    {
      "bo": "ལྷ་དང་མི་ཡི་བདེ་བ་མཆོག་ཐོབ་ནས། །",
      "en": "May we find supreme happiness among gods and human beings,",
      "en-trans": "lha dang mi yi dewa chok tob né"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་པ་སྒྲུབ་པར་བྱེད་པ་ལ། །",
      "en": "And may all obstacles to the attainment of omniscience,",
      "en-trans": "tamché khyenpa drubpar jepa la"
    },
    {
      "bo": "བར་ཆད་གདོན་བགེགས་རིམས་དང་ནད་ལ་སོགས། །",
      "en": "As well as harmful influences and disease,",
      "en-trans": "barché dön gek rim dang né lasok"
    },
    {
      "bo": "དུས་མིན་འཆི་བར་གྱུར་པ་སྣ་ཚོགས་དང་། །",
      "en": "All that brings untimely death,",
      "en-trans": "dümin chiwar gyurpa natsok dang"
    },
    {
      "bo": "རྨི་ལམ་ངན་དང་མཚན་མ་ངན་པ་དང༌་། །",
      "en": "All bad dreams and evil omens,",
      "en-trans": "milam ngen dang tsenma ngenpa dang"
    },
    {
      "bo": "འཇིགས་པ་བརྒྱད་སོགས་ཉེ་བར་འཚེ་བ་རྣམས། །",
      "en": "The eight major fears and all forms of harm,",
      "en-trans": "jikpa gyé sok nyewar tsewa nam"
    },
    {
      "bo": "མྱུར་དུ་ཞི་ཞིང་མེད་པར་མཛད་དུ་གསོལ། །",
      "en": "All be swiftly pacified and eliminated.",
      "en-trans": "nyurdu zhi zhing mepar dzé du sol"
    },
    {
      "bo": "འཇིག་རྟེན་འཇིག་རྟེན་ལས་ནི་འདས་པ་ཡི། །",
      "en": "May auspiciousness, happiness and prosperity,",
      "en-trans": "jikten jikten lé ni depa yi"
    },
    {
      "bo": "བཀྲ་ཤིས་བདེ་ལེགས་ཕུན་སུམ་ཚོགས་པ་རྣམས། །",
      "en": "Both worldly and transcendent,",
      "en-trans": "tashi delek pünsum tsokpa nam"
    },
    {
      "bo": "འཕེལ་ཞིང་རྒྱས་པའི་དོན་རྣམས་མ་ལུས་པ། །",
      "en": "Flourish and expand, and may all our wishes",
      "en-trans": "pel zhing gyepé dön nam malüpa"
    },
    {
      "bo": "འབད་མེད་ལྷུན་གྱིས་གྲུབ་པར་མཛད་དུ་གསོལ། །",
      "en": "Be effortlessly and spontaneously fulfilled.",
      "en-trans": "bemé lhün gyi drubpar dzé du sol"
    },
    {
      "bo": "སྒྲུབ་ལ་བརྩོན་ཞིང་དམ་ཆོས་འཕེལ་བ་དང༌་། །",
      "en": "May we endeavour in the practice, may the Dharma spread,",
      "en-trans": "drub la tsön zhing damchö pelwa dang"
    },
    {
      "bo": "རྟག་ཏུ་ཁྱེད་སྒྲུབ་ཞལ་མཆོག་མཐོང་བ་དང༌་། །",
      "en": "May we always meditate on you, and behold your perfect face,",
      "en-trans": "taktu khyé drub zhal chok tongwa dang"
    },
    {
      "bo": "སྟོང་ཉིད་དོན་རྟོགས་བྱང་སེམས་རིན་པོ་ཆེ། །",
      "en": "May we realize the nature of emptiness, and",
      "en-trans": "tongnyi dön tok changsem rinpoche"
    },
    {
      "bo": "ཡར་ངོའི་ཟླ་ལྟར་འཕེལ་ཞིང་རྒྱས་པར་མཛོད། །",
      "en": "May precious bodhicitta develop and expand, just like the waxing moon.",
      "en-trans": "yarngö da tar pel zhing gyepar dzö"
    }
  ]
}