{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tara-eliminator-of-suffering",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།    །བླ་མ་རྗེ་བཙུན་སྒྲོལ་མར་གསོལ་འདེབས་སྡུག་བསྔལ་སེལ་བྱེད་ཅེས་བྱ་བ།    །"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་ཀུན་གྱི་ཡུམ་གཅིག་མ།    །"
    },
    {
      "bo": "རྗེ་བཙུན་སྒྲོལ་མ་མྱུར་མ་དཔའ་མོ་ཡི།    །"
    },
    {
      "bo": "ཞབས་རྟེན་ཨུཏྤལ་སྔོན་པོར་གུས་མཆོད་དེ།    །"
    },
    {
      "bo": "བདག་གི་ལུས་སེམས་གདུང་བ་བསལ་དུ་གསོལ།"
    },
    {
      "bo": "ཁྱོད་ནི་སངས་རྒྱས་བྱང་སེམས་ཐམས་ཅད་ཀྱི།    །"
    },
    {
      "bo": "ཕྲིན་ལས་གཅིག་ཏུ་བསྡུས་པའི་རང་གཟུགས་མཆོག  །"
    },
    {
      "bo": "ཨཱརྱ་ཏཱ་རེའི་ཞལ་བཟང་དྲན་པའི་མོད།    །"
    },
    {
      "bo": "སྲིད་པའི་སྡུག་བསྔལ་མ་ལུས་གཞོམ་དུ་གསོལ།    །"
    },
    {
      "bo": "བརྒྱད་གཉིས་འཇིགས་པའི་ཆུ་གཏེར་འཁྲུགས་པ་ལས།    །"
    },
    {
      "bo": "མི་བཟད་ཆུ་སྲིན་ལྟ་བུའི་སྡེ་ཚོགས་རྣམས།    །"
    },
    {
      "bo": "ཁྱོད་མཚན་བརྗོད་དང་འོ་དོད་བོས་པའི་ཚེ།    །"
    },
    {
      "bo": "དེ་མ་ཐག་ཏུ་སྐྱབས་པར་མཛད་དུ་གསོལ།    །"
    },
    {
      "bo": "ཚེ་དང་ཤེས་རབ་བསོད་ནམས་ནོར་གྱིས་དབུལ།    །"
    },
    {
      "bo": "དོན་ཉམས་ལ་སོགས་སྲིད་ཞིའི་དགེ་ལེགས་ཀྱི།    །"
    },
    {
      "bo": "འགལ་ཟླར་གྱུར་རྣམས་ཁྱོད་ལ་གསོལ་བཏབ་པས།    །"
    },
    {
      "bo": "དཀར་པོའི་ཕྱོགས་ཀྱི་ཆ་བཞིན་རྒྱས་མཛད་གསོལ།    །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་དག་ཅིང་ཐོས་བསམ་སྒོམ་པ་འཕེལ།    །"
    },
    {
      "bo": "མཁྱེན་ནུས་བརྩེ་བའི་ཡོན་ཏན་རྩལ་ཆེན་རྫོགས།    །"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཕྲིན་ལས་རྩལ་ཤུགས་འཆང་།    །"
    },
    {
      "bo": "རྗེ་བཙུན་ཉིད་དང་དབྱེར་མེད་མཛད་དུ་གསོལ།    །"
    },
    {
      "bo": "དུས་མིན་འཆི་བའི་གཡུལ་ལས་རབ་རྒྱལ་ཞིང་།    །"
    },
    {
      "bo": "འཆི་མེད་རྡོ་རྗེའི་སྲོག་གི་ཀ་བ་བརྟན།"
    },
    {
      "bo": "གྲུབ་པའི་བདུད་རྩིས་ལུས་སེམས་སྟོབས་དཔལ་རྒྱས།    །"
    },
    {
      "bo": "ཡིད་བཞིན་འཁོར་ལོའི་ངོ་བོ་སྒྲུབ་ཏུ་གསོལ།    །"
    },
    {
      "bo": "རིས་མེད་ཐུབ་པའི་བསྟན་པ་དར་ཞིང་རྒྱས།    །"
    },
    {
      "bo": "བསྟན་ལ་གནོད་པ་ཁྲོ་གཉེར་ཅན་གྱིས་བཏུལ།    །"
    },
    {
      "bo": "བསྟན་པའི་སྦྱིན་བདག་མངའ་ཐང་རབ་འཕེལ་ཏེ།    །"
    },
    {
      "bo": "རྫོགས་ལྡན་གསར་པའི་སྣང་བ་འཆར་གྱུར་ཅིག  །"
    },
    {
      "bo": "མདོར་ན་བདག་ལ་སྐྱིད་སྡུག་ཅི་བྱུང་ཡང་།    །"
    },
    {
      "bo": "རྗེ་བཙུན་བཅོམ་ལྡན་འདས་མ་ཉིད་ཀྱིས་ནི།    །"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་འབྲལ་བ་མེད་པ་དང་།    །"
    },
    {
      "bo": "བསམ་པའི་དོན་ཀུན་འབད་མེད་འགྲུབ་པར་ཤོག  །"
    }
  ]
}