{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/sera-khandro/supreme-deities-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཉམས་སྣང་ལས༔ ལྷག་པའི་ལྷ་ལ་གསོལ་འདེབས་ཐུགས་རྒྱུད་གནད་བསྐུལ་བཞུགས།"
  },
  "text": [
    {
      "bo": "ཀྱེ་མ༔ དུས་གསུམ་སངས་རྒྱས་མ་ལུས་འདུས་པའི་སྐུ༔"
    },
    {
      "bo": "འགྲོ་བའི་མགོན་གྱུར་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "འཇིགས་བརྒྱད་ཞི་མཛད་རྗེ་བཙུན་འཕགས་མ་སྒྲོལ། །"
    },
    {
      "bo": "བདག་སོགས་རྩེ་གཅིག་དད་པས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་གཟིགས་ལ་བྱིན་གྱིས་རློབས་སུ་གསོལ། །"
    },
    {
      "bo": "དལ་འབྱོར་མི་ལུས་རིན་ཆེན་ཐོབ་དུས་འདིར། །"
    },
    {
      "bo": "སྙིང་པོ་དམ་པའི་ཆོས་ལ་མི་བརྩོན་ཞིང་། །"
    },
    {
      "bo": "དོན་མེད་སྟོང་ལོག་མི་དགེའི་ལས་ལ་བརྩོན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "མི་ལུས་དོན་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཕྱི་སྣོད་འཇིག་རྟེན་ནང་བཅུད་འགྲོ་བ་སོགས། །"
    },
    {
      "bo": "མི་རྟག་ཆུ་ཡི་ལྦུ་བ་དང་མཚུངས་ཀྱང་། །"
    },
    {
      "bo": "འཆི་ཆོས་མི་སྒྲུབ་རྟག་འཛིན་དམ་པོས་བཅིངས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "འཆི་བ་སྙིང་ནས་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྲིད་པའི་བདེ་སྡུག་ལས་འབྲས་ཁོ་ནར་ཐུག །"
    },
    {
      "bo": "སྤང་བླང་གཉིས་ལ་བླང་དོར་ནོར་ནས་ཀྱང་། །"
    },
    {
      "bo": "རྒྱུ་འབྲས་ཁྱད་བསད་སྟོང་སྐད་ཁ་ཕོ་མཐོ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "རྒྱུ་འབྲས་བག་ལས་ཞིབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འཁོར་བའི་གནས་སུ་བདེ་བ་སྐད་ཅིག་མེད། །"
    },
    {
      "bo": "བདེ་བ་འདོད་ཀྱང་སྡུག་བསྔལ་ལས་ལ་བརྩོན། །"
    },
    {
      "bo": "ཕྱེ་ལེབ་ཇི་བཞིན་མེ་འོབས་ནང་དུ་འགགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "འཁོར་བར་ཞེན་པ་ལོག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མཆོག་གསུམ་སྐྱབས་གནས་གཙོ་བོ་ཡིན་ནའང་། །"
    },
    {
      "bo": "བསླབ་པའི་སྡོམ་པ་སྣ་གཅིག་མི་བསྲུང་ཞིང་། །"
    },
    {
      "bo": "མི་དགེའི་ལས་བརྩོན་ཉེས་ལྟུང་སྣ་ཚོགས་བསགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "དཀོན་མཆོག་ཡོན་ཏན་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྨོན་འཇུག་བྱང་སེམས་ནོར་བུ་ཡོད་ན་ཡང་། །"
    },
    {
      "bo": "གཞན་ཕན་ཆུང་བས་གཉིས་འཛིན་རུ་ཏྲར་གོལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་ཪས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "ཚད་མེད་རྣམ་བཞི་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བདག་འཛིན་མེད་སྙམ་ཚོགས་གཉིས་འཁོར་ལོར་རློམས། །"
    },
    {
      "bo": "སེར་སྣ་དམ་པོས་ཚོགས་བསག་མི་བརྩོན་ཞིང་། །"
    },
    {
      "bo": "ཇ་ཕོར་ཙམ་ལ་རང་གཞན་ཤི་སྦར་འཐམ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "ཚོགས་བསག་རྒྱ་ཆེར་ནུས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྡིག་སྒྲིབ་མེད་སྙམ་རང་སྣང་སྟོང་པར་བཟུང་། །"
    },
    {
      "bo": "དད་ཟས་གཤིན་ཟས་དཀོར་ནག་ཁུར་པོ་ལྕི། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "སྟོབས་བཞི་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དད་པ་དག་སྣང་ཕྱོགས་མེད་བསམ་ན་ཡང་། །"
    },
    {
      "bo": "ཇོ་དར་རླུང་གིས་བསྐྱོད་དང་མཚུངས་པས་ན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "དད་མོས་ཐང་ལྷོད་མེད་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྩ་བའི་བླ་མ་བཀའ་དྲིན་གསུམ་ལྡན་ལ། །"
    },
    {
      "bo": "མཉེས་པ་གསུམ་གྱི་ཞབས་ཏོག་མི་བསྒྲུབ་པར། །"
    },
    {
      "bo": "ལོག་སྒྲིབ་དབང་གིས་མཚམས་མེད་ཉེས་ལྟུང་བསགས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "མཉེས་པ་ཕུལ་དུ་ཕྱིན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བླ་མའི་ཐུགས་དང་རང་སེམས་དབྱེར་མེད་པར། །"
    },
    {
      "bo": "དབང་བཞི་བླང་བ་ཕྱོགས་དང་རིས་སུ་ཆད། །"
    },
    {
      "bo": "བྱིན་རླབས་འཇུག་དཀའ་ལོག་ལྟ་སྐྱེས་ནས་ཀྱང་། །"
    },
    {
      "bo": "བླ་མ་དགྲ་ལྟར་མཐོང་ནས་སྐུར་པ་འདེབས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "བླ་མའི་བྱིན་རླབས་སེམས་ལ་འཇུག་ནས་ཀྱང་། །"
    },
    {
      "bo": "སངས་རྒྱས་དངོས་སུ་མཐོང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལྟ་བ་མཐོན་པོས་ནམ་མཁའ་མདུང་བསྐོར་བྱེད། །"
    },
    {
      "bo": "རྒྱུ་འབྲས་ཁྱད་བསད་སྟོང་སྐད་ཆད་ལྟར་གོལ། །"
    },
    {
      "bo": "རང་གཞན་ཕུང་བྱེད་སྡིག་པའི་ལས་ལ་བརྩོན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "ལྟ་བའི་རང་སྐྱོན་མཐོང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྒོམ་པ་འཛིན་མེད་ཆོས་སྐུར་གྲོལ་ཉམས་བཤད། །"
    },
    {
      "bo": "ཨ་འཐས་འཛིན་ཞེན་བརྟོད་ཕུར་དམ་པོས་བཟུང་། །"
    },
    {
      "bo": "འཁོར་བ་བློ་ཡིས་མི་ཐོང་རིམ་གྱིས་བརྩོན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "གཟུང་འཛིན་མདུད་པ་ཞིག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཐེག་ཆེན་སྤྱོད་པ་ཡིད་བཞིན་ནོར་བུ་ལ། །"
    },
    {
      "bo": "གང་ཤར་རང་གྲོལ་སྤང་བླང་མེད་ན་ཡང་། །"
    },
    {
      "bo": "བློ་ཆུང་ཐེག་དམན་འདོར་ཞིག་ཚུལ་ཁྲིམས་ཉམས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "བསླབ་པ་གསུམ་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་བྱུང་ཡེ་ཤེས་ལྐོག་འགྱུ་ལུང་མ་བསྟན། །"
    },
    {
      "bo": "གསལ་སྟོང་ཉམས་ལ་ཞེན་ནས་རང་ཉིད་བསླུས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "རང་བྱུང་ཡེ་ཤེས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལམ་ལ་སྦྱོང་རྩོལ་མི་དགོས་ལྷུན་གྲུབ་ལ། །"
    },
    {
      "bo": "གཉིས་འཛིན་ཆགས་སྡང་གདུང་སེམས་དྲག་པོས་བསྡམས། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "ལམ་ལ་གོལ་འཕྱུགས་བྲལ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འབྲས་བུ་ཀུན་བཟང་དགོངས་པ་འོད་གསལ་དབྱིངས། །"
    },
    {
      "bo": "ཁྱད་ཆོས་དྲུག་ལྡན་གཞོན་ནུ་བུམ་པའི་སྐུ། །"
    },
    {
      "bo": "སྤྲོས་པའི་མཐའ་བརྒྱད་མ་ཆོད་དུག་ལྔས་ཟིན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་ཨཱརྱ་ཏཱ་རེ་མ། །"
    },
    {
      "bo": "སྐུ་བཞིའི་རྒྱལ་ས་ཟིན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མདོར་ན་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས། །"
    },
    {
      "bo": "འཁོར་བར་བློ་ལྡོག་བླ་མ་དམ་པ་བསྟེན། །"
    },
    {
      "bo": "བསླབ་པ་གསུམ་དང་ཐེག་པ་སོ་སོ་ཡི། །"
    },
    {
      "bo": "མདོ་སྔགས་གཞུང་ལུགས་ཁྱད་ཆོས་སྣ་ཚོགས་སོགས། །"
    },
    {
      "bo": "མ་ལུས་ཐམས་ཅད་མ་ནོར་རིམ་བཞིན་དུ། །"
    },
    {
      "bo": "དཀའ་བ་དང་བླངས་ངལ་བ་ཁྱད་བསད་ནས། །"
    },
    {
      "bo": "བདག་ཅག་བརྩོན་འགྲུས་དྲག་པོས་ཉམས་བླང་ཞིང་། །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པ་དང་། །"
    },
    {
      "bo": "མ་རིག་དུག་ལྔའི་གཉེན་པོར་གྱུར་ནས་ཀྱང་། །"
    },
    {
      "bo": "བདག་རྒྱུད་སྨིན་གྲོལ་སྣོད་དུ་རུང་བར་ཤོག །"
    },
    {
      "bo": "རང་རྒྱུད་གྲོལ་ནས་གཞན་ཕན་བྱང་སེམས་ལ། །"
    },
    {
      "bo": "འཕགས་པ་ཉིད་དང་མཚུངས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གལ་ཏེ་ལས་རླུང་དྲག་པོའི་མཐུ་བཙན་པས། །"
    },
    {
      "bo": "མ་རིག་ཉོན་མོངས་དབང་དུ་གྱུར་ན་ཡང་། །"
    },
    {
      "bo": "རྒྱལ་བའི་ཡུམ་མཆོག་འཕགས་མ་སྒྲོལ་མ་ཡིས། །"
    },
    {
      "bo": "དུག་ལྔ་གྲོགས་སུ་འཆར་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བདག་ལ་བཟང་ངན་འབྲེལ་ཐོགས་མ་ལུས་པ། །"
    },
    {
      "bo": "ཕྱི་མ་འོག་མིན་པོ་ཏ་ལ་ཡི་ཞིང་། །"
    },
    {
      "bo": "མ་དང་དབྱེར་མེད་འཕགས་པའི་ཞབས་དྲུང་དུ། །"
    },
    {
      "bo": "ཚོམ་བུ་གཅིག་ཏུ་མངོན་པར་སངས་རྒྱས་ཤོག །"
    }
  ]
}