{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tara-averting-obstructive-circumstances",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་བཙུན་སྒྲོལ་མ་ལ་གསོལ་བ་འདེབས་པར་བར་ཆད་རྐྱེན་བཟློག་ཅེས་བྱ་བ་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ཨོཾ།  དཔལ་མོ་ཁྱོད་མཚན་ཡིད་ལ་དྲན་པ་ཡིས།    །"
    },
    {
      "bo": "འཇིགས་པ་མཐའ་དག་མྱུར་དུ་ཞི་མཛད་ཅིང་།    །"
    },
    {
      "bo": "དོན་གཉིས་འབད་མེད་འགྲུབ་སྟེར་མཆོག་སྦྱིན་མ།    །"
    },
    {
      "bo": "བླ་མ་རྗེ་བཙུན་སྒྲོལ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྒྱལ་པོ་མེ་ཆུ་ལྕགས་སྒྲོགས་དུག་མཚོན་དང་།    །"
    },
    {
      "bo": "སྦྲུལ་དང་སེང་གེ་གླང་ཆེན་ཤ་ཟ་དང་།    །"
    },
    {
      "bo": "ཆོམ་རྐུན་སྲིན་པོ་འབྱུང་པོ་རོ་ལོངས་སོགས།    །"
    },
    {
      "bo": "འཇིགས་པ་བསྐྱབ་མཛད་སྒྲོལ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འགྲོ་བ་གང་ཞིག་ཚེ་ཡི་དབུལ་བ་དང་།  །"
    },
    {
      "bo": "གཏི་མུག་མུན་པས་འཐིབ་པའི་འགྲོ་རྣམས་ལ།    །"
    },
    {
      "bo": "ཟླ་ཞལ་བདུད་རྩིས་སྣང་བ་སྐྱེ་བའི་མོད།    །"
    },
    {
      "bo": "ཚེ་དང་ཡེ་ཤེས་སྦྱིན་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དམར་གསལ་པདྨ་རཱ་གའི་འོད་ཟེར་གྱི།    །"
    },
    {
      "bo": "ལྕགས་ཀྱུས་སྲིད་ཞིའི་ཕུན་ཚོགས་འགུགས་མཛད་ཅིང་།    །"
    },
    {
      "bo": "ཀུན་ལ་དབང་བསྒྱུར་རྟག་པའི་རྒྱལ་མོ་ཆེར།    །"
    },
    {
      "bo": "སྒྲོལ་མ་མྱུར་མ་དཔའ་མོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཞི་ལས་མ་གཡོས་སྙིང་རྗེ་ཁྲོས་པ་ཡི།    །"
    },
    {
      "bo": "ཁྲོ་གཉེར་གཡོ་དང་ཧཱུྃ་གི་སྒྲ་བསྒྲགས་པས།    །"
    },
    {
      "bo": "བདུད་དང་བགེགས་རྣམས་མ་ལུས་འཇོམས་མཛད་མ།    །"
    },
    {
      "bo": "སྒྲོལ་མ་དྲག་བྱེད་ཆེན་མོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བདེ་བའི་རོས་མྱོས་བཞད་པའི་ང་རོ་དང་།    །"
    },
    {
      "bo": "ཞབས་གཉིས་བརྡབ་པས་འཇིག་རྟེན་བདུན་པོའི་ཚོགས།    །"
    },
    {
      "bo": "རབ་ཏུ་གནོན་ཅིང་ཁམས་གསུམ་ཟིལ་གྱིས་གནོན།    །"
    },
    {
      "bo": "མཐའ་ཡས་རྣམ་རྒྱལ་མ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "གང་ཞིག་ནོར་གྱིས་དབུལ་བར་གྱུར་པ་ལ།    །"
    },
    {
      "bo": "རྣམ་མང་ནོར་བུའི་ཆར་ཆེན་འབེབས་པ་ཡིས།    །"
    },
    {
      "bo": "ཕོངས་པའི་སྡུག་བསྔལ་མཐའ་དག་སེལ་མཛད་པའི།    །"
    },
    {
      "bo": "སྦྱིན་པ་མཐར་ཕྱིན་འཕགས་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཁོར་བའི་ཉེས་པ་ཆེ་ལས་རབ་གྲོལ་ཞིང་།    །"
    },
    {
      "bo": "ཟག་བྲལ་དགའ་བ་མཆོག་གི་རྩེར་སོན་ཅིང་།    །"
    },
    {
      "bo": "འཕོ་མེད་བདེ་བ་ཆེ་ལ་རྟག་རོལ་པ།    །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་ཕར་ཕྱིན་དབང་མོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཁའ་མཉམ་འགྲོ་བའི་དོན་ལ་རབ་བཟོད་ཅིང་།    །"
    },
    {
      "bo": "ཀུན་གྱི་ཉེར་འཚེ་ས་གཞི་ལྟ་བུ་ཡི།    །"
    },
    {
      "bo": "རྟག་ཏུ་ཁྲོ་མེད་སྙིང་རྗེའི་ཡོངས་གང་བ།    །"
    },
    {
      "bo": "བཟོད་པ་དཀའ་ཐུབ་ཞི་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་དལ་བ་མེད་པ་ཡི།    །"
    },
    {
      "bo": "འགྲོ་བ་སྒྲོལ་ལ་རབ་ཏུ་བརྩོན་པ་གང་།    །"
    },
    {
      "bo": "འཁོར་བ་སྟོང་པར་མ་གྱུར་དེ་སྲིད་དུ།    །"
    },
    {
      "bo": "བརྩོན་འགྲུས་འགྲོ་སྒྲོལ་མ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མི་གཡོ་ཏིང་འཛིན་རྒྱ་མཚོ་རབ་མཉེས་ཤིང་།    །"
    },
    {
      "bo": "རྣམ་པར་བཅས་པའི་རྟོག་ཚོགས་ཐམས་ཅད་ཞི།    །"
    },
    {
      "bo": "རྣམ་མེད་བདེ་བ་ཆེན་པོའི་རོས་མྱོས་མ།    །"
    },
    {
      "bo": "བསམ་གཏན་གྲུབ་པ་ཆེན་མོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཟབ་དང་རྒྱ་ཆེའི་ཆོས་ཀུན་མངོན་སུམ་གཟིགས།    །"
    },
    {
      "bo": "ཡེ་ཤེས་རྒྱ་མཚོ་ཟད་པ་མེད་པའི་ཐུགས།    །"
    },
    {
      "bo": "ཡོན་ཏན་རྒྱ་མཚོ་སངས་རྒྱས་ཀུན་དང་མཉམ།    །"
    },
    {
      "bo": "ཤེས་རབ་ཕར་ཕྱིན་སྒྲོལ་མ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁྱེད་ལ་རྟག་ཏུ་དད་པས་གསོལ་འདེབས་མཐུས།    །"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་རྣམས་བར་ཆད་ཀུན་ལས་སྐྱོབས།    །"
    },
    {
      "bo": "སྒྲོལ་མའི་ཐུགས་རྗེས་རྟག་ཏུ་རྗེས་བཟུང་ནས།    །"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྱིས་འགྲུབ་པའི་བཀྲ་ཤིས་ཤོག  །"
    }
  ]
}