{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/light-of-compassion-dakinis-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཡེ་ཤེས་མཁའ་འགྲོའི་ཚོགས་ལ་གསོལ་འདེབས་ཐུགས་རྗེའི་འོད་སྣང་ཞེས་བྱ་བཞུགས།",
    "en": "A Prayer to the Wisdom Ḍākinīs"
  },
  "text": [
    {
      "bo": "ཆོས་དབྱིངས་རྡོ་རྗེ་བཙུན་མོའི་ཡེ་ཤེས་དབྱིངས། །",
      "en": "Within the wisdom-space of the Vajra Queen, the dharmadhātu,",
      "en-trans": "chöying dorjé tsünmö yeshe ying"
    },
    {
      "bo": "བདེ་སྟོང་སྒྱུ་འཕྲུལ་དྲྭ་བའི་སྤྲིན་ཕྲེང་ལས། །",
      "en": "From garlands of clouds of the bliss-empty magical net,",
      "en-trans": "detong gyutrul drawé trin treng lé"
    },
    {
      "bo": "བྱིན་རླབས་དངོས་གྲུབ་ཕྲིན་ལས་གློག་གར་གྱིས། །",
      "en": "Your lightning dance of blessings, siddhis, and activities",
      "en-trans": "jinlab ngödrub trinlé lok gar gyi"
    },
    {
      "bo": "ཕན་བདེའི་ཆར་འབེབས་མཁའ་འགྲོར་གསོལ་བ་འདེབས། །",
      "en": "Showers us with goodness and happiness—to you ḍākinīs I pray!",
      "en-trans": "pendé charbeb khandror solwa deb"
    },
    {
      "bo": "ཐུབ་པའི་སྤྱན་སྔར་གངྒའི་ལྷ་མོའི་ཚུལ། །",
      "en": "As Gaṅgādevī in the presence of the Sage,1",
      "en-trans": "tubpé chen ngar gang gé lhamö tsul"
    },
    {
      "bo": "རྒྱལ་ཀུན་གསུང་གི་རྡོ་རྗེ་དབྱངས་ཅན་མ། །",
      "en": "And Sarasvatī, vajra speech of all buddhas,",
      "en-trans": "gyal kün sung gi dorjé yangchenma"
    },
    {
      "bo": "གུ་རུའི་དགྱེས་སྡེ་གསང་སྔགས་བཀའ་སྡུད་མོ། །",
      "en": "Delighting your Guru, you compiled the Secret Mantra’s teachings.",
      "en-trans": "gurü gyé dé sang ngak ka dümo"
    },
    {
      "bo": "ཡེ་ཤེས་མཚོ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Lady Yeshé Tsogyal, to you I pray!",
      "en-trans": "yeshe tsogyal zhab la solwa deb"
    },
    {
      "bo": "སངས་རྒྱས་ཀུན་གྱི་ཕྲིན་ལས་མྱུར༵་མ༵འི་ཚུལ། །",
      "en": "Swift One—activity of all the buddhas—",
      "en-trans": "sangye kün gyi trinlé nyurmé tsul"
    },
    {
      "bo": "གདུལ་དཀའི་འགྲོ་ཀུན་སྒྲོལ་བ་དཔ༵འ་མོ༵འི་མཚན། །",
      "en": "Renowned heroine—liberator of the hard-to-tame—2",
      "en-trans": "dul ké dro kün drolwa pamö tsen"
    },
    {
      "bo": "སྲིད་ཞིའི་གདུང༵་སྐྱོབ༵་རྒྱལ་བ་ཀུན་ཡུམ་མ། །",
      "en": "Mother of all Victors, Umbrella3over existence and peace,",
      "en-trans": "sizhi dung kyob gyalwa kün yum ma"
    },
    {
      "bo": "རྗེ་བཙུན་འཕགས་མ་སྒྲོལ༵་མ༵ར་གསོལ་བ་འདེབས། །",
      "en": "Noble Lady Tārā, to you I pray!",
      "en-trans": "jetsün pakma drolmar solwa deb"
    },
    {
      "bo": "རྣམ་ཐར་གསུམ་རྫོགས་དབྱིངས་ཡུམ་ཀུན་བཟང་མོ། །",
      "en": "You are Samantabhadrī, mother of space, perfection of the three doors of liberation,",
      "en-trans": "namtar sum dzok ying yum kunzang mo"
    },
    {
      "bo": "ཡེ་ཤེས་ཀློང་ལྔ་རིགས་ཀྱི་ཡུམ་ཆེན་ལྔ། །",
      "en": "The five great mothers of the five wisdom expanses and five families,",
      "en-trans": "yeshe long nga rik kyi yumchen nga"
    },
    {
      "bo": "གནས་གསུམ་མཁའ་འགྲོའི་རྗེ་མོ་ཁྲོས་མ་ནག །",
      "en": "And Krodhikālī, empress of the ḍākinīs of the three abodes,",
      "en-trans": "né sum khandrö jemo tröma nak"
    },
    {
      "bo": "དབྱིངས་ཕྱུག་རྡོ་རྗེ་ཕག་མོར་གསོལ་བ་འདེབས། །",
      "en": "Dhātviśvarī Vajravārāhī, to you I pray!",
      "en-trans": "yingchuk dorjé pakmor solwa deb"
    },
    {
      "bo": "མཆོག་ཏུ་མི་འགྱུར་བདེ་ཆེན་རྡོ་རྗེའི་གཟུགས། །",
      "en": "Your vajra-form of great bliss, utterly unchanging,",
      "en-trans": "chok tu mingyur dechen dorjé zuk"
    },
    {
      "bo": "གར་གྱི་དབང་ཕྱུག་དགྱེས་མའི་ཡུམ་གྱི་ཚུལ། །",
      "en": "Takes the guise of Nateśvara’s consort, lady of pleasure,",
      "en-trans": "gar gyi wangchuk gyé mé yum gyi tsul"
    },
    {
      "bo": "ཨོ་རྒྱན་ཌཱ་ཀིའི་གཙོ་མོར་དངོས་གྲུབ་བདག །",
      "en": "Queen of Siddhis, chief amongst Uḍḍiyāna’s ḍākinīs,",
      "en-trans": "orgyen daki tsomor ngödrub dak"
    },
    {
      "bo": "གསང་བ་ཡེ་ཤེས་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Lady Guhyajñānā, to you I pray!",
      "en-trans": "sangwa yeshe zhab la solwa deb"
    },
    {
      "bo": "དངོས་གཅིག་དུ་མའི་རོལ་པའི་དྷ་ཀི་མ། །",
      "en": "Ḍākinī—single essence with myriad displays,",
      "en-trans": "ngö chikdumé rolpé dhakima"
    },
    {
      "bo": "དོན་དམ་ལྷན་ཅིག་སྐྱེས་མའི་ཡེ་ཤེས་དབྱིངས། །",
      "en": "Ultimate, co-emergent wisdom-space,",
      "en-trans": "döndam lhenchik kyé mé yeshe ying"
    },
    {
      "bo": "འཁོར་འདས་ཀུན་ཁྱབ་མཉམ་ཡངས་བརྡལ་བ་ཆེའི། །",
      "en": "Vast, pervasive equality permeating all of saṃsāra and nirvāṇa—",
      "en-trans": "khordé künkhyab nyam yang dalwa ché"
    },
    {
      "bo": "ངོ་བོར་འདུ་འབྲལ་མེད་པས་གསོལ་བ་འདེབས། །",
      "en": "Never parting from this essence, to you I pray!",
      "en-trans": "ngowor dudral mepé solwa deb"
    },
    {
      "bo": "ངེས་འབྱུང་སྐྱོ་ཤས་ལམ་གྱིས་རྒྱུད་སྦྱངས་ནས། །",
      "en": "By purifying our minds through the path of renunciation and weariness,",
      "en-trans": "ngejung kyoshé lam gyi gyü jang né"
    },
    {
      "bo": "དད་མོས་བཙོན་པས་བྱང་ཆུབ་སྤྱོད་པ་རྫོགས། །",
      "en": "Through faith, devotion and diligence, may we perfect the awakened conduct.",
      "en-trans": "dé mö tsönpé changchub chöpa dzok"
    },
    {
      "bo": "ཁྱད་པར་སྨིན་གྲོལ་ཟབ་མོའི་གསེང་ལམ་གྱིས། །",
      "en": "Especially, through the profound, direct path of ripening and liberation,",
      "en-trans": "khyepar mindrol zabmö seng lam gyi"
    },
    {
      "bo": "ཟུང་འཇུག་བདེ་ཆེན་རྡོ་རྗེའི་གྲོང་རྩེན་ཤོག །",
      "en": "May we enjoy the vajra citadel of unified great bliss!",
      "en-trans": "zungjuk dechen dorjé drong tsen shok"
    },
    {
      "bo": "སྤྱོད་པ་གསུམ་གྱི་ཉེ་རྒྱུ་མཐར་སོན་པས། །",
      "en": "Perfecting the three conducts, the immediate cause,4",
      "en-trans": "chöpa sum gyi nyé gyu tarsönpé"
    },
    {
      "bo": "འབར་བ་གསུམ་གྱི་རླུང་སེམས་དབུ་མར་བཅིང་། །",
      "en": "May I bind the three blazes of the prāṇa-mind in the central channel,5",
      "en-trans": "barwa sum gyi lungsem umar ching"
    },
    {
      "bo": "འདུ་བ་གསུམ་གྱིས་དོན་གཉིས་ལྷུན་གྲུབ་ནས། །",
      "en": "And through three gatherings may the two benefits be spontaneously accomplished.6",
      "en-trans": "duwa sum gyi dön nyi lhündrub né"
    },
    {
      "bo": "གནས་གསུམ་མཁའ་འགྲོའི་ཚོགས་དང་སྐལ་མཉམ་ཤོག །",
      "en": "Thus may I gain the same fortune as the ḍākinīs of the three places.",
      "en-trans": "né sum khandrö tsok dang kal nyam shok"
    },
    {
      "bo": "ཚེ་བས་ཀུན་ཏུ་ཡེ་ཤེས་མཁའ་འགྲོ་མས། །",
      "en": "In all my future lives, O wisdom ḍākinīs,",
      "en-trans": "tsewé küntu yeshe khandromé"
    },
    {
      "bo": "རྗེས་སུ་བཟུང་སྟེ་རྡོ་རྗེ་ཐེག་མཆོག་གྱིས། །",
      "en": "Take me under your care! Through the supreme Vajrayāna,",
      "en-trans": "jesu zung té dorjé tek chok gyi"
    },
    {
      "bo": "གསང་མཛོད་འདོད་རྒུར་སྤྱོད་པ་ལྷན་སྐྱེས་ཀྱིས། །",
      "en": "The innate, secret treasury that yields all to be desired,",
      "en-trans": "sangdzö dögur chöpa lhenkyé kyi"
    },
    {
      "bo": "ཡེ་ཤེས་ཐིག་ལེར་གཉིས་མེད་བྱང་ཆུབ་ཤོག །",
      "en": "May I awaken, merging indivisibly with the wisdom bindu!",
      "en-trans": "yeshe tikler nyimé changchub shok"
    }
  ]
}