{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/prayer-to-patrul",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འགྲོ་འདུལ་རྒྱལ་བའི་མྱུ་གུ་ཆོས་ཀྱི་དབང་པོར་གསོལ་བ་འདེབས་བཞུགས་སོ།།",
    "en": "Prayer to Chökyi Wangpo, the Bodhisattva1and Tamer of Beings"
  },
  "text": [
    {
      "bo": "འཕགས་པའི་ཡུལ་དུ་སློབ་དཔོན་ཞི་བ་ལྷ། །",
      "en": "In the land of the āryas, you were the master Śāntideva;",
      "en-trans": "pakpé yul du lobpön zhiwa lha"
    },
    {
      "bo": "གངས་རིའི་ཁྲོད་ན་སྤྲུལ་སྐུ་ཡེ་ཤེས་འབྱུང་། །",
      "en": "In this land of snow-capped peaks, you were the nirmāṇakāya Aro Yeshe Jungne;2",
      "en-trans": "gangri trö na trulku yeshé jung"
    },
    {
      "bo": "དེང་འདིར་འགྲོ་འདུལ་ཆོས་ཀྱི་དབང་པོའི་སྡེ། །",
      "en": "And now you are Chökyi Wangpo, the tamer of beings—",
      "en-trans": "deng dir dro dül chökyi wangpö dé"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "To this great source of benefit for all with a connection, I pray!",
      "en-trans": "drel tsé dön den chenpor solwa dep"
    },
    {
      "bo": "ངེས་འབྱུང་ཆེན་པོས་སྒྲུབ་པའི་རྒྱལ་མཚན་བཙུགས། །",
      "en": "With great renunciation, you planted the victory banner of accomplishment;",
      "en-trans": "ngéjung chenpö drubpé gyaltsen tsuk"
    },
    {
      "bo": "བྱང་སེམས་ཆེན་པོས་འགྲོ་ཀུན་བུ་ལྟར་གཟིགས། །",
      "en": "With great bodhicitta, you look upon all beings as your very own children;",
      "en-trans": "chang sem chenpö dro kün bu tar zik"
    },
    {
      "bo": "མཁྱེན་རབ་ཆེན་པོས་ཆོས་ཆར་མཐའ་ཡས་པའི། །",
      "en": "With great wisdom, you rain down an infinite shower of Dharma:",
      "en-trans": "khyenrab chenpö chö char tayépé"
    },
    {
      "bo": "རྣམ་ཐར་དྲན་བཞིན་སྙིང་ནས་གསོལ་བ་འདེབས། །",
      "en": "Remembering your qualities of liberation, I pray to you from the depths of my heart!",
      "en-trans": "namtar dren zhin nying né solwa dep"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་རླབས་ཀྱིས། །",
      "en": "Through the inspiration and blessings of praying in this way,",
      "en-trans": "dé tar solwa tabpé chinlap kyi"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མ་བསྐལ་བརྒྱར་ཞབས་བརྟན་ཅིང་། །",
      "en": "May the life of the venerable guru remain secure for a hundred aeons,",
      "en-trans": "jetsün lama kal gyar zhap ten ching"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཕྲིན་ལས་ཕྱོགས་བཅུར་རྒྱས་པ་དང་། །",
      "en": "May his activity of teaching and practice spread in all directions,",
      "en-trans": "shé drup trinlé chok chur gyépa dang"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་འགྲུབ་པའི་བཀྲ་ཤིས་ཤོག །",
      "en": "And may all be auspicious to accomplish the twofold benefit of self and others!",
      "en-trans": "rang zhen dön nyi drubpé trashi shok"
    }
  ]
}