{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-patrul",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཨོ་རྒྱན་འཇིགས་མེད་ཆོས་ཀྱི་དབང་པོ་ལ་གསོལ་བ་འདེབས་པ་ཟླ་ཤེལ་བདུད་རྩི་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "A Prayer to Orgyen Jigme Chökyi Wangpo"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti.",
      "en-trans": "om swasti"
    },
    {
      "bo": "དམར་སེར་རལ་གྲིས་ཕྱག་གི་ལྕུག་ཕྲན་བརྒྱན། །",
      "en": "Reddish yellow, the spray of your hand adorned with a sword,",
      "en-trans": "marser raldri chak gi chuktren gyen"
    },
    {
      "bo": "མཁྱེན་པའི་འོད་ཟེར་དྲྭ་བས་ཀུན་ནས་མཛེས། །",
      "en": "Perfectly handsome amidst a web of wisdom light rays,",
      "en-trans": "khyenpé özer drawé künné dzé"
    },
    {
      "bo": "ཐུན་མཚམས་གསར་བའི་མདངས་ལྡན་གསེར་བསྲེགས་བཞིན། །",
      "en": "Ablaze and golden with the radiance of a pristine dawn,",
      "en-trans": "tüntsam sarwé dangden ser sek zhin"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་མཁའ་དབྱིངས་ཁྱབ་པའི་ཡེ་ཤེས་སྐུ། །",
      "en": "Your wisdom kāya fills the whole of space in every direction.",
      "en-trans": "chok chü khaying khyabpé yeshe ku"
    },
    {
      "bo": "རྗེས་སུ་ཆགས་པའི་རོལ་རྩེད་འབུམ་ཕྲག་བརྒྱ། །",
      "en": "You are without equal in displaying all at once",
      "en-trans": "jesu chakpé roltsé bumtrak gya"
    },
    {
      "bo": "གཅིག་ཅར་སྟོན་ལ་མཚུངས་པ་མེད་པ་དང་། །",
      "en": "Manifestations of love by their hundreds of thousands,",
      "en-trans": "chik char tön la tsungpa mepa dang"
    },
    {
      "bo": "ཏིང་འཛིན་སྒོ་མོ་བརྒྱ་ཕྲག་མང་པོ་འབྱེད། །",
      "en": "And in opening doors to samādhi by the score.",
      "en-trans": "tingdzin gomo gyatrak mangpo jé"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་དང་བཅས་པས་རབ་བསྔགས་ཤིང་། །",
      "en": "Thus, the victorious ones and their heirs extol you",
      "en-trans": "gyalwa sé dang chepé rab ngak shing"
    },
    {
      "bo": "བསྟོད་པའི་མེ་ཏོག་རིགས་ལྔ་དབུ་ལ་བཅིང་། །",
      "en": "And pin flowers of praise to the five families at your crown.",
      "en-trans": "töpé metok rik nga u la ching"
    },
    {
      "bo": "ཐོར་ཚུགས་ནོར་བུའི་འོད་ཀྱིས་ཞིང་ཀུན་གསལ། །",
      "en": "Light from the jewel of your topknot illuminates all realms.",
      "en-trans": "tortsuk norbü ö kyi zhing kün sal"
    },
    {
      "bo": "རྒྱལ་བའི་ཡབ་གཅིག་འཇམ་དཔལ་གཞོན་ནུ་ནི། །",
      "en": "One and only father of the conquerors, Mañjughoṣa,",
      "en-trans": "gyalwé yab chik jampal zhönnu ni"
    },
    {
      "bo": "ཕྲ་རབ་རྡུལ་ལ་འཇུག་ཅིང་སྲིད་ཞིར་ཁྱབ། །",
      "en": "You enter the finest particles and pervade existence and peace.",
      "en-trans": "tra rab dul la juk ching sizhir khyab"
    },
    {
      "bo": "འདོད་པའི་འབྲས་བུ་ཡིད་བཞིན་སྟོན་མཛད་ཅིང་། །",
      "en": "As the fruit of aspirations, you manifest according to wishes,",
      "en-trans": "döpé drebu yizhin tön dzé ching"
    },
    {
      "bo": "བློ་མཆོག་དགེ་བའི་བཤེས་ཀྱི་གཟུགས་སུ་སྟོན། །",
      "en": "And appear as a spiritual teacher of supreme intellect,",
      "en-trans": "lo chok geweshé kyi zuk su tön"
    },
    {
      "bo": "སྙིགས་མའི་འདྲེན་པ་ཟླ་མེད་སྣང་བར་གྱུར། །",
      "en": "A peerless guide for this decadent age.",
      "en-trans": "nyikmé drenpa damé nangwar gyur"
    },
    {
      "bo": "འཇམ་དབྱངས་ཞབས་ཀྱི་པདྨོ་ལ་རེག་ཅིང་། །",
      "en": "You touched the lotus feet of Mañjughoṣa",
      "en-trans": "jamyang zhab kyi pemo la rek ching"
    },
    {
      "bo": "ངོ་མཚར་རྣམ་ཐར་གཏམ་གྱི་རྒྱུད་མངས་འཁྲོལ། །",
      "en": "And thesitarof your wondrous life of liberation played.",
      "en-trans": "ngotsar namtar tam gyi gyümang trol"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པའི་གཞུང་མདོ་ལ་སོགས་པ། །",
      "en": "Your texts on awakening activity, the sūtras and so on",
      "en-trans": "changchub chöpé zhung do lasokpa"
    },
    {
      "bo": "བསྟན་འགྲོའི་མཆོད་སྡོང་འཛམ་གླིང་ཀུན་གྱི་རྒྱན། །",
      "en": "Became a sacred support for teachings and beings, an ornament for all the world.",
      "en-trans": "ten drö chö dong dzamling kün gyi gyen"
    },
    {
      "bo": "ཡེ་ཤེས་འབྱུང་གནས་བསམ་བཞིན་བྱོན་པའི་སྐུ། །",
      "en": "Yeshe Jungne1intentionally reincarnated,",
      "en-trans": "yeshe jungné samzhin jönpé ku"
    },
    {
      "bo": "འཕགས་མཆོག་འཇམ་དཔལ་དབྱངས་དང་དབྱེར་མི་ཕྱེད། །",
      "en": "Inseparable from the sublime and exalted Mañjughoṣa,",
      "en-trans": "pakchok jampal yang dang yer miché"
    },
    {
      "bo": "འཛམ་གླིང་མཁས་པའི་བསྟན་བཅོས་རྣམས་ཀྱི་གཞུང་། །",
      "en": "You taught, practised and imparted direct instructions",
      "en-trans": "dzamling khepé tenchö nam kyi zhung"
    },
    {
      "bo": "འཆད་ཅིང་ཉམས་ལེན་དམར་ཁྲིད་འདོམས་པར་མཛད། །",
      "en": "On the major treatises of the learned ones of Jambudvīpa—",
      "en-trans": "ché ching nyamlen martri dompar dzé"
    },
    {
      "bo": "བླ་མ་ཐུགས་རྗེ་ཅན་ཁྱོད་ཡང་ཡང་དྲན། །",
      "en": "Compassionate guru, I call you to mind again and again.",
      "en-trans": "lama tukjé chen khyö yangyang dren"
    },
    {
      "bo": "གདུལ་དཀའི་སེམས་ཅན་ཐབས་མཁས་འཕྲུལ་གྱིས་འདུལ། །",
      "en": "With skill and ingenuity, you tamed unruly beings,",
      "en-trans": "dul ké semchen tabkhé trul gyi dul"
    },
    {
      "bo": "སྡིག་རྒྱུན་གཅོད་ཅིང་དགེ་བའི་ལམ་ལ་བཀོད། །",
      "en": "Stemming the tide of their misdeeds and setting them on the path of virtue,",
      "en-trans": "dik gyün chö ching gewé lam la kö"
    },
    {
      "bo": "འབྲེལ་ཚད་ཐར་པའི་ས་བོན་འདེབས་པར་མཛད། །",
      "en": "And planted the seed of liberation in all with a connection—",
      "en-trans": "dreltsé tarpé sabön debpar dzé"
    },
    {
      "bo": "ཨོ་རྒྱན་འཇིགས་མེད་ཆོས་ཀྱི་དབང་པོར་འདུད། །",
      "en": "Orgyen Jigme Chökyi Wangpo, to you I bow down.",
      "en-trans": "orgyen jikme chö kyi wangpor dü"
    },
    {
      "bo": "གྲོལ་བ་བཞི་ལྡན་ཡིག་དྲུག་ཆོས་ཀྱི་མཁར། །",
      "en": "In the dharma space of fourfold liberation and the six syllables,",
      "en-trans": "drolwa zhiden yik druk chö kyi khar"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ས་ཡི་བརྟན་ཕུར་བསྐྲུན། །",
      "en": "You planted the tethering stake of benefit for all you encountered,",
      "en-trans": "dreltsé dönden sa yi ten pur trün"
    },
    {
      "bo": "གསུང་གི་ཕྲིན་ལས་མཁས་གྲུབ་སློབ་ཚོགས་འདུ། །",
      "en": "And drew in learned, accomplished students through your enlightened acts of speech—",
      "en-trans": "sung gi trinlé khedrub lob tsokdu"
    },
    {
      "bo": "རྒྱལ་སྲས་སྨྲ་བའི་ཁྱུ་མཆོག་ཆེན་པོར་བསྟོད། །",
      "en": "Heir to the victors, most magnificent of teachers, to you I offer praise.",
      "en-trans": "gyalsé mawé khyuchok chenpor tö"
    },
    {
      "bo": "སྐུ་ཚེ་མཐར་ཕྱིན་བདེ་བ་ཅན་ཞིང་དང་། །",
      "en": "When your life was complete, in limitless emanations",
      "en-trans": "kutsé tarchin dewachen zhing dang"
    },
    {
      "bo": "མངོན་པར་དགའ་བ་སོགས་སུ་ཐེག་ཆེན་གྱི། །",
      "en": "You continued to teach the Dharma of the Great Vehicle",
      "en-trans": "ngönpar gawa sok su tekchen gyi"
    },
    {
      "bo": "ཆོས་ཀྱི་བགྲོ་གླེང་སྤྲུལ་པ་དཔག་མེད་ཀྱིས། །",
      "en": "In the realms of Sukhāvatī, Abhirati and elsewhere—",
      "en-trans": "chö kyi droleng trulpa pakmé kyi"
    },
    {
      "bo": "བསྟན་འགྲོར་ཕན་བདེ་སྤེལ་བའི་ཆོས་ཀྱི་རྗེ། །",
      "en": "Dharma lord, who caused the teachings and beings to prosper,",
      "en-trans": "ten dror pendé pelwé chö kyi jé"
    },
    {
      "bo": "ཁྱོད་ལ་ཡང་ཡང་གསོལ་བ་བཏབ་པ་ཡིས། །",
      "en": "As a result of my repeated prayers to you,",
      "en-trans": "khyö la yangyang solwa tabpa yi"
    },
    {
      "bo": "དམ་ཆོས་སྒྲུབ་པའི་བར་ཆད་དབྱིངས་སུ་སོལ། །",
      "en": "Dispel all obstacles to the practice of sacred Dharma into basic space.",
      "en-trans": "damchö drubpé barché ying su sol"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་འབྱོངས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire me with your blessings so that I may master sublime bodhicitta,",
      "en-trans": "changchub sem chok jongpar jingyi lob"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་འབྱུང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "And grant your blessings so that twofold benefit may arise spontaneously.",
      "en-trans": "dön nyi lhündrub jungwar jingyi lob"
    }
  ]
}