{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/yangthang-rinpoche/khenpo-sodargye-blessings-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བྱིན་རླབས་གསོལ་འདེབས་མོས་གུས་ཀྱི་མྱུ་གུ།"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།"
    },
    {
      "bo": "སྙིང་རྗེའི་གཏེར་ཆེན་ཕྱག་ན་པདྨོ་ཡི། །"
    },
    {
      "bo": "གདུལ་བྱའི་ཞིང་མཆོག་གངས་རིའི་ལྗོངས་འདི་རུ། །"
    },
    {
      "bo": "བཀའ་དྲིན་ཟླ་བྲལ་པདྨ་སཾ་བྷ་ཝས། །"
    },
    {
      "bo": "རྗེས་བཟུང་གྲུབ་ཆེན་ནམ་མཁའི་རྣལ་འབྱོར་པ། །"
    },
    {
      "bo": "རྡོ་རྗེ་བདུད་འཇོམས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་བརྒྱད་ཚེ་འདིའི་ཞེན་པ་རང་གྲོལ་ནས། །"
    },
    {
      "bo": "ཚེ་དང་སྒྲུབ་པ་སྙོམས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མཆོག་གི་གསང་གསུམ་རྡོ་རྗེའི་སྒྱུ་འཕྲུལ་གར། །"
    },
    {
      "bo": "རྩོད་ལྡན་དུས་ཀྱི་མུན་སེལ་འགྲོ་བའི་མགོན། །"
    },
    {
      "bo": "འཇིགས་མེད་ཕུན་ཚོགས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་བརྒྱད་ཚེ་འདིའི་ཞེན་པ་རང་གྲོལ་ནས། །"
    },
    {
      "bo": "ཚེ་དང་སྒྲུབ་པ་སྙོམས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གང་གི་གསུང་གི་འོད་ཟེར་འཕོས་པ་ལས། །"
    },
    {
      "bo": "ཟབ་རྒྱས་ཆོས་ལ་བློ་གྲོས་འདབ་བརྒྱ་བཞད། །"
    },
    {
      "bo": "བསྟན་འགྲོར་སྨན་པའི་ཕྲིན་ལས་མཛད་བཟང་ཅན། །"
    },
    {
      "bo": "བསོད་ནམས་དར་རྒྱས་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་བརྒྱད་ཚེ་འདིའི་ཞེན་པ་རང་གྲོལ་ནས། །"
    },
    {
      "bo": "ཚེ་དང་སྒྲུབ་པ་སྙོམས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྐྱེ་སྔོན་བསོ༵ད་ན༵མས་རྒྱ་ཆེན་ལེགས་བྱས་མཐུས། །"
    },
    {
      "bo": "རྟེན་འདིར་འགྲོ་དོན་ཕྱོགས་མེད་ད༵ར་ཞིང་རྒྱ༵ས། །"
    },
    {
      "bo": "རྒྱལ་བསྟན་དགུང་དུ་འདེགས་པའི་དཔལ་མངའ་བ། །"
    },
    {
      "bo": "རྩ་བའི་བླ་མ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བླ་མ་སངས་རྒྱས་དངོས་མཐོང་མོས་གུས་ཀྱིས། །"
    },
    {
      "bo": "རྣམ་ཀུན་ཁྱེད་ཤེས་དྲག་པོས་གསོལ་འདེབས་ན། །"
    },
    {
      "bo": "ཆོས་ཀྱི་འགལ་རྐྱེན་མ་ལུས་ཉེར་ཞི་ནས། །"
    },
    {
      "bo": "ཆོས་བརྒྱད་བྲལ་བའི་དབེན་ཁྲོད་ཉམས་དགའ་བར། །"
    },
    {
      "bo": "ཚེ་དང་སྒྲུབ་པ་མཐའ་རུ་ཕྱིན་ནས་ཀྱང་། །"
    },
    {
      "bo": "མ་དག་འཁྲུལ་བའི་སྣང་བ་དབྱིངས་སུ་ནུབ། །"
    },
    {
      "bo": "ཀ་དག་ཆོས་སྐུའི་དགོངས་པ་མངོན་གྱུར་ནས། །"
    },
    {
      "bo": "ལྷུན་གྲུབ་བདེ་གཤེགས་སྙིང་པོའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "གདོད་མའི་བཙན་ས་ཟིན་པར་བྱིན་གྱིས་རློབས། །"
    }
  ]
}