{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-gorampa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཀུན་མཁྱེན་བསྟན་པའི་ཉི་མ་བསོད་ནམས་སེངྒེ་ལ་གསོལ་བ་འདེབས་པ་ཡེ་ཤེས་སྣང་གཏེར་ཞེས་བྱ་བ།",
    "en": "A Prayer to Sonam Senge, Omniscient Sun of the Teachings"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་པུནྱཻ་སེང་ཧ་ཡ།",
      "en": "Namo guru-puṇya-siṃhāya!1"
    },
    {
      "bo": "ཀུན་མཁྱེན་འཇམ་དཔལ་སྨྲ་བའི་སེངྒེ་མཆོག །",
      "en": "All-knowing Mañjuśrī, supreme lion of speech,",
      "en-trans": "künkhyen jampal mawé sengé chok"
    },
    {
      "bo": "ཀུན་དགའི་རིང་ལུགས་ཉིན་མོར་བྱེད་པའི་སླད། །",
      "en": "In order to become a sun for the tradition of Kunga,2",
      "en-trans": "küngé ringluk nyinmor jepé lé"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་རབ་གྲུབ་པ། །",
      "en": "You perfectly accomplished Samantabhadra’s aspirations.",
      "en-trans": "kuntuzangpö mönlam rab drubpa"
    },
    {
      "bo": "ཀུན་གཟིགས་འཇམ་དབྱངས་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "All-seeing Mañjughoṣa guru, to you I pray.",
      "en-trans": "künzik jamyang lamar solwa deb"
    },
    {
      "bo": "གདོད་ནས་འཇམ་པའི་དཔལ་དང་དབྱེར་མི་ཕྱེད། །",
      "en": "Always indivisible from Mañjuśrī—Gentle Splendour,",
      "en-trans": "döné jampé pal dang yer miché"
    },
    {
      "bo": "འཕགས་བོད་མཁས་གྲུབ་དུ་མའི་སྐྱེ་བ་བཞེས། །",
      "en": "You took birth as scholars and adepts in India and Tibet,",
      "en-trans": "pak bö khedrub dumé kyewa zhé"
    },
    {
      "bo": "དེང་འདིར་དགེ་བའི་བཤེས་ཀྱི་སྐུར་སྟོན་ནས། །",
      "en": "And then you took the form of this spiritual friend.",
      "en-trans": "dengdir gewé shé kyi kur tön né"
    },
    {
      "bo": "སུམ་ལྡན་རྡོ་རྗེ་འཛིན་པར་གསོལ་བ་འདེབས། །",
      "en": "Vajra holder of the three sets of vows, to you I pray.",
      "en-trans": "sumden dorjé dzinpar solwa deb"
    },
    {
      "bo": "ངེས་འབྱུང་ཚུལ་ཁྲིམས་ཁང་བཟང་ཉམས་དགའ་བར། །",
      "en": "In the delightful palace of renunciation and discipline,",
      "en-trans": "ngejung tsultrim khang zang nyamgawar"
    },
    {
      "bo": "གཞན་ཕན་བྱང་ཆུབ་སེམས་དཔའི་ཐུ་བོ་ཆེ། །",
      "en": "You are the great son and heir, an altruistic bodhisattva,",
      "en-trans": "zhenpen changchub sempé tuwo ché"
    },
    {
      "bo": "གསང་བའི་བདག་པོ་རྡོ་རྗེའི་སྙེམས་འཆང་བ། །",
      "en": "The Lord of Secrets sustaining vajra pride.",
      "en-trans": "sangwé dakpo dorjé nyem changwa"
    },
    {
      "bo": "རིགས་གསུམ་འདུས་ཞལ་བླ་མར་གསོལ་བ་འདེབས། །",
      "en": "Guru who embodies the three families, to you I pray.",
      "en-trans": "rik sum dü zhal lamar solwa deb"
    },
    {
      "bo": "ཟབ་དང་རྒྱ་ཆེའི་ཤེས་བྱ་ཐམས་ཅད་མཁྱེན། །",
      "en": "Master of all the profound and vast topics of knowledge,",
      "en-trans": "zab dang gyaché sheja tamché khyen"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་ལ་ཆགས་ཐོགས་སྒྲིབ་པ་བྲལ། །",
      "en": "Unobstructed in exposition, debate and composition,",
      "en-trans": "ché tsö tsom la chaktok dribpa dral"
    },
    {
      "bo": "གངས་ཅན་མཛེས་པའི་རྒྱན་མཆོག་ཆེན་པོ་ནི། །",
      "en": "You are a magnificent ornament enhancing the Land of Snows.",
      "en-trans": "gangchen dzepé gyen chok chenpo ni"
    },
    {
      "bo": "མཚུངས་ཟླ་མེད་པ་ཁྱེད་ལ་གསོལ་བ་འདེབས། །",
      "en": "Peerless and unrivalled one, to you I pray.",
      "en-trans": "tsungda mepa khyé la solwa deb"
    },
    {
      "bo": "ཡུམ་དོན་དགོངས་པ་ཇི་བཞིན་ཐུགས་སུ་ཆུད། །",
      "en": "You understood the precise meaning of Mother Prajñāpāramitā,",
      "en-trans": "yum dön gongpa jizhin tuk su chü"
    },
    {
      "bo": "དཔལ་ལྡན་ཆོས་ཀྱི་གྲགས་པ་དངོས་སུ་སྣང་། །",
      "en": "And showed yourself to be glorious Dharmakīrti in person,",
      "en-trans": "palden chökyi drakpa ngö su nang"
    },
    {
      "bo": "དབྱིག་གི་གཉེན་པོ་བཞིན་དུ་བརྗོད་པ་དག །",
      "en": "As articulate in expression as Vasubandhu himself.",
      "en-trans": "yik gi nyenpo zhindu jöpa dak"
    },
    {
      "bo": "མཁས་པའི་གཙུག་རྒྱན་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Great crown adornment of scholars, to you I pray.",
      "en-trans": "khepé tsukgyen chenpor solwa deb"
    },
    {
      "bo": "བྱམས་ཀླུ་དགོངས་པ་འགལ་མེད་ཅིག་ཏུ་སྒྲུབ། །",
      "en": "You reconciled the visions of both Maitreya and Nāgārjuna,",
      "en-trans": "jam lu gongpa galmé chik tu drub"
    },
    {
      "bo": "རྟག་ཆད་སྤྲོས་པའི་མཐའ་ལ་མ་ལྷུང་ཞིང་། །",
      "en": "Without falling into eternalist or nihilist extremes,",
      "en-trans": "takché tröpé ta la ma lhung zhing"
    },
    {
      "bo": "ཟུང་འཇུག་དབུ་མ་ཆེན་པོ་སྟོན་མཛད་པ། །",
      "en": "And revealed the great Middle Way of unity.",
      "en-trans": "zungjuk uma chenpo tön dzepa"
    },
    {
      "bo": "བྱང་ཕྱོགས་ཐུབ་དབང་གཉིས་པར་གསོལ་བ་འདེབས། །",
      "en": "Second Lord of Sages for the Land of Snows, to you I pray.",
      "en-trans": "jangchok tubwang nyipar solwa deb"
    },
    {
      "bo": "འཇིགས་བྲལ་སྟོབས་ཀྱི་མགོན་པོ་བིརཱུ་པའི། །",
      "en": "With a stream of ripening empowerments and liberating instructions",
      "en-trans": "jikdral tob kyi gönpo birupé"
    },
    {
      "bo": "བཞེད་གཞུང་གསུང་ངག་སྨིན་གྲོལ་ཆུ་རྒྱུན་གྱི། །",
      "en": "In the tradition of Virūpa, that fearless and mighty guardian,",
      "en-trans": "zhé zhung sung ngak mindrol chugyün gyi"
    },
    {
      "bo": "སྐལ་ལྡན་སྐུ་བཞིའི་ལོ་ཐོག་རྒྱས་མཛད་པ། །",
      "en": "You brought fortunate disciples an abundant four-kāya harvest.",
      "en-trans": "kalden ku zhi lo tok gyé dzepa"
    },
    {
      "bo": "རྗེ་བཙུན་རིན་པོ་ཆེ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Most precious and noble one, to you I pray.",
      "en-trans": "jetsün rinpoche la solwa deb"
    },
    {
      "bo": "ངེས་པའི་དོན་དུ་རྡོ་རྗེ་འཆང་དབང་དང་། །",
      "en": "In reality, you are none other than mighty Vajradhara,",
      "en-trans": "ngepé döndu dorjé chang wang dang"
    },
    {
      "bo": "ཐ་དད་མ་མཆིས་དཀྱིལ་འཁོར་ཀུན་གྱི་བདག །",
      "en": "The lord of each and every maṇḍala,",
      "en-trans": "tadé ma chi kyilkhor kün gyi dak"
    },
    {
      "bo": "གསང་སྔགས་རྒྱུད་དོན་མ་ནོར་གསལ་མཛད་པ། །",
      "en": "Clarifying without error the meaning of tantra and secret mantra.",
      "en-trans": "sang ngak gyü dön manor sal dzepa"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Great lord of yogins, to you I pray.",
      "en-trans": "naljor wangchuk chenpor solwa deb"
    },
    {
      "bo": "སྐྱེ་བ་འདི་དང་སྐྱེ་བ་གཞན་དག་ཏུ། །",
      "en": "In this and all my other lives to come,",
      "en-trans": "kyewa di dang kyewa zhendak tu"
    },
    {
      "bo": "ཁྱེད་ཀྱི་གསང་བ་གསུམ་གྱི་བྱིན་བརླབས་ཞུགས། །",
      "en": "May I be blessed by your secret body, speech and mind,",
      "en-trans": "khyé kyi sangwa sum gyi jinlab zhuk"
    },
    {
      "bo": "རྒྱལ་བའི་དགོངས་པ་ཇི་བཞིན་འཆད་པ་ལ། །",
      "en": "And as I expound upon the intent of the victorious buddhas,",
      "en-trans": "gyalwé gongpa jizhin chepa la"
    },
    {
      "bo": "ཀུན་མཁྱེན་བླ་མ་ཉིད་དང་དབྱེར་མེད་ཤོག །",
      "en": "May I be indivisible from you, the all-knowing guru.",
      "en-trans": "künkhyen lama nyi dang yermé shok"
    },
    {
      "bo": "བསོད་ནམས་ཆེན་པོའི་དཔལ་གྱིས་ལེགས་གསུང་ཚོགས། །",
      "en": "With powerful intellect capable of retaining, explaining and propagating",
      "en-trans": "sönam chenpö pal gyi lek sung tsok"
    },
    {
      "bo": "འཛིན་འཆད་སྤེལ་ལ་བློ་གྲོས་མཐུ་ལྡན་ཞིང་། །",
      "en": "Your excellent teachings that have the splendour of great merit,",
      "en-trans": "dzin ché pel la lodrö tuden zhing"
    },
    {
      "bo": "ཕྱོགས་ལས་རྣམ་པར་རྒྱལ་བའི་སེངྒེའི་སྒྲས། །",
      "en": "And with the leonine roar of comprehensive and universal victory",
      "en-trans": "chok lé nampar gyalwé sengé dré"
    },
    {
      "bo": "ལྟ་ངན་རི་དྭགས་ཚོགས་རྣམས་འཇོམས་གྱུར་ཅིག །",
      "en": "May I overcome the bestial hordes of mistaken views.",
      "en-trans": "ta ngen ridak tsok nam jom gyur chik"
    }
  ]
}