{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-shantarakshita",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁན་ཆེན་གསོལ་འདེབས་བྱང་ཆུབ་ལྗོན་ཤིང་ཞེས་བྱ་བ།",
    "en": "A Prayer to the Great Abbot Śāntarakṣita"
  },
  "text": [
    {
      "bo": "མགོན་པོ་འཇམ་པའི་དབྱངས་ལ་གུས་པས་ཕྱག་འཚལ་ལོ།    །",
      "en": "In devotion, I pay homage to the protector Mañjughoṣa!",
      "en-trans": "gönpo jampé yang la güpé chaktsal lo"
    },
    {
      "bo": "རྒྱལ་རིགས་སཱ་ལ་ལྟ་བུའི་རྒྱུད་འཁྲུངས་ཤིང་།    །",
      "en": "Born into thesāla-like lineage of the kṣatriyas,",
      "en-trans": "gyalrik sala tabü gyü trung shing"
    },
    {
      "bo": "རིག་པའི་གནས་ལྔ་མཐར་ཕྱིན་འཇམ་དབྱངས་ཀྱི།    །",
      "en": "You mastered the five sciences and honoured Mañjughoṣa,",
      "en-trans": "rigpé né nga tarchin jamyang kyi"
    },
    {
      "bo": "ཞབས་ཀྱི་པདྨོའི་ཟེའུ་འབྲུ་སྤྱི་བོས་བསྟེན།    །",
      "en": "Offering the crown of your head for his lotus feet—",
      "en-trans": "zhab kyi pemö zé'u dru chiwö ten"
    },
    {
      "bo": "མཁན་ཆེན་བྱང་ཆུབ་སེམས་དཔར་གསོལ་བ་འདེབས།    །",
      "en": "Great bodhisattva abbot, to you I pray.",
      "en-trans": "khenchen changchub sempar solwa deb"
    },
    {
      "bo": "བསྐལ་མང་གོང་ནས་གཞན་ཕན་ཐུགས་བསྐྱེད་ཀྱི།    །",
      "en": "With your altruistic resolve formed many aeons ago",
      "en-trans": "kal mang gong né zhenpen tukkyé kyi"
    },
    {
      "bo": "རྩ་བ་གསེར་སྦྲམ་ལྟ་བུ་རབ་བརྟན་པས།    །",
      "en": "As an utterly stable foundation like finest gold,",
      "en-trans": "tsawa ser dram tabu rabten pé"
    },
    {
      "bo": "རྩོད་དུས་བསྟན་དང་འགྲོ་བའི་གཉེན་གཅིག་པུ།    །",
      "en": "You are the sole ally of the teachings and beings in this age of turmoil—",
      "en-trans": "tsödü ten dang drowé nyen chikpu"
    },
    {
      "bo": "མཁན་ཆེན་ཞི་བ་འཚོ་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Great abbot Śāntarakṣita, to you I pray.",
      "en-trans": "khenchen zhiwatso la solwa deb"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་ལ་འཁུ་བའི་མུ་སྟེགས་ཀྱི།    །",
      "en": "Like a mighty skull-crushing vajra elephant, you defeated",
      "en-trans": "sangye ten la khuwé mutek kyi"
    },
    {
      "bo": "གླང་ཆེན་གཙུག་འགེམ་དབང་པོའི་རྡོ་རྗེ་ལྟར།    །",
      "en": "Thetīrthikas who were hostile to the teachings of the Buddha",
      "en-trans": "langchen tsuk gem wangpö dorjé tar"
    },
    {
      "bo": "སྒྲ་ཚད་དབུ་མའི་རིགས་པས་བཅོམ་མཛད་པའི།    །",
      "en": "In grammar and logic and through Middle Way reasoning —",
      "en-trans": "dratsé umé rikpé chom dzepé"
    },
    {
      "bo": "སྨྲ་བའི་སེངྒེ་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Great lion of speech, to you I pray.",
      "en-trans": "mawé sengé chenpor solwa deb"
    },
    {
      "bo": "ཆོས་འདུལ་གསེར་གྱི་རི་བོར་རྟེན་བཅས་ཤིང་།    །",
      "en": "Upon the foundation of Vinaya teachings, like a golden mountain,",
      "en-trans": "chö dul ser gyi riwor ten ché shing"
    },
    {
      "bo": "ཟབ་ཅིང་རྒྱ་ཆེའི་མདོ་སྡེའི་དོན་རབ་གསལ།    །",
      "en": "You fully elucidated the meaning of the Sūtras, profound and vast,",
      "en-trans": "zab ching gyaché dodé dön rabsal"
    },
    {
      "bo": "ཆོས་མངོན་རྒྱ་མཚོའི་སྤྱན་སྟོང་རྣམ་པར་བཀྲ།    །",
      "en": "And beheld the ocean-like Abhidharma as if with a thousand eyes—",
      "en-trans": "chö ngön gyatsö chen tong nampar tra"
    },
    {
      "bo": "མཁན་ཆེན་ལྷ་ཡི་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "Great abbot, guru to the gods, to you I pray.",
      "en-trans": "khenchen lha yi lamar solwa deb"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་དྲི་ཡིས་ལྷར་བཅས་འགྲོ་རྣམས་དགའ།    །",
      "en": "The sweet scent of your discipline delighted all including the devas,",
      "en-trans": "tsultrim dri yi lhar ché dro nam ga"
    },
    {
      "bo": "ཏིང་འཛིན་ཟབ་མོས་ཟག་མེད་ཡོན་ཏན་སྡུད།    །",
      "en": "Your profound meditative absorption brought undefiled qualities,",
      "en-trans": "tingdzin zab mö zakmé yönten dü"
    },
    {
      "bo": "ཤེས་རབ་སྤོབས་པས་ཆོས་ཀྱི་སྒོ་བརྒྱ་འབྱེད།    །",
      "en": "And your wisdom and courageous eloquence opened a hundred Dharma doors—",
      "en-trans": "sherab pobpé chö kyi go gya jé"
    },
    {
      "bo": "འཛམ་གླིང་ཐུབ་དབང་གཉིས་པར་གསོལ་བ་འདེབས།    །",
      "en": "Second lord of sages for this world of Jambudvīpa, to you I pray.",
      "en-trans": "dzamling tubwang nyipar solwa deb"
    },
    {
      "bo": "བྱང་ཕྱོགས་གངས་རིའི་ཕྲེང་བས་བསྐོར་བའི་ལྗོངས།    །",
      "en": "You brought the chariot of the teachings of the Śākya Lion",
      "en-trans": "jangchok gangri trengwé korwé jong"
    },
    {
      "bo": "ཤཱཀྱ་སེངྒེའི་བསྟན་པའི་ཤིང་རྟ་འདྲེན།    །",
      "en": "To this northern land encircled by a chain of snowy peaks,",
      "en-trans": "shakya sengé tenpé shingta dren"
    },
    {
      "bo": "སྡེ་སྣོད་གསུམ་ལ་ཅི་དགར་ལོངས་སྤྱོད་པའི།    །",
      "en": "So that we may readily avail ourselves of the Three Piṭakas—",
      "en-trans": "denö sum la chi gar longchö pé"
    },
    {
      "bo": "བཀའ་དྲིན་མཉམ་མེད་རྗེ་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Lord of unparalleled kindness, to you I pray.",
      "en-trans": "kadrin nyammé jé la solwa deb"
    },
    {
      "bo": "རྒྱལ་བས་ལུང་གིས་བསྟན་པའི་མཁན་པོ་ནི།    །",
      "en": "To the abbot prophesied by the victorious buddha,",
      "en-trans": "gyalwé lung gi tenpé khenpo ni"
    },
    {
      "bo": "བྷོ་དྷི་སཏྭ་ཤཱནྟ་རཀྵི་ཏ།    །",
      "en": "Bodhisattva Śāntarakṣita,",
      "en-trans": "bhodhi sato shanta rakshi ta"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་དངོས་སྟོན་པའི་རྒྱལ་ཚབ་ཆེར།    །",
      "en": "Omniscient in actuality, great regent of the Teacher,",
      "en-trans": "tamché khyen ngö tönpé gyaltsab cher"
    },
    {
      "bo": "དད་མོས་རྩེ་གཅིག་གུས་པས་གསོལ་བ་འདེབས།    །",
      "en": "With single-pointed faith and devotion, I pray.",
      "en-trans": "dé mö tsechik güpé solwa deb"
    },
    {
      "bo": "ཁ་ཙམ་མ་ཡིན་སྙིང་ནས་གསོལ་འདེབས་ན།    །",
      "en": "As I pray to you—not with empty mouthing but from the depths of my heart,",
      "en-trans": "kha tsam mayin nying né soldeb na"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཕྱོགས་བཅུར་འཕེལ་བ་དང་།    །",
      "en": "Grant your blessings so that the precious teachings spread in all directions,",
      "en-trans": "tenpa rinchen chok chur pelwa dang"
    },
    {
      "bo": "ཚུལ་ལྡན་འདུས་པ་རྒྱ་མཚོས་ཡོངས་གང་ཞིང་།    །",
      "en": "Everywhere is flooded with ocean-like communities of the ethical,",
      "en-trans": "tsulden düpa gyatsö yong gang zhing"
    },
    {
      "bo": "སྒོ་གསུམ་རྣམ་པར་དག་པར་བྱིན་གྱིས་རློབས།།    །།",
      "en": "And my three doors of body, speech and mind are made utterly pure.",
      "en-trans": "go sum nampar dakpar jingyi lob"
    }
  ]
}