{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/chokgyur-lingpa-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གཏེར་ཆེན་མཆོག་གྱུར་བདེ་ཆེན་གླིང་པའི་གསོལ་འདེབས།",
    "en": "Prayer to Chokgyur Dechen Lingpa1"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་བཛྲ་སཏྭཱ་ཡ།",
      "en": "Namo guru vajrasatvāya!"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་བཞིའི་རྣམ་འདྲེན་སྲས་བཅས་ཀྱི། །",
      "en": "Embodiment of the enlightened body, speech, mind, qualities and activity",
      "en-trans": "chok chu dü zhi namdren sé ché kyi"
    },
    {
      "bo": "སྐུ་གསུང་ཐུགས་ཡོན་ཕྲིན་ལས་ངོ་བོ་ཉིད། །",
      "en": "Of all the guides and their heirs throughout the ten directions and four times,",
      "en-trans": "ku sung tuk yön trinlé ngowo nyi"
    },
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་གཏེར་ཆེན་རྡོ་རྗེ་འཆང་། །",
      "en": "Great treasure-revealing Vajradhara, who personifies all sources of refuge,",
      "en-trans": "kyabné kündü terchen dorjé chang"
    },
    {
      "bo": "སྙིང་ནས་འབོད་དོ་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས། །",
      "en": "I call to you from the depths of my heart: look with your wisdom vision!",
      "en-trans": "nying né bö do yeshe chen gyi zik"
    },
    {
      "bo": "མི་ཕྱེད་གུས་པས་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི། །",
      "en": "With unwavering devotion, I pay homage to and take refuge in you.",
      "en-trans": "miché güpé chaktsal kyab su chi"
    },
    {
      "bo": "ལུས་དང་ལོངས་སྤྱོད་དགེ་ཚོགས་ལྟོས་མེད་འབུལ། །",
      "en": "Withholding nothing, I offer body, possessions and accumulated virtue.",
      "en-trans": "lü dang longchö gé tsok tömé bul"
    },
    {
      "bo": "སྡོམ་དང་དམ་ཚིག་ཉམས་པ་མཐོལ་བཤགས་ན། །",
      "en": "As I confess my impairments of vows and samaya commitments,",
      "en-trans": "dom dang damtsik nyampa tol shak na"
    },
    {
      "bo": "སྒྲིབ་མེད་ཚངས་པ་མཆོག་གི་དངོས་གྲུབ་སྩོལ། །",
      "en": "Please grant the supreme attainment of unobscured purity!",
      "en-trans": "dribmé tsangpa chok gi ngödrub tsol"
    },
    {
      "bo": "བདག་ཅག་བརྒྱུད་འཛིན་སློབ་མར་བཅས་རྣམས་ཀུན། །",
      "en": "All of us, your students and upholders of your lineage,",
      "en-trans": "dakchak gyü dzin lobmar ché nam kün"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ལས་སྐྱབས་གཞན་མ་མཆིས་པས། །",
      "en": "Have no other refuge but you, O protector,",
      "en-trans": "gönpo khyö lé kyab zhen machipé"
    },
    {
      "bo": "སྙིང་དབུས་མི་ཤིགས་ཐིག་ལེར་རྟག་བཞུགས་ནས། །",
      "en": "So remain forever in the indestructible sphere in the centre of our hearts,",
      "en-trans": "nying ü mishik tikler tak zhuk né"
    },
    {
      "bo": "ཐུགས་ཡིད་གཅིག་ཏུ་འདྲེས་པའི་བྱིན་ཆེན་ཕོབ། །",
      "en": "And confer the great blessing of the merger of our minds and your wisdom.",
      "en-trans": "tuk yi chik tu drepé jin chen pob"
    },
    {
      "bo": "གནས་སྐབས་དམ་ཆོས་སྒྲུབ་པའི་འགལ་རྐྱེན་ཞི། །",
      "en": "In the short term, with all hindrances to the practice of Dharma pacified,",
      "en-trans": "nekab damchö drubpé galkyen zhi"
    },
    {
      "bo": "མཐུན་རྐྱེན་མ་ལུས་ཕུན་སུམ་ཚོགས་པ་དང་། །",
      "en": "And all favourable circumstances present in abundance,",
      "en-trans": "tünkyen malü pünsum tsokpa dang"
    },
    {
      "bo": "རྣམ་པར་དཀར་བའི་ལེགས་བྱས་ཇི་སྙེད་ཀྱིས། །",
      "en": "May all our positive wholesome acts, however many there may be,",
      "en-trans": "nampar karwé lek jé jinyé kyi"
    },
    {
      "bo": "མགོན་ཁྱོད་ཐུགས་དགོངས་ཡོངས་སུ་རྫོགས་པར་ཤོག །",
      "en": "Contribute to the complete fulfilment of your enlightened aspirations, O protector!",
      "en-trans": "gön khyö tukgong yongsu dzokpar shok"
    },
    {
      "bo": "མཐར་ཐུག་པདྨས་ཁེབས་པའི་ཞིང་ཁམས་སུ། །",
      "en": "Ultimately, bless us, so that in the pure realm Lotus-Covered,",
      "en-trans": "tartuk pemé khebpé zhingkham su"
    },
    {
      "bo": "བྱང་སེམས་ཁྱུ་མཆོག་པདྨའི་མྱུ་གུ་དང་། །",
      "en": "Where you are the bodhisattva Padme Nyugu ('Budding Lotus'),",
      "en-trans": "changsem khyuchok pemé nyugu dang"
    },
    {
      "bo": "སྟོན་འཁོར་དགོངས་པ་དབྱེར་མེད་གཅིག་གྱུར་ཏེ། །",
      "en": "We all—teacher and retinue—become united in realization",
      "en-trans": "tönkhor gongpa yermé chik gyur té"
    },
    {
      "bo": "མཁའ་མཉམ་འགྲོ་ཀུན་འདྲེན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And act as guides for all beings, as infinite as space in number.",
      "en-trans": "khanyam dro kün drenpar jingyi lob"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་དངོས་བླ་མས་རྗེས་སུ་བཟུང་། །",
      "en": "May we be cared for by the gurus, who are all victorious ones in person,",
      "en-trans": "gyalwa kün ngö lamé jesu zung"
    },
    {
      "bo": "རྒྱལ་བའི་སྲས་པོ་ཞབས་པད་བསྐལ་བརྒྱར་བརྟན། །",
      "en": "May the lotus feet of the victorious ones’ heirs remain secure for a hundred aeons,",
      "en-trans": "gyalwé sepo zhabpé kal gyar ten"
    },
    {
      "bo": "རྒྱལ་ཁམས་དྲི་མེད་བཤད་སྒྲུབ་ཕྲིན་ལས་རྒྱས། །",
      "en": "May the immaculate activity of teaching and practice spread everywhere, far and wide,",
      "en-trans": "gyalkham drimé shedrub trinlé gyé"
    },
    {
      "bo": "རྒྱལ་ཁམས་ཀུན་ཏུ་བཀྲ་ཤིས་བདེ་ལེགས་ཤོག །",
      "en": "And may auspiciousness, well-being and positivity flourish throughout the land!",
      "en-trans": "gyalkham küntu tashi delek shok"
    }
  ]
}