{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/tsewang-drakpa/devotional-song",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མོས་གུས་གླུ་དབྱངས།",
    "en": "A Devotional Song1"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།  སྙིང་དབུས་དད་པའི་ཆུ་སྐྱེས་འདབས་བརྒྱད་རུ་བཞད་པའི། །",
      "en": "Emaho! Upon the scintillating pistils of an eight-petaled lotus",
      "en-trans": "emaho, nying ü depé chukyé dab gyé ru zhepé"
    },
    {
      "bo": "གེ་སར་རྣམ་པར་བཀྲ་བ་འོད་ལྔ་ཡི་ཀློང་དུ། །",
      "en": "In full bloom at the center of my faithful heart,",
      "en-trans": "gesar nampar trawa ö nga yi long du"
    },
    {
      "bo": "བཀའ་དྲིན་གསུམ་ལྡན་གཏེར་ཆེན་བླ་མ་དེ་བཞུགས་ཡོད། །",
      "en": "You sit, Great Tertön, guru of threefold kindness, in a sphere of five-colored light.",
      "en-trans": "kadrin sumden terchen lama dé zhuk yö"
    },
    {
      "bo": "མོས་གུས་གདུང་བ་དྲག་པོའི་གསོལ་བ་རང་འདེབས་སོ། །",
      "en": "I pray to you with fervent, piercing devotion!",
      "en-trans": "mögü dungwa drakpö solwa rang deb so"
    },
    {
      "bo": "རྨད་བྱུང་མཁྱེན་བརྩེའི་དཔལ་གྱི་སྒོ་འཕར་དེ་ཕྱེད་ནས་། །",
      "en": "Throw open the glorious door of your wondrous wisdom and love,",
      "en-trans": "mejung khyentsé pal gyi gopar dé ché né"
    },
    {
      "bo": "སྒོ་གསུམ་ལྷ་སྔགས་ཆོས་སྐུར་བྱིན་གྱིས་རང་སློབས་ཤིག །",
      "en": "And bless my three doors as deity, mantra, and dharmakāya!",
      "en-trans": "go sum lha ngak chökur jin gyi rang lob shik"
    },
    {
      "bo": "ཤིན་ཏུ་ཟབ་པའི་མཐར་ཐུག་ཨོ་རྒྱན་རྗེའི་ཐུགས་བསྐྱེད། །",
      "en": "The consummate, utmost profundity of the Lord of Uḍḍiyāna’s wisdom mind",
      "en-trans": "shintu zabpé tartuk orgyen jé tukkyé"
    },
    {
      "bo": "བདུད་བཞི་ཟིལ་གནོན་གཏུམ་ཆེན་རིགས་བཞི་ཡི་ནག་ཚན། །",
      "en": "Is the four fierce Acala classes who overpower the four demons.",
      "en-trans": "dü zhi zilnön tum chen rik zhi yi nak tsen"
    },
    {
      "bo": "རྣམ་གཡེང་ལྷ་བུ་བདུད་བཅོམ་མི་གཡོ་བ་མཐིང་གའི། །",
      "en": "Blue Acala is the slayer of the demon of distraction, the son of the gods.",
      "en-trans": "namyeng lha bu dü chom miyowa ting gé"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་ལ་གོམས་པའི་རྣལ་འབྱོར་གྱི་དཔོན་སློབ། །",
      "en": "Upon us teachers and disciples, trained in the two stages of Acala,",
      "en-trans": "rim nyi lam la gompé naljor gyi pönlob"
    },
    {
      "bo": "ལམ་གྱི་དངོས་གཞི་གཏུམ་མོའི་རྣལ་འབྱོར་ལ་བརྩོན་པའི། །",
      "en": "And striving in the main practice, the yoga of fierce heat,",
      "en-trans": "lam gyi ngözhi tummö naljor la tsönpé"
    },
    {
      "bo": "བདེ་དྲོད་ཡེ་ཤེས་འཆར་བའི་དངོས་གྲུབ་ཞིག་ཞུའོ། །",
      "en": "Bestow, we pray, the siddhi that rouses the wisdom of blissful warmth!",
      "en-trans": "dé drö yeshe charwé ngödrub zhik zhu o"
    }
  ]
}