{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/prayer-for-konchok",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཀོན་མཆོག་གིས་བསྐུལ་བའི་གསོལ་འདེབས།",
    "en": "fromA Shower of Precious Blessings"
  },
  "text": [
    {
      "bo": "ཨོ་རྒྱན་པདྨའི་བཀའ་ཡི་ཕོ་ཉ་བ། །",
      "en": "Messenger of the word of the Lotus of Uḍḍiyāna,",
      "en-trans": "orgyen pemé ka yi ponyawa"
    },
    {
      "bo": "མཆོག་གྱུར་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པའི་དཔལ། །",
      "en": "Glorious supreme being (Chokgyur) who spontaneously fulfills the two goals,",
      "en-trans": "chokgyur dön nyi lhün gyi drubpé pal"
    },
    {
      "bo": "བདེ་ཆེན་འགྱུར་བ་མེད་པའི་དགོངས་པ་ཅན། །",
      "en": "With your realization of unchanging great bliss (Dechen),",
      "en-trans": "dechen gyurwa mepé gongpachen"
    },
    {
      "bo": "ཐར་པ་ཆེན་པོའི་གླིང་དུ་འགྲོ་ཀུན་འདྲེན། །",
      "en": "You lead all beings to the island (Lingpa) of great liberation.",
      "en-trans": "tarpa chenpö ling du dro kün dren"
    },
    {
      "bo": "དཀོན་མཆོག་བསྟན་འཛིན་དར་ཞིང་རྒྱས་པའི་སྡེ། །",
      "en": "You spread and expand the doctrine of the Three Jewels (Könchok Tenzin Dargyé).",
      "en-trans": "könchok tendzin dar zhing gyepé dé"
    },
    {
      "bo": "རིག་འཛིན་རཏྣའི་མཚན་དེར་གསོལ་བ་འདེབས། །",
      "en": "To you, the Jewel Vidyādhara (Rikdzin Ratna), I pray!",
      "en-trans": "rigdzin ratné tsen der solwa deb"
    },
    {
      "bo": "གསུང་རབ་ཐམས་ཅད་ངེས་དོན་ཉིད་དུ་ཐོབ། །",
      "en": "May I receive all the victor’s supreme teachings as the definitive meaning!",
      "en-trans": "sung rab tamché ngedön nyi du tob"
    },
    {
      "bo": "དཀར་ནག་ཟང་ཐལ་རྒྱུ་འབྲས་བླང་དོར་བསམ། །",
      "en": "May I reflect unhindered on the full range of karma, both virtuous and non-virtuous, on what to accept and reject.",
      "en-trans": "karnak zangtal gyundré langdor sam"
    },
    {
      "bo": "འཁོར་ལོ་གསུམ་གྱི་ཐ་མའི་དགོངས་དོན་བསྒོམ། །",
      "en": "May I train in the intent of the third and final turning of the wheel,",
      "en-trans": "khorlo sum gyi tamé gongdön gom"
    },
    {
      "bo": "ཀུན་གཞི་བདེ་གཤེགས་སྙིང་པོའི་རྒྱལ་ས་ཟིན། །",
      "en": "And may I capture the kingdom of the all-ground, the bliss-gone essence.",
      "en-trans": "künzhi deshek nyingpö gyalsa zin"
    },
    {
      "bo": "མདོར་ན་མགོན་པོ་འབྲི་གུང་པ་ཆེན་པོའི། །",
      "en": "In short, grant your blessings that I may realize correctly",
      "en-trans": "dorna gönpo drigung pa chenpö"
    },
    {
      "bo": "གྲུབ་མཐའ་ཚུལ་བཞིན་རྟོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "The practice tradition of the great Drikung Protector!",
      "en-trans": "drubta tsulzhin tokpar jingyi lob"
    }
  ]
}