{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/three-name-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཆོག་གླིང་མཚན་གསུམ་ལྡན་གྱི་གསོལ་འདེབས།",
    "en": "Three-Name Prayer to Chokgyur Lingpa1"
  },
  "text": [
    {
      "bo": "པདྨའི་རྒྱལ་ཚབ་ཨོ་རྒྱན་མཆོག་གྱུར་གླིང་། །",
      "en": "Regent of the Lotus Born, Orgyen Chokgyur Lingpa,",
      "en-trans": "pemé gyaltsab orgyen chokgyur ling"
    },
    {
      "bo": "བཀའ་གཏེར་བསྟན་པའི་མངའ་བདག་བདེ་ཆེན་གླིང་། །",
      "en": "Sovereign of the teachings ofkamaandterma, Dechen Lingpa,",
      "en-trans": "kater tenpé ngadak dechen ling"
    },
    {
      "bo": "རྫོགས་ཆེན་རང་སྣང་རིས་མེད་ཞིག་པོ་གླིང་། །",
      "en": "Master of unbiased, natural great perfection, Zhikpo Lingpa—",
      "en-trans": "dzogchen rangnang rimé zhikpo ling"
    },
    {
      "bo": "གཏེར་སྟོན་གཅིག་ལ་གླིང་པ་གསུམ་དུ་གྲགས། །",
      "en": "One treasure-revealer known by three names of Lingpa!",
      "en-trans": "tertön chik la lingpa sum du drak"
    },
    {
      "bo": "བཀའ་དྲིན་སུམ་ལྡན་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "I pray to you, the one whose kindness is threefold:",
      "en-trans": "kadrin sumden zhab la solwa deb"
    },
    {
      "bo": "ངེས་འབྱུང་རྣལ་མར་རྒྱུད་ལ་སྐྱེ་བ་དང་། །",
      "en": "May true renunciation awaken naturally in my mind;",
      "en-trans": "ngejung nalmar gyü la kyewa dang"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་དམ་ཚིག་ལ་གནས་ཤོག །",
      "en": "May I keep the samaya commitments to the glorious guru;",
      "en-trans": "palden lamé damtsik la né shok"
    },
    {
      "bo": "བསྐྱེད་དང་རྫོགས་པའི་དྲོད་རྟགས་མྱུར་དུ་སྟོན། །",
      "en": "May I quickly show signs of success in generation and perfection;",
      "en-trans": "kyé dang dzokpé drötak nyurdu tön"
    },
    {
      "bo": "རང་རིག་རྫོགས་པ་ཆེན་པོ་མངོན་གྱུར་ནས། །",
      "en": "May I actualize the great perfection of my own awareness,",
      "en-trans": "rangrig dzogpachenpo ngöngyur né"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And in a single lifetime attain the state of Buddhahood!",
      "en-trans": "tsé chik sangye drubpar jingyi lob"
    }
  ]
}