{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-marpa-lotsawa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་མར་པ་ལོ་ཙཱ་ལ་གསོལ་བ་འདེབས་པ་མོས་གུས་ཀྱི་རྒྱང་གླུ་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "en": "A Prayer to Lord Marpa Lotsāwa"
  },
  "text": [
    {
      "bo": "རྗེ་དུས་གསུམ་སངས་རྒྱས་འདུས་པའི་དངོས། །",
      "en": "Precious lord, true embodiment of the buddhas of the three times,",
      "en-trans": "jé dü sum sangye düpé ngö"
    },
    {
      "bo": "དཔལ་དགྱེས་མཛད་རྡོ་རྗེའི་སྤྲུལ་པའི་སྐུ། །",
      "en": "Glorious Hevajra in a body of manifestation—",
      "en-trans": "pal gyé dzé dorjé trulpé ku"
    },
    {
      "bo": "རྗེ་མར་པ་ལོ་ཙཱར་གསོལ་བ་འདེབས། །",
      "en": "Precious lord Marpa Lotsāwa, to you I pray:",
      "en-trans": "jé marpa lo tsar solwa deb"
    },
    {
      "bo": "བུ་ང་ལ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །",
      "en": "Inspire me, a devoted child, with your blessings.",
      "en-trans": "bu nga la jingyi lab tu sol"
    },
    {
      "bo": "མགོན་བཀའ་བཞི་བརྒྱུད་པའི་སྤྱི་མེས་ཆེ། །",
      "en": "Great forefather of the lineage of the four transmissions,1",
      "en-trans": "gön ka zhi gyüpé chimé ché"
    },
    {
      "bo": "ཆོས་སྣང་སེམས་ཀུན་ལ་རང་དབང་བསྒྱུར། །",
      "en": "With mastery over all aspects of mind and phenomena,",
      "en-trans": "chö nang sem kün la rangwang gyur"
    },
    {
      "bo": "དཔལ་གྲུབ་རིགས་རྒྱ་མཚོའི་དེད་དཔོན་ཆེ། །",
      "en": "Great leader guiding an ocean of glorious adepts,",
      "en-trans": "pal drub rik gyatsö depön ché"
    },
    {
      "bo": "མགོན་ལྷོ་བྲག་པ་དེ་སྙིང་དབུས་དྲན། །",
      "en": "Lord of Lhodrak, I recall you in the depths of my heart.",
      "en-trans": "gön lhodrakpa dé nying ü dren"
    },
    {
      "bo": "རྗེ་འཕགས་པའི་ཡུལ་དུ་ལན་བདུན་བྱོན། །",
      "en": "Precious lord, seven times you travelled to the noble land of India,",
      "en-trans": "jé pakpé yul du len dün jön"
    },
    {
      "bo": "དཔལ་ནཱ་རོ་མི་ཏྲིའི་གདམས་མཛོད་ཀྱིས། །",
      "en": "And with a treasury of instructions from glorious Nāro and Maitrī,",
      "en-trans": "pal naro mitri dam dzö kyi"
    },
    {
      "bo": "ཕ་འགྲོ་བའི་བླ་མའི་ཐུགས་རྒྱུད་ཚིམ། །",
      "en": "You, father and guru to all beings, satisfied your wisdom mind.",
      "en-trans": "pa drowé lamé tukgyü tsim"
    },
    {
      "bo": "ཆོས་ཟབ་མོ་གསང་སྔགས་ཐེག་པ་ཡི། །",
      "en": "You distributed this treasure trove of precious jewels,",
      "en-trans": "chö zabmo sang ngak tekpa yi"
    },
    {
      "bo": "ནོར་རཏྣའི་གཏེར་ཁ་གྲམ་བུར་བརྡལ། །",
      "en": "Profound Dharma from the secret mantra vehicle,",
      "en-trans": "nor ratné terkha dram bur dal"
    },
    {
      "bo": "ཕ་ཁྱེད་ལས་འཁྲུངས་པའི་ཐུགས་ཀྱི་སྲས། །",
      "en": "And became a father to your heart-born son—",
      "en-trans": "pa khyé lé trungpé tuk kyi sé"
    },
    {
      "bo": "རྗེ་མི་ལ་ཞེས་པ་མཚན་ཙམ་གྱིས། །",
      "en": "Jé Mila, whose name alone serves",
      "en-trans": "jé mila zhepa tsen tsam gyi"
    },
    {
      "bo": "ངན་སོང་གི་སྡུག་བསྔལ་ཞི་མཛད་ཅིང་། །",
      "en": "To assuage the sufferings of the lower realms,",
      "en-trans": "ngensong gi dukngal zhidzé ching"
    },
    {
      "bo": "བྷོ་ཏྲ་ཡི་གྲུབ་པ་ཀུན་གྱི་རྒྱན། །",
      "en": "The crowning ornament of all the adepts of Bhoṭa.2",
      "en-trans": "bhotra yi drubpa kün gyi gyen"
    },
    {
      "bo": "སྐྱབས་མཐར་ཐུག་ཡིད་བཞིན་ནོར་འདྲའི་སྐུ། །",
      "en": "Ultimate refuge, whose form is like a wish-granting gem,",
      "en-trans": "kyab tartuk yizhin nor dré ku"
    },
    {
      "bo": "གནས་གྲོ་བོ་ལུང་གི་དགོན་པ་དང་། །",
      "en": "In places such as the hermitage of Trowo valley",
      "en-trans": "né drowo lung gi gönpa dang"
    },
    {
      "bo": "དཔལ་སྲས་མཁར་སྤྲུལ་པའི་ལྷ་ཁང་ན། །",
      "en": "And the manifest temple at glorious Sekhar,",
      "en-trans": "pal sékhar trulpé lhakhang na"
    },
    {
      "bo": "རྗེ་ཆོས་ཀྱི་དབང་ཕྱུག་ཧེ་རུ་ཀ །",
      "en": "You are the precious lord of Dharma, the heruka,",
      "en-trans": "jé chö kyi wangchuk heruka"
    },
    {
      "bo": "དཔལ་བདག་མེད་མ་དང་དགྱེས་རོལ་བཞུགས། །",
      "en": "Who dwells in delight with Nairātmyā.3",
      "en-trans": "pal dakmema dang gyé rol zhuk"
    },
    {
      "bo": "ཆོས་ངེས་གསང་གི་རྒྱུད་སྡེ་རྒྱ་མཚོ་ཡིས། །",
      "en": "And who, with oceanic tantras of definitive secret Dharma,",
      "en-trans": "chö ngé sang gi gyüdé gyatso yi"
    },
    {
      "bo": "བུ་སྐལ་བཟང་སློབ་ཚོགས་སྨིན་གྲོལ་མཛད། །",
      "en": "Matured and liberated hosts of fortunate disciple-children.",
      "en-trans": "bu kalzang lob tsok mindrol dzé"
    },
    {
      "bo": "རྗེ་མི་ཡི་ལུས་ལ་སངས་རྒྱས་ཐུགས། །",
      "en": "Precious lord who has a buddha’s mind in a human body,",
      "en-trans": "jé mi yi lü la sangye tuk"
    },
    {
      "bo": "མགོན་སྲས་བཅས་རྒྱལ་བའི་ཕྲིན་ལས་མཛད། །",
      "en": "With your heirs, you carried out the victorious ones’ activity.",
      "en-trans": "gön sé ché gyalwé trinlé dzé"
    },
    {
      "bo": "དུས་ད་ལྟ་བཞུགས་ན་དགའ་བ་ལ། །",
      "en": "If only you were here right now, how happy I would be!",
      "en-trans": "dü danta zhuk na gawa la"
    },
    {
      "bo": "མགོན་ཁྱོད་ཞལ་མཇལ་བའི་སྐལ་བས་དབེན། །",
      "en": "But I am bereft, O protector, with no chance to see your face—",
      "en-trans": "gön khyö zhal jalwé kalwé wen"
    },
    {
      "bo": "བུ་ལས་ངན་སྒྲིབ་པའི་ཉེས་པར་ཟད། །",
      "en": "A child of evil karma mired in the fault of obscurations.",
      "en-trans": "bu lé ngen dribpé nyepar zé"
    },
    {
      "bo": "ཕ་ཆོས་ཀྱི་དབྱིངས་ན་བཞུགས་བཞིན་དུ། །",
      "en": "O Father, as you dwell in the dharmadhātu,",
      "en-trans": "pa chö kyi ying na zhuk zhindu"
    },
    {
      "bo": "གཟུགས་ལོངས་སྤྲུལ་གྱི་རོལ་པ་རྒྱུན་མི་ཆད། །",
      "en": "The play of nirmāṇakāya and sambhogakāya forms continues,",
      "en-trans": "zuk long trul gyi rolpa gyün mi ché"
    },
    {
      "bo": "འཁོར་དག་དང་མ་དག་མཐའ་ཀླས་རྣམས། །",
      "en": "Leading infinite assemblies, pure and impure,",
      "en-trans": "khor dak dang ma dak talé nam"
    },
    {
      "bo": "འབྲས་བྱང་ཆུབ་ཆེན་པོའི་ས་ལ་འགོད། །",
      "en": "To the fruitional state of great awakening.",
      "en-trans": "dré changchub chenpö sa la gö"
    },
    {
      "bo": "རྗེ་ཁྱོད་ཀྱི་ཕྲིན་ལས་མཁའ་ལྟར་ཁྱབ། །",
      "en": "Precious lord, your activity is as pervasive as space itself.",
      "en-trans": "jé khyö kyi trinlé kha tar khyab"
    },
    {
      "bo": "བོད་མུན་པའི་རྒྱལ་ཁམས་དཀར་པོར་གཏོང་། །",
      "en": "You brought the light of purity to the benighted land of Tibet.",
      "en-trans": "bö münpé gyalkham karpor tong"
    },
    {
      "bo": "སྔགས་རིག་འཛིན་གྲུབ་པ་བསམ་ལས་འདས། །",
      "en": "And with innumerable mantra adepts and vidyādharas",
      "en-trans": "ngak rigdzin drubpa sam lé dé"
    },
    {
      "bo": "དཔལ་སྒྲུབ་བརྒྱུད་བསྟན་པས་འཛམ་གླིང་ཁྱབ། །",
      "en": "Spread the teachings of the glorious practice lineage throughout the world.",
      "en-trans": "pal drubgyü tenpé dzamling khyab"
    },
    {
      "bo": "མགོན་ཁྱོད་འདྲའི་རྣམ་ཐར་གཞན་ལ་མེད། །",
      "en": "O protector, no other life of liberation can compare to yours.",
      "en-trans": "gön khyö dré namtar zhen lamé"
    },
    {
      "bo": "དཔལ་ས་ར་ཧ་དང་དབྱེར་མེད་པའི། །",
      "en": "You who are inseparable from glorious Saraha,",
      "en-trans": "pal sara ha dang yermé pé"
    },
    {
      "bo": "ཕ་ལོ་ཙཱ་ཆེན་པོའི་བཀའ་དྲིན་དྲན། །",
      "en": "Great father translator, I recall your kindness.",
      "en-trans": "pa lo tsa chenpö kadrin dren"
    },
    {
      "bo": "ས་བཅུ་གསུམ་རྩེ་མོར་རབ་ཕྱིན་པའི། །",
      "en": "You who reached the peak of the thirteen stages,",
      "en-trans": "sa chusum tsemor rab chinpé"
    },
    {
      "bo": "དཔལ་ཡན་ལག་བདུན་ལྡན་རྡོ་རྗེ་འཆང་། །",
      "en": "Glorious Vajradhara with the seven aspects of union,",
      "en-trans": "pal yenlak dünden dorjé chang"
    },
    {
      "bo": "སྐུ་ཐ་མལ་གྱི་རྣམ་པར་རབ་བསྟན་པ། །",
      "en": "Who manifested perfectly in an ordinary form,",
      "en-trans": "ku tamal gyi nampar rab tenpa"
    },
    {
      "bo": "རྗེ་ལྷོ་བྲག་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Great lord of Lhodrak, to you I pray.",
      "en-trans": "jé lho drak chenpor solwa deb"
    },
    {
      "bo": "སྐུ་ཉི་མ་བརྒྱ་པའི་གཟི་བརྗིད་དང་། །",
      "en": "Your body has the majestic splendour of a hundred suns,",
      "en-trans": "ku nyima gyapé ziji dang"
    },
    {
      "bo": "གསུང་ཆོས་ཀྱི་སྒྲ་དབྱངས་འུ་རུ་རུ། །",
      "en": "Your speech resounds with the melodious tones of Dharma,",
      "en-trans": "sung chö kyi drayang u ru ru"
    },
    {
      "bo": "ཐུགས་ཟབ་ཞི་བདེ་སྟོང་འོད་གསལ་ཆེ། །",
      "en": "And your mind is profound peace, bliss-emptiness, great luminosity—",
      "en-trans": "tuk zab zhi dé tong ösal ché"
    },
    {
      "bo": "ཕ་གསང་གསུམ་གྱི་བྱིན་རླབས་མཚུངས་ཟླ་བྲལ། །",
      "en": "O Father, the blessings of your three secrets are beyond compare.",
      "en-trans": "pa sang sum gyi jinlab tsungda dral"
    },
    {
      "bo": "བདག་མོས་གུས་ཀྱི་གསོལ་བ་འདེབས་ནུས་ན། །",
      "en": "If I can supplicate you with devotion,",
      "en-trans": "dak mögü kyi solwa deb nü na"
    },
    {
      "bo": "རྗེས་ཐུགས་ཀྱི་ངེས་པར་མི་གཏོང་སྙམ། །",
      "en": "I trust that you, precious lord, will not fail me.",
      "en-trans": "jé tuk kyi ngepar mi tong nyam"
    },
    {
      "bo": "བུ་བདག་ལ་བྱིན་རླབས་ཀྱི་ཕ་ཕོག་དེ། །",
      "en": "Now is the time for patrimonial blessings",
      "en-trans": "bu dak la jinlab kyi pa pok dé"
    },
    {
      "bo": "དུས་ད་ལྟ་ཉིད་དུ་སྩོལ་རེ་རན། །",
      "en": "To be imparted to me, child that I am.",
      "en-trans": "dü danta nyi du tsol ré ren"
    },
    {
      "bo": "བློ་དྲེད་པོ་ཐར་པའི་ལམ་ལ་བསྒྱུར། །",
      "en": "Turn this stubborn mind of mine toward the path of liberation;",
      "en-trans": "lo drepo tarpé lam la gyur"
    },
    {
      "bo": "སྣང་བདེན་འཛིན་དྲྭ་བ་ཧྲུལ་པོ་བཤིག །",
      "en": "Tear apart the web of clinging to appearances as real;",
      "en-trans": "nang dendzin drawa hrulpo shik"
    },
    {
      "bo": "ཆོས་གཟུང་འཛིན་གྱི་སྤྲོས་པ་དབྱིངས་སུ་ཞི། །",
      "en": "Let the constructs of dualistic perception cease within basic space;",
      "en-trans": "chö zungdzin gyi tröpa ying su zhi"
    },
    {
      "bo": "སེམས་རིག་པ་སྐྱེ་མེད་འོད་གསལ་དེ། །",
      "en": "Allow me to sustain, at all times without interruption",
      "en-trans": "sem rigpa kyemé ösal dé"
    },
    {
      "bo": "དུས་རྒྱུན་ཆད་མེད་པར་རྟག་ཏུ་བསྐྱངས། །",
      "en": "The clear light of mind’s own unborn awareness;",
      "en-trans": "dü gyünché mepar taktu kyang"
    },
    {
      "bo": "ང་ཚོགས་དྲུག་གི་སྣང་བ་རང་སར་གྲོལ། །",
      "en": "Cause all sensory perceptions to be freed, just as they are;",
      "en-trans": "nga tsok druk gi nangwa rang sar drol"
    },
    {
      "bo": "རྗེ་ཁྱོད་དང་དགོངས་པ་མཉམ་པར་ཤོག །",
      "en": "And make me your equal, O precious lord, in wisdom intent.",
      "en-trans": "jé khyö dang gongpa nyampar shok"
    }
  ]
}