{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-marpa-consort-heirs",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་མར་པ་ཡབ་ཡུམ་སྲས་བཅས་ཀྱི་གསོལ་འདེབས།",
    "en": "Prayer to Lord Marpa, Consort and Heirs1"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ངོ་མཚར་གྲུབ་པ་ཆེན་པོའི་སྐུ་བརྙེས་པ།    །",
      "en": "You who assumed the form of a wondrous mahāsiddha,",
      "en-trans": "ngotsar drubpa chenpö ku nyepa"
    },
    {
      "bo": "སྣང་སེམས་དབང་བསྒྱུར་ཆོས་ཀྱི་རྒྱལ་པོ་མཆོག  །",
      "en": "Sublimedharma-king, master of mind and perception,",
      "en-trans": "nang sem wanggyur chökyi gyalpo chok"
    },
    {
      "bo": "སྒྲ་བསྒྱུར་ལོ་ཙཱ་ཆེན་པོ་མར་པ་རྗེ།    །",
      "en": "Magnificent translator, Lord Marpa Lotsāwa,",
      "en-trans": "dra gyur lotsa chenpo marpa jé"
    },
    {
      "bo": "བློ་གྲོས་ཆེན་པོ་བློ་མཆོག་མངའ་བའི་བདག  །",
      "en": "Sovereign of vastintelligenceand supreme mind,2",
      "en-trans": "lodrö chenpo lo chok ngawé dak"
    },
    {
      "bo": "རྒྱུད་སྡེ་རྒྱ་མཚོའི་གསང་བའི་མཛོད་འཛིན་པ།    །",
      "en": "Keeper of the secret treasury of oceanic tantras,",
      "en-trans": "gyüdé gyatsö sangwé dzö dzinpa"
    },
    {
      "bo": "ཟུང་འཇུག་གྲུབ་པའི་འཁོར་ལོས་སྒྱུར་བ་ཆེ།    །",
      "en": "Great universal ruler, who attained the state of union.",
      "en-trans": "zungjuk drubpé khorlö gyurwa ché"
    },
    {
      "bo": "གང་གི་གསང་བ་གསུམ་གྱིས་བྱིན་བརླབས་སྲས།    །",
      "en": "Your son, whom you blessed with your three secrets,",
      "en-trans": "gang gi sangwa sum gyi jinlab sé"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་དཔའ་ཆེན་འགྲོ་བ་འདུལ།    །",
      "en": "Was the bodhisattva and magnificent tamer of beings",
      "en-trans": "changchub sempa pachen drowa dul"
    },
    {
      "bo": "དར་མ་མདོ་སྡེ་ཚོགས་གཉིས་རྨད་བྱུང་སྐུ།    །",
      "en": "Darma Dodé, whose wondrous form arose from twofold accumulation.",
      "en-trans": "darma dodé tsok nyi mejung ku"
    },
    {
      "bo": "ཡེ་ཤེས་རྒྱ་མཚོའི་རང་གཟུགས་སྤྱན་རས་གཟིགས།    །",
      "en": "A manifestation of Avalokiteśvara, embodiment of oceanic wisdom,",
      "en-trans": "yeshe gyatsö rang zuk chenrezik"
    },
    {
      "bo": "གཞོན་ནུའི་སྐུར་སྟོན་སྨོན་ལམ་མཐའ་ཡས་བདག  །",
      "en": "Appearing in youthful form as a master of infinite aspiration.",
      "en-trans": "zhönnü kur tön mönlam tayé dak"
    },
    {
      "bo": "རྡོ་རྗེ་བདག་མེད་མི་མོའི་གཟུགས་བསྒྱུར་བ།    །",
      "en": "Vajra Nairātmyā appearing in human female guise,",
      "en-trans": "dorjé dakmé mimö zuk gyurwa"
    },
    {
      "bo": "ཤེས་རབ་ལྷ་མོ་བདེ་བའི་བདག་ཉིད་སྐུ།    །",
      "en": "Was the wisdom goddess and embodiment of bliss,",
      "en-trans": "sherab lhamo dewé daknyi ku"
    },
    {
      "bo": "འཁོར་འདས་ཆོས་ཀུན་དབྱིངས་ཀྱི་བྷ་གར་སྡུད།    །",
      "en": "In whosebhagaof absolute space all the phenomena of saṃsāra and nirvāṇa are contained—",
      "en-trans": "khordé chö kün ying kyi bhagar dü"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་སྤྲོ་དང་སྡུད་མཛད་མ།    །",
      "en": "She who emanates and attracts all the victorious ones of the three times.",
      "en-trans": "dü sum gyalwa tro dang dü dzé ma"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པའི་གྲུབ་རིག་ཡོངས་ཀྱི་གཙོ།    །",
      "en": "Foremost among all the adepts of Cakrasaṃvara,",
      "en-trans": "khorlo dompé drub rik yong kyi tso"
    },
    {
      "bo": "ལ་ལ་ནཱ་དང་རཱ་སའི་རྒྱུ་བ་ཀུན།    །",
      "en": "Was the master for whom all movement within thelalanāandrasanā3",
      "en-trans": "lala na dang rasé gyuwa kün"
    },
    {
      "bo": "སྒྲ་གཅན་དབྱིངས་སུ་ཟ་བར་བྱེད་པའི་བདག  །",
      "en": "Was eclipsed, consumed within the space of Rahū,",
      "en-trans": "drachen ying su zawar jepé dak"
    },
    {
      "bo": "བཅུ་དྲུག་རྩེར་སོན་མི་སློབ་རྒྱལ་སར་གཤེགས།    །",
      "en": "And who reached the culmination of the sixteen joys, the state of no-more-learning,",
      "en-trans": "chudruk tser sön mi lob gyalsar shek"
    },
    {
      "bo": "མཚན་ཐོས་འཁོར་བའི་འཇིགས་ལས་སྐྱོབ་མཛད་ཅིང་།    །",
      "en": "He whose name alone guards against saṃsāra’s terror,",
      "en-trans": "tsen tö khorwé jik lé kyob dzé ching"
    },
    {
      "bo": "བྱིན་རླབས་ཆེན་པོ་མངོན་སུམ་སྟེར་བའི་བདག  །",
      "en": "The master who directly confers the greatest of blessings,",
      "en-trans": "jinlab chenpo ngönsum terwé dak"
    },
    {
      "bo": "རྡོ་རྗེ་རྒྱལ་མཚན་ཐོས་པ་དགའ་ཞེས་གྲགས།    །",
      "en": "The one renowned as Dorje Gyaltsen and Töpa Ga,",
      "en-trans": "dorjé gyaltsen töpa ga zhé drak"
    },
    {
      "bo": "འཇིག་རྟེན་གསུམ་གྱི་རྒྱན་གྱུར་མི་ཡི་མཆོག  །",
      "en": "Ornament of all three worlds, supreme among human beings.",
      "en-trans": "jikten sum gyi gyen gyur mi yi chok"
    },
    {
      "bo": "དེ་ལྟར་རྗེ་བཙུན་ཡབ་ཡུམ་སྲས་རྣམས་ལ།    །",
      "en": "Through this, my devoted prayer to the reverend and noble Guru,",
      "en-trans": "detar jetsün yabyum sé nam la"
    },
    {
      "bo": "གུས་པས་གསོལ་བཏབ་བདག་ལ་བྱིན་གྱིས་རློབས།    །",
      "en": "Together with his consort and heirs, inspire me with your blessings.",
      "en-trans": "güpé soltab dak la jingyi lob"
    },
    {
      "bo": "རང་སེམས་ལྷན་སྐྱེས་ཡེ་ཤེས་ཉི་མ་ཆེས།    །",
      "en": "Let the great sun of co-emergent wisdom dawn within my mind",
      "en-trans": "rangsem lhenkyé yeshe nyima ché"
    },
    {
      "bo": "སྙིང་གི་མ་རིག་མུན་པ་ཀུན་བསལ་ཞིང་།    །",
      "en": "To banish all the darkness contained within an ignorant heart.",
      "en-trans": "nying gi marik münpa kün sal zhing"
    },
    {
      "bo": "སྲིད་གསུམ་དགྲ་སྡེའི་གྲོང་ཁྱེར་གཏན་བཅོམ་ནས།    །",
      "en": "May the city of the three worlds’ hostile forces be forever undone,",
      "en-trans": "si sum dra dé drongkhyer ten chom né"
    },
    {
      "bo": "འོག་མིན་ལྷུན་གྲུབ་གཞལ་མེད་ཉམས་དགའ་བར།    །",
      "en": "And may we savour the treasury of inexhaustible kāyas and wisdoms",
      "en-trans": "womin lhündrub zhalmé nyamgawar"
    },
    {
      "bo": "སྐུ་དང་ཡེ་ཤེས་འཛད་མེད་གཏེར་ལ་སྤྱོད།    །",
      "en": "Within the delightful, spontaneously present palace of Akaniṣṭha,",
      "en-trans": "ku dang yeshe dzemé ter la chö"
    },
    {
      "bo": "ཁམས་གསུམ་འཁོར་བ་དོང་ནས་སྤྲུགས་པར་ཤོག  །",
      "en": "And empty the three realms of saṃsāra from their very depths.",
      "en-trans": "kham sum khorwa dong né trukpar shok"
    }
  ]
}