{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/tsongkhapa/foundation-of-all-qualities",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཡོན་ཏན་གཞིར་གྱུར་མ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ཡོན་ཏན་ཀུན་གྱི་གཞིར་གྱུར་དྲིན་ཅན་རྗེ། །"
    },
    {
      "bo": "ཚུལ་བཞིན་བསྟེན་པ་ལམ་གྱི་རྩ་བ་རུ། །"
    },
    {
      "bo": "ལེགས་པར་མཐོང་ནས་འབད་པ་དུ་མ་ཡིས། །"
    },
    {
      "bo": "གུས་པ་ཆེན་པོས་བསྟེན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལན་ཅིག་རྙེད་པའི་དལ་བའི་རྟེན་བཟང་འདི། །"
    },
    {
      "bo": "ཤིན་ཏུ་རྙེད་དཀའ་དོན་ཆེ་ཤེས་གྱུར་ནས། །"
    },
    {
      "bo": "ཉིན་མཚན་ཀུན་ཏུ་སྙིང་པོ་ལེན་པའི་བློ། །"
    },
    {
      "bo": "རྒྱུན་ཆད་མེད་པར་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལུས་སྲོག་གཡོ་བ་ཆུ་ཡི་ཆུ་བུར་བཞིན། །"
    },
    {
      "bo": "མྱུར་དུ་འཇིག་པའི་འཆི་བ་དྲན་པ་དང༌། །"
    },
    {
      "bo": "ཤི་བའི་རྗེས་སུ་ལུས་དང་གྲིབ་མ་བཞིན། །"
    },
    {
      "bo": "དཀར་ནག་ལས་འབྲས་ཕྱི་བཞིན་འབྲང་བ་ལ། །"
    },
    {
      "bo": "ངེས་པ་བརྟན་པོ་རྙེད་ནས་ཉེས་པའི་ཚོགས། །"
    },
    {
      "bo": "ཕྲ་ཞིང་ཕྲ་བ་རྣམས་ཀྱང་སྤོང་བ་དང༌། །"
    },
    {
      "bo": "དགེ་ཚོགས་མཐའ་དག་སྒྲུབ་པར་བྱེད་པ་ལ། །"
    },
    {
      "bo": "རྟག་ཏུ་བག་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྤྱད་པས་མི་ངོམས་སྡུག་བསྔལ་ཀུན་གྱི་སྒོ། །"
    },
    {
      "bo": "ཡིད་བརྟན་མི་རུང་སྲིད་པའི་ཕུན་ཚོགས་ཀྱི། །"
    },
    {
      "bo": "ཉེས་དམིགས་རིག་ནས་ཐར་བའི་བདེ་བ་ལ། །"
    },
    {
      "bo": "དོན་གཉེར་ཆེན་པོ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྣམ་དག་བསམ་པ་དེ་ཡིས་དྲངས་པ་ཡི། །"
    },
    {
      "bo": "དྲན་དང་ཤེས་བཞིན་བག་ཡོད་ཆེན་པོ་ཡིས། །"
    },
    {
      "bo": "བསྟན་པའི་རྩ་བ་སོ་སོར་ཐར་བ་ལ། །"
    },
    {
      "bo": "སྒྲུབ་པ་སྙིང་པོར་བྱེད་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་ཉིད་སྲིད་མཚོར་ལྷུང་བ་ཇི་བཞིན་དུ། །"
    },
    {
      "bo": "མར་གྱུར་འགྲོ་བ་ཀུན་ཀྱང་དེ་འདྲ་བར། །"
    },
    {
      "bo": "མཐོང་ནས་འགྲོ་བ་སྒྲོལ་བའི་ཁུར་འཁྱེར་བའི། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་འབྱོངས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སེམས་ཙམ་བསྐྱེད་ཀྱང་ཚུལ་ཁྲིམས་རྣམ་གསུམ་ལ། །"
    },
    {
      "bo": "གོམས་པ་མེད་ན་བྱང་ཆུབ་མི་འགྲུབ་པར། །"
    },
    {
      "bo": "ལེགས་པར་མཐོང་ནས་རྒྱལ་སྲས་སྡོམ་པ་ལ། །"
    },
    {
      "bo": "བརྩོན་པ་དྲག་པོས་སློབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལོག་པའི་ཡུལ་ལ་གཡེངས་པ་ཞི་བྱེད་ཅིང༌། །"
    },
    {
      "bo": "ཡང་དག་དོན་ལ་ཚུལ་བཞིན་དཔྱོད་པ་ཡིས། །"
    },
    {
      "bo": "ཞི་གནས་ལྷག་མཐོང་ཟུང་དུ་འབྲེལ་བའི་ལམ། །"
    },
    {
      "bo": "མྱུར་དུ་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཐུན་མོང་ལམ་སྦྱང་སྣོད་དུ་གྱུར་པ་ན། །"
    },
    {
      "bo": "ཐེག་པ་ཀུན་གྱི་མཆོག་གྱུར་རྡོ་རྗེ་ཐེག།"
    },
    {
      "bo": "སྐལ་བཟང་སྐྱེ་བོའི་འཇུག་ངོགས་དམ་པ་དེར། །"
    },
    {
      "bo": "བདེ་བླག་ཉིད་དུ་འཇུག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དེ་ཚེ་དངོས་གྲུབ་རྣམ་གཉིས་སྒྲུབ་པའི་གཞི། །"
    },
    {
      "bo": "རྣམ་དག་དམ་ཚིག་སྡོམ་པར་གསུངས་པ་ལ། །"
    },
    {
      "bo": "བཅོས་མ་མིན་པའི་ངེས་པ་རྙེད་གྱུར་ནས། །"
    },
    {
      "bo": "སྲོག་དང་བསྡོས་ཏེ་སྲུང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དེ་ནས་རྒྱུད་སྡེ་སྙིང་པོ་རིམ་གཉིས་ཀྱི། །"
    },
    {
      "bo": "གནད་རྣམས་ཇི་བཞིན་རྟོགས་ནས་བརྩོན་པ་ཡིས། །"
    },
    {
      "bo": "ཐུན་བཞིའི་རྣལ་འབྱོར་སྤྱོད་ལས་མི་གཡེལ་བར། །"
    },
    {
      "bo": "དམ་པའི་གསུང་བཞིན་སྒྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དེ་ལྟར་ལམ་བཟང་སྟོན་པའི་བཤེས་གཉེན་དང༌། །"
    },
    {
      "bo": "ཚུལ་བཞིན་སྒྲུབ་པའི་གྲོགས་རྣམས་ཞབས་བརྟན་ཅིང༌། །"
    },
    {
      "bo": "ཕྱི་དང་ནང་གི་བར་དུ་གཅོད་པའི་ཚོགས། །"
    },
    {
      "bo": "ཉེ་བར་ཞི་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་ཡང་དག་བླ་མ་དང་། །"
    },
    {
      "bo": "འབྲལ་མེད་ཆོས་ཀྱི་དཔལ་ལ་ལོངས་སྤྱོད་ཅིང་། །"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་ཡོན་ཏན་རབ་རྫོགས་ནས། །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་གི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །"
    }
  ]
}