{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/two-prayers-gyurme-tsewang-gyatso-jkw",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཇམ་མགོན་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས་པ་ཐུགས་རྗེ་མྱུར་འཇུག་གི་གདུང་དབྱངས་ཞེས་བྱ་བ།",
    "en": "A Prayer to the Vajradhara Gurus, the Gentle Protectors"
  },
  "text": [
    {
      "bo": "འཆི༵་མེད༵་ཡེ་ཤེས་སྐུ་བརྙེས་པདྨ་འབྱུང་།    །",
      "en": "Padmasambhava, who attained the deathless wisdom kāya,",
      "en-trans": "chiméyeshe ku nyé pema jung"
    },
    {
      "bo": "དེང་འདིར་སླར་ཡང་གསང་ཆེན་རྡོ་རྗེའི་ཐེག  །",
      "en": "Appearing once again here and now to illuminate the great secret",
      "en-trans": "dengdir lar yangsang chen dorjé tek"
    },
    {
      "bo": "སྣང༵་ཞིང་ཕྱོགས་དུས་ཀུན་ཏུ་རྒྱས་མཛ༵ད་ཕྱིར།    །",
      "en": "Vajra vehicle and help it to flourish throughout the whole of space and time,",
      "en-trans": "nangzhing chok dü küntu gyédzéchir"
    },
    {
      "bo": "ཡེ་ཤེས་ལྔ་ལྡན་སྐུ་གསུང་ཐུགས་རྡོ༵་རྗེ༵འི།    །",
      "en": "Supreme glorious guru, endowed with the five wisdoms,",
      "en-trans": "yeshe ngaden ku sung tukdorjé"
    },
    {
      "bo": "བདག་ཉིད་ཅན་གྱི་དཔལ་ལྡན་བླ་མ་མཆོག  །",
      "en": "Personification of the vajra body, speech and mind,",
      "en-trans": "daknyi chen gyi palden lama chok"
    },
    {
      "bo": "བསྐལ་བརྒྱར་བཞུགས་ཅིང་བདག་སོགས་འགྲོ་རྣམས་ལ།    །",
      "en": "Remain for a hundred aeons, and for the sake of us all,",
      "en-trans": "kal gyar zhuk ching dak sok dro nam la"
    },
    {
      "bo": "གཞོམ་མེད་ནཱ་དའི་ཆོས་འཁོར་རྒྱུན་མི་ཆད།    །",
      "en": "Turn uninterruptedly the Dharma Wheel of the indestructible nāda,",
      "en-trans": "zhommé na dé chökhor gyün mi ché"
    },
    {
      "bo": "ཕབས་ནས་སྐུ་བཞིའི་ས་བོན་བཏབ་མཛད་གསོལ།    །",
      "en": "Thereby planting the seeds of the four kāyas, I pray.",
      "en-trans": "pab né ku zhi sabön tab dzé sol"
    },
    {
      "bo": "གཞན་ཡང་ཕྱི་ནང་བར་གཅོད་རབ་ཞི་ཞིང་།    །",
      "en": "Utterly pacify any outer and inner obstacles, and",
      "en-trans": "zhenyang chi nang bar chö rabzhi zhing"
    },
    {
      "bo": "མཐུན་རྐྱེན་ལེགས་ཚོགས་དབྱར་གྱི་ཆུ་གཏེར་ལྟར།    །",
      "en": "Make everything auspicious, so that positive, harmonious circumstances",
      "en-trans": "tünkyen lektsok yar gyi chuter tar"
    },
    {
      "bo": "འགྲིབ་མེད་རྟག་པ་དམ་པའི་བཀྲ་ཤིས་ཤོག  །",
      "en": "Never wane but continually increase just like a lake in summer.",
      "en-trans": "dribmé takpa dampé tashi shok"
    },
    {
      "bo": "བདག་དང་མཁའ་མཉམ་སེམས་ཅན་མ་ལུས་ཀུན།    །",
      "en": "For me and all sentient beings, as infinite as space,",
      "en-trans": "dak dang khanyam semchen malü kün"
    },
    {
      "bo": "དེང་ནས་བཟུང་སྟེ་བྱང་ཆུབ་མ་ཐོབ་བར།    །",
      "en": "From now until we attain awakening,",
      "en-trans": "deng né zung té changchub matob bar"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མ་མཁྱེན་བརྩེའི་དབང་པོ་ཡིས།    །",
      "en": "Glorious guru Khyentse Wangpo,",
      "en-trans": "palden lama khyentsé wangpo yi"
    },
    {
      "bo": "འབྲལ་མེད་རྗེས་བཟུང་བྱིན་རླབས་དངོས་གྲུབ་སྩོལ།    །",
      "en": "Guide us without ever parting and grant us blessings and attainments.",
      "en-trans": "dralmé jezung jinlab ngödrub tsol"
    }
  ]
}