{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-on-occasion-of-gorampa-transmission",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཀུན་མཁྱེན་ཆོས་ཀྱི་རྒྱལ་པོའི་གསུང་པོད་བཅུ་གསུམ་པ་ལྗགས་ལུང་གནང་སྐབས་ཀྱི་གསོལ་འདེབས།",
    "en": "Prayer on the Occasion of the Reading Transmission for the Omniscient King of Dharma's Thirteen-Volume Collected Writings"
  },
  "text": [
    {
      "bo": "འཇ༵མ་དབྱང༵ས་བླ་མའི་བྱིན་རླབས་སྤྲིན་ཕུང་ལས། །",
      "en": "From the cloud-banks of blessings from the Mañjughoṣa Guru1",
      "en-trans": "jamyanglamé jinlab trinpung lé"
    },
    {
      "bo": "མདོ་སྔགས་ནོར་བུའི་གྲུ་ཆར་ལྷུག་པར་འཇོ། །",
      "en": "Falls the gentle rain of sūtra and mantra jewels",
      "en-trans": "do ngak norbü druchar lhukpar jo"
    },
    {
      "bo": "ཀུན་དགའི་བསྟན་པའི་རྒྱལ༵་མཚན༵་རྩེར་བཀོད་པ། །",
      "en": "To be placed atop the victory banner of Kunga’s teachings—2",
      "en-trans": "küngé tenpégyaltsentser köpa"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Glorious guru, at your feet I pray!",
      "en-trans": "palden lamé zhab la solwa deb"
    },
    {
      "bo": "གཞན་ཕན་བྱམས༵་པའི༵་དཔལ༵་དང་ལྡན༵་པའི་མཆོག །",
      "en": "Supreme of those endowed with splendid altruism and loving kindness,",
      "en-trans": "zhenpenjampé paldangdenpé chok"
    },
    {
      "bo": "ཤེས༵་རབ༵་གསུམ་གྱིས་ཆོས་ཚུལ་རྣམ་པར་འབྱེད། །",
      "en": "You discern the ways of Dharma with threefold wisdom",
      "en-trans": "sherabsum gyi chö tsul nampar jé"
    },
    {
      "bo": "ཡང་དག་ལྟ་སྒོམ་སྤྱོད་པའི་ཁང་བཟང་དུ། །",
      "en": "In the fine mansion of authentic view, meditation and conduct—",
      "en-trans": "yangdak ta gom chöpé khang zang du"
    },
    {
      "bo": "རྟེན་བཅས་བཤེས་གཉེན་ཆེན་པོར་གསོལ་བ་འདེབས། །",
      "en": "Great spiritual friend, to you I pray!",
      "en-trans": "ten ché shenyen chenpor solwa deb"
    },
    {
      "bo": "བདག་སོགས་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་། །",
      "en": "May I and others develop impeccable ethical discipline,",
      "en-trans": "dak sok tsultrim nampar dakpa dang"
    },
    {
      "bo": "ངེས་འབྱུང་བྱང་ཆུབ་སེམས་གཉིས་རྒྱུད་ལ་སྐྱེ། །",
      "en": "May renunciation and twofold bodhicitta awaken in our being,",
      "en-trans": "ngejung changchub sem nyi gyü la kyé"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གྱི་བགྲོད་པར་མཐར་ཕྱིན་ནས། །",
      "en": "May we perfectly traverse the paths of the two stages",
      "en-trans": "rim nyi lam gyi dröpar tarchin né"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོའི་གོ་འཕང་ཐོབ་པར་ཤོག །",
      "en": "And ultimately attain the level of a Dharma Sovereign!",
      "en-trans": "chö kyi gyalpö gopang tobpar shok"
    }
  ]
}