{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/clear-light-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འོད་གསལ་འཆར་བའི་གསོལ་འདེབས་བཞུགས་སོ།    །",
    "en": "Prayer for the Dawning of Clear Light"
  },
  "text": [
    {
      "bo": "དྲན་པ་ཙམ་གྱིས་སྲིད་ཞིའི་འཇིགས་འཕྲོག་པ།    །",
      "en": "The mere thought of you banishes the anxieties of existence and quiescence,",
      "en-trans": "drenpa tsam gyi sizhi jik trokpa"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མ་མུན་སེལ་སྒྲོན་མེ་ཉིད།    །",
      "en": "Glorious guru, beacon who dispels the darkness,",
      "en-trans": "palden lama münsel drönmé nyi"
    },
    {
      "bo": "བདག་གི་སྙིང་ག་པདྨའི་གདན་བཞུགས་ནས།    །",
      "en": "Take your seat upon the lotus in my heart",
      "en-trans": "dak gi nyingga pemé den zhuk né"
    },
    {
      "bo": "རང་བྱུང་འོད་གསལ་འཆར་བར་བྱིན་གྱིས་རློབས།    །",
      "en": "And inspire the dawn of naturally arisen clear light.",
      "en-trans": "rangjung ösal charwar jingyi lob"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་མ་རིག་གཏི་མུག་གི །",
      "en": "I have been subject to the murky gloom of delusion,",
      "en-trans": "tokmé dü né marik timuk gi"
    },
    {
      "bo": "མུན་པར་གཉིད་མཐུག་དྲག་པོས་ནོན་པ་བདག  །",
      "en": "A nescience that’s endured throughout beginningless time.",
      "en-trans": "münpar nyi tuk drakpö nönpa dak"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མའི་དྲིན་གྱིས་ཁྱོད་ཐུགས་དང་།    །",
      "en": "Now, in your kindness, O precious guru, inspire me",
      "en-trans": "jetsün lamé drin gyi khyö tuk dang"
    },
    {
      "bo": "རང་སེམས་དབྱེར་མེད་ཤེས་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "To realise how your wisdom and my mind are indivisible.",
      "en-trans": "rangsem yermé shepar jingyi lob"
    },
    {
      "bo": "རང་རིག་གསལ་སྟོང་བླ་མའི་ཐུགས་སུ་ཤར།    །",
      "en": "Let my own clear, empty awareness dawn as the guru’s wisdom—",
      "en-trans": "rangrig saltong lamé tuk su shar"
    },
    {
      "bo": "ཟབ་ཞི་སྤྲོས་བྲལ་འོད་གསལ་འདུས་མ་བྱས།    །",
      "en": "Profound, peaceful, unelaborate and uncompounded clear light.",
      "en-trans": "zab zhi trödral ösal dümajé"
    },
    {
      "bo": "སྐྱེ་མེད་ཨ་ཡིག་དཀར་པོ་འོད་འབར་བར།    །",
      "en": "Inspire me with the ability to focus my mind inseparably",
      "en-trans": "kyemé a yikkar po öbar bar"
    },
    {
      "bo": "སེམས་ཟིན་དབྱེར་མེད་བསྲེ་ནུས་བྱིན་གྱིས་རློབས།    །",
      "en": "On the white A, syllable of the unborn, blazing in radiance.",
      "en-trans": "sem zin yermé sé nü jingyi lob"
    },
    {
      "bo": "དེ་ཡི་འོད་ཀྱིས་ཕྱི་ནང་སྣོད་བཅུད་ཀུན།    །",
      "en": "Let its light illuminate the whole world, outer and inner,",
      "en-trans": "dé yi ö kyi chinang nöchü kün"
    },
    {
      "bo": "ཡེ་ཤེས་འོད་ཀྱིས་གསལ་བར་གྱུར་པ་དང་།    །",
      "en": "Environment and inhabitants, in wisdom luminosity,",
      "en-trans": "yeshe ö kyi salwar gyurpa dang"
    },
    {
      "bo": "གཉིད་མཐུག་ཀུན་གཞིའི་མུན་པ་དབྱིངས་སུ་དག  །",
      "en": "And purify the dark of slumber and ālaya into basic space.",
      "en-trans": "nyi tuk künzhi münpa ying su dak"
    },
    {
      "bo": "སྲབ་མཐུག་འོད་གསལ་ཟིན་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me to recognize both coarse and subtle luminosity.",
      "en-trans": "sab tuk ösal zinpar jingyi lob"
    },
    {
      "bo": "གཟུང་འཛིན་རྟོག་པའི་སྒྲིབ་པས་མ་གོས་པ།    །",
      "en": "Untainted by the obscurations of dualistic thought,",
      "en-trans": "zungdzin tokpé dribpé magöpa"
    },
    {
      "bo": "དག་དང་མ་དག་སྣང་བ་ཐམས་ཅད་ཀུན།    །",
      "en": "In a clear state wherein all perception, pure and impure,",
      "en-trans": "dak dang ma daknang ba tamché kün"
    },
    {
      "bo": "སྣང་ཡང་ངར་འཛིན་མེད་པ་གསལ་བའི་ངང་།    །",
      "en": "Is experienced without any clinging to a self,",
      "en-trans": "nang yang ngardzin mepa salwé ngang"
    },
    {
      "bo": "གོམས་འདྲིས་བརྟན་པ་ཐོབ་པར་བྱིན་གྱིས་རློབས།    །",
      "en": "Inspire me to gain the stability of familiarity.",
      "en-trans": "gom dri tenpa tobpar jingyi lob"
    },
    {
      "bo": "དེ་ལྟར་བརྩོན་པས་ཚེ་འདིར་གྲོལ་བའམ།    །",
      "en": "Inspire me, glorious guru of my own awareness,",
      "en-trans": "detar tsönpé tsé dir drolwa am"
    },
    {
      "bo": "བར་དོ་འོད་གསལ་རང་ངོ་ཤེས་པ་དང་།    །",
      "en": "So that through such diligent application,",
      "en-trans": "bardo ösal rang ngoshepa dang"
    },
    {
      "bo": "ཆོས་ཉིད་བདེན་པ་མངོན་སུམ་རྟོགས་པ་རུ།    །",
      "en": "I may gain liberation in this life or recognize the bardo’s clear light",
      "en-trans": "chönyi denpa ngönsum tokpa ru"
    },
    {
      "bo": "རང་རིག་དཔལ་ལྡན་བླ་མས་བྱིན་གྱིས་རློབས།    །",
      "en": "And directly realize the truth of dharmatā.",
      "en-trans": "rangrig palden lamé jingyi lob"
    }
  ]
}