{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/khenpo-chime-rigdzin/lament-of-faith",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མ་ཡིད་བཞིན་ནོར་བུའི་རྗེས་དྲན་གསོལ་འདེབས་ཉུང་ངུ་དད་པའི་གདུང་དབྱངས་ཞེས་བྱ་བ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "འཇིགས་མེད་རྩོད་འཆད་རྩོམ་པའི་གཏེར་ལ་དབང་། །"
    },
    {
      "bo": "ཕུན་ཚོགས་བསླབ་པ་གསུམ་གྱི་ཡོན་ཏན་རྫོགས། །"
    },
    {
      "bo": "དཔག་ཡས་ཕན་བདེའི་འབྱུང་གནས་རིན་པོ་ཆེ། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བློ་ཁ་ཆོས་ལ་ཕྱོགས་པ་བླ་མའི་དྲིན། །"
    },
    {
      "bo": "ཆོས་ལ་དགའ་བ་སྐྱེས་པ་བླ་མའི་དྲིན། །"
    },
    {
      "bo": "ཆོས་གཟུགས་མ་བོར་ཙམ་འདི་བླ་མའི་དྲིན། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་སྒྲུབ་པའི་ལམ་གྱི་གནད། །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་མ་ཡིན་ཤེས་རབ་བརྩོན་འགྲུས་མིན། །"
    },
    {
      "bo": "བླ་མའི་མོས་གུས་ཁོ་ནར་ཐག་ཆོད་ནས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་ལ་སྦྱངས་བརྩོན་རྡུལ་ཙམ་མ་བྱས་ཀྱང་། །"
    },
    {
      "bo": "རྟོགས་ལྡན་བླ་མར་དད་པའི་རྟེན་འབྲེལ་གྱིས། །"
    },
    {
      "bo": "དགོངས་པ་ལྷ་དང་མཉམ་པའི་ཆེ་བ་ཡོད། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྡིག་ཅན་ཤན་པ་སྨད་འཚོང་ཚུལ་འཆལ་སོགས། །"
    },
    {
      "bo": "ཐེག་པ་གཞན་གྱི་གདུལ་བྱར་མ་བྱར་པ། །"
    },
    {
      "bo": "མོས་གུས་ལམ་གྱིས་གྲོལ་བའི་གྲུབ་ཐོབ་མང་། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཁའ་འགྲོའི་གསང་མཛོད་སྒྲུབ་བརྒྱུད་ཤིང་རྟ་བརྒྱད། །"
    },
    {
      "bo": "ཀུན་ཀྱང་ཞལ་མཐུན་ཀུན་གྱི་གསང་བའི་གནད། །"
    },
    {
      "bo": "བླ་མའི་རྣལ་འབྱོར་ཁོ་ནར་རག་ལས་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མོས་གུས་ལམ་གྱི་རྩ་བ་མ་ཚུགས་ན། །"
    },
    {
      "bo": "ཚེ་གང་འདུལ་ཁྲིམས་གཙང་མས་རྒྱུད་བསྡམས་ཀྱང་། །"
    },
    {
      "bo": "སེམས་རྒྱུད་ཐ་མལ་མི་ལས་མི་འཕགས་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བརྒྱུད་གསུམ་བླ་མའི་བྱིན་རླབས་མ་ཞུགས་ན། །"
    },
    {
      "bo": "མདོ་སྔགས་རིག་གནས་ཀུན་ལ་མཁས་ན་ཡང་། །"
    },
    {
      "bo": "དོན་བརྒྱུད་རྟོགས་པ་འཕོ་རྒྱུ་མི་འདུག་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བླ་མ་ལྷ་རུ་ཁོ་ཐག་མ་ཆོད་ན། །"
    },
    {
      "bo": "བསྙེན་པ་དུང་ཕྱུར་གྲངས་མང་བཟླས་ན་ཡང་། །"
    },
    {
      "bo": "མཆོག་གི་དངོས་གྲུབ་ཚེ་འདིར་མི་ཐོབ་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དད་པའི་གྲོགས་དང་ཡུན་དུ་མ་འགྲོག་ན། །"
    },
    {
      "bo": "སེམས་ཉིད་གཉུག་མའི་གནས་ལུགས་ངོ་འཕྲོད་ཀྱང་། །"
    },
    {
      "bo": "ཉམས་རྟོགས་རྩ་ལ་ཁ་ཕྱོགས་མེད་མི་རྒྱས་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བླ་མ་སངས་རྒྱས་ཉིད་དུ་མ་ཤེས་ན། །"
    },
    {
      "bo": "ཕྱག་མཆོད་རྟེན་བཞེངས་དགེ་སྦྱོར་ཅི་བྱས་ཀྱང་། །"
    },
    {
      "bo": "ཚེ་གཅིག་གདོད་མའི་རྒྱལ་ས་མི་ཟིན་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྙན་པས་ས་ཁྱབ་ཆེ་དགུའི་རྩེར་སོན་ཀྱང་། །"
    },
    {
      "bo": "བླ་མའི་བཀའ་དྲིན་ཡང་ཡང་མ་དྲན་ན། །"
    },
    {
      "bo": "རྣམ་དག་ལྷ་ཆོས་ལམ་དུ་མི་འགྲོ་བས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྐྱེན་ངན་ཐོག་བབས་དམན་པའི་སར་ལྷུངས་ཀྱང་། །"
    },
    {
      "bo": "དད་པའི་ཁམས་འདུས་གསོ་ཚུལ་མ་ཤེས་ན། །"
    },
    {
      "bo": "སྐྱོ་གདུང་ཡིད་ཆད་སེལ་མཁན་མི་འདུག་པས། །"
    },
    {
      "bo": "འདྲེན་མཆོག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ད་རེས་རང་གིས་རང་ཉིད་མ་བསླུས་ན། །"
    },
    {
      "bo": "སངས་རྒྱས་དངོས་འདྲའི་བླ་མའི་ཐུགས་རྗེས་ཟིན། །"
    },
    {
      "bo": "སེམས་ཀྱི་གཏད་ས་བརྟན་བརྗིད་རི་ལས་བརླིང་། །"
    },
    {
      "bo": "མཁྱེན་ནོ་མཁྱེན་ནོ་དྲིན་ཅན་བླ་མ་མཁྱེན། །"
    },
    {
      "bo": "ཟ་ཟིའི་རྨི་ལམ་ནང་ནས་ཁྱེད་ཞལ་རེ། །"
    },
    {
      "bo": "ཡང་ཡང་མཇལ་བར་སྒུག་པའི་བུ་ང་ལ། །"
    },
    {
      "bo": "སྐྱིད་སྡུག་ཅི་བྱུང་རེ་ས་གཞན་མེད་པས། །"
    },
    {
      "bo": "མཁྱེན་ནོ་མཁྱེན་ནོ་ཡིད་བཞིན་ནོར་བུ་མཁྱེན། །"
    },
    {
      "bo": "ཐོས་པ་ཆེ་ཡང་གྲུབ་པའི་ཉམས་རྟོགས་ཕྲ། །"
    },
    {
      "bo": "རྟོགས་པ་མཐོ་ཡང་ཆོས་ལ་སྦྱངས་བ་ཆུང་། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་མཁས་གྲུབ་གཉིས་ལྡན་པའི། །"
    },
    {
      "bo": "རྒྱན་དྲུག་མཆོག་གཉིས་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "བསྟན་འགྲོར་མི་སེམས་རང་དོན་ཞི་བ་གཉེར། །"
    },
    {
      "bo": "རང་རྒྱུད་མ་སྨིན་གཞན་དོན་སྒྲུབ་བློ་བྱེད། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་དོན་གཉིས་ལྷུན་འགྲུབ་པའི། །"
    },
    {
      "bo": "རྫོགས་པའི་སངས་རྒྱས་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "འདུལ་ཁྲིམས་མཆོག་བཟུང་སྔགས་ལ་མོས་པ་ཆུང་། །"
    },
    {
      "bo": "སྔགས་ལ་ཞུགས་ནས་འདུལ་བར་གུས་པ་ལྷོད། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་གསུམ་ལྡན་རྡོ་རྗེ་འཛིན། །"
    },
    {
      "bo": "པདྨ་དཀར་པོ་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "རབ་བྱུང་རྗེས་བཟུང་ཁྱིམ་པའི་ཆོས་སྐལ་ཆད། །"
    },
    {
      "bo": "ཁྱིམ་པ་རྗེས་བཟུང་མཁས་པའི་བུ་སློབ་མེད། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་འཁོར་ཚོགས་རྣམ་བཞིའི་མགོན། །"
    },
    {
      "bo": "ཀུན་ཕན་ཟླ་བ་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "བཀའ་མ་ཤེས་ཀྱང་གཏེར་གྱི་ཆོས་སྐལ་མེད། །"
    },
    {
      "bo": "གཏེར་ཆོས་མང་ཡང་བཀའ་མའི་བརྒྱུད་པ་མེད། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་བཀའ་གཏེར་ཀུན་འཛོམས་པའི། །"
    },
    {
      "bo": "འདོད་འབྱུང་བུམ་བཟང་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "རང་ལུགས་མཆོག་བཟུང་གཞན་གྱི་ཆོས་ལ་སྨོད། །"
    },
    {
      "bo": "གཞན་ལུགས་རྗེས་བརྗོད་བརྒྱུད་པའི་ཆོས་སྐལ་བོར། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་བསྟན་པ་ཡོངས་ཀྱི་གཉེན། །"
    },
    {
      "bo": "འཛམ་གླིང་ཉི་མ་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "སྙན་གྲགས་ཆེ་ཡང་རྒྱུད་ལ་ཉམས་རྟོགས་མེད། །"
    },
    {
      "bo": "རྟོགས་པ་མཐོ་ཡང་མཛད་པའི་གྲགས་རྒྱ་ཆུང་། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་ཁམས་གསུམ་དབང་བསྡུས་པའི། །"
    },
    {
      "bo": "འཁོར་ལོས་བསྒྱུར་རྒྱལ་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "ཆོས་པ་བཟང་ཡང་འཇིག་རྟེན་ཤེས་རྒྱ་ཆུང་། །"
    },
    {
      "bo": "འཇིག་རྟེན་མཁས་ཀྱང་ཆོས་ཀྱི་ཉམས་ལེན་ཕྲ། །"
    },
    {
      "bo": "དེ་འདྲ་བསམ་ནས་ལུགས་གཉིས་ཀུན་འཛོམས་པའི། །"
    },
    {
      "bo": "དེད་དཔོན་བཟང་པོ་འདྲ་བའི་བླ་མ་དྲན། །"
    },
    {
      "bo": "བྱིན་རླབས་རྟགས་མཚན་ཡོད་ཀྱང་མེད་ཀྱང་རུང་། །"
    },
    {
      "bo": "དངོས་གྲུབ་སྐལ་བ་ཐོབ་རུང་མ་ཐོབ་རུང་། །"
    },
    {
      "bo": "འདུན་མའི་རྩེ་བརྒྱ་མགོན་པོ་ཁྱེད་ལ་གཏད། །"
    },
    {
      "bo": "ལམ་སྣེ་གང་ལ་འཁོར་ཡང་འགྱོད་པ་མེད། །"
    },
    {
      "bo": "སྐྱིད་ན་བླ་མའི་བྱིན་རླབས་ཉིད་དུ་བསམ། །"
    },
    {
      "bo": "གུ་ཡངས་ཉམས་གླུ་ལེན་བཞིན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕན་བདེ་འགྲོ་ལ་བསྔོ་བཞིན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྡུག་ན་སྒྲིབ་སྦྱོང་དངོས་གྲུབ་ཉིད་དུ་ཤེས། །"
    },
    {
      "bo": "ཉམས་ལེན་རྩལ་སྦྱོང་བྱེད་བཞིན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཁོར་བའི་སྡུག་བསྔལ་བསམ་བཞིན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱོ་ཤས་ངེས་འབྱུང་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བསྐྱེད་པའི་ལྷ་བསྒོམ་བཟླས་པའི་སྔགས་བགྲང་ཀུན། །"
    },
    {
      "bo": "བླ་མའི་མོས་གུས་གསོལ་འདེབས་ཁོ་ན་རུ། །"
    },
    {
      "bo": "སྲོག་སྡོམ་གཟེར་བཞིའི་གནད་འགགས་གཅིག་དྲིལ་ན། །"
    },
    {
      "bo": "གང་སྣང་ལྷ་རུ་འཆར་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དྭངས་མའི་ཧཾ་ཡིག་བདེ་ཆེན་བླ་མའི་ཐུགས། །"
    },
    {
      "bo": "མོས་གུས་གཏུམ་མོས་བསྐུལ་བའི་ཐུགས་རྗེ་ལས། །"
    },
    {
      "bo": "གནས་ཡུལ་མཁའ་འགྲོའི་གྲོགས་དང་ལྷན་ཅིག་ཏུ། །"
    },
    {
      "bo": "བདེ་སྟོང་ཉམས་རྩལ་རྫོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚིག་ལ་བརྟེན་པས་གོ་བའི་དོན་མི་རྟོགས། །"
    },
    {
      "bo": "རྩོལ་བས་བཅིང་བའི་སྒོམ་པས་ས་མི་ཆོད། །"
    },
    {
      "bo": "བཟོ་བཅོས་སྤྲོས་དང་སྤང་བླངས་མི་དགོས་པར། །"
    },
    {
      "bo": "ཉིན་མཚན་སྒོམ་དང་འདྲེས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དེང་ནས་མགོན་ཁྱོད་དགྱེས་ཞལ་ནམ་མཇལ་ཚེ། །"
    },
    {
      "bo": "སྔོན་བྱོན་གྲུབ་ཐོབ་གོང་མའི་རྣམ་ཐར་བཞིན། །"
    },
    {
      "bo": "ཐ་མལ་མི་ཡི་སྣང་བ་མི་འཆར་བར། །"
    },
    {
      "bo": "ལྷག་པའི་ལྷ་རུ་མཐོང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མདོར་ན་འདི་ནས་སྐྱེ་བའི་ཕྲེང་བ་རུ། །"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་ཀྱིས་དགྱེས་བཞིན་རྗེས་བཟུང་ནས། །"
    },
    {
      "bo": "ཚེ་དང་ཆོས་ལ་བར་ཆད་མི་འབྱུང་བར། །"
    },
    {
      "bo": "ཐུགས་ཡིད་དབྱེར་མེད་འདྲེས་པར་བྱིན་གྱིས་རློབས། །"
    }
  ]
}