{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-kagyu-masters",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བཀའ་བརྒྱུད་སྤྱི་བའི་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་ཆེན་ཏེ་ལོ་ནཱ་རོ་དང་། །"
    },
    {
      "bo": "མར་མི་དྭགས་པོ་མཐའ་རྩ་འབྲི་སྟག་གླིང་། །"
    },
    {
      "bo": "བཀའ་བཞི་བརྒྱུད་པའི་བླ་མ་ཐམས་ཅད་ཀྱིས། །"
    },
    {
      "bo": "དེང་འདིར་བདག་སོགས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "ཁྱད་པར་འགྲན་ཟླ་ཀུན་བྲལ་སྤྲུལ་པའི་སྐུ། །"
    },
    {
      "bo": "དུས་གསུམ་མཁྱེན་པའི་སྐུ་ཡི་སྐྱེས་རབས་ཕྲེང་། །"
    },
    {
      "bo": "རིམ་པར་བྱོན་པ་ཀུན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་འདིར་བདག་སོགས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "བདེ་ཆེན་དབང་དྲག་རོལ་པའི་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བའི་ཕྲིན་ལས་པ་ཆེན་པོ། །"
    },
    {
      "bo": "གྲུབ་ཆེན་ཆོས་ཀྱི་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་འདིར་བདག་སོགས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "སྐུ་ནི་པདྨ་ཧེ་རུ་ཀ་ཆེན་པོ། །"
    },
    {
      "bo": "གསུང་ནི་གྲགས་སྟོང་སྔགས་ཀྱི་སྒྲ་ཆེན་སྒྲོགས། །"
    },
    {
      "bo": "ཐུགས་ནི་ཆོས་དབྱིངས་ཀུན་ཁྱབ་འོད་གསལ་ཆེ། །"
    },
    {
      "bo": "བླ་མ་ཀརྨ་པ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་འདིར་བདག་སོགས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "བརྟན་གཡོ་སྣང་སྲིད་ཐམས་ཅད་ཟིལ་གྱིས་གནོན། །"
    },
    {
      "bo": "ཡེ་ཤེས་སྐུ་ནི་འཕྲོ་འདུའི་གར་གྱིས་བརྗིད། །"
    },
    {
      "bo": "དགོངས་པ་མི་འགྱུར་མཁའ་ལྟར་དག་ཅིང་ཡངས། །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་འདིར་བདག་སོགས་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "སྙིགས་དུས་དམ་སྲི་རྒྱལ་འགོང་ཀུན་གྱི་གཤེད། །"
    },
    {
      "bo": "བླ་མ་དཔལ་ཆེན་དྲག་པོའི་དཀྱིལ་འཁོར་པ། །"
    },
    {
      "bo": "ཇི་སྙེད་གཅིག་ཏུ་བསྡུས་པའི་ཀརྨ་པ། །"
    },
    {
      "bo": "པཀྴི་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་འདིར་དབང་བསྐུར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། །"
    },
    {
      "bo": "ནད་གདོན་གནོད་པ་ཞི་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚེ་ཆོས་མཐའ་རུ་ཕྱིན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་ཏིང་འཛིན་བརྟན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་སེམས་ཆོས་སྐུར་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བླ་མ་ཁྱེད་དང་མཉམ་པར་བྱིན་གྱིས་རློབས། །"
    }
  ]
}