{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/great-pangs-of-devotion-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མ་རྩ་གསུམ་སྤྱི་དང་ཁྱད་པར་དྲན་པས་གདུང་སེལ་ཐར་རྩེ་མཁན་ཆེན་རྡོ་རྗེ་འཆང་མཆེད་གཉིས་དང་།  མཁྱེན་བརྩེའི་དབང་པོར་གསོལ་འདེབས་མོས་གུས་ཀྱི་གཟེར་ཆེན་ཞེས་བྱ་བ་བཞུགས་སོ།།",
    "en": "Great Pangs of Devotion"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om svasti"
    },
    {
      "bo": "བཅོམ་ལྡན་ཤཱཀ་ཐུབ་ཉེ་སྲས་གནས་བརྟན་ཆེ།    །",
      "en": "The Blessed One Śākyamuni, his Close Sons, the great elders,",
      "en-trans": "chomden shak tub nyesé neten ché"
    },
    {
      "bo": "རྒྱ་བོད་མཁས་གྲུབ་རིག་འཛིན་ཚོགས་རྣམས་ཀྱིས།    །",
      "en": "Scholars and adepts of India and Tibet and hosts of vidyādharas,",
      "en-trans": "gya bö khedrub rigdzin tsok nam kyi"
    },
    {
      "bo": "བྱིན་རླབས་པདྨ་དཀར་པོ་ཆར་དུ་བསྙིལ།    །",
      "en": "Let your blessings descend as cascading white lotuses,",
      "en-trans": "jinlab pema karpo char du nyil"
    },
    {
      "bo": "དུས་གསུམ་ཀུན་ཏུ་བཀྲ་ཤིས་རྒྱལ་གྱུར་ཅིག  །",
      "en": "And let auspiciousness reign throughout the three times.",
      "en-trans": "dü sum küntu tashi gyal gyur chik"
    },
    {
      "bo": "དགོངས་བརྡ་སྙན་བརྒྱུད་རིག་འཛིན་བླ་མ་དང་།    །",
      "en": "Gurus of the mind-direct, sign and aural transmissions,",
      "en-trans": "gong da nyengyü rigdzin lama dang"
    },
    {
      "bo": "ཡི་དམ་ཞི་ཁྲོ་གནས་གསུམ་ཌཱ་ཀིའི་ཚོགས།    །",
      "en": "Peaceful and wrathful yidams, ḍākinīs of the three abodes,",
      "en-trans": "yidam zhitro né sum daki tsok"
    },
    {
      "bo": "དམ་ཅན་ཆོས་སྐྱོང་ནོར་ལྷ་གཏེར་གཞི་བདག  །",
      "en": "Oath-bound dharma protectors, wealth deities, treasure-keepers and local spirits,",
      "en-trans": "damchen chökyong norlha ter zhidak"
    },
    {
      "bo": "དེང་འདིར་བདག་ཅག་རྣམས་ལ་དགོངས་པར་མཛོད།    །",
      "en": "Turn your attention towards us, here and now.",
      "en-trans": "dengdir dakchak nam la gongpar dzö"
    },
    {
      "bo": "དམིགས་མེད་བྱམ༷ས་པ༷་སྙིང་རྗེའི་མངའ་བདག་ཆེ།    །",
      "en": "Great sovereign of non-referential love and compassion,",
      "en-trans": "mikméjampanyingjé ngadak ché"
    },
    {
      "bo": "ཀུན༷་བཟང་རྡོ་རྗེ་འཆང་ཆེན་ཧེ་བཛྲ།    །",
      "en": "Ever perfect great Vajradhara Hevajra,",
      "en-trans": "kunzang dorjé chang chen hé benza"
    },
    {
      "bo": "རབ་ཏུ་དགའ༷་བའི་དབང་བསྒྱུར་འཁོར་ལོ་སྡོམ།    །",
      "en": "And Cakrasaṃvara, master1of supreme joy—",
      "en-trans": "rabtugawé wanggyur khorlo dom"
    },
    {
      "bo": "དབྱེར་མེད་བསྟན༷་འཛི༷ན་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །",
      "en": "To the vajra holder of the teachings, who is indivisible from them, I pray.2",
      "en-trans": "yermétendzindorjér solwa deb"
    },
    {
      "bo": "བྱམ༷ས་པ༷་ཆེན་པོས་འགྲོ་ལ་བུ་བཞིན་དགོངས།    །",
      "en": "Regarding beings with great love like that for a child,",
      "en-trans": "jampachenpö dro la bu zhin gong"
    },
    {
      "bo": "མཐུ་སྟོབས་རྣལ༷་འབྱོར༷་ཕུལ་བྱུང་གྲུབ་པའི་རྗེ།    །",
      "en": "Powerful and pre-eminent yogin, lord of siddhas,",
      "en-trans": "tutobnaljorpuljung drubpé jé"
    },
    {
      "bo": "ཀུན་རྨོངས་ཞེ་སྡང་ཐ་བ་འཇ༷མ་པའི་དཔ༷ལ།    །",
      "en": "Whose splendour softens the harshness of ignorance and hatred—",
      "en-trans": "kün mong zhedang tawajampépal"
    },
    {
      "bo": "བཟ༷ང་པོ༷འི་མཆོག་གྱུར་བླ་མར་གསོལ་བ་འདེབས།    །",
      "en": "Supremely excellent guru, to you I pray.3",
      "en-trans": "zangpöchokgyur lamar solwa deb"
    },
    {
      "bo": "འཇ༷མ་དཔལ་དབྱང༷ས་ཀྱི་ཡེ་ཤེས་སྒྱུ་མའི་འཕྲུལ།    །",
      "en": "Magical manifestation of Mañjughoṣa’s wisdom,",
      "en-trans": "jampalyangkyi yeshe gyumé trul"
    },
    {
      "bo": "མཁྱེན༷་དང་བརྩེ་བ༷འི་དབ༷ང་པོ༷་བཀའ་བབས་བདུན།    །",
      "en": "Lord of knowledge and love, master of the teachings.",
      "en-trans": "khyendangtsewéwangpokabab dün"
    },
    {
      "bo": "ངོ་མཚར་ཤིང་རྟ་འདྲེན་མཛད་བསྟན་པའི་བདག  །",
      "en": "Who draws the chariot of wondrous sevenfold transmission,4",
      "en-trans": "ngotsar shingta dren dzé tenpé dak"
    },
    {
      "bo": "འོད་གསལ་སྤྲུལ་པའི་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །",
      "en": "Ösal Trulpe Dorje, to you I pray.5",
      "en-trans": "ösal trulpé dorjér solwa deb"
    },
    {
      "bo": "དེ་ལྟར་སྙིང་ནས་གསོལ་བ་བཏབ་པ་ལ།    །",
      "en": "As I pray from the depths of my heart in this way,",
      "en-trans": "detar nying né solwa tabpa la"
    },
    {
      "bo": "འདྲེན་མཆོག་ཡབ་སྲས་རྣམས་ཀྱི་ཐུགས་རྗེས་གཟིགས།    །",
      "en": "May the supreme guides, father and son alike, look on me with compassion.",
      "en-trans": "dren chok yabsé nam kyi tukjé zik"
    },
    {
      "bo": "བུ་ལ་སྐྱིད་སྡུག་ལེགས་ཉེས་ཅི་བྱུང་ཡང་།    །",
      "en": "Whatever befalls this child of yours, happiness or sorrow, good or bad,",
      "en-trans": "bu la kyiduk leknyé chi jung yang"
    },
    {
      "bo": "བླ་མ་ཡབ་སྲས་ཚོགས་ལ་བློ་གཏད་ན།    །",
      "en": "By placing my trust in you, the guru fathers and son,",
      "en-trans": "lama yabsé tsok la lo té na"
    },
    {
      "bo": "ངེས་པར་མཁྱེན་བརྩེའི་སྤྱན་གྱིས་བཙའ་བ་དང་།    །",
      "en": "Watch over me with your eyes of knowledge and love,",
      "en-trans": "ngepar khyentsé chen gyi tsawa dang"
    },
    {
      "bo": "བྱམས་པའི་ཕྱག་གིས་ནམ་ཡང་མི་གཏོང་བར།    །",
      "en": "And never release me from your loving embrace,",
      "en-trans": "jampé chak gi namyang mi tongwar"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོ་ཀུན་ཏུ་བསྐྱབ་ཏུ་གསོལ།    །",
      "en": "But always protect me in this life, the next life, and the bardos, I pray.",
      "en-trans": "di chi bardo küntu kyab tu sol"
    },
    {
      "bo": "ད་ནི་ལྔ་བརྒྱའི་མཐའ་མ་ཡང་མཐར་ལྷུང་།    །",
      "en": "Now that we have reached the final five-hundred year age,",
      "en-trans": "dani ngabgyé tama yang tar lhung"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་པ་ནུབ་རིར་གཞོལ་ལ་ཉེ།    །",
      "en": "Buddha’s teachings have almost set below the western peak.",
      "en-trans": "sangye tenpa nub rir zhol la nyé"
    },
    {
      "bo": "སྡིག་སྤྱོད་ཀླ་ཀློས་ས་སྟེང་ཐམས་ཅད་ཁྱབ།    །",
      "en": "The world teems with evildoers and barbarian hordes.",
      "en-trans": "dik chö lalö sateng tamché khyab"
    },
    {
      "bo": "སྐྱེ་འགྲོ་ཐམས་ཅད་སྡུག་ལ་གཏོད་དུས་འདིར།    །",
      "en": "At this time, when everyone seems intent upon misery,",
      "en-trans": "kyendro tamché duk la tö dü dir"
    },
    {
      "bo": "བླ་མ་ཡབ་སྲས་ཐུགས་རྗེ་མཐུ་སྟོབས་ཀྱི།    །",
      "en": "May the strength and compassion of the guru fathers and son",
      "en-trans": "lama yabsé tukjé tutob kyi"
    },
    {
      "bo": "རྩལ་ཤུགས་ཕྱུངས་ལ་དུས་ཀྱི་རྒུད་པ་བཟློག  །",
      "en": "Reach their full force and the ills of this age be averted.",
      "en-trans": "tsalshuk chung la dü kyi güpa dok"
    },
    {
      "bo": "བསྟན་པའི་གེགས་ཆགས་མ་ལུས་བསལ་བ་དང་།    །",
      "en": "May all that obstructs the teachings be entirely eliminated,",
      "en-trans": "tenpé gek chak malü salwa dang"
    },
    {
      "bo": "ཆོས་སྐྱོང་རྒྱལ་པོའི་ཆབ་སྲིད་ཡུན་བརྟན་མཛོད།    །",
      "en": "And the dominion of the dharma-protecting king endure.",
      "en-trans": "chökyong gyalpö chabsi yünten dzö"
    },
    {
      "bo": "སྐྱེ་འགྲོ་ཕོ་མོའི་ཤེས་རྒྱུད་བགེགས་ཀྱིས་བརླམས།    །",
      "en": "May those who curse men and women with obstructing forces",
      "en-trans": "kyendro pomö shé gyü gek kyi lam"
    },
    {
      "bo": "བསྟན་འགྲོའི་བདེ་སྐྱིད་འཕྲོག་པར་བྱེད་པ་རྣམས།    །",
      "en": "And who threaten the welfare of the teachings and beings",
      "en-trans": "ten drö dekyi trokpar jepa nam"
    },
    {
      "bo": "མྱུར་དུ་ཞི་ནས་བྱམས་པའི་སེམས་ལྡན་ཞིང་།    །",
      "en": "Be swiftly pacified, their minds filled with benevolence,",
      "en-trans": "nyurdu zhi né jampé semden zhing"
    },
    {
      "bo": "ཕན་ཚུན་ཕ་མ་ལྟ་བུར་འགྱུར་བར་མཛོད།    །",
      "en": "So that all may treat one another like parents.",
      "en-trans": "pentsün pama tabur gyurwar dzö"
    },
    {
      "bo": "བདག་ཅག་རྣམས་ཀྱང་ཆོས་མཐུན་བསམ་སྦྱོར་ཚོགས།    །",
      "en": "May we effortlessly accomplish all our aspirations and deeds",
      "en-trans": "dakchak nam kyang chö tün samjor tsok"
    },
    {
      "bo": "འབད་མེད་འགྲུབ་ཅིང་ལྷ་མིན་འབྱུང་པོ་ཡི།    །",
      "en": "That accord with the Dharma, and may we never be harmed",
      "en-trans": "bemé drub ching lhamin jungpo yi"
    },
    {
      "bo": "གནོད་འཚེས་མི་ཚུགས་ཕྱོགས་ལས་རྣམ་པར་རྒྱལ།    །",
      "en": "By non-human spirits and forces, but be entirely victorious.",
      "en-trans": "nö tsé mitsuk chok lé nampar gyal"
    },
    {
      "bo": "ནད་དང་གདོན་ཞི་ཚེ་མཐར་ཕྱིན་པར་མཛོད།    །",
      "en": "May illness and evil influence be pacified, so that our lives may reach their full extent.",
      "en-trans": "né dang dön zhi tsé tarchinpar dzö"
    },
    {
      "bo": "སྡེ་བཞི་དགེ་བཅུའི་སྨན་ལྗོངས་ཉམས་དགའ་བར།    །",
      "en": "In the pleasant medicinal land of fourfold well-being and tenfold virtue,6",
      "en-trans": "dé zhi gé chü men jong nyamgawar"
    },
    {
      "bo": "བཀྲ་ཤིས་ལྷ་རི་རྩེ་མོའི་དགོན་པ་རུ།    །",
      "en": "In the monastery at the peak of the divine mountain of auspiciousness,7",
      "en-trans": "tashi lha ri tsemö gönpa ru"
    },
    {
      "bo": "ཀུན་མཁྱེན་བླ་མའི་ཆོས་ཀྱི་ཕོ་བྲང་དེར།    །",
      "en": "Is the dharma palace of the all-knowing guru, wherein",
      "en-trans": "künkhyen lamé chö kyi podrang der"
    },
    {
      "bo": "བག་ཕེབས་བཀྲ་ཤིས་དགེ་ལེགས་རྒྱས་པར་མཛོད།    །",
      "en": "May gladness,8fortune and excellence increase.",
      "en-trans": "bak peb tashi gelek gyepar dzö"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་བཞིན་འགྲུབ་པ་ལ།    །",
      "en": "So that this prayer may be accomplished just so,",
      "en-trans": "detar solwa tab zhin drubpa la"
    },
    {
      "bo": "སངས་རྒྱས་བྱང་སེམས་ཉན་རང་ལ་སོགས་དང་།    །",
      "en": "Let buddhas, bodhisattvas, śrāvakas, pratyekabuddhas,",
      "en-trans": "sangye changsem nyenrang lasok dang"
    },
    {
      "bo": "ཁྱད་པར་རྩ་གསུམ་ཀུན་འདུས་ཨོ་རྒྱན་རྗེས།    །",
      "en": "And especially the Lord of Oḍḍiyāna, embodiment of all Three Roots,",
      "en-trans": "khyepar tsa sum kündü orgyen jé"
    },
    {
      "bo": "བདེན་པའི་རྒྱབ་སྐྱོར་བདེན་དོན་མངོན་སུམ་དུ།    །",
      "en": "Grant their blessings, bolstered by the force of truth itself,",
      "en-trans": "denpé gyab kyor dendön ngönsum du"
    },
    {
      "bo": "མྱུར་དུ་འགྲུབ་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།    །",
      "en": "That it may be swiftly brought about, I pray.",
      "en-trans": "nyurdu drubpar jingyi lab tu sol"
    }
  ]
}