{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/fourth-dodrupchen-jalu-dorje/prayer-to-guru",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་གངས་ཅན་གྱི་བླ་མ་གུ་རུ་པད་འབྱུང་།",
    "en": "Guru Padmasambhava, Master of the Land of Snows"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ།",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "རྗེ་གངས་ཅན་གྱི་བླ་མ་གུ་རུ་པད་འབྱུང་། །",
      "en": "Guru Padmasambhava, master of the Land of Snows,",
      "en-trans": "jé gangchen gyi lama guru pejung"
    },
    {
      "bo": "ལྷ་རྩ་གསུམ་རྒྱལ་བ་ཞི་ཁྲོ་རབ་འབྱམས། །",
      "en": "Infinite peaceful and wrathful deities of the Three Roots,",
      "en-trans": "lha tsa sum gyalwa zhitro rabjam"
    },
    {
      "bo": "སྐྱབས་བསླུ་མེད་མགོན་པོ་དཀོན་མཆོག་རྣམ་གསུམ། །",
      "en": "And unfailing guardians of refuge, the Three Jewels—",
      "en-trans": "kyab lumé gönpo könchok nam sum"
    },
    {
      "bo": "སྙིང་རུས་པའི་གཏིང་ནས་གསོལ་བ་འདེབས་སོ། །",
      "en": "From the very core of my heart, I pray to you all.",
      "en-trans": "nyingrü pé tingné solwa deb so"
    },
    {
      "bo": "ལུས་ཕུང་ཁམས་དག་པ་སྒྱུ་མའི་ལྷ་སྐུ། །",
      "en": "The pure aggregates and elements of your body are the deity’s illusory form,",
      "en-trans": "lü pung kham dakpa gyumé lha ku"
    },
    {
      "bo": "ངག་རླུང་ཁམས་དག་པ་སྔགས་ཀྱི་རང་བཞིན། །",
      "en": "The pure wind-element of your speech is by nature the mantra,",
      "en-trans": "ngak lung kham dakpa ngak kyi rangzhin"
    },
    {
      "bo": "སེམས་དྲན་རིག་དག་པ་ཆོས་སྐུའི་དཀྱིལ་འཁོར། །",
      "en": "And the pure cognizance of your mind is the maṇḍala of dharmakāya,",
      "en-trans": "sem dren rik dakpa chökü kyilkhor"
    },
    {
      "bo": "དཔལ་མཉམ་མེད་འཇའ་ལུས་རྡོ་རྗེ་མཁྱེན་ནོ། །",
      "en": "Glorious and incomparable Jalü Dorje, watch over me!",
      "en-trans": "pal nyammé jalü dorjé khyen no"
    },
    {
      "bo": "སྔོན་ལས་ཉོན་དབང་གིས་སྲིད་པའི་བཙོན་རར། །",
      "en": "Imprisoned in conditioned existence by past actions and afflictions,",
      "en-trans": "ngön lé nyön wang gi sipé tsönrar"
    },
    {
      "bo": "ལས་བདེ་སྡུག་སྣ་ཚོགས་ཆུ་ཡི་གཉེར་མ། །",
      "en": "And buffeted by karma and the vicissitudes of joy and sorrow,",
      "en-trans": "lé deduk natsok chu yi nyerma"
    },
    {
      "bo": "གནས་གར་འགྲོ་འདིར་འགྲོ་རང་དབང་མེད་དུས། །",
      "en": "I lack the autonomy to proceed wherever I choose,",
      "en-trans": "né gar dro dir dro rangwang mé dü"
    },
    {
      "bo": "སྐྱབས་ཁྱོད་རྣམས་མ་གཏོགས་གཞན་ན་མེད་པས། །",
      "en": "And I have no other source of protection but you.",
      "en-trans": "kyab khyö nam ma tok zhen na mepé"
    },
    {
      "bo": "ཡིད་ཁྱེད་ཤེས་དད་པའི་སྙིང་ནས་གཏད་ན། །",
      "en": "As I place my sincere and trusting faith in you,",
      "en-trans": "yi khyé shé depé nying né té na"
    },
    {
      "bo": "བདག་ལས་ངན་འཁྲུལ་པའི་དབང་དུ་མ་གཏོང་། །",
      "en": "Do not allow me to succumb to misdeeds or delusion.",
      "en-trans": "dak lé ngen trulpé wang duma tong"
    },
    {
      "bo": "མགོན་ཁྱེད་ཀྱི་ཐུགས་རྗེ་ནམ་ཡང་མ་འདོར། །",
      "en": "O protector, never forsake me in your compassion",
      "en-trans": "gön khyé kyi tukjé namyang ma dor"
    },
    {
      "bo": "སྡུག་འདི་ནས་ཐར་པར་མཛོད་ཅིག་ཀྱེ་ཀྱེ། །",
      "en": "And help me to escape from this misery!Kyé! Kyé!",
      "en-trans": "duk di né tarpar dzö chik kyé kyé"
    },
    {
      "bo": "ཚེ་འདི་དང་ཕྱི་མ་བར་དོས་གཟིར་བའི། །",
      "en": "As I travel the five long and perilous pathways of being,",
      "en-trans": "tsé di dang chima bardö zirwé"
    },
    {
      "bo": "ལམ་རྒྱུད་ལྔའི་འཕྲང་རིང་གཡང་སར་འགྲིམ་ཚེ། །",
      "en": "Tormented throughout this life, the next, and the bardos,",
      "en-trans": "lam gyü ngé trang ring yangsar drim tsé"
    },
    {
      "bo": "སྐྱབས་སྐྱོབ་པའི་བློ་གཏད་གཞན་ན་མེད་པས། །",
      "en": "I have no one else to rely on for refuge and protection.",
      "en-trans": "kyab kyobpé lo té zhen na mepé"
    },
    {
      "bo": "གནས་འཁོར་བ་ངན་འགྲོའི་འཇིགས་ལས་སྒྲོལ་ཤིག །",
      "en": "Free me from the terrors of saṃsāra and its lower realms!",
      "en-trans": "né khorwa ngendrö jik lé drol shik"
    },
    {
      "bo": "གནས་དག་པའི་ཞིང་མཆོག་བདེ་བ་ཅན་དུ། །",
      "en": "To the supreme pure realm of Sukhāvatī, wherein",
      "en-trans": "né dakpé zhing chok dewachen du"
    },
    {
      "bo": "མགོན་ཨོ་རྒྱན་པདྨ་སྣང་མཐའ་དབྱེར་མེད། །",
      "en": "Lord Orgyen Padma and Amitābha are inseparable,",
      "en-trans": "gön orgyen pema nang ta yermé"
    },
    {
      "bo": "དཔལ་དྲིན་ཆེན་རྩ་བའི་བླ་མའི་ཐུགས་ཀློང་། །",
      "en": "The glorious and gracious root guru’s wisdom expanse—",
      "en-trans": "pal drinchen tsawé lamé tuk long"
    },
    {
      "bo": "བདག་རང་རིག་ཆོས་ཀྱི་དབྱིངས་སུ་འཕོ་ཤོག །",
      "en": "To this, the dharma-sphere of my own awareness, transfer me!",
      "en-trans": "dak rangrig chökyi ying su po shok"
    }
  ]
}