{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/patrul-rinpoche/katok-kubum-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་སྲས་ཞི་བ་ལྷ་དང་ཀཿཐོག་པ་དམ་གཙང་བྱམས་གསུམ་གྱི་གསོལ་འདེབས།",
    "en": "Prayer to Śāntideva and Dam, Tsang and Jam of Katok"
  },
  "text": [
    {
      "bo": "ཚེ་རབས་ཀུན་ཏུ་མགོན་པོ་འཇམ་དཔལ་དབྱངས། །",
      "en": "Throughout all your lives, you took the protector Mañjughoṣa",
      "en-trans": "tserab küntu gönpo jampal yang"
    },
    {
      "bo": "རིགས་ཀྱི་བདག་པོར་ཐོབ་ནས་འགྲོ་ཀུན་ལ། །",
      "en": "As the lord of your buddha family, and, for the sake of all,",
      "en-trans": "rik kyi dakpor tob né dro kün la"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པའི་ལམ་བཟང་གསལ་མཛད་པ། །",
      "en": "Illuminated the excellent path of a bodhisattva’s way of life—",
      "en-trans": "changchub chöpé lamzang sal dzepa"
    },
    {
      "bo": "རྒྱལ་སྲས་ཞི་བ་ལྷ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "To Śāntideva, heir of the victorious ones, I pay homage!",
      "en-trans": "gyalsé zhiwa lha la chaktsal lo"
    },
    {
      "bo": "མཉམ་མེད་གཙུག་གི་རྒྱན་གཅིག་ཀཿ་དམ་པ། །",
      "en": "Katok Dampa,1who was the sole crown-ornament without equal,",
      "en-trans": "nyammé tsuk gi gyen chik kadampa"
    },
    {
      "bo": "ཀུན་ཏུ་འོད་ཀྱི་ས་བརྙེས་གཙང་སྟོན་པ། །",
      "en": "Tsangtönpa,2who reached the level of Universal Illumination,3",
      "en-trans": "küntu ö kyi sa nyé tsang tönpa"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་དངོས་དཔལ་ལྡན་བྱམས་པ་འབུམ། །",
      "en": "And glorious Jampa Bum,4who was the omniscient one in person—",
      "en-trans": "tamché khyen ngö palden jampa bum"
    },
    {
      "bo": "བསྟན་པའི་འབྱུང་གནས་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three sources of the teachings, I pray!",
      "en-trans": "tenpé jungné sum la solwa deb"
    },
    {
      "bo": "ཡོངས་རྫོགས་བསྟན་པའི་མངའ་བདག་བསོད་ནམས་འབུམ། །",
      "en": "Sönam Bum,5who was a sovereign of all the teachings,",
      "en-trans": "yongdzok tenpé ngadak sönam bum"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་དགོངས་པ་མཐར་ཕྱིན་ཡེ་ཤེས་འབུམ། །",
      "en": "Yeshe Bum,6who reached consummate realization of generation and perfection,",
      "en-trans": "kyedzok gongpa tarchin yeshe bum"
    },
    {
      "bo": "གསད་གསོའི་བརྟུལ་ཞུགས་གྲུབ་པ་བྱང་ཆུབ་དཔལ། །",
      "en": "And Jangchub Pal,7who mastered the discipline of reviving the dead—",
      "en-trans": "sé sö tulzhuk drubpa changchub pal"
    },
    {
      "bo": "བསྟན་པའི་སྒྲོན་མེ་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three beacons of the teachings, I pray!",
      "en-trans": "tenpé drönmé sum la solwa deb"
    }
  ]
}