{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-khyentse-wangpo-kongtrul-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁྱེན་ཀོང་གཉིས་དང་རྩ་བའི་བླ་མའི་གསོལ་འདེབས། །",
    "en": "Prayer to Jamyang Khyentse Wangpo, Jamgön Kongtrul and Jamyang Khyentse Chökyi Lodrö"
  },
  "text": [
    {
      "bo": "འཇམ་དབྱངས་བླ་མ་མཁྱེན་བརྩེའི་དབང་པོ་ནི། །",
      "en": "Guru Mañjughoṣa, Khyentse Wangpo,",
      "en-trans": "jamyang lama khyentsé wangpo ni"
    },
    {
      "bo": "ངོ་མཚར་བཀའ་བབས་བདུན་གྱི་མངའ་བདག་མཆོག །",
      "en": "Supreme sovereign of the seven wondrous transmissions,",
      "en-trans": "ngotsar kabab dün gyi ngadak chok"
    },
    {
      "bo": "པདྨ་འོད་གསལ་མདོ་སྔགས་གླིང་པ་ལ། །",
      "en": "Pema Ösel Do-ngak Lingpa —",
      "en-trans": "pema ösal do ngak lingpa la"
    },
    {
      "bo": "མི་ཕྱེད་སྙིང་ནས་གུས་པས་གསོལ་བ་འདེབས། །",
      "en": "To you I pray with unwavering and heartfelt devotion.",
      "en-trans": "miché nying né güpé solwa deb"
    },
    {
      "bo": "དེ་ཡི་སྐུ་གསུང་ཐུགས་དང་ཡོན་ཏན་གྱི། །",
      "en": "The one who effortlessly accomplished all the activity",
      "en-trans": "dé yi ku sung tuk dang yönten gyi"
    },
    {
      "bo": "ཕྲིན་ལས་ཐམས་ཅད་འབད་མེད་སྒྲུབ་མཛད་པ། །",
      "en": "Of your enlightened body, speech, mind and qualities",
      "en-trans": "trinlé tamché bemé drub dzepa"
    },
    {
      "bo": "ལོ་ཆེན་རྣམ་སྣང་སྤྲུལ་པས་ལུང་ཐོབ་པའི། །",
      "en": "And who was prophesied as an emanation of Lochen Vairotsana—",
      "en-trans": "lochen namnang trulpé lung tobpé"
    },
    {
      "bo": "བློ་གྲོས་རྒྱ་མཚོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Lodrö Gyatso, at your feet I pray.",
      "en-trans": "lodrö gyatsö zhab la solwa deb"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་ཀྱི་དངོས་གྲུབ་མཆོག་བརྙེས་པ། །",
      "en": "One who received the supreme attainment of Mañjuśrīghoṣa,",
      "en-trans": "jampal yang kyi ngödrub chok nyepa"
    },
    {
      "bo": "བཀའ་གཏེར་དམ་པ་ཆོ༵༵ས་ཀྱི༵་མཛོད་འཛིན་ཅིང་། །",
      "en": "Who holds the sacred Dharma treasuries of kama and terma,",
      "en-trans": "kater dampa chö kyi dzö dzin ching"
    },
    {
      "bo": "བློ༵་གྲོ༵ས་ཆེན་པོས་གཞན་ལ་སྟོན་མཛད་པ། །",
      "en": "And who teaches others with great intelligence —",
      "en-trans": "lodrö chenpö zhen la tön dzepa"
    },
    {
      "bo": "དྲིན་ཅན་བླ་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Gracious Guru, at your feet I pray!",
      "en-trans": "drinchen lamé zhab la solwa deb"
    },
    {
      "bo": "འདི་ནས་བཟུང་སྟེ་བྱང་ཆུབ་མ་ཐོབ་བར། །",
      "en": "From now until I attain enlightenment,",
      "en-trans": "di né zung té changchub matob bar"
    },
    {
      "bo": "ཚེ་རབས་ཕྲེང་བ་ཀུན་ཏུ་རྗེས་འཛིན་ཅིང་། །",
      "en": "May you accept and care for me in all my lives to come.",
      "en-trans": "tserab trengwa küntu jedzin ching"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་ཡོན་ཏན་མཐར་ཕྱིན་ནས། །",
      "en": "And may I perfect the qualities of the paths and bhūmis,",
      "en-trans": "sa dang lam gyi yönten tarchin né"
    },
    {
      "bo": "བླ་མ་སྐུ་བཞིའི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །",
      "en": "And swiftly reach the level of the four-kāya guru.",
      "en-trans": "lama ku zhi gopang nyur tob shok"
    }
  ]
}