{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/protection-fears-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཆོས་ཉིད་མཁའ་འགྲོའི་གསང་མཛོད་ལས༔ གསོལ་འདེབས་དུས་ངན་འཇིགས་སྐྱོབ་བསམ་པ་མྱུར་འགྲུབ་མ་བཞུགས་སོ༔",
    "en": "from the Reality Ḍākinīs’ Secret Treasury"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་མ་ལུས་འདུས་པའི་དཔལ༔",
      "en": "Glorious embodiment of the victorious ones of the three times without exception,",
      "en-trans": "dü sum gyalwa malü düpé pal"
    },
    {
      "bo": "སངས་རྒྱས་ཀུན་ལས་ཐུགས་རྗེ་མྱུར་བའི་ལྷ༔",
      "en": "Deity whose compassion is swifter than all buddhas,",
      "en-trans": "sangye kün lé tukjé nyurwé lha"
    },
    {
      "bo": "འགྲོ་བའི་སྐྱབས་མགོན་ཨོ་རྒྱན་རིན་པོ་ཆེ༔",
      "en": "Protector and refuge of beings, Orgyen Rinpoche,",
      "en-trans": "drowé kyab gön orgyen rinpoche"
    },
    {
      "bo": "ལོག་འདྲེན་ཚར་གཅོད་རྡོ་རྗེ་ཐོད་ཕྲེང་རྩལ༔",
      "en": "Subduer of corrupting influences, Dorje Tötreng Tsal,",
      "en-trans": "lokdren tsarchö dorjé tötreng tsal"
    },
    {
      "bo": "གདུག་པ་འདུལ་མཛད་ཡང་ཁྲོས་གྲོ་བོ་ལོད༔",
      "en": "And tamer of malevolent ones, extremely wrathful Drolö,",
      "en-trans": "dukpa dul dzé yang trö drowolö"
    },
    {
      "bo": "མི་བཟོད་དུས་ཀྱི་གཡུལ་ངོ་འགྱེད་པའི་ཚེ༔",
      "en": "When I am confronted by the unbearable conflicts of these times,",
      "en-trans": "mi zö dü kyi yulngo gyepé tsé"
    },
    {
      "bo": "སྐྱབས་དང་རེ་ས་གཞན་ན་མ་མཆིས་པས༔",
      "en": "I have no other refuge or hope but you,",
      "en-trans": "kyab dang resa zhen nama chipé"
    },
    {
      "bo": "ཡིད་གཉིས་ཐེ་ཚོམ་མེད་པར་གསོལ་བ་འདེབས༔",
      "en": "So I offer this prayer without doubt or hesitation.",
      "en-trans": "yinyi tetsom mepar solwa deb"
    },
    {
      "bo": "མི་མངོན་དབྱིངས་ནས་ཐུགས་ཀྱིས་དགོངས་མཛོད་ལ༔",
      "en": "From the imperceptible expanse, direct your wisdom towards us.",
      "en-trans": "mi ngön ying né tuk kyi gong dzö la"
    },
    {
      "bo": "མཐའ་དམག་དུས་འཁྲུགས་མཚོན་གྱི་བསྐལ་པ་བཟློག༔",
      "en": "Avert the age of foreign invasion, conflicts and weapons.",
      "en-trans": "tamak dü truk tsön gyi kalpa dok"
    },
    {
      "bo": "ལོ་ཉེས་སད་སེར་མུ་གེའི་འཇིགས་པ་སྐྱོབས༔",
      "en": "Protect us from the threat of failed harvests, frost, hail, and famine.",
      "en-trans": "lonyé sé ser mugé jikpa kyob"
    },
    {
      "bo": "མི་ཕྱུགས་ལ་འཚེ་ནད་དང་སྡུག་བསྔལ་སོལ༔",
      "en": "Dispel diseases and suffering that afflict both humans and livestock.",
      "en-trans": "mi chuk la tsé né dang dukngal sol"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་དང་བསྟན་འཛིན་ལ་གནོད་པའི༔",
      "en": "For those who harm the Buddha's teaching and its upholders,",
      "en-trans": "gyalwé ten dang tendzin la nöpé"
    },
    {
      "bo": "རྒྱ་འདྲེ་འབྱུང་པོ་མི་དང་མི་མིན་གདོན༔",
      "en": "Foreign demons, elemental spirits and human and non-human evildoers,",
      "en-trans": "gyadré jungpo mi dang mi min dön"
    },
    {
      "bo": "མ་རུངས་བསྟན་ལ་འཚེ་བྱེད་དམ་སྲིའི་རིགས༔",
      "en": "And the malignant samaya-breakers who would harm the teachings,",
      "en-trans": "marung ten la tsé jé damsi rik"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པའི་མཐུ་རྩལ་མ་ནན་པར༔",
      "en": "Do not hold back the might of your wisdom, love, and power.",
      "en-trans": "khyen tsé nü pé tutsal manenpar"
    },
    {
      "bo": "ཐམས་ཅད་བཟློག་ཅིང་བཏུལ་བའི་དུས་ལ་བབས༔",
      "en": "The time has come to repel and subdue them all.",
      "en-trans": "tamché dok ching tulwé dü la bab"
    },
    {
      "bo": "འདི་ཕྱིའི་མི་མཐུན་ཉེར་འཚེ་ཀུན་ཞི་ནས༔",
      "en": "Grant your blessings, so that all adversity and dangers in this and future lives may be dispelled,",
      "en-trans": "di chi mitün nyertsé kün zhi né"
    },
    {
      "bo": "བྱང་ཆུབ་སྒྲུབ་ལ་བར་ཆད་མི་འབྱུང་ཞིང༔",
      "en": "No obstacles may arise to our accomplishment of enlightenment.",
      "en-trans": "changchub drub la barché minjung zhing"
    },
    {
      "bo": "བསམ་དོན་མྱུར་དུ་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔",
      "en": "And all our aims and wishes may be swiftly fulfilled!",
      "en-trans": "samdön nyurdu drubpar jingyi lob"
    },
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ་བཛྲ་གུ་རུ་པདྨ་སིདྡྷི་ཧཱུྃ༔",
      "en": "oṃ āh hūṃ vajra guru padma siddhi hūṃ",
      "en-trans": "om ah hung benza guru pema siddhi hung"
    }
  ]
}