{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shabkar/happiness-wellbeing-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་ཁམས་བདེ་ཞིང་སྐྱིད་པའི་གསོལ་འདེབས།",
    "en": "Prayer for Happiness and Well-Being Throughout the Land"
  },
  "text": [
    {
      "bo": "བླ་མ་དཀོན་མཆོག་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To the guru and the Three Jewels, I pray:",
      "en-trans": "lama könchok sum la solwa deb"
    },
    {
      "bo": "ཆར་ཆུ་དུས་སུ་འབབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that the rains may always fall on time.",
      "en-trans": "charchu dü su babpar jingyi lob"
    },
    {
      "bo": "ལོ་ཕྱུགས་རྟག་ཏུ་ལེགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that harvests may always be bountiful and livestock always prosper.",
      "en-trans": "lo chuk taktu lekpar jingyi lob"
    },
    {
      "bo": "མི་ནད་ཕྱུགས་ནད་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that disease among human beings and livestock may be pacified.",
      "en-trans": "miné chukné zhiwar jingyi lob"
    },
    {
      "bo": "དུས་འཁྲུག་མུ་གེ་མེད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that the conflicts and famines of this age may be no more.",
      "en-trans": "dü truk mugé mepar jingyi lob"
    },
    {
      "bo": "དགྲ་ཇག་ཆོམ་རྐུན་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that enemies, bandits, and robbers may be subdued.",
      "en-trans": "dra jak chomkün zhiwar jingyi lob"
    },
    {
      "bo": "སད་སེར་ཐན་པ་མེད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that there may be an end to frost, hail and drought.",
      "en-trans": "sé ser tenpa mepar jingyi lob"
    },
    {
      "bo": "རྒྱལ་ཁམས་བདེ་ཞིང་སྐྱིད་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so that happiness and well-being may reign throughout the land!",
      "en-trans": "gyalkham dé zhing kyipar jingyi lob"
    }
  ]
}