{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/samten-lingpa/prayer-lives-and-liberation-of-mandarava",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "ཌཱ་ཀིའི་གཙོ་མོ་མནྡྷ་ར་བའི་རྣམ་ཐར་གསོལ་འདེབས། །"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔ སྔོན་ཚེ་བསྐལ་པ་སྣང་བྱེད་རྒྱལ་པོ་ནི༔"
    },
    {
      "bo": "དབང་ཕྱུག་ལྷ་ཡི་སྲས་མོ་གོས་དཀར་མོ༔"
    },
    {
      "bo": "ལམ་སྦྱངས་འཁོར་བ་སྤངས་ནས་མངོན་སངས་རྒྱས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "དེ་འོག་བསྐལ་པ་རིན་ཆེན་བརྡལ་བ་ན༔"
    },
    {
      "bo": "བྲམ་ཟེའི་རྒྱལ་རིགས་སྲས་མོ་གར་དབང་སྤྲུལ༔"
    },
    {
      "bo": "ཉི་མའི་སྙིང་པོའི་རྒྱལ་སྲིད་ཆོས་ལ་བཀོད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "བསྐལ་པ་སྒྲོན་མེད་གསེར་ཐུབ་བསྟན་པ་ལ༔"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་རྣམས་ཀྱིས་བྱིན་བརླབས་ནས༔"
    },
    {
      "bo": "སྐུ་ལྔའི་རང་བཞིན་གདུལ་བྱའི་གླིང་ལྔར་སྤྲོས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "དབང་ཆེན་ཡབ་ཡུམ་སྲས་མོར་སྐུ་འཁྲུངས་ནས༔"
    },
    {
      "bo": "འོད་ཟེར་སྣང་བརྒྱན་ཞེས་གྱུར་རྒྱ་གར་གྱི༔"
    },
    {
      "bo": "ཀ་ཎི་ཀ་ཡི་ཡུལ་ཁམས་ཆོས་ལ་བཀོད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "འཕགས་པས་བྱིན་བརླབས་མུན་གླིང་ཌཱ་མ་རུར༔"
    },
    {
      "bo": "པདྨ་སྐྱེས་སྤྲུལ་རྟ་མགྲིན་གྲོགས་སུ་བཀུག༔"
    },
    {
      "bo": "ཞི་དང་དྲག་པོས་རྒྱལ་ཁམས་དཀར་པོར་བསྒྱུར༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ལྷ་ཡུལ་བརྒྱ་བྱིན་གནས་སུ་ཀཾ་ཀ་རི༔"
    },
    {
      "bo": "དམ་པ་ཏོག་དཀར་མར་གྱུར་ལྷ་མིན་དཔུང་ཚོགས་བརྟུལ༔"
    },
    {
      "bo": "གཡུལ་འཇོམས་ཞེས་གྲགས་ལྷ་ཁམས་སངས་རྒྱས་བསྒྱུར༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "འོག་ཕྱོགས་རི་བོ་ནོར་བུའི་རྩེ་མོ་རུ༔"
    },
    {
      "bo": "ཀླུ་མོར་སྤྲུལ་ཏེ་ཀླུ་ཡི་ནད་ཀུན་བསལ༔"
    },
    {
      "bo": "དྷརྨིན་དྲ་ཞེས་ཀླུ་རྣམས་བྱང་ཆུབ་བཀོད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ལྷ་མིན་སྲས་མོར་སྤྲུལ་པའི་དཔུང་ཚོགས་ཀུན༔"
    },
    {
      "bo": "གདུག་པའི་ཕྲག་དོག་ཐུལ་བས་ཀུན་བཟང་མོར༔"
    },
    {
      "bo": "གྲགས་ཏེ་ལྷ་མིན་བདུད་ཚོགས་སྨིན་གྲོལ་བཀོད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "འོད་སྲུང་དྲུང་དུ་བྱང་ཆུབ་མཆོག་བརྙེས་པ༔"
    },
    {
      "bo": "རྒྱལ་པོ་བདེ་སྐྱོང་སྲས་མོར་དཔལ་མཚོར་སྤྲུལ༔"
    },
    {
      "bo": "དགེ་སློང་མ་ནི་འབུམ་ཕྲག་རྫོགས་བྱང་ཐོབ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཤཱཀ་ཐུབ་བསྟན་པར་སྤྲུལ་པ་ཉི་ཤུ་ལྔ༔"
    },
    {
      "bo": "དེ་ལས་ཡང་སྤྲུལ་བསམ་མི་ཁྱབ་པར་མཛད༔"
    },
    {
      "bo": "གསང་སྔགས་ཐེག་པའི་གྲོལ་ལམ་སྒོ་ཀུན་ཕྱེས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "དེ་ནས་ནུབ་ཕྱོགས་བདེ་ཆེན་ཞིང་ཁམས་ནས༔"
    },
    {
      "bo": "གསང་སྔགས་སྟོན་པ་བྱེ་བ་ཕྲག་འབུམ་སྤྲུལ༔"
    },
    {
      "bo": "དེ་དང་མཉམ་པའི་མཁའ་འགྲོའི་སྐུ་རེ་སྤྲུལ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཚེ་དཔག་ཡུམ་མཆོག་གོས་དཀར་གནས་ལྔའི་འོད༔"
    },
    {
      "bo": "ཞིང་ཁམས་ཀུན་སྤྲོས་དབྱིངས་ཕྱུག་རིགས་ལྔའི་སྤྲུལ༔"
    },
    {
      "bo": "བྱིན་བརླབས་ཧྲཱིཿཡིག་ཟ་ཧོར་ཡུལ་དུ་འཕྲོས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཡབ་ཡུམ་གཟིགས་སྣང་རྨི་ལམ་ངོ་མཚར་བལྟས༔"
    },
    {
      "bo": "བསམ་མི་ཁྱབ་པ་ཤིང་ཕོ་རྟ་ཟླ་ཡི༔"
    },
    {
      "bo": "ཚེས་བཅུར་སྐུ་འཁྲུངས་ཞལ་ནས་དབྱངས་གསལ་སྒྲོགས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "འཁྲུངས་མ་ཐག་ནས་ཡབ་ཡུམ་དྲིན་ཕྱག་འཚལ༔"
    },
    {
      "bo": "སྙན་པའི་ཀླུ་ཡིས་འཁོར་བར་དགྱེས་པར་སྐྱེད༔"
    },
    {
      "bo": "ལྷ་ཡི་ཁྲུས་གསོལ་སྙན་པས་འཇིག་རྟེན་ཁྱབ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སྐྱེ་རྒ་ན་འཆིའི་སྡུག་བསྔལ་གཟིགས་པ་ཡིས༔"
    },
    {
      "bo": "སྐྱོ་ཤས་དྲག་པོས་འཁོར་བར་བློ་ལྡོག་སྟེ༔"
    },
    {
      "bo": "དམ་ཆོས་རིག་པའི་གནས་ལྔར་མཁས་པར་སྦྱངས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སློབ་དཔོན་དྲི་མེད་ཕག་མོས་ལུང་བསྟན་བཞིན༔"
    },
    {
      "bo": "གོ་ཏ་མ་ཡི་མུ་སྟེགས་ཁྱབ་བསལ་དུ༔"
    },
    {
      "bo": "རྩོད་པ་འགྲན་པས་མུ་སྟེགས་རྒོལ་བ་བཅོམ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཟ་ཧོར་བུ་མོ་སུམ་བརྒྱ་ཆོས་ལ་བསྐུལ༔"
    },
    {
      "bo": "དཔལ་སྡེ་ཚེ་འདས་ཡབ་ཡུམ་སྡུག་བསྔལ་བསལ༔"
    },
    {
      "bo": "བྲམ་ཟེའི་ཤ་རྙེད་རྟེན་གྱི་གཙོ་བོར་བཟུང་༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "བེ་ཏ་ཟ་ཧོར་འཁྲུགས་པ་ཐབས་ཀྱིས་བསྡུམ༔"
    },
    {
      "bo": "གོས་དཀར་ལུང་བསྟན་འཁོར་གཡོག་ཆོས་ལ་བཙུད༔"
    },
    {
      "bo": "འཁོར་བར་སྐྱོ་བའི་ཐུགས་བསྐྱེད་སྨོན་ལམ་བཏབ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཕྱོགས་ཀྱི་མཉེ་མོ་སློང་ཏེ་ཡབ་དང་བསྒྲོས༔"
    },
    {
      "bo": "འཁོར་བར་མི་ཆགས་རྡོར་སེམས་ལུང་བསྟན་ཐོབ༔"
    },
    {
      "bo": "ཐབས་ཀྱི་བྲོས་ཏེ་མཁན་པོར་རབ་ཏུ་བྱུང་༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "མདོ་ཆོས་ཀུན་སྦྱངས་ཁོལ་མོ་ལྔ་བརྒྱ་བཅས༔"
    },
    {
      "bo": "ཀུན་དགའ་ར་བར་སྡེ་སྣོད་འཆད་སྤེལ་མཛད༔"
    },
    {
      "bo": "པད་འབྱུང་སྤྲུལ་པས་བྱིན་བརླབས་ལུང་བསྟན་ཐོབ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སྐྱོ་སངས་བྱོན་པས་ཨོ་རྒྱན་དངོས་དང་མཇལ༔"
    },
    {
      "bo": "གདན་དྲངས་ཆོས་ཞུས་ཚེ་ན་བ་རྫིས་མཐོང་།"
    },
    {
      "bo": "སྐུར་འདེབས་ལ་ཡོག་རྒྱལ་པོས་ཆད་པ་ཕོག༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "པད་འབྱུང་གསོན་བསྲེགས་ཞུས་ཀྱང་རྫུ་འཕྲུལ་བསྟན༔"
    },
    {
      "bo": "རྒྱལ་བློན་གནོང་འགྱོད་ཡབ་ཡུམ་ལྷན་ཅིག་བཞུགས༔"
    },
    {
      "bo": "ཡབ་ཀྱིས་ཨོ་རྒྱན་ལྷ་ལྕམ་ཕུལ་བར་མཛད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཟ་ཧོར་རྒྱལ་ཁམས་ཕོ་རྣམས་ཨོ་རྒྱན་བསྐོར༔"
    },
    {
      "bo": "མོ་རྣམས་ལྷ་ལྕམ་ཆོས་བསྟན་ཐམས་ཅད་གྲོལ༔"
    },
    {
      "bo": "སློབ་དཔོན་གདམས་པས་ལྷ་ལྕམ་རབ་ཏུ་སྨིན༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཆོས་བྲོས་བརྡ་ཆོས་མཐོང་ནས་པད་འབྱུང་དང་༔"
    },
    {
      "bo": "ལྷན་ཅིག་བྲག་ཕུག་མཱ་ར་ཏི་ཀར་བྱོན༔"
    },
    {
      "bo": "འཆི་མེད་ཚེ་ཡི་རིག་འཛིན་མངོན་དུ་བསྒྲུབ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ཀོ་ཏ་ལ་ཡུལ་རྫུ་འཕྲུལ་ཐབས་ཀྱིས་བརྟུལ༔"
    },
    {
      "bo": "མུ་སྟེགས་སྟོན་པའི་མཐུ་ལས་རབ་ཏུ་རྒྱལ༔"
    },
    {
      "bo": "ཡོངས་འདུའི་ཚལ་དུ་བགེགས་ཚོགས་དམ་ལ་བཞག༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "པད་འབྱུང་ལུང་བསྟན་ཀོའུ་མ་རི་ལ་བྱོན༔"
    },
    {
      "bo": "སྲིན་པོ་ཕོ་མོ་ཐམས་ཅད་ཆོས་ལ་བཀོད༔"
    },
    {
      "bo": "འཇའ་ལུས་འགྲུབ་སྟེ་ཡུལ་ཁམས་སྟོང་པར་སྒྱུར༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "རྔམ་པ་ཚལ་ཆེན་ལ་སོགས་ཡུལ་ཆེན་བརྒྱད༔"
    },
    {
      "bo": "ཀཱི་ལ་སྒྲོགས་སོགས་ཡུལ་ཆུང་བརྒྱད་རྣམས་སུ༔"
    },
    {
      "bo": "སྐུ་ཡི་རྫུ་འཕྲུལ་ཆེ་བརྒྱད་ཆུང་བརྒྱད་བསྟན༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "དེ་ནས་པད་འབྱུང་ཡབ་ཡུམ་ལྷན་ཅིག་ཏུ༔"
    },
    {
      "bo": "ཨོ་རྒྱན་ཡུལ་བྱོན་ལོག་ལྟ་ཐབས་ཀྱིས་བསྣུབས༔"
    },
    {
      "bo": "ཆོས་འཁོར་བསྐོར་བས་ལྷག་མེད་འཇའ་སྐུར་གྲོལ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "གུ་རུའི་ལུང་བསྟན་ཤམ་བྷ་ལ་རུ་བྱོན༔"
    },
    {
      "bo": "གླིང་ཆེན་ཉེར་ལྔ་རྫུ་འཕྲུལ་ཁོ་ནས་བརྟུལ༔"
    },
    {
      "bo": "སྐལ་ལྡན་འབུམ་ཕྲག་བཅུ་གསུམ་འཇའ་སྐུར་གྲོལ༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "དེ་ནས་བྷེ་བྱེད་གཡའ་རིའི་རྩེ་མོར་བྱོན༔"
    },
    {
      "bo": "གདམས་པ་ལྷག་མ་མ་ལུས་རྫོགས་པར་གནང་༔"
    },
    {
      "bo": "སྤྲུལ་པའི་ཨུཏྤལ་དཀར་དམར་བལ་བོད་སྤྲོས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "ལྷག་མེད་འཇའ་སྐུར་ནམ་མཁའི་ཀློང་དུ་ཡལ༔"
    },
    {
      "bo": "འོག་མིན་པདྨོ་བཀོད་དུ་རབ་གཤེགས་ནས༔"
    },
    {
      "bo": "ཡུམ་མཆོག་གསང་བ་ཡེ་ཤེས་སྐུ་རུ་གྱུར༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "སློབ་འབངས་རིག་འཛིན་དགུ་བརྒྱ་ལྷན་ཅིག་ཏུ༔"
    },
    {
      "bo": "འཇའ་སྐུར་ཐིམ་ནས་སྤྲུལ་པས་དོན་བྱེད་གྱུར༔"
    },
    {
      "bo": "གང་འདུལ་མཁའ་འགྲོའི་སྤྲུལ་པ་རྒྱུན་མ་འཆད༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "བདེ་བ་ཅན་དུ་གོས་དཀར་གསང་ཡེ་ཡུམ༔"
    },
    {
      "bo": "མཁའ་སྤྱོད་གནས་སུ་གར་གྱི་དབང་མོར་གྲགས༔"
    },
    {
      "bo": "ཟ་ཧོར་ཡུལ་དུ་དུང་སྨན་དཀར་མོ་ཞེས༔"
    },
    {
      "bo": "མནྡྷ་ར་བའི་ཞབས་ལ་གསོལ་བ་འདེབས༔"
    },
    {
      "bo": "བདག་སོགས་སྐྱེ་དང་ཚེ་རབས་ཐམས་ཅད་དུ༔"
    },
    {
      "bo": "ཡུམ་མཆོག་ཌཱ་ཀྐི་ཁྱོད་དང་མི་འབྲལ་ཞིང་༔"
    },
    {
      "bo": "གནས་སྐབས་མཐར་ཐུག་འཇིགས་པ་ཀུན་གྲོལ་ཏེ༔"
    },
    {
      "bo": "རྣམ་ཐར་འགྲུབ་ནས་མངོན་སངས་རྒྱས་པར་མཛོད༔"
    },
    {
      "bo": "མི་མཐུན་ཀུན་ཞི་བར་ཆད་མ་ལུས་ཞི༔"
    },
    {
      "bo": "བསམ་དོན་མྱུར་འགྲུབ་གཞན་དོན་མཐར་ཕྱིན་ནས༔"
    },
    {
      "bo": "འཁོར་བའི་གནས་སྟོང་རྒྱལ་ཡུམ་གོ་འཕང་ལ༔"
    },
    {
      "bo": "འགོད་པའི་མཐུ་ནུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔"
    }
  ]
}