{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-gyalwa-yangonpa",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྒྱལ་བ་ཡང་དགོན་པ་ལ་གསོལ་བ་འདེབས་པ་ཐར་པའི་དེད་དཔོན་ཞེས་བྱ་བ།"
  },
  "text": [
    {
      "bo": "བླ་མ་ཐུགས་རྗེ་ཅན་ལ་ཕྱག་འཚལ་ལོ།    །"
    },
    {
      "bo": "ངེས་འབྱུང་ཆེན་པོས་སྲིད་ལས་རབ་བརྒལ་ནས།    །"
    },
    {
      "bo": "ཡོངས་འཛིན་དགེ་བའི་བཤེས་ཀྱི་རྗེས་སུ་བཟུང་།    །"
    },
    {
      "bo": "ཉོན་མོངས་ཟག་པ་ཐམས་ཅད་སྤངས་པ་ཡི།    །"
    },
    {
      "bo": "དགྲ་བཅོམ་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "གཞན་ཕན་བྱང་ཆུབ་སེམས་གྱི་ཐུགས་རྒྱུད་གཏམས།    །"
    },
    {
      "bo": "བདག་བས་གཞན་གཅེས་འབྱོངས་བས་རང་སྲོག་ཀྱང་།    །"
    },
    {
      "bo": "སེམས་ཅན་དོན་ཕྱིར་གཏོང་ལ་མི་ཞུམ་པ།    །"
    },
    {
      "bo": "རྒྱལ་སྲས་སེམས་དཔའ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དབང་བཞིས་ལམ་གྱི་རྒྱུད་བཞི་རབ་སྦྱངས་ཤིང་།    །"
    },
    {
      "bo": "དམ་ཚིག་སྡོམ་པ་སྲོག་ལྟར་གཅེས་པར་བསྐྱངས།    །"
    },
    {
      "bo": "བདག་གཞན་སྣོད་བཅུད་དཀྱིལ་འཁོར་བཞི་རུ་ཤར།    །"
    },
    {
      "bo": "རྡོ་རྗེ་འཛིན་པ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཕྱི་ལྟར་ཉན་ཐོས་འདུལ་བའི་སྤྱོད་པ་བསྐྱངས།    །"
    },
    {
      "bo": "ནང་དུ་འགྲོ་ཀུན་ཕ་མར་ཤེས་པས་སྒྲོལ།    །"
    },
    {
      "bo": "གསང་བ་ལྷན་སྐྱེས་བདེ་ཆེན་རྡོ་རྗེའི་བདག  །"
    },
    {
      "bo": "སྡོམ་གསུམ་ལྡན་པ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཁྱེན་པས་ཤེས་བྱའི་ཆོས་ཀུན་མངོན་སུམ་གཟིགས།    །"
    },
    {
      "bo": "བརྩེ་བས་དམྱལ་མེ་བཟོད་དཀར་འཇུག་པར་སྤྲོ།    །"
    },
    {
      "bo": "ནུས་པས་ཕྱི་ནང་གསང་བའི་བདུད་ཚོགས་བཅོམ།    །"
    },
    {
      "bo": "རིགས་གསུམ་འདུས་ཞལ་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཁས་པའི་ཚོགས་ཀྱི་དབུས་ན་སྤོབས་པ་མཐོ།    །"
    },
    {
      "bo": "གྲུབ་ཐོབ་རྣལ་འབྱོར་ཀུན་གྱི་དབུས་ན་བརྗིད།    །"
    },
    {
      "bo": "བཟང་པོའི་མཛད་པའི་གྲགས་སྙན་རིང་འཕྲོ་བ།    །"
    },
    {
      "bo": "རྒྱལ་མཚན་དཔལ་བཟང་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བླུན་སྒོམ་ཡིད་དཔྱོད་ལས་འདས་ཕྱག་རྒྱ་བཞིའི།    །"
    },
    {
      "bo": "རྟོགས་པ་ཇི་བཞིན་མངོན་དུ་གྱུར་པ་ལས།    །"
    },
    {
      "bo": "རྩ་ཡི་མདུད་གྲོལ་ས་ལམ་མཐར་ཕྱིན་པའི།    །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བདག་ནི་ཁྱེད་ལ་མི་ཕྱེད་དད་པའི་མཐུས།    །"
    },
    {
      "bo": "གཅམ་བུའི་ཚིག་སྤངས་སྙིང་ནས་གསོལ་བཏབ་པས།    །"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ཀྱི་རྣམ་ཐར་མ་ལུས་པ།    །"
    },
    {
      "bo": "བདག་གི་ཡོངས་སུ་རྫོགས་པར་བྱིན་གྱིས་རློབས།    །"
    }
  ]
}