{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/dilgo-khyentse/jamyang-khyentse-biographical-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཇམ་མགོན་བླ་མའི་རྣམ་ཐར་གསོལ་འདེབས་སྙིང་པོ་ངོ་མཚར་བདུད་རྩིའི་ཉིང་ཁུ་བཞུགས་སོ།    །",
    "en": "The Quintessence of Marvellous Nectar"
  },
  "text": [
    {
      "bo": "ཆོས་དབྱིངས་ཀུན་ཁྱབ་མཁྱེན་གཉིས་ཡེ་ཤེས་སེམས།    །",
      "en": "Wisdom embodiment of twofold omniscience pervading the dharmadhātu,",
      "en-trans": "chöying künkhyab khyen nyi yeshe sem"
    },
    {
      "bo": "དག་པའི་ཞིང་ཀུན་སྒྱུ་འཕྲུལ་རྒྱ་མཚོའི་དཔལ།    །",
      "en": "Resplendent amidst an ocean of illusory forms in all the pure realms,",
      "en-trans": "dakpé zhing kün gyutrul gyatsö pal"
    },
    {
      "bo": "བདག་སོགས་འདུལ་ཕྱིར་འཁོར་ལོའི་དབང་ཕྱུག་ཚུལ།    །",
      "en": "You appeared in the form of a lord of the maṇḍala to tame the likes of me—",
      "en-trans": "dak sok dul chir khorlö wangchuk tsul"
    },
    {
      "bo": "འཇམ་དབྱངས་ཆོས་ཀྱི་བློ་གྲོས་གསོལ་བ་འདེབས།    །",
      "en": "Jamyang Chökyi Lodrö, to you I pray.",
      "en-trans": "jamyang chökyi lodrö solwa deb"
    },
    {
      "bo": "འཕགས་བོད་བསྟན་པའི་ཤིང་རྟ་བསྒྲངས་ཡས་ཀྱི།    །",
      "en": "Khyentse Wangpo was the embodiment of the universal wisdom",
      "en-trans": "pak bö tenpé shingta drang yé kyi"
    },
    {
      "bo": "ཡེ་ཤེས་སྤྱི་གཟུགས་མཁྱེན་བརྩེའི་དབང་པོ་ཉིད།    །",
      "en": "Of countless charioteers of the teachings from the Land of Āryas and Tibet.",
      "en-trans": "yeshe chizuk khyentsé wangpo nyi"
    },
    {
      "bo": "བསམ་བཞིན་བསྟན་འགྲོའི་དཔལ་དུ་སྐུ་སྤྲུལ་ནས།    །",
      "en": "You were his intentional emanation, a splendour of the teachings and beings,",
      "en-trans": "samzhin ten drö pal du ku trul né"
    },
    {
      "bo": "རྡོ་རྗེའི་ལུང་གིས་བསྔགས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Praised in vajra prophecies—to you I pray.",
      "en-trans": "dorjé lung gi ngak la solwa deb"
    },
    {
      "bo": "རྡོ་རྗེ་གདན་དངོས་ཀཿཐོག་ཆོས་ཀྱི་ཁྲིར།    །",
      "en": "You were installed on the dharma throne at Katok, the true Vajra Seat,",
      "en-trans": "dorjé den ngö kah tok chö kyi trir"
    },
    {
      "bo": "ཞབས་པད་བཀོད་ཅིང་ཀུན་གཟིགས་ཆོས་རྒྱ་མཚོས།    །",
      "en": "And the all-seeing Chökyi Gyatso1",
      "en-trans": "zhabpé kö ching künzik chö gyatsö"
    },
    {
      "bo": "སྡོམ་པ་གསུམ་གྱི་ཐེག་མཆོག་རྒྱལ་ཐབས་བཀོད།    །",
      "en": "Invested you with the supreme vehicle’s sovereignty of the three sets of vows.",
      "en-trans": "dompa sum gyi tek chok gyaltab kö"
    },
    {
      "bo": "གསན་བསམ་རྣམ་ཐར་རྒྱས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "To you, in whom liberating study and contemplation flourished, I pray.",
      "en-trans": "sen sam namtar gyé la solwa deb"
    },
    {
      "bo": "ཕྱི་ནང་རིག་པའི་གནས་ཀུན་ཐུགས་སུ་ཆུད།    །",
      "en": "You mastered all the outer and inner fields of knowledge,",
      "en-trans": "chinang rigpé né kün tuk su chü"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་པས་དག་པའི་རྣམ་ཐར་བསྐྱངས།    །",
      "en": "And maintained a pure life of exposition, debate and composition.",
      "en-trans": "ché tsö tsompé dakpé namtar kyang"
    },
    {
      "bo": "སྨིན་གྲོལ་ཆོས་ཀྱི་འབྱུང་གནས་བསྟན་མཆོག་གི།",
      "en": "Source of maturing and liberating Dharma, sole charioteer",
      "en-trans": "mindrol chö kyi jungné ten chok gi"
    },
    {
      "bo": "ཤིང་རྟ་གཅིག་པུར་གྱུར་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Of the supreme teachings, to you I pray.",
      "en-trans": "shingta chikpur gyur la solwa deb"
    },
    {
      "bo": "རིམ་གཉིས་ཏིང་འཛིན་ཡོན་ཏན་མངའ་དབང་འབྱོར།    །",
      "en": "You mastered the qualities of two-stage samādhi,",
      "en-trans": "rim nyi tingdzin yönten nga wangjor"
    },
    {
      "bo": "གཟུངས་དང་སྤོབས་པའི་གཏེར་མཛོད་དངོས་སུ་གྲོལ།    །",
      "en": "And unlocked a treasury of mnemonic retention (dhāraṇī) and courageous eloquence.",
      "en-trans": "zung dang pobpé terdzö ngö su drol"
    },
    {
      "bo": "ཟབ་རྒྱས་མདོ་རྒྱུད་གསང་བ་གཟིགས་པས་རྟོགས།    །",
      "en": "You saw the secret of the sūtras and tantras, profound and vast, and gained realization.",
      "en-trans": "zabgyé dogyü sangwa zikpé tok"
    },
    {
      "bo": "འཛིན་སྤེལ་སྡུད་པའི་བྱེད་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Master of upholding, propagating and gathering, to you I pray.",
      "en-trans": "dzin pel düpé jepor solwa deb"
    },
    {
      "bo": "བཀའ་གདམས་གསར་རྙིང་ལམ་འབྲས་མར་ཤངས་ཀྱི།    །",
      "en": "The teachings of the old and new Kadam, Lamdré, Marpa and Shangpa Kagyü,",
      "en-trans": "kadam sar nying lamdré mar shang kyi"
    },
    {
      "bo": "བཀའ་བརྒྱུད་ཞི་གཅོད་ཇོ་ཞལ་དུས་འཁོར་ལོ།    །",
      "en": "Pacifying (Zhijé), Severance (Chöd), Jonang and Zhalu Kālacakra,",
      "en-trans": "kagyü zhi chö jo zhal dükhor lo"
    },
    {
      "bo": "སྔ་འགྱུར་བཀའ་གཏེར་ཡོངས་རྫོགས་ལེགས་གསན་ཅིང་།    །",
      "en": "And the kama and terma of the Ancient Translations—you masterfully studied them all.",
      "en-trans": "ngagyur kater yongdzok lek sen ching"
    },
    {
      "bo": "གངས་ཅན་ཁྱབ་པར་སྤེལ་ལ་གསོལ་བ་འདེབས།    །",
      "en": "To you, who then disseminated them throughout the Land of Snows, I pray.",
      "en-trans": "gangchen khyabpar pel la solwa deb"
    },
    {
      "bo": "དོན་གྱི་སྤངས་རྟོགས་འཕགས་པའི་གོ་འཕང་བརྙེས།    །",
      "en": "In reality, through elimination and realization, you attained the level of an ārya.",
      "en-trans": "dön gyi pang tok pakpé gopang nyé"
    },
    {
      "bo": "ཚུར་མཐོང་མཛད་པ་ཆོས་དང་མཐུན་པར་སྟོན།    །",
      "en": "For those of limited vision, you displayed acts in accordance with the Dharma.",
      "en-trans": "tsur tong dzepa chö dang tünpar tön"
    },
    {
      "bo": "ཆོས་བརྒྱད་བསྙེམས་བྲལ་རེ་དོགས་མདུད་པ་གྲོལ།    །",
      "en": "Uninvolved in the eight worldly concerns, you untied the knots of hope and fear.",
      "en-trans": "chö gyé nyemdral redok düpa drol"
    },
    {
      "bo": "འཁྲུལ་ཞིག་རྣལ་འབྱོར་དབང་ཕྱུག་གསོལ་བ་འདེབས།    །",
      "en": "Delusion-conquering lord of yogins, to you I pray.",
      "en-trans": "trulzhik naljor wangchuk solwa deb"
    },
    {
      "bo": "རྩ་གསུམ་ལྷ་ཡི་དགྱེས་ཞལ་དུས་ཀུན་གཟིགས།    །",
      "en": "You continually beheld the smiling faces of the deities of the Three Roots.",
      "en-trans": "tsa sum lha yi gyé zhal dü künzik"
    },
    {
      "bo": "ཆོས་ཀྱི་སྒོ་གཏད་བྱིན་བརླབས་རྒྱུན་བསྙེན་པས།    །",
      "en": "Through the doors of Dharma, entrustment, blessings and regular recitation,",
      "en-trans": "chö kyi go té jinlab gyün nyenpé"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་བསྟན་འགྲོའི་རྒུད་སེལ་བའི།    །",
      "en": "You spontaneously accomplished the twofold benefit, like a great sun",
      "en-trans": "dön nyi lhündrub ten drö gü selwé"
    },
    {
      "bo": "ཕན་བདེའི་ཉིན་བྱེད་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Of benefit and happiness banishing troubles for the teachings and beings—to you I pray.",
      "en-trans": "pendé nyinjé chenpor solwa deb"
    },
    {
      "bo": "ཀུན་བཟང་རྡོ་རྗེའི་རྣམ་ཐར་མཐར་སོན་ཏེ།    །",
      "en": "When you reached the end of your ever-perfect vajra life of liberation,",
      "en-trans": "kunzang dorjé namtar tar sön té"
    },
    {
      "bo": "ཐ་མའི་མཛད་པ་ངོ་མཚར་བཅས་ཏེ་བསྟན།    །",
      "en": "You displayed your final act accompanied by wondrous signs.",
      "en-trans": "tamé dzepa ngotsar ché té ten"
    },
    {
      "bo": "སླར་ཡང་བསྟན་དང་ལྷག་མའི་གདུལ་བྱའི་ཕྱིར།    །",
      "en": "Then, once more, for the sake of the teachings and to train disciples who remained",
      "en-trans": "lar yang ten dang lhakmé duljé chir"
    },
    {
      "bo": "སྤྲུལ་པའི་ཉིན་བྱེད་འཆར་ལ་གསོལ་བ་འདེབས།    །",
      "en": "You arose in a sun-like emanation—to you I pray.",
      "en-trans": "trulpé nyinjé char la solwa deb"
    },
    {
      "bo": "དཔལ་མགོན་བླ་མའི་རྣམ་ཐར་རྗེས་དྲན་པས།    །",
      "en": "By recalling your liberational life, O glorious protector guru,",
      "en-trans": "palgön lamé namtar jedren pé"
    },
    {
      "bo": "གསོལ་བ་བཏབ་བཞིན་བདག་གིས་མངོན་དུ་གྱུར།    །",
      "en": "And praying to you, may I gain the corresponding realization.",
      "en-trans": "solwa tab zhin dak gi ngön du gyur"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་མཐོང་མོས་གུས་སྐྱ་རེངས་ཀྱིས།    །",
      "en": "May the dawning devotion of seeing all your deeds as positive",
      "en-trans": "chi dzé lek tong mögü kya reng kyi"
    },
    {
      "bo": "དགོངས་བརྒྱུད་ཉིན་བྱེད་སྙིང་ལ་འདྲེན་གྱུར་ཅིག  །",
      "en": "Draw the sun of mind-direct transmission into my heart.",
      "en-trans": "gonggyü nyinjé nying la dren gyur chik"
    },
    {
      "bo": "མགོན་ཁྱོད་བྱང་ཆུབ་མངོན་བརྙེས་ཚུལ་བསྟན་ཚེ།    །",
      "en": "O protector, when you ultimately display the attainment of awakening,",
      "en-trans": "gön khyö changchub ngön nyé tsul ten tsé"
    },
    {
      "bo": "ཉེ་བའི་སྲས་སུ་གྱུར་ནས་ཐུགས་མཛོད་འཛིན།    །",
      "en": "May I be there among your closest heirs and hold your wisdom treasury.",
      "en-trans": "nyewé sé su gyur né tuk dzö dzin"
    },
    {
      "bo": "མཉེས་པ་གསུམ་གྱིས་ཐུགས་ཡིད་གཅིག་འདྲེས་ནས།    །",
      "en": "Through the three means of delight, may I blend my mind with your wisdom,",
      "en-trans": "nyepa sum gyi tuk yi chik dré né"
    },
    {
      "bo": "འཇམ་མགོན་མཛད་པ་མཐའ་དག་བསྒྲུབ་ནུས་ཤོག  །",
      "en": "And may I be able to accomplish all the Gentle Protector’s enlightened deeds.",
      "en-trans": "jam gön dzepa tadak drub nü shok"
    }
  ]
}