{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-for-ngawang-sherab",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངག་དབང་ཤེས་རབ་ཀྱི་ངོར་སྨྲས་པའི་གསོལ་འདེབས།",
    "en": "Prayer for Ngawang Sherab1"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti.",
      "en-trans": "om svasti"
    },
    {
      "bo": "ཕྱོགས་དུས་རྒྱལ་བ་ཀུན་གྱི་ཡེ་ཤེས་སྐུ།    །",
      "en": "Embodiment of the wisdom of all the victors throughout the whole of space and time,",
      "en-trans": "chok dü gyalwa kün gyi yeshe ku"
    },
    {
      "bo": "ཁྱབ་བདག་འཇམ་དཔལ་རྡོ་རྗེ་ཉིན་མོ་བྱེད།    །",
      "en": "Omnipresent lord, sun-like Mañjuvajra,",
      "en-trans": "khyabdak jampal dorjé nyinmo jé"
    },
    {
      "bo": "ཡོངས་རྫོགས་བསྟན་པ་རྒྱ་མཚོའི་མངའ་བདག་མཆོག  །",
      "en": "Supreme sovereign of the oceanic teachings in their entirety,",
      "en-trans": "yongdzok tenpa gyatsö ngadak chok"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Khyentse Wangpo, at your feet I pray.",
      "en-trans": "khyentsé wangpö zhab la solwa deb"
    },
    {
      "bo": "གང་གི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་རོལ་ལས།    །",
      "en": "The magical play of his primordial wisdom,",
      "en-trans": "gang gi yeshe gyumé namrol lé"
    },
    {
      "bo": "ཕྲིན་ལས་རྒྱ་མཚོ་འགྲོ་བ་འདུལ་བའི་མགོན།    །",
      "en": "The protector who trains beings through ocean-like activity,",
      "en-trans": "trinlé gyatso drowa dulwé gön"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མ་ཆོས་ཀྱི་བློ་གྲོས་ལ།    །",
      "en": "Mañjughoṣa guru, Chökyi Lodrö, to you",
      "en-trans": "jamyang lama chökyi lodrö la"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་གྱིས་རློབས།    །",
      "en": "I pray from the depths of my heart: inspire me with your blessings!",
      "en-trans": "nying né soldeb dak gyü jingyi lob"
    },
    {
      "bo": "བདག་ཅག་དད་དང་དམ་ཚིག་རྣམ་པར་དག  །",
      "en": "May our faith and samaya commitment remain utterly pure,",
      "en-trans": "dakchak dé dang damtsik nampar dak"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གྱི་བགྲོད་པ་མཐར་ཕྱིན་ཏེ།    །",
      "en": "May we complete the path of the two stages,2",
      "en-trans": "rim nyi lam gyi dröpa tarchin té"
    },
    {
      "bo": "ལྷན་སྐྱེས་ཡེ་ཤེས་ཉི་མ་སྙིང་ལ་འཆར།    །",
      "en": "May the sun of co-emergent wisdom dawn within our hearts,",
      "en-trans": "lhenkyé yeshe nyima nying la char"
    },
    {
      "bo": "དོན་གཉིས་མཐའ་རུ་ཕྱིན་པའི་བཀྲ་ཤིས་ཤོག  །",
      "en": "And may all be auspicious for the twofold aim to be perfectly fulfilled.3",
      "en-trans": "dön nyi ta ru chinpé tashi shok"
    }
  ]
}