{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/gaton-ngawang-lekpa/bestower-supreme-blessings-prayer-to-khyentse-chokyi-lodro",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཆོག་སྤྲུལ་ཐམས་ཅད་མཁྱེན་པའི་གསོལ་འདེབས་བྱིན་རླབས་མཆོག་སྩོལ་ཞེས་བྱ་བ་བཞུགས་སོ།།",
    "en": "Bestower of Supreme Blessings"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་རྒྱལ་བའི་ཡབ་གཅིག་འཇ༵མ་པའི་དབྱ༵ངས། །",
      "en": "One and only father of the victors of the three times, Mañjughoṣa,",
      "en-trans": "dü sum gyalwé yab chikjampéyang"
    },
    {
      "bo": "ཟབ་རྒྱས་ཆོས༵་ཀྱི༵་དགའ་སྟོན་སྤེལ་སླད་དུ། །",
      "en": "In order to share a festival of Dharma, profound and vast,",
      "en-trans": "zabgyéchökyigatön pel ledu"
    },
    {
      "bo": "བློ༵་གྲོ༵ས་མཚུངས་མེད་བཤེས་གཉེན་མཆོག་གི་སྐུར། །",
      "en": "You assumed the form of a supreme spiritual guide of peerless intellect—",
      "en-trans": "lodrötsungmé shenyen chok gi kur"
    },
    {
      "bo": "ཡོངས་ཤར་ཁྱབ་བདག་བླ་མ་ཞབས་བརྟན་གསོལ། །",
      "en": "Sovereign guru, I pray that your life may remain secure.",
      "en-trans": "yong shar khyabdak lama zhabten sol"
    },
    {
      "bo": "ལེགས་གསུང་འདུལ་བའི་ཁྲིམས་ཀྱི་ཡུ་བ་བརྟན། །",
      "en": "On the stable pole of the rules of well-spoken Vinaya,",
      "en-trans": "lek sung dulwé trim kyi yuwa ten"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་གཉིས་དར་གྱི་ལྷབ་ལྷུབ་གཡོ། །",
      "en": "Flutters the silken flag of the two types of bodhicitta,",
      "en-trans": "changchub sem nyi dar gyi lhab lhub yo"
    },
    {
      "bo": "གསང་ཆེན་སྨིན་གྲོལ་ནོར་བུའི་ཏོག་ལྡན་པ། །",
      "en": "With the jewel of great secret ripening and liberating at its crest—",
      "en-trans": "sang chen mindrol norbü tok denpa"
    },
    {
      "bo": "ཡོངས་འཛིན་བསྟན་པའི་རྒྱལ་མཚན་མཆོག་ལ་འདུད། །",
      "en": "To this supreme victory banner of the fully observed teaching, I bow.",
      "en-trans": "yongdzin tenpé gyaltsen chok la dü"
    },
    {
      "bo": "མང་དུ་ཐོས་པའི་ནོར་གྱིས་རྒྱུད་ཕྱུག་ཅིང་། །",
      "en": "Your mindstream is enriched by a wealth of prodigious study,",
      "en-trans": "mangdu töpé nor gyi gyü chuk ching"
    },
    {
      "bo": "དེ་དོན་བསམ་པའི་སྒྲོ་འདོགས་ནང་ནས་ཆོད། །",
      "en": "Your misconceptions eliminated through contemplation of meaning—",
      "en-trans": "dedön sampé drondok nang né chö"
    },
    {
      "bo": "རྩེ་གཅིག་བསྒོམ་པའི་ཏིང་འཛིན་བདུད་རྩི་ཡིས། །",
      "en": "To you, whose body of realization is strengthened through the nectar",
      "en-trans": "tsechik gompé tingdzin dütsi yi"
    },
    {
      "bo": "རྟོགས་པའི་ལུས་སྟོབས་རྒྱས་པ་དེ་ལ་འདུད། །",
      "en": "Of single-pointed meditative absorption, I bow.",
      "en-trans": "tokpé lü tob gyepa dé la dü"
    },
    {
      "bo": "མཁྱེན་པའི་ཡེ་ཤེས་ཟུང་གི་སྤྱན་དང་ལྡན། །",
      "en": "You have the eyes of the twofold wisdom of omniscience,",
      "en-trans": "khyenpé yeshe zung gi chen dangden"
    },
    {
      "bo": "བརྩེ་བའི་ཐུགས་རྗེ་འགྲོ་ཀུན་རྗེས་སུ་འཛིན། །",
      "en": "You guide and care for beings with loving compassion",
      "en-trans": "tsewé tukjé dro kün jesu dzin"
    },
    {
      "bo": "གང་གི་ནུས་པ་ལུང་རྟོགས་བསྟན་པའི་དཔལ། །",
      "en": "And your power is the splendour of scripture and realization—",
      "en-trans": "gang gi nüpa lungtok tenpé pal"
    },
    {
      "bo": "མཚུངས་མེད་བླ་མ་དམ་པའི་ཞབས་ལ་འདུད། །",
      "en": "Incomparable and noble guru, at your feet I bow.",
      "en-trans": "tsungmé lama dampé zhab la dü"
    },
    {
      "bo": "འཆད་པའི་ལེགས་བཤད་སྐལ་ལྡན་གདུལ་བྱའི་དཔལ། །",
      "en": "The elegance of your exposition is a splendour to the fortunate,",
      "en-trans": "chepé lek shé kalden duljé pal"
    },
    {
      "bo": "རྩོད་པའི་རིགས་པས་ཕས་རྒོལ་ལོག་ལྟ་འཇོམས། །",
      "en": "The rationality of your debate destroys opponents with wrong views,",
      "en-trans": "tsöpé rikpé pé gol lokta jom"
    },
    {
      "bo": "རྩོམ་ཕྲེང་རྒྱལ་བསྟན་མཛེས་པའི་རྒྱན་གྱུར་པ། །",
      "en": "And your garlanded compositions are ornaments to beautify the victor’s teachings—",
      "en-trans": "tsom treng gyalten dzepé gyen gyurpa"
    },
    {
      "bo": "སྨྲ་བའི་དབང་པོ་མཆོག་གི་ཞབས་ལ་འདུད། །",
      "en": "Superlative master of expression, at your feet I bow.",
      "en-trans": "mawé wangpo chok gi zhab la dü"
    },
    {
      "bo": "སྙིགས་དུས་གངས་ཅན་བོད་ཀྱི་གདུལ་བྱ་ལ། །",
      "en": "With non-referential love, you constantly watch over disciples",
      "en-trans": "nyikdü gangchen bö kyi dulja la"
    },
    {
      "bo": "དམིགས་མེད་བརྩེ་བའི་ཐུགས་ཀྱིས་རྟག་དགོངས་ཤིང་། །",
      "en": "Of this snowy land of Tibet at this degenerate time,",
      "en-trans": "mikmé tsewé tuk kyi tak gong shing"
    },
    {
      "bo": "བསྡུ་དངོས་བཞི་ཡི་ལེགས་མཛད་མཐའ་ཡས་པས། །",
      "en": "And with the limitless beneficence of the four means of attraction",
      "en-trans": "du ngö zhi yi lek dzé tayepé"
    },
    {
      "bo": "ཕན་བདེའི་དགའ་སྟོན་སྤེལ་མཛད་ཞབས་ལ་འདུད། །",
      "en": "You extend the celebration of benefit and happiness—at your feet I bow.",
      "en-trans": "pendé gatön pel dzé zhab la dü"
    },
    {
      "bo": "དེ་ལྟར་རྩེ་གཅིག་གུས་པས་གསོལ་བཏབ་མཐུས། །",
      "en": "Through the power of praying with one-pointed devotion in this way,",
      "en-trans": "detar tsechik güpé soltab tü"
    },
    {
      "bo": "དྲི་མེད་ཐུབ་བསྟན་ཕྱོགས་བཅུར་རྒྱས་པ་དང་། །",
      "en": "May the Sage’s flawless teachings spread throughout the ten directions,",
      "en-trans": "drimé tubten chok chur gyepa dang"
    },
    {
      "bo": "བསྟན་འཛིན་སྐྱེས་མཆོག་ཞབས་པད་རྟག་བརྟན་ཅིང་། །",
      "en": "May the lives of the sublime masters who uphold the teachings remain secure,",
      "en-trans": "tendzin kyechok zhabpé takten ching"
    },
    {
      "bo": "རྣམ་དཀར་ཕྲིན་ལས་རྒྱས་པར་མཛད་དུ་གསོལ། །",
      "en": "And may utterly pure enlightened actions flourish.",
      "en-trans": "namkar trinlé gyepar dzé du sol"
    },
    {
      "bo": "ཡུལ་ཕྱོགས་ཀུན་ཏུ་ནད་མུག་འཁྲུགས་རྩོད་སོགས། །",
      "en": "Throughout every land may the evil signs of this degenerate age,",
      "en-trans": "yul chok küntu né muk truktsö sok"
    },
    {
      "bo": "སྙིགས་མའི་དུས་ལྟས་ངན་པ་ཀུན་ཞི་ནས། །",
      "en": "Such as disease, famine and warfare, be wholly pacified,",
      "en-trans": "nyikmé dü té ngenpa kün zhi né"
    },
    {
      "bo": "འགྲོ་ཀུན་དགེ་བཅུའི་དཔལ་ལ་སྤྱོད་པ་སོགས། །",
      "en": "And, as all beings revel in the glory of the ten virtues,",
      "en-trans": "dro kün gé chü pal la chöpa sok"
    },
    {
      "bo": "རྫོགས་ལྡན་གསར་པའི་བདེ་འབྱོར་རྒྱས་པར་མཛོད། །",
      "en": "May we savour the splendours of a new golden era.",
      "en-trans": "dzokden sarpé dé jor gyepar dzö"
    },
    {
      "bo": "ཁྱད་པར་བདག་ཅག་དེང་ནས་བྱང་ཆུབ་བར། །",
      "en": "For us, in particular, from now until awakening,",
      "en-trans": "khyepar dakchak deng né changchub bar"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་ཀྱིས་འབྲལ་མེད་རྗེས་བཟུང་ཞིང་། །",
      "en": "May you guide and care for us inseparably, O protector.",
      "en-trans": "gönpo khyö kyi dralmé jezung zhing"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་རིམ་པ་མཐར་ཕྱིན་ནས། །",
      "en": "May we complete the stages of study, contemplation and meditation,",
      "en-trans": "tö sam gompé rimpa tarchin né"
    },
    {
      "bo": "ཐམས་ཅད་གཟིགས་པའི་གོ་འཕང་མྱུར་ཐོབ་ཤོག།",
      "en": "And swiftly attain the stage of all-encompassing insight.",
      "en-trans": "tamché zikpé gopang nyur tob shok"
    }
  ]
}