{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-karmapa-incarnations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཔལ་ལྡན་ཀརྨ་པའི་སྐྱེས་རབས་ཕྲེང་བར་གསོལ་འདེབས་མོས་གུས་ཀྱི་སྦྲང་རྩི།"
  },
  "text": [
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཕྲིན་ལས་སྤེལ། །"
    },
    {
      "bo": "རིགས་གསུམ་གཅིག་བསྡུས་ཀརྨ་པ། །"
    },
    {
      "bo": "དུས་གསུམ་མཁྱེན་པ་མི་ཡི་རྗེ། །"
    },
    {
      "bo": "འཇིག་རྟེན་འདྲེན་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྣང་སྲིད་ཡེ་ཤེས་ཕྱག་རྒྱས་ཐེབས། །"
    },
    {
      "bo": "བདེ་ཆེན་ཟུང་འཇུག་གྲུབ་པའི་གཙོ། །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཧེ་རུ་ཀ །"
    },
    {
      "bo": "ཆོས་ཀྱི་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་དབང་མི་ཡི་གཟུགས། །"
    },
    {
      "bo": "བརྟན་པའི་འཁོར་ལོའི་མཁྱེན་རབ་ཅན། །"
    },
    {
      "bo": "གསང་བ་རྒྱ་མཚོའི་མངའ་བདག་མཆོག །"
    },
    {
      "bo": "རང་བྱུང་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱལ་སྲས་བྱང་ཆེན་སྤྱོད་པ་ལས། །"
    },
    {
      "bo": "སྙིང་སྟོབས་གོ་ཆ་བརྟན་པོ་བཞེས། །"
    },
    {
      "bo": "གཞན་ལ་ཕན་པའི་རྩ་ལག་མཆོག །"
    },
    {
      "bo": "རོལ་པའི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལྷར་བཅས་སྲིད་ཞིའི་གཙུག་གི་ནོར། །"
    },
    {
      "bo": "བརྟན་གཡོ་ཕྱག་རྒྱ་ཆེན་པོར་སྡོམ། །"
    },
    {
      "bo": "གངས་ལྗོངས་བསྟན་པ་ཡོངས་ཀྱི་བདག །"
    },
    {
      "bo": "དེ་བཞིན་གཤེགས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་ཕུང་པོ་རབ་བརྗིད་ཅིང་། །"
    },
    {
      "bo": "ཏིང་འཛིན་མཆོག་ལས་མི་འདའ་ཞིང་། །"
    },
    {
      "bo": "ཤེས་རབ་ཟབ་མོའི་དཔལ་འཆང་བ། །"
    },
    {
      "bo": "མཐོང་བ་དོན་ལྡན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཚར་གཅོད་རྗེས་འཛིན་མཐུ་གྲུབ་ཅིང་། །"
    },
    {
      "bo": "མཁས་དང་བཙུན་པའི་ཕུལ་དུ་གྱུར། །"
    },
    {
      "bo": "མཁྱེན་ནུས་བརྩེ་བའི་གཏེར་ཆེན་པོ། །"
    },
    {
      "bo": "ཆོས་གྲགས་རྒྱ་མཚོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མི་འཕྲོག་པ་ཡི་ཐུགས་མངའ་ཞིང་། །"
    },
    {
      "bo": "ཟབ་དོན་མན་ངག་རྒྱ་མཚོའི་མཛོད། །"
    },
    {
      "bo": "ཁམས་གསུམ་ཆོས་ཀྱི་རྒྱལ་པོ་མཆོག །"
    },
    {
      "bo": "མི་བསྐྱོད་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཕགས་ཆེན་ས་ལ་རབ་བཞུགས་ཤིང་། །"
    },
    {
      "bo": "ལུང་རིགས་ནོར་བུ་གྲམ་པ་བརྡལ། །"
    },
    {
      "bo": "འཆད་རྩོད་རྩོམ་ལ་བསྙེངས་བྲལ་བ། །"
    },
    {
      "bo": "དབང་ཕྱུག་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་བརྒྱད་སྒྱུ་མར་རྟག་ཏུ་གཟིགས། །"
    },
    {
      "bo": "རོ་སྙོམས་བརྟུལ་ཞུགས་གྲུབ་པའི་གཙོ། །"
    },
    {
      "bo": "ལྷག་པའི་ལྷ་ཡིས་རྗེས་སུ་བཟུང་། །"
    },
    {
      "bo": "ཆོས་དབྱིངས་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལས་རླུང་དྷུ་ཏིའི་དབྱིངས་སུ་བཅིངས། །"
    },
    {
      "bo": "ཀུན་ཏུ་རྟོག་པ་ཐམས་ཅད་ཟད། །"
    },
    {
      "bo": "འཕོ་མེད་ཟུང་འཇུག་ཕྱག་རྒྱའི་སྐུ། །"
    },
    {
      "bo": "ཡེ་ཤེས་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྤངས་རྟོགས་ཡོན་ཏན་བྱེ་བའི་གཏེར། །"
    },
    {
      "bo": "མདོ་སྔགས་ཆོས་ཚུལ་འབྱུང་གནས་ཆེ། །"
    },
    {
      "bo": "སྐལ་ལྡན་སྐུ་བཞིར་བཀྲིར་མཛད་པ། །"
    },
    {
      "bo": "བྱང་ཆུབ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྟག་པར་སེམས་ཅན་དོན་ལ་བརྩོན། །"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པ་མཐར་སོན་ཅིང་། །"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་ཆོས་ཀྱི་རྗེ། །"
    },
    {
      "bo": "ཐེག་མཆོག་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པ་མི་ཡི་གཟུགས། །"
    },
    {
      "bo": "ཁྱབ་བདག་རྡོ་རྗེ་སེམས་དཔའི་སྐུ། །"
    },
    {
      "bo": "རིགས་རྣམས་ཀུན་འདུས་དཀྱིལ་འཁོར་གཙོ། །"
    },
    {
      "bo": "མཁའ་ཁྱབ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྲིད་འདི་ཇི་སྲིད་གནས་ཀྱི་བར། །"
    },
    {
      "bo": "འཕགས་མཆོག་སྤྲུལ་པ་རྒྱུན་མི་ཆད། །"
    },
    {
      "bo": "ཕུལ་བྱུང་ངོ་མཚར་གཏམ་མང་གིས། །"
    },
    {
      "bo": "ནོར་འཛིན་ཁྱོན་ཀུན་ཁྱབ་གྱུར་ཅིག །"
    },
    {
      "bo": "བདག་ཀྱང་དེང་ནས་བྱང་ཆུབ་བར། །"
    },
    {
      "bo": "མགོན་པོས་འབྲལ་མེད་རྗེས་བཟུང་ཞིང་། །"
    },
    {
      "bo": "རྒྱལ་བ་སེངྒེའི་ང་རོ་དང་། །"
    },
    {
      "bo": "དབྱེར་མེད་མངོན་པར་བྱང་ཆུབ་ཤོག །"
    }
  ]
}