{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tara-eliminator-of-suffering",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།    །བླ་མ་རྗེ་བཙུན་སྒྲོལ་མར་གསོལ་འདེབས་སྡུག་བསྔལ་སེལ་བྱེད་ཅེས་བྱ་བ།    །",
    "en": "A Prayer to the Venerable and Exalted Tārā"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་ཀུན་གྱི་ཡུམ་གཅིག་མ།    །",
      "en": "Only mother of all the buddhas of the three times,",
      "en-trans": "düsum gyalwa küngyi yum chik ma"
    },
    {
      "bo": "རྗེ་བཙུན་སྒྲོལ་མ་མྱུར་མ་དཔའ་མོ་ཡི།    །",
      "en": "Venerable Tārā, goddess who is swift and courageous,",
      "en-trans": "jetsün drolma nyurma pamo yi"
    },
    {
      "bo": "ཞབས་རྟེན་ཨུཏྤལ་སྔོན་པོར་གུས་མཆོད་དེ།    །",
      "en": "Respectfully I pay homage at the blue lotus beneath your feet:",
      "en-trans": "zhab ten utpal ngönpor gü chö dé"
    },
    {
      "bo": "བདག་གི་ལུས་སེམས་གདུང་བ་བསལ་དུ་གསོལ།",
      "en": "Clear away the torment that afflicts me physically and mentally, I pray.",
      "en-trans": "dak gi lü sem dungwa sal du sol"
    },
    {
      "bo": "ཁྱོད་ནི་སངས་རྒྱས་བྱང་སེམས་ཐམས་ཅད་ཀྱི།    །",
      "en": "In your sublime form you embody the activity",
      "en-trans": "khyö ni sangye changsem tamché kyi"
    },
    {
      "bo": "ཕྲིན་ལས་གཅིག་ཏུ་བསྡུས་པའི་རང་གཟུགས་མཆོག  །",
      "en": "Of all the buddhas and the bodhisattvas.",
      "en-trans": "trinlé chik tu düpé rang zuk chok"
    },
    {
      "bo": "ཨཱརྱ་ཏཱ་རེའི་ཞལ་བཟང་དྲན་པའི་མོད།    །",
      "en": "Noble Tārā, as soon as I recall your splendid face,",
      "en-trans": "arya taré zhal zang drenpé mö"
    },
    {
      "bo": "སྲིད་པའི་སྡུག་བསྔལ་མ་ལུས་གཞོམ་དུ་གསོལ།    །",
      "en": "Eliminate all the miseries of existence, I pray.",
      "en-trans": "sipé dukngal malü zhom du sol"
    },
    {
      "bo": "བརྒྱད་གཉིས་འཇིགས་པའི་ཆུ་གཏེར་འཁྲུགས་པ་ལས།    །",
      "en": "When unbearable forces arise like monsters",
      "en-trans": "gyé nyi jikpé chuter trukpa lé"
    },
    {
      "bo": "མི་བཟད་ཆུ་སྲིན་ལྟ་བུའི་སྡེ་ཚོགས་རྣམས།    །",
      "en": "Out of the turbulent sea of sixteenfold danger,",
      "en-trans": "mi zé chusin tabü dé tsok nam"
    },
    {
      "bo": "ཁྱོད་མཚན་བརྗོད་དང་འོ་དོད་བོས་པའི་ཚེ།    །",
      "en": "As I chant your name and call out to you,",
      "en-trans": "khyö tsenjö dang odö böpé tsé"
    },
    {
      "bo": "དེ་མ་ཐག་ཏུ་སྐྱབས་པར་མཛད་དུ་གསོལ།    །",
      "en": "Grant me protection there and then, I pray.",
      "en-trans": "dé ma tak tu kyabpar dzé du sol"
    },
    {
      "bo": "ཚེ་དང་ཤེས་རབ་བསོད་ནམས་ནོར་གྱིས་དབུལ།    །",
      "en": "When my longevity, wisdom, merit and funds are depleted,",
      "en-trans": "tsé dang sherab sönam nor gyi ul"
    },
    {
      "bo": "དོན་ཉམས་ལ་སོགས་སྲིད་ཞིའི་དགེ་ལེགས་ཀྱི།    །",
      "en": "In contrast to the universal fortune and virtue I seek,",
      "en-trans": "dön nyam lasok sizhi gelek kyi"
    },
    {
      "bo": "འགལ་ཟླར་གྱུར་རྣམས་ཁྱོད་ལ་གསོལ་བཏབ་པས།    །",
      "en": "Then, by calling out to you in heartfelt prayer,",
      "en-trans": "galdar gyur nam khyö la soltab pé"
    },
    {
      "bo": "དཀར་པོའི་ཕྱོགས་ཀྱི་ཆ་བཞིན་རྒྱས་མཛད་གསོལ།    །",
      "en": "Cause them to increase like the waxing moon, I pray.",
      "en-trans": "karpö chok kyi cha zhin gyé dzé sol"
    },
    {
      "bo": "ཚུལ་ཁྲིམས་དག་ཅིང་ཐོས་བསམ་སྒོམ་པ་འཕེལ།    །",
      "en": "Make my ethical discipline pure, my study, reflection and meditation grow,",
      "en-trans": "tsultrim dak ching tö sam gompa pel"
    },
    {
      "bo": "མཁྱེན་ནུས་བརྩེ་བའི་ཡོན་ཏན་རྩལ་ཆེན་རྫོགས།    །",
      "en": "Let my qualities of wisdom, capacity and love reach their full potential,",
      "en-trans": "khyen nü tsewé yönten tsal chen dzok"
    },
    {
      "bo": "རྒྱལ་བ་ཀུན་གྱི་ཕྲིན་ལས་རྩལ་ཤུགས་འཆང་།    །",
      "en": "And make me inseparable from you, the venerable goddess",
      "en-trans": "gyalwa kün gyi trinlé tsalshuk chang"
    },
    {
      "bo": "རྗེ་བཙུན་ཉིད་དང་དབྱེར་མེད་མཛད་དུ་གསོལ།    །",
      "en": "Who acts with the full force of all the victorious ones, I pray.",
      "en-trans": "jetsün nyi dang yermé dzé du sol"
    },
    {
      "bo": "དུས་མིན་འཆི་བའི་གཡུལ་ལས་རབ་རྒྱལ་ཞིང་།    །",
      "en": "Grant me perfect victory in the battle against untimely death,",
      "en-trans": "dümin chiwé yul lerab gyal zhing"
    },
    {
      "bo": "འཆི་མེད་རྡོ་རྗེའི་སྲོག་གི་ཀ་བ་བརྟན།",
      "en": "Set firm the pillar of an indestructible and immortal vital force,",
      "en-trans": "chimé dorjé sok gi kawa ten"
    },
    {
      "bo": "གྲུབ་པའི་བདུད་རྩིས་ལུས་སེམས་སྟོབས་དཔལ་རྒྱས།    །",
      "en": "Let the nectar of accomplishment invigorate my body and mind,",
      "en-trans": "drubpé dütsi lü sem tob pal gyé"
    },
    {
      "bo": "ཡིད་བཞིན་འཁོར་ལོའི་ངོ་བོ་སྒྲུབ་ཏུ་གསོལ།    །",
      "en": "And let me realize the essence of the Wish-Fulfilling Wheel, I pray.",
      "en-trans": "yizhin khorlö ngowo drub tu sol"
    },
    {
      "bo": "རིས་མེད་ཐུབ་པའི་བསྟན་པ་དར་ཞིང་རྒྱས།    །",
      "en": "Cause the Buddha’s non-sectarian teachings to flourish and spread,",
      "en-trans": "rimé tubpé tenpa dar zhing gyé"
    },
    {
      "bo": "བསྟན་ལ་གནོད་པ་ཁྲོ་གཉེར་ཅན་གྱིས་བཏུལ།    །",
      "en": "Show your frown of wrath and subdue all who harm the teachings,",
      "en-trans": "ten la nöpa tronyer chen gyi tul"
    },
    {
      "bo": "བསྟན་པའི་སྦྱིན་བདག་མངའ་ཐང་རབ་འཕེལ་ཏེ།    །",
      "en": "Increase the power and influence of Dharma patrons,",
      "en-trans": "tenpé jindak ngatang rab pel té"
    },
    {
      "bo": "རྫོགས་ལྡན་གསར་པའི་སྣང་བ་འཆར་གྱུར་ཅིག  །",
      "en": "And usher in the golden dawn of a new and perfect age.",
      "en-trans": "dzokden sarpé nangwa char gyur chik"
    },
    {
      "bo": "མདོར་ན་བདག་ལ་སྐྱིད་སྡུག་ཅི་བྱུང་ཡང་།    །",
      "en": "In short, in joy as in sorrow, no matter what befalls me,",
      "en-trans": "dorna dak la kyiduk chi jung yang"
    },
    {
      "bo": "རྗེ་བཙུན་བཅོམ་ལྡན་འདས་མ་ཉིད་ཀྱིས་ནི།    །",
      "en": "May you, O venerable and blessed goddess,",
      "en-trans": "jetsün chomden dema nyi kyi ni"
    },
    {
      "bo": "སྐད་ཅིག་ཙམ་ཡང་འབྲལ་བ་མེད་པ་དང་།    །",
      "en": "Never part from me even for a single instant,",
      "en-trans": "kechik tsam yang dralwa mepa dang"
    },
    {
      "bo": "བསམ་པའི་དོན་ཀུན་འབད་མེད་འགྲུབ་པར་ཤོག  །",
      "en": "And cause all my wishes to be effortlessly fulfilled.",
      "en-trans": "sampé dön kün bemé drubpar shok"
    }
  ]
}