{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/drikung-kyobpa-jikten-sumgon/sevenfold-tara-refuge-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྒྲོལ་མ་སྐྱབས་བདུན་མ་བཞུགས་སོ། །",
    "en": "Prayer to Tārā: A Sevenfold Supplication for Protection"
  },
  "text": [
    {
      "bo": "མ་སྐྱེ་བ་མེད་པའི་ཆོས་དབྱིངས་ན། །",
      "en": "I pray to celestial Tārā, the exalted mother,",
      "en-trans": "ma kyewa mepé chöying na"
    },
    {
      "bo": "ཡུམ་རྗེ་བཙུན་ལྷ་མོ་སྒྲོལ་མ་བཞུགས། །",
      "en": "Who abides within the uncreated dharmadhātu,",
      "en-trans": "yum jetsün lhamo drolma zhuk"
    },
    {
      "bo": "དེ་སེམས་ཅན་ཀུན་ལ་བདེ་སྟེར་མ། །",
      "en": "From where she bestows comfort and joy upon all:",
      "en-trans": "dé semchen kün la dé ter ma"
    },
    {
      "bo": "བདག་འཇིགས་པ་ཀུན་ལས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "Protect me from all fear.",
      "en-trans": "dak jikpa kün lé kyab tu sol"
    },
    {
      "bo": "རང་ཆོས་སྐུ་ཡིན་པར་མ་ཤེས་པར། །",
      "en": "I pray to the divine mother Tārā:",
      "en-trans": "rang chöku yinpar ma shepar"
    },
    {
      "bo": "སེམས་ཉོན་མོངས་དབང་དུ་གྱུར་པ་ཡི། །",
      "en": "Through not realizing our innate nature to be dharmakāya,",
      "en-trans": "sem nyönmong wang du gyurpa yi"
    },
    {
      "bo": "མ་འཁོར་བར་འཁྱམས་པའི་སེམས་ཅན་ལ། །",
      "en": "Our minds remain under the influence of destructive emotion;",
      "en-trans": "ma khorwar khyampé semchen la"
    },
    {
      "bo": "ཡུམ་ལྷ་མོ་ཁྱོད་ཀྱིས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "Protect all of us who wander aimlessly in saṃsāra.",
      "en-trans": "yum lhamo khyö kyi kyab tu sol"
    },
    {
      "bo": "ཆོས་སྙིང་ནས་རྒྱུད་ལ་མ་སྐྱེས་པར། །",
      "en": "I pray to the genuine deity, mother Tārā:",
      "en-trans": "chö nying né gyü la ma kyepar"
    },
    {
      "bo": "ཐ་སྙད་ཚིག་གི་རྗེས་འབྲངས་ནས། །",
      "en": "Protect us in whose hearts the genuine dharma hasn’t been born,",
      "en-trans": "tanyé tsik gi jé drang né"
    },
    {
      "bo": "གྲུབ་མཐའ་ངན་པས་བསླུས་པ་ལ། །",
      "en": "Who fixate on words and ideas,",
      "en-trans": "drubta ngenpé lüpa la"
    },
    {
      "bo": "ཡུམ་ཡང་དག་གི་ལྷ་མོས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "Or who have been deceived by false claims.",
      "en-trans": "yum yangdak gi lhamö kyab tu sol"
    },
    {
      "bo": "རྟོགས་པར་དཀའ་བ་རང་གི་སེམས། །",
      "en": "I pray to the deity of mindfulness, mother Tārā:",
      "en-trans": "tokpar kawa rang gi sem"
    },
    {
      "bo": "མཐོང་ནས་གོམས་པར་མི་བྱེད་པར། །",
      "en": "Protect us who have glimpsed the nature of mind, so difficult to realize,",
      "en-trans": "tong né gompar mi jepar"
    },
    {
      "bo": "བྱ་བ་ངན་པས་གཡེང་བ་ལ། །",
      "en": "And yet, due to lack of mindfulness and familiarity,",
      "en-trans": "jawa ngenpé yengwa la"
    },
    {
      "bo": "ཡུམ་དྲན་པའི་ལྷ་མོས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "Remain distracted by negative action.",
      "en-trans": "yum drenpé lhamö kyab tu sol"
    },
    {
      "bo": "སེམས་རང་བྱུང་གཉིས་མེད་ཡེ་ཤེས་ལ། །",
      "en": "I pray to the deity who is inseparable from my mind, mother Tārā:",
      "en-trans": "sem rangjung nyimé yeshe la"
    },
    {
      "bo": "གཉིས་སུ་འཛིན་པའི་བག་ཆགས་ཀྱིས། །",
      "en": "Protect us whose strong adherence to and grasping at subject-object duality",
      "en-trans": "nyisu dzinpé bakchak kyi"
    },
    {
      "bo": "ཇི་ལྟར་བྱས་ཀྱང་བཅིངས་པ་རྣམས། །",
      "en": "Blinds us from realizing",
      "en-trans": "jitar jé kyang chingpa nam"
    },
    {
      "bo": "ཐུགས་གཉིས་མེད་ཀྱི་ལྷ་མོས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "The true nature of mind, non-dual wisdom.",
      "en-trans": "tuk nyimé kyi lhamö kyab tu sol"
    },
    {
      "bo": "ཡང་དག་གི་དོན་ལ་གནས་བྱས་ཀྱང་། །",
      "en": "I pray to the deity of omniscience, mother Tārā:",
      "en-trans": "yangdak gi dön la né jé kyang"
    },
    {
      "bo": "རྒྱུ་འབྲས་ཀྱི་རྟེན་འབྲེལ་མི་ཤེས་པས། །",
      "en": "Protect us who, even though we abide in the midst of reality",
      "en-trans": "gyundré kyi tendrel mishepé"
    },
    {
      "bo": "ཤེས་བྱའི་དོན་ལ་རྨོངས་པ་ལ། །",
      "en": "Fail to recognise cause and effect and mutual dependence",
      "en-trans": "shejé dön la mongpa la"
    },
    {
      "bo": "ཡུམ་ཀུན་མཁྱེན་གྱི་ལྷ་མོས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "And thus remain in confusion.",
      "en-trans": "yum künkhyen gyi lhamö kyab tu sol"
    },
    {
      "bo": "སྤྲོས་བྲལ་ནམ་མཁའི་མཚན་ཉིད་ཅན། །",
      "en": "I pray to the fully awakened deity, mother Tārā:",
      "en-trans": "trödral namkhé tsennyi chen"
    },
    {
      "bo": "ཐམས་ཅད་དེ་དང་དབྱེར་མེད་ཀྱིས། །",
      "en": "Protect us who still remain unaware of the inseparability",
      "en-trans": "tamché dé dang yermé kyi"
    },
    {
      "bo": "ད་དུང་སློབ་མའི་གང་ཟག་ལ། །",
      "en": "Of the unelaborate, sky-like nature,",
      "en-trans": "dadung lobmé gangzak la"
    },
    {
      "bo": "ཡུམ་རྫོགས་སངས་རྒྱས་ཀྱིས་བསྐྱབ་ཏུ་གསོལ། །",
      "en": "And everything it pervades.",
      "en-trans": "yum dzok sangyé kyi kyab tu sol"
    }
  ]
}