{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/prayer-to-sakya-gurus-deities",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ས་སྐྱའི་རྩ་བརྒྱུད་བླ་མ་དང་ཡི་དམ་མཁའ་འགྲོ་ཆོས་སྐྱོང་རྣམས་ལ་གསོལ་འདེབས་བཞུགས། །",
    "en": "Prayer to Root and Lineage Masters, and the Assembly of Deity, Ḍākinīs and Dharma Protectors of the Sakya Lineage"
  },
  "text": [
    {
      "bo": "འཇམ་མགོན་ས་སྐྱའི་རྩ་བརྒྱུད་བླ་མ་དང་། །",
      "en": "Root and lineage masters of the Sakya tradition of Mañjuśrī Protectors,",
      "en-trans": "jamgön sakyé tsa gyü lama dang"
    },
    {
      "bo": "ཡི་དམ་སྙིང་པོ་དཔལ་ལྡན་ཀྱེ་རྡོ་རྗེ། །",
      "en": "Glorious Hevajra, who is the most essential yidam deity,",
      "en-trans": "yidam nyingpo palden kyé dorjé"
    },
    {
      "bo": "མཁའ་འགྲོ་ཆོས་སྐྱོང་ནོར་ལྷའི་ཚོགས་རྣམས་ལ། །",
      "en": "And the assembly of ḍākinīs, dharma protectors and deities of wealth,",
      "en-trans": "khandro chökyong norlhé tsok nam la"
    },
    {
      "bo": "གུས་པས་གསོལ་འདེབས་ཡེ་ཤེས་སྤྱན་གྱིས་གཟིགས། །",
      "en": "In devotion I pray to you: look upon me with eyes of wisdom!",
      "en-trans": "güpé soldeb yeshe chen gyi zik"
    },
    {
      "bo": "བདག་དང་བདག་གི་འབྲེལ་ཚད་ཡིད་ཅན་རྣམས། །",
      "en": "May I and all those sentient beings who are connected with me",
      "en-trans": "dak dang dak gi dreltsé yichen nam"
    },
    {
      "bo": "ཚེ་འདིར་ཚེ་རིང་ནད་མེད་ཉམས་རྟོགས་འཕེལ། །",
      "en": "Live long, be free of illness, and increase our realization and experiences in this life;",
      "en-trans": "tsé dir tsering nemé nyamtok pel"
    },
    {
      "bo": "ཕྱི་མ་བདེ་ཅན་དག་པའི་ཞིང་སྐྱེས་ནས། །",
      "en": "And when we take rebirth in the pureland of Great Bliss in the next,",
      "en-trans": "chima dechen dakpé zhing kyé né"
    },
    {
      "bo": "ཁམས་གསུམ་འགྲོ་ཀུན་འདྲེན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Bless us so that we may guide all beings of the three realms.",
      "en-trans": "kham sum dro kün drenpar jingyi lob"
    }
  ]
}