{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-ngorchen-kunga-zangpo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངོར་ཆེན་ཀུན་དགའ་བཟང་པོའི་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ཨཱ་ནནྡ་བྷ་དྲཱ་ཡ།"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཀུན་ཏུ་དགེ་བའི་ཕྲིན་ལས་ཅན།    །"
    },
    {
      "bo": "ཀུན་གཟིགས་རྫོགས་སངས་རྒྱས་ཀྱི་ལུང་བསྟན་བརྙེས།    །"
    },
    {
      "bo": "ཀུན་དགའ་སྙིང་པོའི་རིང་ལུགས་ཉིན་མོར་བྱེད།    །"
    },
    {
      "bo": "ཀུན་བཟང་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མདོ་རྒྱུད་རྒྱ་མཚོའི་གཏེར་མཛོད་ཆགས་ཐོགས་བྲལ།    །"
    },
    {
      "bo": "རབ་འབྱམས་ཤེས་བྱ་ཀུན་གཟིགས་སྨྲ་བའི་སེང་།    །"
    },
    {
      "bo": "སྙིང་རྗེའི་དབང་ཕྱུག་ཕྱག་ན་པད་དཀར་འཆང་།    །"
    },
    {
      "bo": "གསང་འཛིན་ལག་ན་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཁྲུལ་པའི་དྲི་བྲལ་བློ་གྲོས་མི་ཟད་པས།    །"
    },
    {
      "bo": "ཐེག་ཆེན་ཆོས་ཀྱི་སྒྲ་དབྱངས་རྟག་ཏུ་སྒྲོགས།    །"
    },
    {
      "bo": "རྒྱུད་སྡེ་རྣམ་བཞིའི་ཆུ་ཀླུང་ཆེན་པོ་འདྲེན།    །"
    },
    {
      "bo": "སྐལ་ལྡན་སྨིན་གྲོལ་མཛད་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁྱད་པར་བིཪྺའི་ཐུགས་བཅུད་གསུང་ངག་གི    །"
    },
    {
      "bo": "རྟེན་གྱི་དཀྱིལ་འཁོར་དབང་བཞིས་སྨིན་མཛད་ནས།    །"
    },
    {
      "bo": "སྐུ་བཞིའི་གོ་འཕང་མཆོག་ལ་འགོད་མཛད་པ།    །"
    },
    {
      "bo": "བླ་མ་དགྱེས་མཛད་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ངེས་འབྱུང་འཕགས་པའི་ཚུལ་ཁྲིམས་ཁང་བཟང་དུ།    །"
    },
    {
      "bo": "ལྟ་སྤྱོད་རྣམ་པར་དག་པའི་སྐྱེས་བུ་ནི།    །"
    },
    {
      "bo": "བྱང་ཕྱོགས་ཐུབ་པའི་རྒྱལ་ཚབ་ངོར་ཆེན་རྗེར།    །"
    },
    {
      "bo": "མི་ཕྱེད་གུས་པ་ཆེན་པོས་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མའི་ཐུགས་རྗེའི་བྱིན་རླབས་ཀྱི།    །"
    },
    {
      "bo": "ཟླ་ཤེལ་བདུད་རྩི་གསར་པས་རེག་པའི་མོད།    །"
    },
    {
      "bo": "སྐལ་བཟང་ཚེ་དང་བློ་ཡི་ཀུནྡ་བཞད།    །"
    },
    {
      "bo": "མི་མཐུན་རྒུད་པ་ཀུན་ལས་བསྐྱབ་ཏུ་གསོལ།    །"
    },
    {
      "bo": "འདི་ནས་བཟུང་སྟེ་ཚེ་རབས་ཐམས་ཅད་དུ།    །"
    },
    {
      "bo": "དལ་འབྱོར་རྟེན་རྙེད་སྡོམ་གསུམ་རྣམ་པར་དག  །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་རྒྱ་མཚོ་ལྷུན་གྱིས་གྲུབ།    །"
    },
    {
      "bo": "བསྟན་པ་ཕྱོགས་བཅུར་སྤེལ་བའི་བཀྲ་ཤིས་ཤོག  །"
    }
  ]
}