{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/anguished-prayer-buddhas-bodhisattvas",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སངས་རྒྱས་བྱང་སེམས་ལ་སྨྲེ་སྔགས་ཀྱི་གསོལ་བ་འདེབས་པ་བཞུགས།    །"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།"
    },
    {
      "bo": "བླ་མ་མཉམ་མེད་ཐུབ་པའི་དབང་པོ་དང་།    །"
    },
    {
      "bo": "འཇམ་དབྱངས་བྱམས་པ་ཕྱག་རྡོར་སྤྱན་གཟིགས་སོགས།    །"
    },
    {
      "bo": "དམིགས་མེད་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པའི།    །"
    },
    {
      "bo": "རྒྱལ་དང་དེ་སྲས་ཚོགས་རྣམས་དགོངས་སུ་གསོལ།   །"
    },
    {
      "bo": "ཀྱེ་མ།  བདག་འདྲའི་སེམས་ཅན་ལས་ངན་པ།    །"
    },
    {
      "bo": "ལུས་ལ་སྣ་ཚོགས་ནད་ཀྱིས་གདུང་བས་མནར།    །"
    },
    {
      "bo": "ངག་ནི་མི་དགེའི་གཏེར་གྱི་འབྱུང་གནས་གྱུར།    །"
    },
    {
      "bo": "སེམས་ལ་བྱིང་རྨུགས་གཉིད་དང་བརྗེད་ངས་ཆེ།    །"
    },
    {
      "bo": "སྒོ་གསུམ་འཁྲུལ་པའི་རང་བཞིན་འདི་འདྲ་བའི།    །"
    },
    {
      "bo": "གནས་ངན་ལེན་ལ་སྲས་བཅས་རྒྱལ་བ་ཡི།    །"
    },
    {
      "bo": "ཐུགས་རྗེ་ཆེན་པོས་ངེས་པར་གཟིགས་སུ་གསོལ།    །"
    },
    {
      "bo": "བདག་ནི་བླང་དོར་ཅུང་ཟད་ཤེས་ནའང་།    །"
    },
    {
      "bo": "ཤེས་བཞིན་ཉོན་མོངས་ཆང་གི་རབ་མྱོས་པས།    །"
    },
    {
      "bo": "དབང་མེད་གྱུར་པའི་སྐྱེ་ངན་བདག་ཉིད་ལ།    །"
    },
    {
      "bo": "རྒྱལ་སྲས་རྣམས་ཀྱིས་སྐྱོབ་པར་མཛད་དུ་གསོལ།    །"
    },
    {
      "bo": "ལས་ཉོན་འཁྲུལ་འཁོར་དྲག་པོ་བཟློག་པ་དང་།    །"
    },
    {
      "bo": "འཁོར་བའི་མུན་པ་སྨུག་པོ་བསལ་དུ་གསོལ།    །"
    },
    {
      "bo": "ཡེ་ཤེས་ཟེར་གྱིས་སྣང་བའི་སྒོ་ཕྱེས་ལ།    །"
    },
    {
      "bo": "མ་འཁྲུལ་གནས་ལུགས་ཟབ་མོ་དེ་ཁོ་ནའི།    །"
    },
    {
      "bo": "རང་བཞིན་མངོན་གྱུར་བདག་ལ་མཛད་དུ་གསོལ།    །"
    },
    {
      "bo": "ཀྱེ་མ་ཀྱི་ཧུད་རྒྱལ་བ་ཐུགས་རྗེ་ཅན།    །"
    },
    {
      "bo": "ད་ལྟ་ཉིད་དུ་སྲིད་པའི་འདམ་ལས་དྲོངས།    །"
    },
    {
      "bo": "བྱང་ཆུབ་མཆོག་གི་ལམ་ལ་དྲོང་དུ་གསོལ།    །"
    },
    {
      "bo": "སྒྲིབ་པའི་དྲི་མ་དག་ཅིང་བྱང་བ་དང་།    །"
    },
    {
      "bo": "རྟོགས་པའི་ཡོན་ཏན་ཉམས་འོག་ཆུད་པ་དང་།    །"
    },
    {
      "bo": "སྐུ་བཞིའི་རྒྱལ་ས་ཐོབ་པར་མཛད་དུ་གསོལ།    །"
    }
  ]
}