{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/great-pangs-of-devotion-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བླ་མ་རྩ་གསུམ་སྤྱི་དང་ཁྱད་པར་དྲན་པས་གདུང་སེལ་ཐར་རྩེ་མཁན་ཆེན་རྡོ་རྗེ་འཆང་མཆེད་གཉིས་དང་།  མཁྱེན་བརྩེའི་དབང་པོར་གསོལ་འདེབས་མོས་གུས་ཀྱི་གཟེར་ཆེན་ཞེས་བྱ་བ་བཞུགས་སོ།།"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།"
    },
    {
      "bo": "བཅོམ་ལྡན་ཤཱཀ་ཐུབ་ཉེ་སྲས་གནས་བརྟན་ཆེ།    །"
    },
    {
      "bo": "རྒྱ་བོད་མཁས་གྲུབ་རིག་འཛིན་ཚོགས་རྣམས་ཀྱིས།    །"
    },
    {
      "bo": "བྱིན་རླབས་པདྨ་དཀར་པོ་ཆར་དུ་བསྙིལ།    །"
    },
    {
      "bo": "དུས་གསུམ་ཀུན་ཏུ་བཀྲ་ཤིས་རྒྱལ་གྱུར་ཅིག  །"
    },
    {
      "bo": "དགོངས་བརྡ་སྙན་བརྒྱུད་རིག་འཛིན་བླ་མ་དང་།    །"
    },
    {
      "bo": "ཡི་དམ་ཞི་ཁྲོ་གནས་གསུམ་ཌཱ་ཀིའི་ཚོགས།    །"
    },
    {
      "bo": "དམ་ཅན་ཆོས་སྐྱོང་ནོར་ལྷ་གཏེར་གཞི་བདག  །"
    },
    {
      "bo": "དེང་འདིར་བདག་ཅག་རྣམས་ལ་དགོངས་པར་མཛོད།    །"
    },
    {
      "bo": "དམིགས་མེད་བྱམ༷ས་པ༷་སྙིང་རྗེའི་མངའ་བདག་ཆེ།    །"
    },
    {
      "bo": "ཀུན༷་བཟང་རྡོ་རྗེ་འཆང་ཆེན་ཧེ་བཛྲ།    །"
    },
    {
      "bo": "རབ་ཏུ་དགའ༷་བའི་དབང་བསྒྱུར་འཁོར་ལོ་སྡོམ།    །"
    },
    {
      "bo": "དབྱེར་མེད་བསྟན༷་འཛི༷ན་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བྱམ༷ས་པ༷་ཆེན་པོས་འགྲོ་ལ་བུ་བཞིན་དགོངས།    །"
    },
    {
      "bo": "མཐུ་སྟོབས་རྣལ༷་འབྱོར༷་ཕུལ་བྱུང་གྲུབ་པའི་རྗེ།    །"
    },
    {
      "bo": "ཀུན་རྨོངས་ཞེ་སྡང་ཐ་བ་འཇ༷མ་པའི་དཔ༷ལ།    །"
    },
    {
      "bo": "བཟ༷ང་པོ༷འི་མཆོག་གྱུར་བླ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཇ༷མ་དཔལ་དབྱང༷ས་ཀྱི་ཡེ་ཤེས་སྒྱུ་མའི་འཕྲུལ།    །"
    },
    {
      "bo": "མཁྱེན༷་དང་བརྩེ་བ༷འི་དབ༷ང་པོ༷་བཀའ་བབས་བདུན།    །"
    },
    {
      "bo": "ངོ་མཚར་ཤིང་རྟ་འདྲེན་མཛད་བསྟན་པའི་བདག  །"
    },
    {
      "bo": "འོད་གསལ་སྤྲུལ་པའི་རྡོ་རྗེར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དེ་ལྟར་སྙིང་ནས་གསོལ་བ་བཏབ་པ་ལ།    །"
    },
    {
      "bo": "འདྲེན་མཆོག་ཡབ་སྲས་རྣམས་ཀྱི་ཐུགས་རྗེས་གཟིགས།    །"
    },
    {
      "bo": "བུ་ལ་སྐྱིད་སྡུག་ལེགས་ཉེས་ཅི་བྱུང་ཡང་།    །"
    },
    {
      "bo": "བླ་མ་ཡབ་སྲས་ཚོགས་ལ་བློ་གཏད་ན།    །"
    },
    {
      "bo": "ངེས་པར་མཁྱེན་བརྩེའི་སྤྱན་གྱིས་བཙའ་བ་དང་།    །"
    },
    {
      "bo": "བྱམས་པའི་ཕྱག་གིས་ནམ་ཡང་མི་གཏོང་བར།    །"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོ་ཀུན་ཏུ་བསྐྱབ་ཏུ་གསོལ།    །"
    },
    {
      "bo": "ད་ནི་ལྔ་བརྒྱའི་མཐའ་མ་ཡང་མཐར་ལྷུང་།    །"
    },
    {
      "bo": "སངས་རྒྱས་བསྟན་པ་ནུབ་རིར་གཞོལ་ལ་ཉེ།    །"
    },
    {
      "bo": "སྡིག་སྤྱོད་ཀླ་ཀློས་ས་སྟེང་ཐམས་ཅད་ཁྱབ།    །"
    },
    {
      "bo": "སྐྱེ་འགྲོ་ཐམས་ཅད་སྡུག་ལ་གཏོད་དུས་འདིར།    །"
    },
    {
      "bo": "བླ་མ་ཡབ་སྲས་ཐུགས་རྗེ་མཐུ་སྟོབས་ཀྱི།    །"
    },
    {
      "bo": "རྩལ་ཤུགས་ཕྱུངས་ལ་དུས་ཀྱི་རྒུད་པ་བཟློག  །"
    },
    {
      "bo": "བསྟན་པའི་གེགས་ཆགས་མ་ལུས་བསལ་བ་དང་།    །"
    },
    {
      "bo": "ཆོས་སྐྱོང་རྒྱལ་པོའི་ཆབ་སྲིད་ཡུན་བརྟན་མཛོད།    །"
    },
    {
      "bo": "སྐྱེ་འགྲོ་ཕོ་མོའི་ཤེས་རྒྱུད་བགེགས་ཀྱིས་བརླམས།    །"
    },
    {
      "bo": "བསྟན་འགྲོའི་བདེ་སྐྱིད་འཕྲོག་པར་བྱེད་པ་རྣམས།    །"
    },
    {
      "bo": "མྱུར་དུ་ཞི་ནས་བྱམས་པའི་སེམས་ལྡན་ཞིང་།    །"
    },
    {
      "bo": "ཕན་ཚུན་ཕ་མ་ལྟ་བུར་འགྱུར་བར་མཛོད།    །"
    },
    {
      "bo": "བདག་ཅག་རྣམས་ཀྱང་ཆོས་མཐུན་བསམ་སྦྱོར་ཚོགས།    །"
    },
    {
      "bo": "འབད་མེད་འགྲུབ་ཅིང་ལྷ་མིན་འབྱུང་པོ་ཡི།    །"
    },
    {
      "bo": "གནོད་འཚེས་མི་ཚུགས་ཕྱོགས་ལས་རྣམ་པར་རྒྱལ།    །"
    },
    {
      "bo": "ནད་དང་གདོན་ཞི་ཚེ་མཐར་ཕྱིན་པར་མཛོད།    །"
    },
    {
      "bo": "སྡེ་བཞི་དགེ་བཅུའི་སྨན་ལྗོངས་ཉམས་དགའ་བར།    །"
    },
    {
      "bo": "བཀྲ་ཤིས་ལྷ་རི་རྩེ་མོའི་དགོན་པ་རུ།    །"
    },
    {
      "bo": "ཀུན་མཁྱེན་བླ་མའི་ཆོས་ཀྱི་ཕོ་བྲང་དེར།    །"
    },
    {
      "bo": "བག་ཕེབས་བཀྲ་ཤིས་དགེ་ལེགས་རྒྱས་པར་མཛོད།    །"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་བཞིན་འགྲུབ་པ་ལ།    །"
    },
    {
      "bo": "སངས་རྒྱས་བྱང་སེམས་ཉན་རང་ལ་སོགས་དང་།    །"
    },
    {
      "bo": "ཁྱད་པར་རྩ་གསུམ་ཀུན་འདུས་ཨོ་རྒྱན་རྗེས།    །"
    },
    {
      "bo": "བདེན་པའི་རྒྱབ་སྐྱོར་བདེན་དོན་མངོན་སུམ་དུ།    །"
    },
    {
      "bo": "མྱུར་དུ་འགྲུབ་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།    །"
    }
  ]
}