{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/chokgyur-dechen-lingpa/prayer-for-disciples",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སློབ་མས་བསྐུལ་བའི་གསོལ་འདེབས།"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོཿ"
    },
    {
      "bo": "གདོད་མའི་མགོན་པོ་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་། །"
    },
    {
      "bo": "ལོངས་སྤྱོད་རྫོགས་སྐུ་རིགས་ལྔ་ཡབ་ཡུམ་བཅུ། །"
    },
    {
      "bo": "སྤྲུལ་སྐུ་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དང་། །"
    },
    {
      "bo": "སྟོན་པ་སྟོང་རྩ་ཉེ་བའི་སྲས་ཆེན་སོགས། །"
    },
    {
      "bo": "ཕྱོགས་བཅུ་དུས་གསུམ་བྱོན་པ་རྒྱལ་བའི་ཚོགས། །"
    },
    {
      "bo": "བདེ་བར་གཤེགས་པ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བདག་དང་འགྲོ་དྲུག་འཁོར་བའི་གནས་ནས་དྲོངས། །"
    },
    {
      "bo": "འཇིག་རྟེན་མིག་གྱུར་འཕགས་ཡུལ་སློབ་དཔོན་བརྒྱད་། །"
    },
    {
      "bo": "གསང་ཆེན་སྟོན་གཙོ་གུ་རུ་རིན་པོ་ཆེ། །"
    },
    {
      "bo": "གསང་སྔགས་བཀའ་ཡི་བསྡུ་དཔོན་མཚོ་རྒྱལ་མ། །"
    },
    {
      "bo": "ཐུགས་བྱོན་མུ་ཏྲ་མངའ་བདག་ཡབ་སྲས་བཞི། །"
    },
    {
      "bo": "རྗེ་འབངས་ཉེར་ལྔ་མཁས་དང་གྲུབ་པའི་གཙོ། །"
    },
    {
      "bo": "བོད་ལ་དྲིན་ཅན་མཛད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྙིགས་མའི་བོད་འབངས་རྣམས་ལ་ཐུགས་རྗེའི་གཟིགས། །"
    },
    {
      "bo": "འཇིག་རྟེན་སྒྲོན་མེ་གཏེར་ཆེན་བརྒྱ་རྩའི་ཞབས། །"
    },
    {
      "bo": "རིས་མེད་འགྲོ་འདྲེན་གཏེར་ཕྲན་སྟོང་རྩ་གཉིས། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་ཡང་གཏེར་བྱེ་བའི་ཚོགས། །"
    },
    {
      "bo": "ཆོས་བདག་བརྒྱུད་འཛིན་ཁྱད་པར་ད་ལྟའི་དུས། །"
    },
    {
      "bo": "མཁས་བཙུན་ཕུལ་བྱུང་བསྟན་འགྲོའི་མིག་རྣམས་སུ། །"
    },
    {
      "bo": "མཛེས་པར་གར་སྒྱུར་འཁྲུལ་མེད་གང་ཟག་མཆོག །"
    },
    {
      "bo": "ཐེ་ཚོམ་གནས་མེད་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྱད་པར་སྙིགས་མའི་བསྟན་འཛིན་པཎྜི་ཏ། །"
    },
    {
      "bo": "ཆེ་མཆོག་འདུས་རྩལ་བྱང་སེམས་ཚད་མེད་ཅིང་། །"
    },
    {
      "bo": "འགྲུ་རྗེའི་སྡོང་འཁྲུངས་མཛད་པ་བཅུ་གཉིས་ཀྱི། །"
    },
    {
      "bo": "འགྲོ་འདྲེན་མགོན་པོ་དཔལ་ལྡན་འགྱུར་མེད་ཅེས། །"
    },
    {
      "bo": "བཀའ་དྲིན་ཅན་གྱི་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཅིག་ཆོག་གྱུར་པར་གསོལ་བ་བཏབ་པའི་མཐུས། །"
    },
    {
      "bo": "ཕྱི་ནང་བར་ཆད་ཞི་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དངོས་གྲུབ་རྣམ་གཉིས་ཐོབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་སེམས་སངས་རྒྱས་མངོན་སུམ་མཐོང་བ་དང་། །"
    },
    {
      "bo": "ནམ་ཞིག་སྐྱེ་འཆིའི་ཁ་ལོ་གར་བསྒྱུར་ཀྱང་། །"
    },
    {
      "bo": "ཚེ་རབས་ཨོ་རྒྱན་པདྨས་རྗེས་འཛིན་ཤོག །"
    }
  ]
}