{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/chokgyur-dechen-lingpa/prayer-to-vidyadhara-gurus",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "སྐྱབས་ཀུན་འདུས་ཞལ་གུ་རུ་རིན་པོ་ཆེའི་གཙོས་རྩ་གསུམ་བརྒྱུད་པར་བཅས་པ་ལ་གསོལ་འདེབས་ཀྱི་ཕྲེང་བ་བྱིན་རླབས་ནོར་བུའི་གྲུ་ཆར་ལས་བཀོལ་དུ་ཕྱུང་ངོ་། །"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོཿ ཆོས་དབྱིངས་རྣམ་པར་དག་པའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "སྐྱེ་མེད་ཆོས་སྐུ་དག་པའི་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "ཆོས་སྐུ་ཀུན་ཏུ་བཟང་པོ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱེ་མེད་ཆོས་སྐུ་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འོག་མིན་འཐུག་པོ་བཀོད་པའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "གཏི་མུག་རྣམ་དག་མེ་ལོང་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཏི་མུག་རྣམ་དག་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཤར་ཕྱོགས་མངོན་པར་དགའ་བའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "ཞེ་སྡང་རྣམ་དག་སྟོང་ཉིད་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "སངས་རྒྱས་རྡོ་རྗེ་སེམས་དཔའ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཞེ་སྡང་རྣམ་དག་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལྷོ་ཕྱོགས་དཔལ་ལྡན་མཛེས་པའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "ང་རྒྱལ་རྣམ་དག་མཉམ་ཉིད་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "སངས་རྒྱས་རིན་ཆེན་འབྱུང་ལྡན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ང་རྒྱལ་རྣམ་དག་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ནུབ་ཕྱོགས་བདེ་བ་ཅན་གྱི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "འདོད་ཆགས་རྣམ་དག་སོར་རྟོག་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འདོད་ཆགས་རྣམ་དག་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བྱང་ཕྱོགས་ལས་རབ་རྫོགས་པའི་ཞིང་ཁམས་སུ། །"
    },
    {
      "bo": "ཕྲག་དོག་རྣམ་དག་བྱ་གྲུབ་ཕོ་བྲང་ནས། །"
    },
    {
      "bo": "སངས་རྒྱས་དོན་ཡོད་གྲུབ་པ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྲག་དོག་རྣམ་དག་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སེམས་དཔའ་བརྒྱད་དང་སངས་རྒྱས་སྟོང་རྩ་དང་། །"
    },
    {
      "bo": "སེམས་མ་བརྒྱད་སོགས་ལོངས་སྐུ་སྤྲུལ་སྐུའི་ཞིང་། །"
    },
    {
      "bo": "སངས་རྒྱས་བྱང་སེམས་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བདག་རྒྱུད་བྱིན་བརླབ་གཞན་རྒྱུད་གྲོལ་བ་དང་། །"
    },
    {
      "bo": "ཕྲིན་ལས་ཕྱོགས་བཅུར་རྒྱས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དུས་གསུམ་བདེ་གཤེགས་ཐམས་ཅད་གཅིག་བསྡུས་པའི། །"
    },
    {
      "bo": "རྗེ་བཙུན་གུ་རུ་པདྨ་རིན་པོ་ཆེ། །"
    },
    {
      "bo": "སློབ་དཔོན་བརྒྱད་དང་མ་གཅིག་མཚོ་རྒྱལ་མ། །"
    },
    {
      "bo": "ལོ་པཎ་རྗེ་འབངས་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་མཐར་ཕྱིན་རྩ་རླུང་མངོན་གྱུར་ནས། །"
    },
    {
      "bo": "འཆི་མེད་ཚེ་ཡི་དངོས་གྲུབ་ཐོབ་ནས་སུ། །"
    },
    {
      "bo": "ཚེ་འདིར་འཇའ་ལུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་རིམ་བྱོན་གཏེར་ཆེན་གཏེར་ཕྲན་དང་། །"
    },
    {
      "bo": "བཀའ་གཏེར་བརྒྱུད་པའི་བླ་མ་རིག་འཛིན་སོགས། །"
    },
    {
      "bo": "རྒྱ་བོད་རིས་མེད་བླ་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དག་སྣང་བརྩོན་འགྲུས་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལོངས་སྐུའི་ཞིང་དུ་སྟོན་པ་རྡོ་རྗེ་སེམས། །"
    },
    {
      "bo": "ཐུབ་པའི་ཉན་ཐོས་ལག་ན་རྡོ་རྗེ་དང་། །"
    },
    {
      "bo": "པད་འབྱུང་དྲུང་དུ་རྒྱལ་སྲས་མུ་རུབ་བཙན། །"
    },
    {
      "bo": "ཟབ་གཏེར་མངའ་བདག་སངས་རྒྱས་གླིང་པ་མཆོག །"
    },
    {
      "bo": "ཡང་སྤྲུལ་རིག་འཛིན་མི་འགྱུར་རྡོ་རྗེ་དང་། །"
    },
    {
      "bo": "གུ་དྲག་བཀའ་བབས་རིག་འཛིན་མཆོག་གྱུར་གླིང་། །"
    },
    {
      "bo": "མ་འོངས་གཏེར་སྟོན་དྲི་མེད་ཀུན་ལྡན་དང་། །"
    },
    {
      "bo": "སངས་རྒྱས་མོས་པ་ཅན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བྱིན་གྱིས་རློབས་ཤིག་བླ་མ་རིག་འཛིན་ཚོགས། །"
    },
    {
      "bo": "བར་ཆད་སོལ་ཅིག་རིག་འཛིན་སངས་རྒྱས་གླིང་། །"
    },
    {
      "bo": "དངོས་གྲུབ་སྩོལ་ཅིག་མི་འགྱུར་རྡོ་རྗེ་རྩལ། །"
    },
    {
      "bo": "ཕྲིན་ལས་རྒྱས་ཤིག་རིག་འཛིན་མཆོག་གྱུར་གླིང་། །"
    },
    {
      "bo": "ཁྱེད་ཀྱིས་རྗེས་འཛིན་བུ་སློབ་བདག་ཅག་ལ། །"
    },
    {
      "bo": "བྱིན་གྱིས་རློབས་ཤིག་དྲིན་ཅན་བླ་མ་རྗེ། །"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་འགྲུབ་པར་མཛད་དུ་གསོལ། །"
    }
  ]
}