{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/yukhok-chatralwa/synthesis-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མཁས་གྲུབ་བླ་མ་དུ་མའི་གསུང་བྱིན་རླབས་ཅན་ཕྱོགས་གཅིག་ཏུ་བསྡུས་པ།"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་དྲིན་ཆེན་བླ་མ་ལ།"
    },
    {
      "bo": "།གསོལ་བ་འདེབས་སོ་ཐུགས་རྗེའི་སྤྱན་གྱིས་གཟིགས། །"
    },
    {
      "bo": "འཁོར་བར་ཞེན་པ་ལོག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ངེས་འབྱུང་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚེ་འདི་བློ་ཡིས་ཐོང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཉམས་དགའ་རི་ཁྲོད་འགྲིམ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གྲོགས་མེད་བློ་བདེ་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དགོས་མེད་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དལ་འབྱོར་སྙིང་པོ་ལོན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འཆི་བ་སྙིང་ནས་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མི་རྟག་རྒྱུད་ལ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ནམ་འཆི་ཆ་མེད་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འགྲོ་དྲུག་ཕ་མར་ཤེས་པར་བྱིན་་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚད་མེད་སྙིང་རྗེ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དགེ་སྡིག་བླང་དོར་ཤེས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྒྱུ་འབྲས་བསླུ་མེད་མཐོང་བར་བྱིན་་གྱིས་རློབས། །"
    },
    {
      "bo": "ཆོས་ལ་སྙིང་རུས་ནུས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་སེམས་ཆོས་དང་འདྲེས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྐྱེན་ངན་གྲོགས་སུ་འཆར་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གཟུང་འཛིན་འཁྲུལ་བ་ཞིག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འཁྲུལ་སྣང་བདེན་མེད་འཆར་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྟག་ཏུ་བླ་མ་དྲན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མོས་གུས་གཏིང་ནས་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྣང་སྲིད་བླ་མར་འཆར་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཐུགས་ཡིད་དབྱེར་མེད་འདྲེས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལྟ་བ་མཐའ་བྲལ་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྒོམ་པ་འཁོར་ཡུག་འདྲེས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྤྱོད་པ་བླང་དོར་བྲལ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འབྲས་བུ་སྐུ་གསུམ་ཐོབ་པར་བྱིན་གྱིས་རློབས། །"
    }
  ]
}