{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/shechen-rabjam-rinpoche/potent-nectar-of-accomplishment",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅།།བརྒྱུད་གསུམ་རིག་འཛིན་བླ་མར་གསོལ་སྨོན་དངོས་གྲུབ་བདུད་རྩིའི་བཅུད་འཛིན་ཞེས་བྱ་བ་བཞུགས་སོ།"
  },
  "text": [
    {
      "bo": "གཞི་དབྱིངས་འགྱུར་མེད་ཆོས་སྐུ་ཀུན་ཏུ་བཟང་། །"
    },
    {
      "bo": "གཞི་སྣང་ལོངས་སྐུ་ཡེ་ཤེས་རིགས་ལྔའི་སྤྲིན། །"
    },
    {
      "bo": "འགྲོ་འདུལ་རིགས་གསུམ་དགོངས་བརྒྱུད་བླ་མ་ལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "སྤྲུལ་པའི་རིག་འཛིན་དགའ་རབ་ཤྲཱི་སིང་། །"
    },
    {
      "bo": "རྒྱལ་ཀུན་ངོ་བོ་པད་འབྱུང་བི་མ་ལ། །"
    },
    {
      "bo": "གྲུབ་པའི་རིག་འཛིན་རྩལ་འཆང་རྣམ་བརྒྱད་ལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་ཡབ་སྲས་བཻ་རོ་ནམ་སྙིང་འབངས། །"
    },
    {
      "bo": "དབྱིངས་ཕྱུགས་ཡུམ་ལྔའི་རྣམ་རོལ་མཁའ་འགྲོ་ལྔ། །"
    },
    {
      "bo": "བཀའ་བབ་སྙན་བརྒྱུད་རིག་འཛིན་ཚོགས་བཅས་ལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "ཉང་གུར་ཀུན་མཁྱེན་ཡབ་སྲས་མངའ་པཎ་རྗེ། །"
    },
    {
      "bo": "བྱང་བདག་རྡོ་རྗེ་ཐོག་མེད་ཆོས་རྗེ་གླིང་། །"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་སོགས་རྣམ་རོལ་བསམས་ཡས་ལ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "འགྱུར༵་མེད༵་རྒྱལ་ཀུན་ངོ་བོ་རིགས་ཀྱི་བདག །"
    },
    {
      "bo": "སྙིགས་དུས་ཐེ༵ག་མཆོ༵ག་བཀའ་གཏེར་བཤད་སྒྲུབ་མགོན། །"
    },
    {
      "bo": "བསྟ༵ན་པའི༵་རྒྱལ༵་མཚ༵ན་འཛིན་ཀུན་གཙུག་གི་རྒྱན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "འཇམ་མགོན་མཁྱེན་བརྩེའི་ཕྲིན་ལས་རང་དབང་བསྒྱུར། །"
    },
    {
      "bo": "ཀུན་གཟིགས་པདྨ་ཡེ་ཤེས་རྡོ་རྗེ་དང་། །"
    },
    {
      "bo": "བཻ་རོའི་རྣམ་རོལ་འཁྲུལ་ཞིག་དྷརྨའི་མཚན། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཕྲིན་ལས་ཆར་ཆེན་ཕོབས། །"
    },
    {
      "bo": "རབ་འབྱམས་ཆོས་ཚུལ་རྒྱ་མཚོའི་སྣོད་དུ་གྱུར། །"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཆོས་ཀྱི་སེངྒེའི་མཚན་གྱིས་སྤུད། །"
    },
    {
      "bo": "ཆོས་བདག་དབུགས་དབྱུངས་དགོངས་རྒྱུད་བྱིན་རླབས་ཐོབ། །"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱིན་རླབས་མཆོག་དངོས་སྩོལ། །"
    },
    {
      "bo": "སྐུ་མཆོག་འཇམ་དཔལ་གསུང་མཆོག་ཚེ་ཡི་ལྷ། །"
    },
    {
      "bo": "ཐུགས་མཆོག་ཡང་དག་ཡོན་ཏན་བླ་མའི་ཚོགས། །"
    },
    {
      "bo": "ཕྲིན་ལས་ཕུར་པ་ཟབ་ཡངས་དགོངས་པའི་གཏེར། །"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་ཚོགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟག་བཅས་འཁོར་བའི་ཡུལ་ལ་མི་ཆགས་པར། །"
    },
    {
      "bo": "ལམ་གྱི་མཐུན་རྐྱེན་སྡོམ་གསུམ་རྣམ་པར་དག །"
    },
    {
      "bo": "དད་བརྩོན་དྲག་པོས་ཐོས་བསམས་མིག་རྙེད་ནས། །"
    },
    {
      "bo": "ཞི་བའི་གནས་སུ་སྒྲུབ་ལ་གཞོལ་བར་ཤོག །"
    },
    {
      "bo": "གཞི་རྒྱུད་བྱང་ཆུབ་སེམས་ཀྱི་ཞིང་ས་བརླན། །"
    },
    {
      "bo": "ལམ་རྒྱུད་སྨིན་གྲོལ་སྐུ་བཞི་ས་བོན་ཐེབས། །"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གྱི་དྲོད་རྟགས་མཐར་ཕྱིན་ནས། །"
    },
    {
      "bo": "འབྲས་རྒྱུད་ལྷུན་གྲུབ་རིག་འཛིན་མངོན་གྱུར་ཤོག །"
    },
    {
      "bo": "གནས་སྐབས་སུ་ཡང་དོན་གཉིས་སྒྲུབ་པ་ལ། །"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་བར་ཆད་མི་འབྱུང་ཞིང་། །"
    },
    {
      "bo": "ནད་མེད་ཚེ་རིང་བསམ་རྒུ་ཡིད་བཞིན་འགྲུབ། །"
    },
    {
      "bo": "ཉམས་རྟོགས་རིག་པའི་རྩལ་ཆེན་འབར་གྱུར་ཅིག །"
    },
    {
      "bo": "འདི་ལ་བཟང་ངན་ལས་འབྲེལ་ཤི་གསོན་ཀུན། །"
    },
    {
      "bo": "རང་སྣང་འཁྲུལ་པ་བར་དོའི་འཇིགས་སྐྲག་ལ། །"
    },
    {
      "bo": "རང་ངོ་ཤེས་ནས་སྣང་མཆེད་ཐོབ་གསུམ་གྱི། །"
    },
    {
      "bo": "རང་སྣང་དག་པའི་སྐུ་གསུམ་མངོན་གྱུར་ཤོག །"
    },
    {
      "bo": "རིག་འཛིན་བླ་མའི་ཐུགས་ཀྱི་དྭངས་མའི་བཅུད། །"
    },
    {
      "bo": "ཆོས་མཆོག་དྲི་མེད་ཟབ་མོ་དགོངས་པའི་གཏེར། །"
    },
    {
      "bo": "འཇིག་རྟེན་ཀུན་ཁྱབ་ཀུན་ཀྱང་སྣོད་གྱུར་ནས། །"
    },
    {
      "bo": "དངོས་བརྒྱུད་རིག་འཛིན་ས་ལ་དབུགས་དབྱུངས་ཤོག །"
    },
    {
      "bo": "སྣོད་བཅུད་རྒུད་པའི་ཉེས་ཚོགས་ཀུན་ཞི་ཞིང་། །"
    },
    {
      "bo": "ཚེ་བསོད་དབང་རླུང་ཉམས་རྟོགས་ངང་གིས་རྒྱས། །"
    },
    {
      "bo": "ཁམས་གསུམ་ཆེ་རྒུའི་རླུང་སེམས་རང་དབང་འདུས། །"
    },
    {
      "bo": "མི་མཐུན་དགྲ་བགེགས་ཡོངས་སྒྲོལ་བཀྲ་ཤིས་ཤོག །"
    }
  ]
}