{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jatson-nyingpo/prayer-to-rigdzin-jatson-nyingpo",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རིག་འཛིན་འཇའ་ཚོན་སྙིང་པོའི་གསོལ་འདེབས་བཞུགས་སོ། །",
    "en": "Prayer to Rigdzin Jatsön Nyingpo"
  },
  "text": [
    {
      "bo": "ཧྲཱིཿ མ་བཅོས་ལྷུན་གྲུབ་ཀ་དག་རང་བྱུང་ལས། །",
      "en": "Hrīḥ! From self-arising primordial purity and unaltered spontaneous presence",
      "en-trans": "hrih, machö lhündrub kadak rangjung lé"
    },
    {
      "bo": "ཅིར་ཡང་འཆར་བའི་རིག་རྩལ་སྒྱུ་འཕྲུལ་ནི། །",
      "en": "You arose as the magical expression of rigpa appearing in any form—",
      "en-trans": "chiryang charwé riktsal gyutrul ni"
    },
    {
      "bo": "གསང་སྔགས་རྙིང་མའི་བསྟན་འཛིན་བང་རི་བ། །",
      "en": "Bangriwa,1upholder of the Nyingma teachings of secret mantra —",
      "en-trans": "sang ngak nyingmé tendzin bang riwa"
    },
    {
      "bo": "ཨོ་རྒྱན་ལས་འཕྲོ་གླིང་པར་གསོལ་བ་འདེབས། །",
      "en": "Orgyen Letro Lingpa, to you I pray!",
      "en-trans": "orgyen letro lingpar solwa deb"
    },
    {
      "bo": "དང་པོ་མདོ་རྒྱུད་མན་ངག་ལེགས་པར་སྦྱངས། །",
      "en": "Initially, you trained thoroughly in sūtras, tantras and pith instructions;",
      "en-trans": "dangpo dogyü mengak lekpar jang"
    },
    {
      "bo": "བར་དུ་བསྐྱེད་རྫོགས་དབྱེར་མེད་བསྒྲུབས་པ་ཚུགས། །",
      "en": "Then, you accomplished the inseparability of development and completion;",
      "en-trans": "bardu kyedzok yermé drubpa tsuk"
    },
    {
      "bo": "ཡང་དག་དོན་གྱི་རབ་འབྱམས་བང་རི་བ། །",
      "en": "Bangriwa, master of the absolute meaning of reality —",
      "en-trans": "yangdak dön gyi rabjam bang riwa"
    },
    {
      "bo": "རིག་འཛིན་འཇའ་ཚོན་སྙིང་པོར་གསོལ་བ་འདེབས། །",
      "en": "Rigdzin Jatsön Nyingpo, to you I pray!",
      "en-trans": "rigdzin jatsön nyingpor solwa deb"
    },
    {
      "bo": "རྒྱལ་དབང་པདྨའི་ཡང་སྤྲུལ་དགེ་སྦྱོང་ཚུལ། །",
      "en": "Emanation of Padmākara, king of victorious ones, in the form of a monk,",
      "en-trans": "gyalwang pemé yangtrul gejong tsul"
    },
    {
      "bo": "བསྐལ་དུས་སྙིགས་མའི་འགྲོ་བའི་དཔལ་དུ་ཤར། །",
      "en": "You appeared as beings’ splendour in this time of degeneration,",
      "en-trans": "kaldü nyikmé drowé pal du shar"
    },
    {
      "bo": "བདག་འཛིན་རུ་ཏྲ་འཇོམས་པའི་བང་རི་བ། །",
      "en": "Bangriwa, destroyer of the rudra of ego-clinging —",
      "en-trans": "dakdzin rudra jompé bang riwa"
    },
    {
      "bo": "སྔགས་འཆང་ཧཱུྃ་ནག་མེ་འབར་ལ་གསོལ་བ་འདེབས། །",
      "en": "Ngakchang Hungnak Mebar, to you I pray!",
      "en-trans": "ngakchang hung nak mebar la solwa deb"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་རླབས་ཀྱིས། །",
      "en": "Through the blessings of praying in this way,",
      "en-trans": "detar solwa tabpé jinlab kyi"
    },
    {
      "bo": "གནས་སྐབས་མཐར་ཐུག་དངོས་གྲུབ་ཆར་འབེབས་ཤིང་། །",
      "en": "May the rain of temporary and ultimate accomplishments shower down,",
      "en-trans": "nekab tartuk ngödrub charbeb shing"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་ལྡན་འཇའ་ལུས་འོད་ཕུང་གྱུར། །",
      "en": "And may we attain the rainbow body, radiant and endowed with wisdom, compassion and capacity—",
      "en-trans": "khyentsé nü den jalü öpung gyur"
    },
    {
      "bo": "བདག་གཞན་དཀྱིལ་འཁོར་གཅིག་ཏུ་འགྲུབ་པར་ཤོག །",
      "en": "I and others all together in a single maṇḍala.",
      "en-trans": "dakzhen kyilkhor chik tu drubpar shok"
    }
  ]
}