{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-karse-kongtrul",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཀརྨ་དཔལ་ལྡན་མཁྱེན་བརྩེའི་གསོལ་འདེབས།",
    "en": "Prayer to Karma Palden Khyentse"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om swasti"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བ་མ་ལུས་འདུས་པའི་དངོས། །",
      "en": "Actual embodiment of all the victorious ones of the three times,",
      "en-trans": "dü sum gyalwa malü düpé ngö"
    },
    {
      "bo": "རིགས་ཀུན་ཁྱབ་བདག་འཇམ་མགོན་སྤྲུལ་པའི་སྐུ། །",
      "en": "Omnipresent lord of all buddha families, nirmāṇakāya Mañjunātha,",
      "en-trans": "rik kün khyabdak jamgön trulpé ku"
    },
    {
      "bo": "ཀརྨ་དཔལ་ལྡན་མཁྱེན་བརྩེའི་འོད་ཟེར་ལ། །",
      "en": "Karma Palden Khyentse Özer,",
      "en-trans": "karma palden khyentsé özer la"
    },
    {
      "bo": "སྙིང་ནས་གསོལ་འདེབས་བདག་རྒྱུད་བྱིན་གྱིས་རློབས། །",
      "en": "I pray to you from the depth of my heart: inspire me with your blessings!",
      "en-trans": "nying né soldeb dak gyü jingyi lob"
    },
    {
      "bo": "ངེས་འབྱུང་བྱང་སེམས་རྒྱུད་ལ་སྐྱེ་བ་དང་། །",
      "en": "Cause renunciation and bodhicitta to arise in my stream of being,",
      "en-trans": "ngejung changsem gyü la kyewa dang"
    },
    {
      "bo": "ཐུགས་རྒྱུད་དགོངས་པའི་བྱིན་ཆེན་འཕོ་བ་ལས། །",
      "en": "And through transmitting the great blessing of your wisdom intent,",
      "en-trans": "tukgyü gongpé jin chen powa lé"
    },
    {
      "bo": "རང་རིག་གཉུག་མ་ཕྱག་རྒྱ་ཆེན་པོ་ཡི། །",
      "en": "Cause the realization of Mahāmudrā, my own genuine awareness,",
      "en-trans": "rangrig nyukma chakgya chenpo yi"
    },
    {
      "bo": "རྟོགས་པ་ཡང་དག་ཇི་བཞིན་འཁྲུངས་པར་ཤོག །",
      "en": "To arise authentically, just as it is, within my mind!",
      "en-trans": "tokpa yangdak jizhin trungpar shok"
    },
    {
      "bo": "འདི་ཕྱི་བར་དོའི་གནས་སྐབས་ཐམས་ཅད་དུ། །",
      "en": "In this life, the next, and all the phases of the intermediate state,",
      "en-trans": "di chi bardö nekab tamché du"
    },
    {
      "bo": "འཇམ་མགོན་ཡིད་བཞིན་ནོར་བུས་རྗེས་བཟུང་ནས། །",
      "en": "May I be guided and cared for by you, Gentle Lord and Wish-Fulfilling Gem,",
      "en-trans": "jamgön yizhin norbü jezung né"
    },
    {
      "bo": "གསང་བ་གསུམ་དང་དབྱེར་མེད་གྱུར་ནས་ཀྱང་། །",
      "en": "And having become inseparable from your secret body, speech and mind,",
      "en-trans": "sangwa sum dang yermé gyur né kyang"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པར་ཤོག །",
      "en": "May the twofold benefit of myself and others be spontaneously accomplished!",
      "en-trans": "rangzhen dön nyi lhün gyi drubpar shok"
    }
  ]
}