{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/beautiful-garland-udumbara-flowers",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྐྱེ་ཕྲེང་གསོལ་འདེབས་ཨུ་དུམྦ་རའི་ཕྲེང་མཛེས་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭ་སྟི།"
    },
    {
      "bo": "རྒྱལ་བ་སྲས་དང་བཅས་པའི་ཡེ་ཤེས་སྐུ། །"
    },
    {
      "bo": "ཕྱོགས་དུས་མུ་མཐའ་མེད་པར་ཁྱབ་པའི་བདག །"
    },
    {
      "bo": "རང་བྱུང་དང་པོའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས། །"
    },
    {
      "bo": "མགོན་པོ་འཇམ་པའི་དབྱངས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཁྱེན་རབ་དབང་ཕྱུག་འཇམ་དཔལ་བཤེས་གཉེན་དང༌། །"
    },
    {
      "bo": "རྡོ་རྗེའི་སྐུ་བརྙེས་བི་མ་ལ་མི་ཏྲ། །"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་དངོས་རྡོ་རྗེ་དྲིལ་བུ་པ། །"
    },
    {
      "bo": "པཎ་ཆེན་སྒོ་མཐའ་ཡས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་ཚངས་པ་ལྷ་ཡི་མེ་ཏོག་དང༌། །"
    },
    {
      "bo": "དེ་ཡི་ཡང་སྤྲུལ་མཆོག་གྲུབ་རྒྱལ་པོའི་ཞབས། །"
    },
    {
      "bo": "སྨྲྀ་ཏི་ཛྙཱ་ན་ཉང་སྟོན་ཉི་མ་འོད། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་འཕགས་པ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་པའི་གཙུག་རྒྱན་མི་ལ་རས་པ་དང༌། །"
    },
    {
      "bo": "འབྲི་གུང་རིན་ཆེན་དཔལ་དང་དྲི་མེད་འོད། །"
    },
    {
      "bo": "སྨན་བླ་དངོས་སྣང་གཡུ་ཐོག་ཡོན་ཏན་མགོན། །"
    },
    {
      "bo": "བསོད་ནམས་རྒྱལ་མཚན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ནགས་ཀྱི་རིན་ཆེན་འགོས་ལོ་གཞོན་ནུ་དཔལ། །"
    },
    {
      "bo": "མཁྱེན་རབ་ཆོས་རྗེ་པཎ་ཆེན་དགེ་འདུན་གྲུབ། །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཐང་སྟོང་རྒྱལ་པོ་དང༌། །"
    },
    {
      "bo": "དཀོན་མཆོག་རྒྱལ་མཚན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ས་ལོ་འཇམ་དབྱངས་ཀུན་དགའ་བསོད་ནམས་དང༌། །"
    },
    {
      "bo": "མངའ་རིས་པཎ་ཆེན་གནས་གསར་མཁྱེན་བརྩེའི་དབང༌། །"
    },
    {
      "bo": "བཀྲ་ཤིས་སྟོབས་རྒྱལ་བློ་བཟང་རྒྱ་མཚོའི་སྡེ། །"
    },
    {
      "bo": "རྒྱལ་བ་ཚངས་དབྱངས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྩོད་དུས་ཀུན་མཁྱེན་ཆེན་པོ་འཇིགས་མེད་གླིང༌། །"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་ཡེ་ཤེས་རྡོ་རྗེ་དང༌། །"
    },
    {
      "bo": "དབྱེར་མེད་བཀའ་བབས་བདུན་ལྡན་མཁྱེན་བརྩེའི་དབང༌། །"
    },
    {
      "bo": "འཇམ་དབྱངས་བློ་གྲོས་རྒྱ་མཚོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱེ་བ་འདི་བཟུང་བྱང་ཆུབ་མ་ཐོབ་བར། །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མ་ཁྱེད་དང་མི་འབྲལ་ཞིང༌། །"
    },
    {
      "bo": "གསུང་གསང་གདམས་པའི་བདུད་རྩིར་སྤྱོད་པ་དང་། །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་འགྲུབ་པར་ཤོག །"
    }
  ]
}