{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/trulshik-rinpoche/gateway-for-the-faithful",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ངག་དབང་ཆོས་ཀྱི་བློ་གྲོས་ཀྱི་སྐྱེས་རབས་དང་རྣམ་ཐར་གསོལ་འདེབས་སུ་བཏགས་པ་དད་པའི་འཇུག་ངོགས་ཞེས་བྱ་བ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།"
    },
    {
      "bo": "ཆོས་དབྱིངས་མཁའ་ལ་ཐུགས་རྗེའི་ཆུ་འཛིན་འཁྲིགས། །"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་བདེ་འཐུང་སྙན་པའི་དབྱར་རྔ་སྒྲོགས། །"
    },
    {
      "bo": "མཆོག་ཐུན་དངོས་གྲུབ་སྦྲང་ཆར་འབེབས་མཛད་པ། །"
    },
    {
      "bo": "རིགས་ཀུན་ཁྱབ་བདག་རྗེ་བཙུན་བླ་མར་འདུད། །"
    },
    {
      "bo": "མི་འགྱུར་ཀུན་ཁྱབ་ཡེ་ཤེས་གཟུགས་ཀྱི་གར། །"
    },
    {
      "bo": "མཚན་དཔེ་ཆུ་ཟླའི་སྣང་བརྙན་ཇི་སྲིད་དུ། །"
    },
    {
      "bo": "མི་གཡོ་ལོངས་སྤྱོད་ངེས་པ་ལྔ་ལྡན་རྫོགས། །"
    },
    {
      "bo": "སྤྲུལ་གཞི་རྣམ་སྣང་ཆེན་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཇི་ལྟ་ཀུན་བཟང་རྡོ་རྗེ་འཆང་དབང་གི། །"
    },
    {
      "bo": "ཇི་སྙེད་གསང་ཆེན་བཀའ་ཡི་བསྡུ་བ་པོར། །"
    },
    {
      "bo": "རབ་འབྱམས་རྒྱལ་བས་མགྲིན་གཅིག་བསྔགས་མཛད་པ། །"
    },
    {
      "bo": "གསང་བདག་རྡོ་རྗེ་ཆོས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཉི་མའི་གཉེན་གྱི་སྲི་ཞུ་མཐར་ཕྱིན་ནས། །"
    },
    {
      "bo": "དགྲ་བཅོམ་ལྔ་བརྒྱའི་སྣམ་སྦྱར་བཏིང་བའི་སྟེང༌། །"
    },
    {
      "bo": "འདི་སྐད་བདག་གིས་ཐོས་ཞེས་བཀའ་བསྡུའི་སྲོལ། །"
    },
    {
      "bo": "ཕྱེ་མཛད་ཀུན་དགའ་བོ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ངོ་མཚར་ལྟས་བཞིན་ཏནྟྲའི་གླེགས་བམ་ཆར། །"
    },
    {
      "bo": "ཁང་སྟེང་དངོས་སུ་བབས་ནས་རྡོ་རྗེ་སེམས། །"
    },
    {
      "bo": "བསྒྲུབས་པས་ཞལ་བསྟན་སྙིང་པོའི་རྒྱུད་རྟོགས་བསྟན། །"
    },
    {
      "bo": "རྒྱལ་པོ་ཛཿཞེས་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ནཱ་གརྫུ་ནས་དབུ་མའི་ཞིང་རྟ་གཏད། །"
    },
    {
      "bo": "སྐྱེ་བའི་མཆོག་གྱུར་སྡེ་སྣོད་མཁས་པའི་ཕུལ། །"
    },
    {
      "bo": "འཛམ་གླིང་མཛེས་པའི་རྒྱན་དྲུག་ཕྲེང་བའི་དབུས། །"
    },
    {
      "bo": "ཨཱརྻ་དེ་ཝར་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཛ་ལནྡྷ་རས་རྗེས་བཟུང་བདེ་མཆོག་གྲུབ། །"
    },
    {
      "bo": "གཞུང་དྲུག་གསལ་མཛད་གྲུབ་ཆེན་སྟོང་རྩས་འདུད། །"
    },
    {
      "bo": "ཡུལ་ཆེན་བཅུ་གསུམ་སྐྱེ་བོ་སྨིན་གྲོལ་མཛད། །"
    },
    {
      "bo": "གྲུབ་ཆེན་ནག་པོ་སྤྱོད་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྲོང་བཙན་རྗེ་ཡི་མདུན་ན་འདོན་ཆེན་པོ། །"
    },
    {
      "bo": "བསིལ་ལྗོངས་གཙུག་ལག་ཤིང་རྟ་ཡི་གེའི་སྲོལ། །"
    },
    {
      "bo": "གཏོད་ཅིང་འཕགས་བོད་ཐོག་མའི་ལོ་ཙཱ་བ། །"
    },
    {
      "bo": "ཐུ་མི་སམ་བྷོ་ཊ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དཔལ་ཆེན་སྟོབས་ལྡན་ནག་པོའི་རིགས་སྔགས་ལས། །"
    },
    {
      "bo": "མཐུ་ཐོབ་རྩལ་གྱིས་དམོད་པས་ལོག་འདྲེན་ཀུན། །"
    },
    {
      "bo": "གཟིར་ཞིང་ཚར་གཅོད་རྗེས་སུ་འཛིན་ལ་དབང༌། །"
    },
    {
      "bo": "རིག་འཛིན་ཤཱནྟིཾ་གརྦྷར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱལ་བསྟན་རྩ་བ་ཚུལ་ཁྲིམས་སྡེ་སྣོད་འཛིན། །"
    },
    {
      "bo": "དགུ་བརྒྱ་གཞིས་ཚེ་བོད་རྗེའི་བླ་མཆོད་མཛད། །"
    },
    {
      "bo": "འཕགས་བོད་ཡོངས་གྲགས་དབུ་སེམས་ཟུང་འཇུག་སྲོལ། །"
    },
    {
      "bo": "འབྱེད་མཁས་མཁན་ཆེན་ཞི་འཚོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གངས་ལྗོངས་ཐོག་མའི་རབ་བྱུང་སད་མིའི་གྲས། །"
    },
    {
      "bo": "ངེས་དོན་པཎ་ཆེན་སྒྲ་སྒྱུར་སྨྲ་བའི་ཟོལ། །"
    },
    {
      "bo": "མཁས་པ་ཉེར་གཅིག་དཀའ་ཆེན་ལྔ་བཅུས་བསྟེན། །"
    },
    {
      "bo": "ལོ་ཆེན་བཻ་རོ་ཙཱ་ནར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པདྨའི་རྒྱལ་ཚབ་ཡེ་ཤེས་རྡོ་རྗེ་ཡི། །"
    },
    {
      "bo": "དག་པའི་གཟིགས་སྣང་གང་གི་ཟློས་གར་དུ། །"
    },
    {
      "bo": "ལུང་གིས་དབུགས་དབྱུང་གསུང་གི་གསང་བ་ཅན། །"
    },
    {
      "bo": "གཉགས་ལོ་ཡེ་ཤེས་གཞོན་ནོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བི་མ་ལ་དང་པདྨ་སམྦྷ་ཝའི། །"
    },
    {
      "bo": "གདམས་པས་རྗེས་བཟུང་རི་བྲག་ཟང་ཐལ་བགྲོད། །"
    },
    {
      "bo": "སྡིག་རྒྱལ་བསྒྲལ་ནས་བོད་ཡུལ་ཕན་བདེར་བཀོད། །"
    },
    {
      "bo": "ལྷ་ལུང་དཔལ་གྱི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྔ་འགྱུར་བཀའ་བབ་སོ་ཟུར་གནུབས་གསུམ་ལས། །"
    },
    {
      "bo": "མདོ་སྒྱུ་སེམས་ཕྱོགས་བཤད་དང་སྒྲུབ་པ་ཡིས། །"
    },
    {
      "bo": "བསིལ་ལྡན་ནོར་འཛིན་ཁྱོན་ཀུན་བརྡལ་བར་མཛད། །"
    },
    {
      "bo": "ཟུར་ཆེན་ཤཱཀ་འབྱུང་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཆིམས་ཀྱི་རིགས་འཁྲུངས་ཀླུ་མེས་མཁན་བུ་ལས། །"
    },
    {
      "bo": "རབ་ཏུ་བྱུང་ཞིང་དབུ་རྩེའི་ཀ་བ་ནས། །"
    },
    {
      "bo": "བཻ་རོས་བསྒྱུར་བའི་གསོ་རིག་རྒྱུད་བཞི་ཕྱུངས། །"
    },
    {
      "bo": "གྲྭ་མངོན་དབང་ཕྱུག་འབར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་དཔལ་སྙིང་པོ་མི་ཡི་ཟོལ་བཟུང་ནས། །"
    },
    {
      "bo": "སྒྲ་ཚད་ལུང་རིག་སྨྲ་བའི་ཁྱུ་མཆོག་ཅེས། །"
    },
    {
      "bo": "འཕགས་བོད་ལོ་པཎ་དུ་མས་བསྔགས་པའི་ཡུལ། །"
    },
    {
      "bo": "རོང་ཟོམ་པཎྜི་ཏ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པཎ་གྲུབ་ཆེན་པོ་ནཱ་རོ་ཏ་པ་ཡིས། །"
    },
    {
      "bo": "ཀུན་ལ་སྦས་ཆོས་ཡང་ཟབ་སྙན་བརྒྱུད་གཏད། །"
    },
    {
      "bo": "ས་སྤྱོད་བལ་པོའི་ཡུལ་ཁམས་ཕན་བདེར་བཀོད། །"
    },
    {
      "bo": "ཕམ་མཐིང་འཇིགས་མེད་གྲགས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱ་གར་བལ་བོད་བཤེས་གཉེན་དུ་མ་བསྟེན། །"
    },
    {
      "bo": "མཆོག་གི་གོ་འཕང་ས་ར་ཧ་དང་མཉམ། །"
    },
    {
      "bo": "ཐུན་མོང་ཚེ་དངོས་བརྒྱ་དང་ལྔ་བཅུར་གཞེས། །"
    },
    {
      "bo": "མཁས་གྲུབ་ཁྱུང་པོར་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཕགས་ཡུལ་པཎ་ཆེན་རྒྱ་མཚོའི་གཙུག་ན་བརྗིད། །"
    },
    {
      "bo": "གཞུང་དང་གདམས་ངག་ཟུང་འབྲེལ་ལམ་སྒྲོན་གསལ། །"
    },
    {
      "bo": "ཐུབ་བསྟན་རྒྱན་གཅིག་ས་གསུམ་སྙན་པར་ཁྱབ། །"
    },
    {
      "bo": "ཇོ་བོ་དཱི་པཾ་ཀཱ་རར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གངས་ཅན་གྲུབ་བརྒྱའི་སྤྱི་མེས་མི་ལ་རྗེར། །"
    },
    {
      "bo": "མཁའ་འགྲོས་ལུང་བསྟན་ཉེ་བའི་སྲས་གཅིག་པུ། །"
    },
    {
      "bo": "འཕགས་པའི་ཡུལ་ནས་སྙན་བརྒྱུད་གདམས་པ་བླངས། །"
    },
    {
      "bo": "རས་ཆུང་རྡོ་རྗེ་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐུབ་དབང་བསྟན་པའི་ནང་མཛོད་འདུལ་བའི་སྡེར། །"
    },
    {
      "bo": "སྦྱངས་པ་ཕུལ་བྱུང་མུ་མེད་འཛིན་སྐྱོང་གིས། །"
    },
    {
      "bo": "གསེར་ལྡན་ངུར་སྨྲིག་འཆང་བས་དོག་པོར་མཛད། །"
    },
    {
      "bo": "བྱ་འདུལ་བརྩོན་འགྲུས་འབར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐྱེ་འཕྲེང་ཉེར་ལྔར་པཎ་ཆེན་ཚུལ་བཞེས་ཤིང༌། །"
    },
    {
      "bo": "རིག་གཏེར་གྱིས་མཚོན་འཆད་རྩོད་རྩོམ་པའི་ཕུལ། །"
    },
    {
      "bo": "གངས་ཅན་མཁས་པའི་གཙུག་རྒྱན་བདག་ཉིད་ཆེ། །"
    },
    {
      "bo": "ས་སྐྱ་པཎྜི་ཏ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བི་མའི་བཀའ་སྲོལ་མན་ངག་སྙིང་ཐིག་གི། །"
    },
    {
      "bo": "བརྒྱུད་པའི་སྲོག་བཟུང་ཁྱད་པར་རྡོར་སེམས་ཀྱིས། །"
    },
    {
      "bo": "རྫོགས་པ་ཆེན་པོའི་དབང་དང་གདམས་པ་གཏད། །"
    },
    {
      "bo": "གྲུབ་ཆེན་མེ་ལོང་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱི་ནང་གྲུབ་མཐའ་རྒྱ་མཚོའི་མཐར་སོན་པས། །"
    },
    {
      "bo": "ལུང་རིགས་ཐེག་མཆོག་སེང་གེའི་སྒྲ་སྒྲོགས་པ། །"
    },
    {
      "bo": "བསིལ་ལྡན་ལྗོངས་ཀྱི་འཇམ་དཔལ་དབྱངས་ཞེས་གྲགས། །"
    },
    {
      "bo": "དྲི་མེད་འོད་ཟེར་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཡབ་མེས་སྔ་འགྱུར་རིགས་འཁྲུངས་བཀའ་གདམས་ཀྱི། །"
    },
    {
      "bo": "རིང་ལུགས་འཛིན་ཅིང་རྗེ་བཙུན་ཙོང་ཁ་པའི། །"
    },
    {
      "bo": "རིགས་ཀྱི་ཅོད་པན་སྙན་བརྒྱུད་བསྟན་པའི་བདག །"
    },
    {
      "bo": "ལྷོ་བྲག་ལས་ཀྱི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་མགོན་བློ་བཟང་གྲགས་པའི་འཁོར་གྱི་དབུས། །"
    },
    {
      "bo": "མཁྱེན་རབ་ཕུལ་བྱུང་གཞུང་བརྒྱ་སྨྲ་བའི་དབང༌། །"
    },
    {
      "bo": "དཔལ་ལྡན་འབྲས་སྤུངས་བསྐྲུན་སོགས་ཐུགས་བསྐྱེད་རྨད། །"
    },
    {
      "bo": "འཇམ་དབྱངས་བཀྲ་ཤིས་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྲིམས་ལྡན་འདུལ་བ་འཛིན་པའི་ཚུལ་བཟུང་ཡང༌། །"
    },
    {
      "bo": "རྟོགས་པའི་གདེང་གིས་པདྨ་གླིང་པ་དང༌། །"
    },
    {
      "bo": "གཏེར་སྐལ་ཞལ་དགྱེས་ཆོས་རྗེ་ཞྭ་དེའུ། །"
    },
    {
      "bo": "འཁྲུལ་ཞིག་ཀུན་དགའ་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྡོ་རྗེའི་རྣལ་འབྱོར་དང་འབྲེལ་སྦྱོར་དྲུག་ཅེས། །"
    },
    {
      "bo": "རིགས་ལྡན་རྣམས་ཀྱི་ཞལ་ཆབ་གངྒཱའི་ཀླུང༌། །"
    },
    {
      "bo": "གཙོར་བྱས་རྒྱུད་སྡེ་ཀུན་ལ་དབང་བསྒྱུར་མགོན། །"
    },
    {
      "bo": "ཇོ་ནང་ཀུན་དགའ་སྙིང་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཉོས་ཀྱི་རིགས་ལས་གསང་ཆེན་བཀའ་གཏེར་བསྟན། །"
    },
    {
      "bo": "འདྲེན་པའི་དེད་དཔོན་རིས་མེད་རྒྱལ་བསྟན་སྤེལ། །"
    },
    {
      "bo": "སྐུ་གསུམ་མཛད་པའི་རྣམ་ཐར་བསམ་མི་ཁྱབ། །"
    },
    {
      "bo": "གཏེར་ཆེན་འགྱུར་མེད་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞོན་ནུར་དགེ་ལྡན་ལུགས་བཟང་བསྟན་དང་མཇལ། །"
    },
    {
      "bo": "ཀུན་མཁྱེན་འཇིགས་མེད་གླིང་པས་རྗེས་སུ་བཟུང༌། །"
    },
    {
      "bo": "འཆི་བ་སློང་སོགས་བརྟུལ་ཞུགས་སྤྱོད་པ་སྐྱོང༌། །"
    },
    {
      "bo": "གུ་ཡངས་བློ་བདེ་རྩལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐེག་རྩེ་ཡང་ཏི་གསེར་འབྲུའི་ཉེ་བརྒྱུད་མཚོན། །"
    },
    {
      "bo": "རང་སྐལ་ཟབ་གཏེར་བཀའ་བབས་མཚོ་སྐྱེས་རྗེའི། །"
    },
    {
      "bo": "ལུང་ཟིན་གྲོལ་བཞིའི་མངའ་བདག་ཧེ་རུ་ཀ །"
    },
    {
      "bo": "ཀུན་བཟང་མཐོང་གྲོལ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ནམ་ཞིག་བསྐལ་བཟང་སྟོང་རྩའི་མཐའ་མ་རུ། །"
    },
    {
      "bo": "བདེ་གཤེགས་མོས་པའི་སྐུ་རུ་བཞེངས་པའི་ཚེ། །"
    },
    {
      "bo": "ཚད་མེད་བསྡུ་བ་རྣམ་བཞིའི་ཕྲིན་ལས་ཀྱིས། །"
    },
    {
      "bo": "འགྲོ་ཀུན་སྲིད་མཐར་མཛད་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞན་ཡང་གནས་དུས་འགྲོ་བའི་ཁམས་དབང་དང༌། །"
    },
    {
      "bo": "རྗེས་མཐུན་གང་འདུལ་སྣང་ངོར་དག་མ་དག །"
    },
    {
      "bo": "དེ་དང་དེར་སྨན་བཤེས་གཉེན་གང་དང་གང༌། །"
    },
    {
      "bo": "ཇི་སྙེད་སྣ་ཚོགས་སྟོན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་དུས་ཐུབ་བསྟན་རིས་མེད་པདྨོའི་ཚལ། །"
    },
    {
      "bo": "ཀུན་ཀྱང་གདུལ་བྱའི་བུང་བ་སོ་སོ་ཡི། །"
    },
    {
      "bo": "དགའ་སྟོན་ཉིད་དུ་རོ་གཅིག་མོས་གུས་ཅན། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བློ་གྲོས་གྲགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བྱིས་པ་ཉིད་ནས་སྙིང་རྗེའི་བག་ཆགས་བརྟས། །"
    },
    {
      "bo": "ཀུན་སྤངས་རི་སུལ་འགྲིམ་ལ་ཆེར་སྤྲོ་ཡང༌། །"
    },
    {
      "bo": "དྲིན་ཅན་བླ་མས་དམ་པའི་སྐྱེ་བ་རུ། །"
    },
    {
      "bo": "བསྔགས་ནས་བཀའ་བཞིན་བསྒྲུབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལུང་ཟིན་གཡུ་སྒྲའི་ཟློས་གར་སྙིགས་དུས་འདིར། །"
    },
    {
      "bo": "གསང་གསུམ་མཛད་པའི་ཕྲིན་ལས་མཐའ་ཡས་པ། །"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོ་འོད་གསལ་རྡོ་རྗེ་ཡིས། །"
    },
    {
      "bo": "དགོངས་རྒྱུད་བྱིན་རླབས་ཐོབ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཡོངས་འཛིན་བཤེས་གཉེན་དམ་པ་མང་དུ་བསྟེན། །"
    },
    {
      "bo": "མདོ་རྒྱུད་ལུང་རིག་མན་ངག་དུ་མ་ཐོས། །"
    },
    {
      "bo": "ཐོས་དོན་དམ་སྡོམ་ཁྱད་དུ་མ་བསད་པར། །"
    },
    {
      "bo": "ཀུན་སྤྱོད་གཙང་མས་མཛེས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྱད་པར་པདྨ་འབྱུང་དང་བི་མ་དངོས། །"
    },
    {
      "bo": "གཏེར་ཆེན་ཆོས་རྗེ་རྣམ་པས་རྗེས་བཟུང་ནས། །"
    },
    {
      "bo": "པདྨ་ཚེ་ཡི་སྙིང་ཐིག་ལ་སོགས་ཀྱི། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བདག་པོར་དབུགས་དབྱུང་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཕགས་པའི་ཡུལ་སོགས་བལ་བོད་གནས་ཆེན་དུ། །"
    },
    {
      "bo": "དམ་ཆོས་འཆད་ཉན་བརྩོན་དང་མཆོད་སྤྲིན་སྤྲོས། །"
    },
    {
      "bo": "ཀུན་ཀྱང་ཆོས་བརྒྱད་ཟོལ་དང་མ་འདྲེས་པར། །"
    },
    {
      "bo": "ལྷག་བསམ་དཀའ་སྤྱད་སྒྲུབ་དེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལྷ་བུའི་བདུད་ཀྱིས་བསླུས་སམ་འདུ་བ་གསུམ། །"
    },
    {
      "bo": "མ་ངེས་རྩོལ་བས་མ་བསྒྲུབས་རྙེད་བཀུར་རྫས། །"
    },
    {
      "bo": "དགོན་གནས་རྟེན་གསུམ་བསྐྲུན་དང་གཞན་ཕན་དུ། །"
    },
    {
      "bo": "གཏོང་ལས་བདག་འཛིན་བྲལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕུལ་བྱུང་དམ་པའི་རྣམ་པར་ཐར་པ་དང༌། །"
    },
    {
      "bo": "འདི་སྣང་ཟིན་མེད་འཁྲུལ་པའི་བྱ་བ་དག །"
    },
    {
      "bo": "ཆོས་ཀུན་ཆོས་ཉིད་ཀློང་དུ་མཉམ་བརྡལ་བས། །"
    },
    {
      "bo": "རེ་དོགས་མཚན་མས་དབེན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བདག་ནི་གཞོན་ནུར་བསྟན་ལ་རབ་འབྱུང་བས། །"
    },
    {
      "bo": "ཁྱིམ་ཐབས་བྱིས་པའི་རྣམ་གཡེང་ཕོངས་ཙམ་ལས། །"
    },
    {
      "bo": "དེ་ལྟའི་རློམ་སེམས་ཆོས་བརྒྱད་མ་མཆིས་ཀྱང༌། །"
    },
    {
      "bo": "དེ་བཞིན་མོས་དགེས་བཏགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རང་ཉིད་མ་སྨིན་གཞན་བྱིན་བརླབ་དཀའ་ཡང༌། །"
    },
    {
      "bo": "གང་ལ་མོས་ན་དེ་ཡིས་བྱིན་རློབ་པར། །"
    },
    {
      "bo": "རྒྱལ་བའི་ལུང་དང་སྔོན་བྱུང་ཚུལ་གནས་ཀྱིས། །"
    },
    {
      "bo": "དད་གསུམ་དག་སྣང་མོས་པས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེང་བཟུང་རང་གཞན་བྱང་ཆུབ་སྙིང་པོའི་བར། །"
    },
    {
      "bo": "སྐྱོན་བྲལ་མཚན་ལྡན་བླ་མས་རྗེས་བཟུང་སྟེ། །"
    },
    {
      "bo": "ལམ་གོལ་ལོག་པའི་གཡང་ས་ལས་གྲོལ་ནས། །"
    },
    {
      "bo": "རྣམ་མཁྱེན་ལམ་མཆོག་སྒོ་འབྱེད་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྡུག་བསྔལ་ཀུན་འབྱུང་འཁོར་བའི་རྒྱུ་དང་འབྲས། །"
    },
    {
      "bo": "བཟོད་པར་དཀའ་བར་ངེས་འབྱུང་བློ་སྐྱེས་ནས། །"
    },
    {
      "bo": "རླབས་ཆེན་ལམ་བཟང་ཚད་མེད་རྣམ་པ་བཞིའི། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་རྟག་ཏུ་འབྱོང་བར་ཤོག །"
    },
    {
      "bo": "ལྟ་བ་མཐའ་བྲལ་དབུ་མ་ཆེན་པོ་རྟོགས། །"
    },
    {
      "bo": "སྒོམ་པ་ཕྱག་ཆེན་འོད་གསལ་ལམ་དུ་ལོངས། །"
    },
    {
      "bo": "འབྲས་བུ་གཞིར་གྲོལ་རྫོགས་ཆེན་མངོན་གྱུར་པའི། །"
    },
    {
      "bo": "རྒྱལ་སྲས་དགྱེས་པའི་སྤྱོད་པར་སློབ་ནུས་ཤོག །"
    },
    {
      "bo": "སྒྲིབ་གཉིས་ཟུང་འཇུག་འགྲོ་ཁམས་མུན་པའི་སྨག །"
    },
    {
      "bo": "མདོ་སྔགས་ཟུང་འཇུག་ཉི་ཟླའི་ལམ་གྱིས་བསལ། །"
    },
    {
      "bo": "སྐུ་གཉིས་ཟུང་འཇུག་རྟེན་ཅིང་འབྲེལ་འབྱུང་ཆོས། །"
    },
    {
      "bo": "དོན་གཉིས་ཟུང་འཇུག་བཀྲ་ཤིས་དཔལ་འབར་ཤོག །"
    }
  ]
}