{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/shabkar/garland-of-rebirths-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཞབས་དཀར་བའི་སྐྱེ་རབས་ཉུང་འདུས་བཞུགས་སོ།།"
  },
  "text": [
    {
      "bo": "བསྐལ་པ་དཔག་ཏུ་མེད་པའི་སྔོན་རོལ་ནས། །"
    },
    {
      "bo": "མྱུར་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སྟེ། །"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་དང་འགྲོ་ལ་ཕན་པའི་ཕྱིར། །"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་སྐུར་བསྟན་འགྲོ་དོན་མཛད། །"
    },
    {
      "bo": "སངས་རྒྱས་དུས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "རྒྱ་གར་ཡུལ་དུ་འཇམ་དཔལ་བཤེས་གཉེན་མཆོག །"
    },
    {
      "bo": "བོད་ཡུལ་དབུས་སུ་དྲན་པ་ནམ་མཁར་གྱུར། །"
    },
    {
      "bo": "བཀའ་བརྒྱུད་བསྟན་ལ་མི་ལ་རས་པ་དངོས། །"
    },
    {
      "bo": "བཀའ་གདམས་དུས་སུ་རྒྱལ་སྲས་ཐོགས་མེད་དཔལ། །"
    },
    {
      "bo": "དགའ་ལྡན་བསྟན་ལ་བློ་གྲོས་རྒྱལ་མཚན་རྗེ། །"
    },
    {
      "bo": "རིས་མེད་འགྲོ་ངོར་ཐང་སྟོང་རྒྱལ་པོར་སྤྲུལ། །"
    },
    {
      "bo": "ད་ལྟའི་དུས་འདིར་འགྲོ་མགོན་ཞབས་དཀར་བ། །"
    },
    {
      "bo": "མ་འོངས་མངོན་དགའ་ལ་སོགས་རིགས་ལྔ་ཡི། །"
    },
    {
      "bo": "ཞིང་དུ་རིགས་ཀྱི་བདག་པོ་དེ་བདག་གི །"
    },
    {
      "bo": "དྲུང་དུ་སྲས་ཀྱི་ཐུ་བོ་རེ་རེར་གྱུར། །"
    },
    {
      "bo": "འབྲེལ་ཚད་གང་འདོད་ཞིང་དུ་འདྲེན་པར་འགྱུར། །"
    },
    {
      "bo": "འདས་དང་མ་འོངས་ད་ལྟ་དུས་གསུམ་དུ། །"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་སྣ་ཚོགས་སྐུར་བསྟན་ནས། །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་དོན་མཛད་པའི་ཐུགས་རྗེ་ཅན། །"
    },
    {
      "bo": "སྐྱབས་མགོན་ཡིད་བཞིན་ནོར་བུ་ལ་གསོལ་བ་དེབས། །"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་ཞིང་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་རུ། །"
    },
    {
      "bo": "བསྐལ་པ་རྒྱ་མཚོར་བཙལ་ཀྱང་རྙེད་དཀའ་ཞིང་། །"
    },
    {
      "bo": "རྙེད་པ་དོན་ཆེན་ཡིད་བཞིན་ནོར་བུ་ལས། །"
    },
    {
      "bo": "ལྷག་པའི་བླ་མ་མཇལ་བ་སྐལ་པ་བཟང་། །"
    },
    {
      "bo": "བདག་ནི་དེང་ནས་ཚེ་རབས་ཐམས་ཅད་དུ། །"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་དང་ནམ་ཡང་མི་འབྲལ་ཞིང་། །"
    },
    {
      "bo": "གསུང་གི་བདུད་རྩིས་བདག་རྒྱུད་སྨིན་གྲོལ་ནས། །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པར་ཤོག །"
    }
  ]
}