{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jigme-lingpa/dzogchen-rinpoche-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མདོ་ཁམས་རྫོགས་ཆེན་པའི་སྐྱེ་ཕྲེང་གསོལ་འདེབས་བཞུགས།"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་སྐྱེ་འགག་མེད་པའི་ཆོས་ཉིད་ཀྱང་། །"
    },
    {
      "bo": "སེམས་ཅན་ཁམས་ལ་གཟུགས་སྐུ་རྣམ་གཉིས་སུ། །"
    },
    {
      "bo": "སྣང་བའི་ངོ་མཚར་བདེ་གཤེགས་གཙུག་ཏོར་ཅན། །"
    },
    {
      "bo": "མཚན་གྱིས་ངན་སོང་སྒྲོལ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྒྱུད་སྡེ་རྒྱ་མཚོའི་མངའ་བདག་ཀུ་ཀུ་རི། །"
    },
    {
      "bo": "འཕོ་ཆེན་རྡོ་རྗེའི་ས་བརྙེས་བི་མ་ལ་། །"
    },
    {
      "bo": "སྤྲོས་བྲལ་ཕྱག་རྒྱ་ཆེན་པོ་ས་ར་ཧ། །"
    },
    {
      "bo": "བསྟན་པའི་ཆུ་འགོ་གསུམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལྷ་སྲིན་བྲན་འཁོལ་རླངས་པ་ཤྲཱི་སེང་། །"
    },
    {
      "bo": "འཁྲུལ་སྣང་བྲག་རི་བསྙིལ་བ་དཀོན་མཆོག་འབྱུང་། །"
    },
    {
      "bo": "རྒྱལ་བསྟན་ཉིན་མོར་བྱེད་པ་ཁྲི་རལ་ཞབས། །"
    },
    {
      "bo": "བསྟན་པའི་རྩ་ལག་གསུམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཏི་མུག་ལམ་སླང་གྲུབ་མཆོག་ཕག་ཚང་བ། །"
    },
    {
      "bo": "མི་ལ་བཞད་པའི་སྲས་གྱུར་བྱང་ཆུབ་རྒྱལ། །"
    },
    {
      "bo": "དྲུག་པ་སེང་གེའི་སྒྱུ་འཕྲུལ་དུས་གསུམ་མཁྱེན། །"
    },
    {
      "bo": "གྲུབ་པ་མཆོག་བརྙེས་གསུམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྟོགས་པས་བདག་རྒྱུད་གྲོལ་བ་གླིང་རས་རྗེ། །"
    },
    {
      "bo": "བླ་མར་མོས་གུས་མཐར་ཕྱིན་སྟག་ལུང་བ། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་གྲུབ་པ་ཨོ་རྒྱན་རང་བྱུང་བ། །"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་བསྟན་འཛིན་གསུམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞི་གསུམ་རྩ་བ་བརྟན་པ་བློ་གྲོས་བཟང་། །"
    },
    {
      "bo": "རྙིང་བསྟན་མདོ་སྨད་སྤེལ་ལ་སྨོན་ལམ་གྱི། །"
    },
    {
      "bo": "མཐུ་གྲུབ་པདྨའི་རིག་པ་འཛིན་པ་དང་། །"
    },
    {
      "bo": "འགྱུར་མེད་ཐེག་མཆོག་ཅེས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་རྩ་བ་མདོ་སྒྱུ་སེམས། །"
    },
    {
      "bo": "ཡང་ཕུར་སངས་རྒྱས་མཉམ་པར་སྦྱོར་ལ་སོགས། །"
    },
    {
      "bo": "བཀའ་མའི་སྒྲུབ་ཆེན་ཕྲིན་ལས་སྲོལ་བཏོད་པའི། །"
    },
    {
      "bo": "ངེས་དོན་བསྟན་འཛིན་བཟང་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ངེས་འབྱུང་རྒྱུད་བརླན་བྱང་ཆུབ་སེམས་གཉིས་ཀྱི། །"
    },
    {
      "bo": "ཤིང་རྟས་དྲངས་པའི་སྨིན་གྲོལ་ལམ་མཆོག་ལ། །"
    },
    {
      "bo": "རྟག་ཏུ་བསྟེན་གོམས་བགྱིས་པའི་དངོས་གྲུབ་ཀུན། །"
    },
    {
      "bo": "ཚེ་འདི་ཉིད་ལ་མཐོང་བར་བྱིན་གྱིས་རློབས། །"
    }
  ]
}