{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-trungpa-incarnations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཟུར་མང་དྲུང་རིན་པོ་ཆེའི་སྐྱེས་ཕྲེང་གསོལ་འདེབས་མོས་གུས་རྒྱ་མཚོའི་རླབས་ཕྲེང་ཞེས་བྱ་བ་བཞུགས་སོ།    །"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭསྟི།"
    },
    {
      "bo": "དགའ་ལྡན་ལྷ་བརྒྱའི་བདག་པོ་མཆོག་གྱུར་པ།    །"
    },
    {
      "bo": "བྱམས་པ་ཆེན་པོ་བྱམས་ཆེན་འགྲོ་བའི་མགོན།    །"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་ཚབ་རྒྱལ་སྲས་ཆེན་པོ་ནི།    །"
    },
    {
      "bo": "མ་འོངས་སངས་རྒྱས་དེ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྒྱལ་རིགས་ལས་འཁྲུངས་དགྱེས་རྡོར་གྲུབ་པ་བརྙེས།    །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཆེན་པོའི་སྤྱོད་པ་ཡིས།    །"
    },
    {
      "bo": "ཕྱོགས་ལས་རྣམ་རྒྱལ་རྫུ་འཕྲུལ་སྟག་ལ་ཆིབ།    །"
    },
    {
      "bo": "ཌོམྦྷི་ཧེ་རུ་ཀ་ལ་གསོལ་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འོད་གསལ་རྡོ་རྗེ་རྩེ་མོའི་ཁང་བཟང་དུ།    །"
    },
    {
      "bo": "རིག་འཛིན་གྲུབ་པ་ཆེན་པོའི་སྐུར་བཞེངས་ཏེ།    །"
    },
    {
      "bo": "ཐེག་མཆོག་བསྟན་པ་ཉིན་མོར་བྱེད་པའི་མགོན།    །"
    },
    {
      "bo": "ཤྲཱི་སིང་ཧའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཨོ་རྒྱན་ཆེན་པོས་བྱིན་བརླབས་ཐུགས་ཀྱི་སྲས།    །"
    },
    {
      "bo": "སྡིག་སྤྱོད་རྒྱལ་པོ་རྡོ་རྗེའི་མདའ་ཡིས་འབིག  །"
    },
    {
      "bo": "ཕྱག་ན་རྡོ་རྗེ་མི་ཡི་བརྫུར་ཞུགས་པ།    །"
    },
    {
      "bo": "དཔལ་གྱི་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རླུང་སེམས་གཉིས་མེད་རྟོགས་པ་མངོན་དུ་གྱུར།    །"
    },
    {
      "bo": "འཁོར་འདས་ཆོས་ཀུན་རང་གྲོལ་ཕྱག་རྒྱ་ཆེར།    །"
    },
    {
      "bo": "ནམ་ཡང་མི་འདའ་གྲུ་གུ་རས་པ་ཞེས།    །"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བླ་མ་མཆོག་བསྟེན་ཟབ་མོའི་གདམས་པ་ཐོབ།    །"
    },
    {
      "bo": "ཇི་བཞིན་ཉམས་བླངས་སྣང་བ་ཆོས་སྐུར་འཆར།    །"
    },
    {
      "bo": "རང་སེམས་སྐྱེ་མེད་ཆོས་སྐུ་མངོན་གྱུར་པ།    །"
    },
    {
      "bo": "ལྷོ་པ་སྒོམ་ཆུང་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མྱོས་ཀྱི་རིགས་ལས་འཁྲུངས་པའི་རྒྱལ་བའི་སྲས།    །"
    },
    {
      "bo": "མདོ་སྔགས་མཁྱེན་རབ་དགོངས་པའི་རྩལ་ཆེན་རྫོགས།    །"
    },
    {
      "bo": "མཁས་གྲུབ་རྒྱ་མཚོའི་གཙུག་ན་རབ་མཐོ་བ།    །"
    },
    {
      "bo": "མཐིང་མ་སངས་རྒྱས་གྲགས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་གྲུབ་ཆེན་བློ་གྲོས་རིན་ཆེན་གྱི།    །"
    },
    {
      "bo": "ཐུགས་སྲས་ངེས་དོན་རྟོགས་པའི་བཀའ་བབས་ཆེ།    །"
    },
    {
      "bo": "བསྒོམ་མེད་ཆོས་སྐུའི་རྒྱལ་ས་རབ་བརྙེས་པ།    །"
    },
    {
      "bo": "ཀུན་དགའ་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཚེར་ལུང་གནས་སུ་སྒྲུབ་པའི་རྒྱལ་མཚན་བཙུག  །"
    },
    {
      "bo": "མ་ཧཱ་ཀཱ་ལས་དགྱེས་ཞལ་ཡང་ཡང་བསྟན།    །"
    },
    {
      "bo": "མཐུ་སྟོབས་ནུས་པ་རྒྱ་མཚོའི་མངའ་བདག་མཆོག  །"
    },
    {
      "bo": "ཀུན་དགའ་བཟང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཕྱི་རུ་ཉན་ཐོས་སྤྱོད་པ་རབ་བསྐྱངས་ཤིང་།    །"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་གཉིས་ཐུགས་ལ་འབྱོངས།    །"
    },
    {
      "bo": "གསང་བ་འཁོར་འདས་ཆོས་ཀུན་དབུ་མར་སྡོམ།    །"
    },
    {
      "bo": "ཀུན་དགའ་འོད་ཟེར་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རབ་འབྱམས་ཤེས་བྱའི་ཆོས་ཀུན་ས་ལེར་གཟིགས།    །"
    },
    {
      "bo": "རྩ་རླུང་ཐིག་ལེའི་དྭངས་མ་གཡོ་མེད་འཆིང་།    །"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པ་གྲུབ་པའི་ཁྱུ་མཆོག་ཆེ།    །"
    },
    {
      "bo": "ཀུན་དགའ་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་རྒྱ་མཚོའི་དབུས་ན་རབ་མཐོ་ཞིང་།    །"
    },
    {
      "bo": "ཐོས་བསམ་སྒོམ་པའི་མཐར་སོན་དེ་ཉིད་བརྙེས།    །"
    },
    {
      "bo": "ཡང་དག་ཡེ་ཤེས་གྲུབ་པའི་ཕུལ་བྱུང་བ།    །"
    },
    {
      "bo": "བསྟན་པ་རྣམ་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "བཀའ་བཞི་བརྒྱུད་པའི་ཆུ་ཀླུང་ཇི་སྙེད་པ།    །"
    },
    {
      "bo": "ཐུགས་མཚོར་བསྐྱིལ་ནས་གདུལ་བྱ་སྨིན་མཛད་ཅིང་།    །"
    },
    {
      "bo": "ས་དང་ལམ་གྱི་མངོན་རྟགས་མཐོན་པོར་གཤེགས།    །"
    },
    {
      "bo": "བསྟན་འཛིན་ཆོས་ཀྱི་རྒྱ་མཚོར་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "སྙན་བརྒྱུད་གདམས་པའི་གཏེར་ལ་དབང་འབྱོར་ཞིང་།    །"
    },
    {
      "bo": "གྲུབ་གཉིས་ནོར་བུའི་རྒྱལ་མཚན་བསྒྲེངས་མཛད་པ།    །"
    },
    {
      "bo": "སྐལ་ལྡན་སྐུ་བཞིའི་ལམ་བཟང་བཀྲི་བའི་གཉེན།    །"
    },
    {
      "bo": "འཇམ་དཔལ་ཆོས་ཀྱི་རྒྱ་མཚོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཀརྨ་བཀའ་བརྒྱུད་བསྟན་འཛིན་བྱེ་བའི་ཕུལ།    །"
    },
    {
      "bo": "ཟབ་གསང་གྲུབ་པའི་ལམ་རྟགས་མངོན་དུ་གྱུར།    །"
    },
    {
      "bo": "གཞན་ཕན་ཕྲིན་ལས་རྩལ་ཤུགས་རབ་འཆང་བ།    །"
    },
    {
      "bo": "འགྱུར་མེད་བསྟན་འཕེལ་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཀརྨ་པ་ཡི་ཐུགས་ཀྱི་སྲས་སུ་གྱུར།    །"
    },
    {
      "bo": "ངེས་དོན་བདེན་པ་ཇི་བཞིན་གཟིགས་པའི་སྤྱན།    །"
    },
    {
      "bo": "ཆོས་ཀྱི་དབང་ཕྱུག་སྙན་བརྒྱུད་སྨིན་གྲོལ་སྤེལ།    །"
    },
    {
      "bo": "བསྟན་པ་མཐའ་རྒྱས་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མའི་ཐུགས་ཀྱི་སྲས་གཅིག་པུ།    །"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པའི་ཁྱུ་མཆོག་རླབས་པོ་ཆེ།    །"
    },
    {
      "bo": "ཀརྨ་སྙན་བརྒྱུད་བསྟན་པའི་སྲོག་འཛིན་པ།    །"
    },
    {
      "bo": "ཆོས་ཀྱི་ཉིན་བྱེད་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་ཀུན་དགའ་ལེགས་པ་སོགས།    །"
    },
    {
      "bo": "གསར་རྙིང་མཁས་གྲུབ་སྐྱེ་བའི་ཟློས་གར་དུ།    །"
    },
    {
      "bo": "སྔོན་གནས་རྗེས་སུ་དྲན་པའི་ཐུགས་མངའ་བ།    །"
    },
    {
      "bo": "ཁྱབ་བདག་དཔལ་ལྡན་བླ་མར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "རྒྱལ་སྲས་སྙིང་རྗེའི་ཟླ་བ་ཆེན་པོ་ནི།    །"
    },
    {
      "bo": "བྱང་ཆུབ་རིགས་ཀྱི་ནུས་པ་ཡོངས་སུ་རྒྱས།    །"
    },
    {
      "bo": "ཐེག་ཆེན་རྒྱལ་བའི་ལམ་བཟང་བསྟེན་མཁས་པ།    །"
    },
    {
      "bo": "ཀརྨ་ཕྲིན་ལས་ཀུན་ཁྱབ་ཞབས་བརྟན་གསོལ།    །"
    },
    {
      "bo": "དེ་ལྟར་རྩ་བརྒྱུད་བླ་མའི་ཚོགས་རྣམས་ལ།    །"
    },
    {
      "bo": "གུས་པས་ཕྱག་འཚལ་མཆོད་འབུལ་སྡིག་ལྟུང་བཤགས།    །"
    },
    {
      "bo": "དགེ་ལ་ཡི་རངས་ཆོས་འཁོར་བསྐོར་བར་བསྐུལ།    །"
    },
    {
      "bo": "མྱ་ངན་མི་འདའ་བཞུགས་གསོལ་དགེ་ཚོགས་བསྔོ།    །"
    },
    {
      "bo": "འགྲོ་ཚོགས་ནམ་མཁའི་ཕ་མཐར་གཏུག་པ་རྣམས།    །"
    },
    {
      "bo": "སྒྲིབ་སྦྱང་ཚོགས་རྫོགས་སྐུ་བཞིའི་གོ་འཕང་ཐོབ།    །"
    },
    {
      "bo": "བདག་གཞན་དེང་ནས་བྱང་ཆུབ་སྙིང་པོའི་བར།    །"
    },
    {
      "bo": "དཔལ་ལྡན་བླ་མས་འབྲལ་མེད་རྗེས་འཛིན་ཤོག  །"
    }
  ]
}