{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jigme-lingpa/prayer-invoking-previous-incarnations",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རིག་འཛིན་འཇིགས་མེད་གླིང་པའི་འཁྲུངས་རབས་གསོལ་འདེབས་བཞུགས། །"
  },
  "text": [
    {
      "bo": "མགོན་པོ་སྲིད་ཞིའི་ཁྱབ་བདག་ཀུན་ཏུ་བཟང་། །"
    },
    {
      "bo": "གཞི་རྒྱུད་བདེ་གཤེགས་སྙིང་པོའི་ངོ་བོ་ཉིད། །"
    },
    {
      "bo": "སྟོང་ཉིད་སྙིང་རྗེར་ཤར་བ་སྤྱན་རས་གཟིགས། །"
    },
    {
      "bo": "དགའ་རབ་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བཅོམ་ལྡན་འོད་སྲུང་དྲུང་ན་ཀྲྀ་ཀྲྀའི་སྲས། །"
    },
    {
      "bo": "ཉི་མའི་གཉེན་གྱི་མཆེད་གྱུར་གཅུང་མཛེས་དགའ། །"
    },
    {
      "bo": "སྲོང་བཙན་སྒམ་པོའི་རྣམ་སྤྲུལ་ཨ་ཀར་མ། །"
    },
    {
      "bo": "ཁྲི་སྲོང་ལྡེའུ་བཙན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བིརྺ་པ་དང་ལྷ་ལྕམ་པདྨ་གསལ། །"
    },
    {
      "bo": "གཙུག་ལག་འཛིན་དངོས་རྒྱལ་སྲས་ལྷ་རྗེའི་ཞབས། །"
    },
    {
      "bo": "དྲི་མེད་ཀུན་ལྡན་ཡར་རྗེ་ཨོ་རྒྱན་གླིང་། །"
    },
    {
      "bo": "ཟླ་འོད་གཞོན་ནུ་གྲགས་རྒྱལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པཎ་ཆེན་བི་མའི་དངོས་སྤྲུལ་བསམ་ཡས་པ། །"
    },
    {
      "bo": "མངའ་རིས་པཎ་ཆེན་ཆོས་རྒྱལ་ཕུན་ཚོགས་ཞབས། །"
    },
    {
      "bo": "བཀྲ་ཤིས་སྟོབས་རྒྱལ་འཛམ་གླིང་རྡོ་རྗེའི་གར། །"
    },
    {
      "bo": "འཇིགས་མེད་གླིང་པར་བསྒྱུར་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འདི་འོག་ཡེ་ཤེས་རྡོ་རྗེའི་རོལ་པ་ཡིས། །"
    },
    {
      "bo": "རྡོ་རྗེ་སྙིང་པོའི་རིང་ལུགས་བསླངས་ནས་སླར། །"
    },
    {
      "bo": "གཤེ་ཞིང་སྐུར་པ་འདེབས་པ་རྣམས་ཀྱི་དོན། །"
    },
    {
      "bo": "སྤྲུལ་པ་སྣ་ཚོགས་སྟོན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མདོར་ན་འོད་སྲུང་དྲུང་དུ་སེམས་བསྐྱེད་ནས། །"
    },
    {
      "bo": "བྱང་ཆུབ་སྤྱོད་པ་རླབས་ཆེན་རྫོགས་པའི་མཐར། །"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བ་ཅན་དུ་འཚང་རྒྱ་བའི། །"
    },
    {
      "bo": "འདུས་པ་དང་པོའི་འཁོར་དུ་སྐྱེ་བར་ཤོག །"
    },
    {
      "bo": "ཅི་མཛད་ལེགས་པར་མཐོང་བའི་དད་གུས་ཀྱིས། །"
    },
    {
      "bo": "ཁྱོད་ཞལ་ཡིད་ལ་བྱེད་པ་ལ་གོམས་པས། །"
    },
    {
      "bo": "བླ་མ་མཆོག་དང་ནམ་ཡང་མི་འབྲལ་ཞིང་། །"
    },
    {
      "bo": "ཚོམ་བུ་གཅིག་ཏུ་མངོན་པར་སངས་རྒྱས་ཤོག །"
    }
  ]
}