{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/shechen-rabjam-rinpoche/shechen-rabjam-incarnations-supplication",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཞེ་ཆེན་རབ་འབྱམས་སྐུ་ཕྲེང་རིམ་བྱོན་གྱི་གསོལ་འདེབས་དང་བའི་པདྨོ་ཞེས་བྱ་བ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ།"
    },
    {
      "bo": "སྨོན་ལམ་བཞི་གྲུབ་ཚོགས་གཉིས་དཔལ་གྱི་བརྗིད། །"
    },
    {
      "bo": "བདེ་གཤེགས་ཤར་ལྷོའི་ཞིང་མགོན་མྱ་ངན་མེད། །"
    },
    {
      "bo": "མཐའ་ཡས་སེམས་ཅན་དུག་གསུམ་ཞི་མཛད་ཅིང་། །"
    },
    {
      "bo": "མཁའ་ཁྱབ་འགྲོ་བའི་མགོན་གྱུར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མ་ལ་ཡ་རྩེར་གསང་བའི་བདག་པོ་ལས། །"
    },
    {
      "bo": "ཀུན་བཟང་དགོངས་བརྒྱུད་གསང་ཆེན་མཐའ་དག་ནོད། །"
    },
    {
      "bo": "ལེགས་པར་བཀའ་བསྡུས་མ་ལུས་ཐུགས་སུ་ཆུད། །"
    },
    {
      "bo": "གནོད་སྦྱིན་སྐར་མདའ་གདོང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་དཔལ་རྣོན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་འཕྲུལ། །"
    },
    {
      "bo": "བདེ་གཤེགས་སྐུ་ཡི་བཀའ་བབ་བཤེས་གཉེན་ཆེ། །"
    },
    {
      "bo": "འོད་གསལ་རྫོགས་ཆེན་སྡེ་གསུམ་བསྟན་པའི་སྲོལ། །"
    },
    {
      "bo": "འབྱེད་མཁས་མཉྫུ་མི་ཏྲར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཛམ་བུའི་གླིང་འདིར་སྟོན་པའི་རིང་སྲེལ་དངོས། །"
    },
    {
      "bo": "བཞུགས་པའི་མཆོད་སྡོང་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞེངས། །"
    },
    {
      "bo": "སྟོན་པའི་མཛད་རྗེས་གནས་དང་བསྟན་དར་ཤུལ། །"
    },
    {
      "bo": "གསལ་མཛད་ཨ་ཤོ་ཀ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བཙད་པོའི་རིགས་འཁྲུངས་པདྨའི་ཐུགས་ཀྱིས་ཟིན། །"
    },
    {
      "bo": "ལོ་པཎ་སྐྱེས་མཆོག་བསྙེན་བཀུར་དམ་ཆོས་བསྒྱུར། །"
    },
    {
      "bo": "དགེ་བཅུའི་སྲོལ་བཟུང་བཀའ་གཙིགས་བྲིས་ཏེ་བཞག །"
    },
    {
      "bo": "རྒྱལ་སྲས་སད་ན་ལེགས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "པདྨས་རྗེས་བཟུང་གྲུབ་པའི་ས་མཐོར་གཤེགས། །"
    },
    {
      "bo": "མདོ་དང་སྒྱུ་འཕྲུལ་ལ་སོགས་སྔགས་ཀྱི་གཞུང་། །"
    },
    {
      "bo": "རྣམ་མང་བསྒྱུར་མཛད་དོན་གྱི་ལོ་ཙཱ་བ། །"
    },
    {
      "bo": "རྨ་བན་རིན་ཆེན་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐུབ་པའི་རྒྱལ་ཚབ་ཤཱནྟ་རཀྵི་ཏའི། །"
    },
    {
      "bo": "དངོས་སློབ་གངས་ལྗོངས་རྒྱལ་བསྟན་རྙོགས་མ་ཀུན། །"
    },
    {
      "bo": "ལུང་དང་རིག་པས་བསལ་མཛད་པཎྜི་ཏ། །"
    },
    {
      "bo": "པདྨའི་ངང་ཚུལ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དགྱེས་མཛད་ལོ་ཙཱས་རྗེས་བཟུང་ཕྱག་རྒྱ་ཆེ། །"
    },
    {
      "bo": "གྲུབ་པའི་རྣལ་འབྱོར་སྒྲུབ་བརྒྱུད་བསྟན་པའི་རྒྱན། །"
    },
    {
      "bo": "གངས་ལྗོངས་གྲུབ་བརྒྱའི་གཙུག་ནོར་མི་ལ་རྗེ། །"
    },
    {
      "bo": "བཞད་པ་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཁྱེན་རབ་སྣང་བས་ཤེས་བྱའི་ཆོས་ཀུན་གཟིགས། །"
    },
    {
      "bo": "བརྩེ་ཆེན་ཐུགས་རྗེས་མཐའ་ཡས་གདུལ་བྱ་སྐྱོང་། །"
    },
    {
      "bo": "མཁས་བཙུན་གྲུབ་པའི་གྲགས་སྙན་ཁྱབ་མཛད་པའི། །"
    },
    {
      "bo": "རོང་སྟོན་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟབ་གཏེར་བཀའ་བབ་ཕྱག་རྫོགས་བསྟན་པའི་བདག །"
    },
    {
      "bo": "འཇམ་དཔལ་ཁྲོས་པའི་ང་རོས་ལོག་སྲེད་སྡེ། །"
    },
    {
      "bo": "ཟིལ་གནོན་ཆོས་ཀྱི་རྒྱལ་པོ་འབྲི་གུང་པ། །"
    },
    {
      "bo": "རིན་ཆེན་ཕུན་ཚོགས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཨོ་རྒྱན་བསྙེན་སྒྲུབ་བཀའ་བརྒྱུད་གོང་མའི་སྲོལ། །"
    },
    {
      "bo": "ཉམས་བཞེས་མཐར་སོན་གྲུབ་པའི་བརྟུལ་ཞུགས་བསྐྱངས། །"
    },
    {
      "bo": "རྫུ་འཕྲུལ་མངའ་བརྙེས་བལ་བོད་ཆོས་ལ་བསྒྱུར། །"
    },
    {
      "bo": "དབུས་སྨྱོན་ཧེ་རུ་ཀ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་དཔལ་མཁྱེན་རབ་ཉི་མ་ཐུགས་ལ་ཤར། །"
    },
    {
      "bo": "ལུང་རིགས་སྨྲ་བའི་སེངྒེས་ལོག་སྨྲའི་ཚོགས། །"
    },
    {
      "bo": "ཟིལ་གནོན་མཁས་གྲུབ་དབང་ཕྱུག་རབ་འབྱམས་པ། །"
    },
    {
      "bo": "བསྟན་པའི་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དམ་པའི་ཚུལ་དགུས་ངེས་གསང་བསྟན་མཆོག་འཛིན། །"
    },
    {
      "bo": "མཁྱེན་དང་བརྩེ་བའི་ཕྲིན་ལས་ཕ་མཐའ་བརྡལ། །"
    },
    {
      "bo": "ཀུན་བཟང་བསྟན་པའི་ཉི་མ་ཞེ་ཆེན་པ། །"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསླབ་གསུམ་རྣམ་དག་མཁྱེན་བརྩེ་ནུས་པའི་གཏེར། །"
    },
    {
      "bo": "སྨིན་གྲོལ་བདུད་རྩིས་སྐལ་བཟང་གདུལ་བྱའི་ཚོགས། །"
    },
    {
      "bo": "ཡོངས་སྨིན་ངེས་པ་དོན་གྱི་རིག་པ་འཛིན། །"
    },
    {
      "bo": "དཔལ་འབྱོར་རྒྱ་མཚོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཨོ་རྒྱན་ལུང་བསྟན་ཟབ་མོའི་གཏེར་ལ་དབང་། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་སྤྱོད་པས་སྦས་པའི་གནས་ཞལ་འབྱེད། །"
    },
    {
      "bo": "བསྐྱེད་རྫོགས་གདིང་ལྡན་སྔགས་སྤྱོད་གར་གྱི་དབང་། །"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་དཔལ་གཤིན་རྗེ་གཤེད་ཀྱིས་རྗེས་སུ་བཟུང་། །"
    },
    {
      "bo": "གཞན་ཕན་བསྡུ་བཞིའི་ཕྲིན་ལས་བསམ་མི་ཁྱབ། །"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་ལྡན་འགྱུར་མེད་ངེས་དོན་གཟིགས། །"
    },
    {
      "bo": "ཀུན་བཟང་བསྟན་པའི་ཉི་མར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རླབས་ཆེན་རྒྱལ་བའི་སྲས་ཀྱི་སྤྱོད་པ་ཡིས། །"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་ཞིང་འདིར་སྣང་བའི་གཉེན། །"
    },
    {
      "bo": "གདུལ་དཀའ་འདུལ་མཛད་གྲུབ་པའི་རྡོ་རྗེ་འཛིན། །"
    },
    {
      "bo": "བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རིས་མེད་བསྟན་འགྲོའི་མགོན་གྱུར་གཏེར་ཆེན་རྗེ། །"
    },
    {
      "bo": "འཇམ་མགོན་རབ་གསལ་ཟླ་བའི་ཐུགས་བསྐྱེད་ཀྱིས། །"
    },
    {
      "bo": "ངེས་གྲོལ་སྔ་འགྱུར་བཤད་སྒྲུབ་ཆུ་གཏེར་ཆེའི། །"
    },
    {
      "bo": "དབྱིག་འཛིན་ཆོས་ཀྱི་སེངྒེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ལྟར་མི་ཕྱེད་གུས་པས་གསོལ་བཏབ་མཐུས། །"
    },
    {
      "bo": "ཚེ་རབས་ཕྲེང་བར་དམ་པའི་མགོན་རྣམས་ཀྱིས། །"
    },
    {
      "bo": "རྗེས་བཟུང་མཉེས་པ་གསུམ་གྱིས་ལེགས་བསྙེན་པས། །"
    },
    {
      "bo": "དོན་གཉིས་བསམ་ཀུན་ལྷུན་འགྲུབ་བྱིན་གྱིས་རློབས། །"
    }
  ]
}