{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/moons-illusory-reflection",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྐྱེས་རབས་གསོལ་འདེབས་ཆུ་ཟླའི་རྫུན་རིས་མོས་ལྡན་དགའ་བྱེད་ཅེས་བྱ་བ་བཞུགས་སོ། །"
  },
  "text": [
    {
      "bo": "ན་མོ་མཉྫ་ཤཱི་ཡེ།"
    },
    {
      "bo": "མཁའ་ཁྱབ་རྒྱལ་བ་ཀུན་གྱི་ཡེ་ཤེས་སྐུ། །"
    },
    {
      "bo": "རྒྱལ་བའི་ཡབ་གཅིག་རྗེ་བཙུན་མཁྱེན་པའི་གཏེར། །"
    },
    {
      "bo": "རྨོངས་པའི་དྲྭ་བ་མཐའ་དག་འདུལ་མཛད་པ། །"
    },
    {
      "bo": "བཅོམ་ལྡན་འཇམ་པའི་དབྱངས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཤཱཀྱའི་རྒྱལ་པོའི་གསུང་གི་སྲས་ཀྱི་མཆོག །"
    },
    {
      "bo": "མི་ཡི་མཆོག་གྱུར་ལི་ཙཱ་བི་ཞེས་གྲགས། །"
    },
    {
      "bo": "གཞོན་ནུ་མཐོང་ན་དགའ་བའི་མཚན་གྱིས་སྙན། །"
    },
    {
      "bo": "དྲི་མེད་གྲགས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དགའ་རབ་དཔའ་བོའི་ཐུགས་ཀྱི་སྲས་ཆེན་པོ། །"
    },
    {
      "bo": "མཁྱེན་རབ་མཐའ་ཡས་བློ་གྲོས་ཆེན་པོའི་གཏེར། །"
    },
    {
      "bo": "སྡེ་གསུམ་ཀློང་དགུའི་བསྟན་པའི་ཤིང་རྟ་ཆེ། །"
    },
    {
      "bo": "མཉྫུ་མི་ཏྲའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྣང་བཞིའི་མཐར་སོན་རིག་པ་འོད་སྐུར་སྨིན། །"
    },
    {
      "bo": "རྡོ་རྗེའི་སྐུ་བརྙེས་རི་བོ་རྩེ་ལྔར་བཞུགས། །"
    },
    {
      "bo": "སྤྲུལ་པས་སྙིང་པོའི་བསྟན་པ་གསལ་བར་བྱེད། །"
    },
    {
      "bo": "བི་མ་མི་ཏྲའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བདེ་བ་མཆོག་གི་གྲུབ་པ་བརྙེས་པའི་ཕུལ། །"
    },
    {
      "bo": "སྲིད་ཞིའི་ཆོས་ཀུན་འཁོར་ལོ་ཆེན་པོར་སྡོམ། །"
    },
    {
      "bo": "ཡུམ་སྲས་དང་བཅས་མཁའ་སྤྱོད་གནས་སུ་གཤེགས། །"
    },
    {
      "bo": "རྡོ་རྗེ་དྲིལ་བུ་པ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གནས་ལྔ་རིག་པ་རྒྱ་མཚོའི་ཕ་མཐར་སོན། །"
    },
    {
      "bo": "སྔགས་ཀྱི་ལམ་ལས་དངོས་གྲུབ་མཆོག་བརྙེས་ཤིང་། །"
    },
    {
      "bo": "འཕགས་ཡུལ་མཁས་པ་དུ་མས་ཕྱག་བྱས་པ། །"
    },
    {
      "bo": "པཎ་ཆེན་སྒོ་མཐའ་ཡས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་ཉིད་གངས་ཅན་རྒྱལ་པོར་སྤྲུལ། །"
    },
    {
      "bo": "གཙུག་ལག་ཁང་བཞེངས་མདོ་སྔགས་བསྟན་པ་སྤེལ། །"
    },
    {
      "bo": "བདེར་འདུས་བཀའ་བབས་ཐུགས་བསྐྱེད་རྨད་དུ་བྱུང་། །"
    },
    {
      "bo": "ཁྲི་སྲོང་ལྡེ་བཙན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་སུ་སྐུ་འཁྲུངས་ཤིང་། །"
    },
    {
      "bo": "གུ་རུའི་ཐུགས་ཟིན་བཀའ་འདུས་གཉེར་དུ་གཏད། །"
    },
    {
      "bo": "སྐྱེ་བ་བཅུ་གསུམ་བསྟན་འགྲོའི་དོན་ཆེན་སྒྲུབ། །"
    },
    {
      "bo": "རྒྱལ་སྲས་ལྷ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གནུབས་ཀྱི་རིགས་ལས་པདྨའི་ཐུགས་ཀྱི་སྲས། །"
    },
    {
      "bo": "ཡང་དག་གྲུབ་བརྙེས་ཉི་མའི་ཟེར་ལ་ཆིབ། །"
    },
    {
      "bo": "མངའ་བདག་ཚངས་པའི་བླ་ཡི་མཆོད་གནས་མཛད། །"
    },
    {
      "bo": "ནམ་མཁའི་སྙིང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སློབ་དཔོན་ཆེན་པོས་རྗེས་བཟུང་ཐུགས་ཀྱི་སྲས། །"
    },
    {
      "bo": "ལང་གྲོ་ལོ་ཙཱ་ཐོག་ཆེན་མདའ་ལྟར་འཕེན། །"
    },
    {
      "bo": "མཐུ་སྟོབས་ཕྲིན་ལས་ནུས་པའི་རྩལ་འཆང་བ། །"
    },
    {
      "bo": "དཀོན་མཆོག་འབྱུང་གནས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མར་པའི་ཐུགས་སྲས་གཏུམ་མོའི་བཀའ་བབས་ཤིང་། །"
    },
    {
      "bo": "དཀའ་སྤྱད་ཆེན་པོས་ཚེ་འདིར་མཆོག་དངོས་གྲུབ། །"
    },
    {
      "bo": "མཚན་ཐོས་ངན་སོང་འཇིགས་ལས་རྣམ་གྲོལ་བ། །"
    },
    {
      "bo": "མི་ལ་བཞད་པ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཉང་གི་རིགས་ལས་སྐུ་འཁྲུངས་ཟབ་གཏེར་བདག །"
    },
    {
      "bo": "མཐོན་མཐིང་རལ་པའི་ཅོད་པན་འཆང་བའི་རྗེ། །"
    },
    {
      "bo": "མཁོ་འཐིང་ལ་སོགས་ཟབ་གཏེར་རྒྱ་མཚོ་འབྱིན། །"
    },
    {
      "bo": "ཉི་མ་འོད་ཟེར་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསིལ་ལྡན་ཁ་བའི་ལྗོངས་ཀྱི་སྐྱེ་བོ་རྣམས། །"
    },
    {
      "bo": "ཉོན་མོངས་སྡུག་བསྔལ་རྒྱུ་འབྲས་ལས་སྐྱོབས་པ། །"
    },
    {
      "bo": "སྨན་པའི་རྒྱལ་པོ་མི་ཡི་ཤ་ཚུགས་ཅན། །"
    },
    {
      "bo": "ཡོན་ཏན་མགོན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཁྲི་སྲོང་སྤྲུལ་པ་ངུར་སྨྲིག་འཆང་བའི་གཙོ། །"
    },
    {
      "bo": "ཀླུ་སྒྲུབ་དངོས་བྱོན་སྒྲུབ་བརྒྱུད་བསྟན་པའི་བདག །"
    },
    {
      "bo": "འགྲོ་དོན་འཛམ་གླིང་ཐ་གྲུར་ཁྱབ་པའི་རྗེ། །"
    },
    {
      "bo": "སྐྱོབས་པ་རིན་ཆེན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཁོན་གྱི་རིགས་འཁྲུངས་མཁས་བཙུན་བཟང་པོའི་ཕུལ། །"
    },
    {
      "bo": "གདུལ་དཀའི་འགྲོ་བ་མཐའ་དག་འདུལ་མཛད་ཅིང་། །"
    },
    {
      "bo": "དྲེགས་ལྡན་གཙུག་གི་ནོར་བུས་ཕྱག་བྱས་པ། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་འཕགས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གློ་བོར་སྐུ་འཁྲུངས་ལོ་ཙཱ་མཁས་པར་མཁྱེན། །"
    },
    {
      "bo": "འཇམ་དཔལ་དམར་པོའི་གྲུབ་པ་མཐོན་པོར་གཤེགས། །"
    },
    {
      "bo": "མཁས་དང་གྲུབ་པའི་ཡོན་ཏན་མཐའ་ཡས་པ། །"
    },
    {
      "bo": "ཤེས་རབ་རིན་ཆེན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཚན་མཆོག་གསུམ་ལྡན་འཇམ་དབྱངས་ས་སྐྱ་པ། །"
    },
    {
      "bo": "བཤད་སྒྲུབ་ཕྲིན་ལས་ནམ་མཁའི་མཐར་ཁྱབ་ཅིང་། །"
    },
    {
      "bo": "མཁྱེན་བརྩེ་ནུས་པ་རྒྱ་མཚོའི་གཏེར་ཆེན་པོ། །"
    },
    {
      "bo": "བསོད་ནམས་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱི་ནང་གཞུང་ལུགས་རྒྱ་མཚོའི་ཕ་མཐར་སོན། །"
    },
    {
      "bo": "ཀུན་ཏུ་བཟང་པོའི་དགོངས་པའི་རྩལ་ཆེན་རྫོགས། །"
    },
    {
      "bo": "འོད་གསལ་རྡོ་རྗེ་རྩེ་མོའི་ཤིང་རྟ་ཆེ། །"
    },
    {
      "bo": "ཀློང་ཆེན་རབ་འབྱམས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀུན་མཁྱེན་དོལ་པོ་སླར་ཡང་སྤྲུལ་པའི་སྐུར། །"
    },
    {
      "bo": "བཞེངས་ནས་པདྨས་རྗེས་བཟུང་བོད་ཁམས་སྐྱོང་། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་གྲུབ་པ་ཡོངས་ཀྱི་གཙུག་གི་རྒྱན། །"
    },
    {
      "bo": "ཐང་སྟོང་རྒྱལ་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཀུན་མཁྱེན་ཀུན་དགའ་བཟང་པོའི་ཐུགས་ཀྱི་སྲས། །"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པ་ངུར་སྨྲིག་གར་བསྒྱུར་ཞིང་། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་གཉིས་འབྱོངས་པ་ཀུན་གྱི་རྗེ། །"
    },
    {
      "bo": "དཀོན་མཆོག་རྒྱལ་མཚན་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱི་ལྟར་རྣམ་གསུམ་གཙང་མའི་གོས་ཀྱིས་བཀླུབས། །"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་ཀྱིས་ཐུགས་རྒྱུད་གཏམས། །"
    },
    {
      "bo": "གསང་བ་རྡོ་རྗེ་འཛིན་པའི་ས་མཆོག་བརྙེས། །"
    },
    {
      "bo": "ཞྭ་ལུ་མཁྱེན་རབ་ཆོས་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རཏྣ་གླིང་པའི་ཐུགས་གསུང་བྱིན་བརླབས་སྲས། །"
    },
    {
      "bo": "བརྒྱ་དང་བཅུ་བཞུགས་ཟབ་གཏེར་བསྟན་པ་སྐྱོང་།"
    },
    {
      "bo": "རིག་སྔགས་གྲུབ་པ་བསྟན་དང་འགྲོ་བའི་མགོན། །"
    },
    {
      "bo": "ཚེ་དབང་གྲགས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ས་སྐྱ་པཎ་ཆེན་བསམ་བཞིན་སྤྲུལ་པའི་སྐུ། །"
    },
    {
      "bo": "བཻ་རོའི་སྤྲུལ་པར་པདྨའི་ལུང་གིས་བརྙེས། །"
    },
    {
      "bo": "གནས་ལྔ་རིག་པ་ས་སྐྱ་ལོ་ཙཱ་ཞེས། །"
    },
    {
      "bo": "འཇམ་པའི་རྡོ་རྗེའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མངའ་བདག་རྒྱལ་པོའི་ཡོན་ཏན་རྣམ་པར་འཕྲུལ། །"
    },
    {
      "bo": "མངའ་རིས་གློ་བོ་མ་ཐང་སྐུ་བལྟམས་ཤིང་། །"
    },
    {
      "bo": "རིས་མེད་བསྟན་པ་རྒྱ་མཚོར་གསན་སྦྱོང་མཛད། །"
    },
    {
      "bo": "པདྨ་དབང་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འ་ཞའི་རིགས་འཁྲུངས་ཚར་ཆེན་ཐུགས་སྲས་མཆོག །"
    },
    {
      "bo": "མཁྱེན་རབ་འཇམ་དཔལ་དབྱངས་དང་གཉིས་སུ་མེད། །"
    },
    {
      "bo": "རྩ་གསུམ་ལྷག་པའི་ལྷ་ཡིས་བྱིན་གྱིས་བརླབས། །"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་ཕྱུག་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གསང་བའི་བདག་པོ་གོས་དཀར་འཆང་བར་སྟོན། །"
    },
    {
      "bo": "དྲག་སྔགས་བཀའ་བབས་རིག་སྔགས་འཆང་བའི་རྗེ། །"
    },
    {
      "bo": "མ་རུང་གདུག་པ་ཅན་རྣམས་འདུལ་མཛད་པ། །"
    },
    {
      "bo": "བཀྲ་ཤིས་སྟོབས་རྒྱལ་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བི་མའི་སྤྲུལ་པ་དག་སྣང་འབྱམས་ཀླས་ཤིང་། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་གྲུབ་པ་རྣམས་ཀྱི་འཁོར་ལོས་སྒྱུར། །"
    },
    {
      "bo": "ཧེ་རུ་ཀ་དཔལ་ལྷ་བཙུན་དཔའ་བོ་ཆེ། །"
    },
    {
      "bo": "ནམ་མཁའ་འཇིགས་མེད་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མདོ་རྒྱུད་རྣམས་ལས་རྒྱལ་བས་ལུང་གིས་བསྔགས། །"
    },
    {
      "bo": "བྱང་ཕྱོགས་སྐྱོང་བའི་སྐྱོབས་པ་མཆོག་གྱུར་པ། །"
    },
    {
      "bo": "འཛམ་གླིང་རྒྱན་གཅིག་ལྷ་མིས་མཆོད་འོས་གྱུར། །"
    },
    {
      "bo": "ངག་དབང་བློ་བཟང་རྒྱ་མཚོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འགྱུར་མེད་རྡོ་རྗེའི་སྐུ་ཡི་སྲས་སུ་བལྟམས། །"
    },
    {
      "bo": "རྟ་མགྲིན་གྲུབ་བརྙེས་དབང་ཆེན་གསུང་གི་རིགས། །"
    },
    {
      "bo": "བློ་གྲོས་ཆེན་པོས་ཤེས་བྱ་རབ་འབྱམས་མཁྱེན། །"
    },
    {
      "bo": "པདྨ་འགྱུར་མེད་རྒྱ་མཚོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ཡི་ཡང་སྲིད་མྱོས་རིགས་དཔའ་བོ་ཆེ། །"
    },
    {
      "bo": "ལྷར་བཅས་སྐྱེ་རྒུས་མཐོང་ན་རབ་དགའ་ཞིང་། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་གཞན་ལ་ཕན་པའི་མཆོག །"
    },
    {
      "bo": "ཚངས་དབྱངས་རྒྱ་མཚོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལང་གྲོའི་སྐྱེ་མཐའ་ཟབ་གཏེར་བསྟན་པ་འཛིན། །"
    },
    {
      "bo": "པདྨ་དྲག་པོའི་སྐུ་གྲུབ་སྡེ་བརྒྱད་འདུལ། །"
    },
    {
      "bo": "སྙིགས་དུས་འབྱུང་པོ་འདུལ་བའི་གཤེད་དུ་གྱུར། །"
    },
    {
      "bo": "ཀློང་གསལ་སྙིང་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐེག་པ་ཆེན་པོའི་རིགས་མཆོག་ཡོངས་སུ་སད། །"
    },
    {
      "bo": "རྩ་ཡི་མདུད་གྲོལ་ཆོས་རྣམས་ཀློང་ནས་རྡོལ། །"
    },
    {
      "bo": "དགོངས་གཏེར་ནམ་མཁའ་མཛོད་ལ་མངའ་དབང་སྒྱུར། །"
    },
    {
      "bo": "འཇིགས་མེད་གླིང་པའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དྲི་མེད་བཤེས་གཉེན་དགེ་སྦྱོང་ཚུལ་བསྟན་ནས། །"
    },
    {
      "bo": "སྐྱེ་བ་བདུན་དུ་བསྟན་འགྲོའི་དོན་ཆེན་སྒྲུབ། །"
    },
    {
      "bo": "ཕྱིར་མི་ལྡོག་པའི་རྟགས་འཆང་བཞི་པ་ནི། །"
    },
    {
      "bo": "མི་འགྱུར་ནམ་མཁའི་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཡེ་ཤེས་རྡོ་རྗེའི་སྐུ་དང་ཀུན་དགའི་གསུང་། །"
    },
    {
      "bo": "དབང་མཆོག་ཐུགས་སྤྲུལ་བློ་གསལ་ཡོན་ཏན་དང་། །"
    },
    {
      "bo": "འཇམ་དཔལ་དབྱངས་དངོས་མཁྱེན་བརྩེའི་དབང་པོ་ཡི། །"
    },
    {
      "bo": "ཕྲིན་ལས་རྣམ་འཕྲུལ་ཆེན་པོར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་པོའི་ཕྲིན་ལས་སྤྲུལ་པའི་སྐུ། །"
    },
    {
      "bo": "བཀའ་དྲིན་གསུམ་ལྡན་ཁྱབ་བདག་འཁོར་ལོའི་མགོན། །"
    },
    {
      "bo": "སྙིགས་མའི་འགྲོ་འདུལ་མཛད་པ་བསམ་མི་ཁྱབ། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བློ་གྲོས་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མ་འོངས་བྱང་ཕྱོགས་ས་སྤྱོད་སྤྲུལ་པའི་ཞིང་། །"
    },
    {
      "bo": "ཤམྦྷ་ལ་ཡི་ཕོ་བྲང་ཀ་ལ་པར། །"
    },
    {
      "bo": "རིགས་ལྡན་དྲག་པོ་འཁོར་ལོ་ཕྱག་ན་འཆང་། །"
    },
    {
      "bo": "རྣམ་པར་རྒྱལ་བ་ཅན་དང་དབྱེར་མེད་ཤོག །"
    },
    {
      "bo": "གསོལ་འདེབས་བུ་ལ་བརྩེ་བས་རབ་དགོངས་ཏེ། །"
    },
    {
      "bo": "དེང་ནས་བཟུང་སྟེ་ཚེ་རབས་ཐམས་ཅད་དུ། །"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མ་མཆོག་གིས་རྗེས་བཟུང་ཞིང་། །"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འཇམ་དབྱངས་བླ་མའི་ཞབས་པད་ཡུན་དུ་བརྟན། །"
    },
    {
      "bo": "བསྟན་དང་བསྟན་འཛིན་དར་ཞིང་རྒྱས་པ་དང་། །"
    },
    {
      "bo": "བོད་ཁམས་དུས་ཀྱི་རྒུད་པ་ཀུན་ཞི་ནས། །"
    },
    {
      "bo": "འཇིག་རྟེན་བདེ་དགའི་དཔལ་གྱིས་འབྱོར་གྱུར་ཅིག །"
    }
  ]
}