{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/words-of-the-buddha/heart-sutra-with-extras",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ། །",
    "en": "In Praise of Prajñāpāramitā"
  },
  "text": [
    {
      "bo": "སྨྲ་བསམ་བརྗོད་མེད་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །",
      "en": "Beyond words, beyond thought, beyond description, Prajñāpāramitā",
      "en-trans": "ma sam jö mé sherab parol chin"
    },
    {
      "bo": "མ་སྐྱེས་མི་འགག་ནམ་མཁའི་ངོ་བོ་ཉིད། །",
      "en": "Unborn, unceasing, the very essence of space",
      "en-trans": "makyé mingak namkhé ngowo nyi"
    },
    {
      "bo": "སོ་སོ་རང་རིག་ཡེ་ཤེས་སྤྱོད་ཡུལ་བ། །",
      "en": "Yet it can be experienced as the wisdom of our own rigpa:",
      "en-trans": "soso rangrig yeshe chöyulwa"
    },
    {
      "bo": "དུས་གསུམ་རྒྱལ་བའི་ཡུམ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the mother of the buddhas of past, present and future!",
      "en-trans": "dü sum gyalwé yum la chaktsal lo"
    },
    {
      "bo": "༈ རྒྱ་གར་སྐད་དུ།",
      "en": "In the language of India:",
      "en-trans": "gyagar ké du"
    },
    {
      "bo": "བྷ་ག་བ་ཏི་པྲཛྙཱ་པཱ་ར་མི་ཏཱ་ཧྲི་ད་ཡ།",
      "en": "Bhagavatī prajñāpāramitā hṛdaya",
      "en-trans": "bhagavati prajnaparamita hridaya"
    },
    {
      "bo": "བོད་སྐད་དུ།",
      "en": "In the language of Tibet:",
      "en-trans": "böké du"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ། །",
      "en": "Chomden dema sherab kyi parol tu chinpé nyingpo",
      "en-trans": "chomden dema sherab kyi parol tu chinpé nyingpo"
    },
    {
      "en": "In the English language:The Blessed Mother, the Heart of the Transcendent Perfection of Wisdom"
    },
    {
      "bo": "བམ་པོ་གཅིག་གོ",
      "en": "In a single segment.",
      "en-trans": "bampo chik go"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Bhagavatī Prajñāpāramitā!",
      "en-trans": "chomden dema sherab kyi parol tu chinpa la chaktsal lo"
    },
    {
      "bo": "འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།",
      "en": "Thus have I heard:",
      "en-trans": "diké dak gi töpa dü chik na"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང༌།",
      "en": "At one time the Blessed One was dwelling in Rājgṛha at Vulture Peak mountain, together with a great community of",
      "en-trans": "chomdendé gyalpö khab jagö pungpö ri la gelong gi gendün chenpo dang"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་གཅིག་ཏུ་བཞུགས་ཏེ།",
      "en": "monks and a great community of bodhisattvas.",
      "en-trans": "changchub sempé gendün chenpo dang tab chik tu zhuk té"
    },
    {
      "bo": "དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཟབ་མོ་སྣང་བ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །",
      "en": "At that time, the Blessed One entered an absorption on categories of phenomena called ‘perception of the profound’.",
      "en-trans": "dé tsé chomdendé zabmo nangwa zhejawa chö kyi namdrang kyi ting ngé dzin la nyompar zhuk so"
    },
    {
      "bo": "ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་ཉིད་ལ་རྣམ་པར་བལྟ་ཞིང་།",
      "en": "At the same time, noble Avalokiteśvara, the bodhisattva and great being, beheld the practice of the profound perfection of wisdom,",
      "en-trans": "yang dé tsé changchub sempa sempa chenpo pakpa chenrezik wangchuk sherab kyi parol tu chinpa zabmo chöpa nyi la nampar ta zhing"
    },
    {
      "bo": "ཕུང་པོ་ལྔ་པོ་དེ་དག་ལ་ཡང་རང་བཞིན་གྱིས་སྟོང་པར་རྣམ་པར་བལྟའོ། །",
      "en": "And saw that the five aggregates are empty of nature.",
      "en-trans": "pungpo ngapo dedak la yang rangzhin gyi tongpar nampar ta o"
    },
    {
      "bo": "དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས།",
      "en": "Then, through the Buddha's power,",
      "en-trans": "dené sangye kyi tü"
    },
    {
      "bo": "ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །",
      "en": "Venerable Śāriputra said to noble Avalokiteśvara, the bodhisattva and great being:",
      "en-trans": "tsé dang denpa sharibü changchub sempa sempa chenpo pakpa chenrezik wangchuk la diké ché mé so"
    },
    {
      "bo": "རིགས་ཀྱི་བུ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་སྤྱད་པར་འདོད་པ་དེས་ཇི་ལྟར་བསླབ་པར་བྱ།",
      "en": "“How should a child of noble family who wishes to practise the profound perfection of wisdom train?”",
      "en-trans": "rik kyi bu gang lala sherab kyi parol tu chinpa zabmo chöpa chepar döpa dé jitar labpar ja"
    },
    {
      "bo": "དེ་སྐད་ཅེས་སྨྲས་པ་དང༌། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཚེ་དང་ལྡན་པ་ཤཱ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །",
      "en": "This is what he said, and the noble Avalokiteśvara, the bodhisattva and great being, replied to venerable Śāriputra as follows:",
      "en-trans": "deké ché mepa dang | changchub sempa sempa chenpo pakpa chenrezik wangchuk gi tsé dang denpa shara datibu la diké ché mé so"
    },
    {
      "bo": "ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་སྤྱད་པར་འདོད་པ་དེས་འདི་ལྟར་རྣམ་པར་བལྟ་བར་བྱ་སྟེ།",
      "en": "“O Śāriputra, a son of noble family or daughter of noble family who wishes to practise the profound perfection of wisdom should regard things in this way:",
      "en-trans": "sharibu rik kyi bu am rik kyi bumo gang lala sherab kyi parol tu chinpa zabmo chöpa chepar döpa dé ditar nampar tawar ja té"
    },
    {
      "bo": "ཕུང་པོ་ལྔ་པོ་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་རྣམ་པར་ཡང་དག་པར་རྗེས་སུ་བལྟའོ། །",
      "en": "They should see the five aggregates to be empty of nature.",
      "en-trans": "pungpo ngapo dedak kyang rangzhin gyi tongpar nampar yangdakpar jesu ta o"
    },
    {
      "bo": "གཟུགས་སྟོང་པའོ། །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ། །",
      "en": "Form is empty; emptiness is form;",
      "en-trans": "zuk tongpa o | tongpanyi kyang zuk so"
    },
    {
      "bo": "གཟུགས་ལས་སྟོང་པ་ཉིད་གཞན་མ་ཡིན་ནོ། །",
      "en": "Emptiness is not other than form;",
      "en-trans": "zuk lé tongpanyi zhen mayin no"
    },
    {
      "bo": "སྟོང་པ་ཉིད་ལས་ཀྱང་གཟུགས་གཞན་མ་ཡིན་ནོ། །",
      "en": "Form is not other than emptiness.",
      "en-trans": "tongpanyi lé kyang zuk zhen mayin no"
    },
    {
      "bo": "དེ་བཞིན་དུ་ཚོར་བ་དང༌། འདུ་ཤེས་དང༌།",
      "en": "In the same way, sensation, recognition,",
      "en-trans": "dezhindu tsorwa dang | dushé dang"
    },
    {
      "bo": "འདུ་བྱེད་དང༌། རྣམ་པར་ཤེས་པ་རྣམས་སྟོང་པའོ། །",
      "en": "Conditioning factors and consciousness are emptiness.",
      "en-trans": "dujé dang | nampar shepa nam tongpa o"
    },
    {
      "bo": "ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དེ།",
      "en": "Therefore, Śāriputra, all dharmas are emptiness.",
      "en-trans": "sharibu detawé na chö tamché tongpanyi dé"
    },
    {
      "bo": "མཚན་ཉིད་མེད་པ། མ་སྐྱེས་པ། མ་འགགས་པ།",
      "en": "They are without characteristics; they are unarisen and unceasing;",
      "en-trans": "tsennyi mepa | makyepa | magakpa"
    },
    {
      "bo": "དྲི་མ་མེད་པ། དྲི་མ་དང་བྲལ་བ་མེད་པ།",
      "en": "They are not tainted and not untainted;",
      "en-trans": "drima mepa | drima dang dralwa mepa"
    },
    {
      "bo": "བྲི་བ་མེད་པ། གང་བ་མེད་པའོ། །",
      "en": "They are not deficient and not complete.",
      "en-trans": "driwa mepa | gangwa mepa o"
    },
    {
      "bo": "ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་སྟོང་པ་ཉིད་ལ་གཟུགས་མེད།",
      "en": "Therefore, Śāriputra, in emptiness, there is no form,",
      "en-trans": "sharibu detawé na tongpanyi la zukmé"
    },
    {
      "bo": "ཚོར་བ་མེད། འདུ་ཤེས་མེད། འདུ་བྱེད་རྣམས་མེད། རྣམ་པར་ཤེས་པ་མེད།",
      "en": "No sensation, no recognition, no conditioning factors, no consciousness;",
      "en-trans": "tsorwa mé | dushé mé | dujé nam mé | nampar shepa mé"
    },
    {
      "bo": "མིག་མེད། རྣ་བ་མེད། སྣ་མེད། ལྕེ་མེད། ལུས་མེད། ཡིད་མེད།",
      "en": "No eye, no ear, no nose, no tongue, no body, no mind;",
      "en-trans": "mik mé | nawa mé | na mé | che mé | lü mé | yi mé"
    },
    {
      "bo": "གཟུགས་མེད། སྒྲ་མེད། དྲི་མེད། རོ་མེད། རེག་བྱ་མེད། ཆོས་མེད་དོ། །",
      "en": "No visible form, no sound, no odour, no taste, no texture, and no mental objects;",
      "en-trans": "zuk mé | dra mé | dri mé | ro mé | rekja mé | chö mé do"
    },
    {
      "bo": "མིག་གི་ཁམས་མེད་པ་ནས་ཡིད་ཀྱི་ཁམས་མེད།",
      "en": "There is no eye element up to no mind element;",
      "en-trans": "mik gi kham mepa né yi kyi kham mé"
    },
    {
      "bo": "ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་ཡང་མེད་དོ། །",
      "en": "And as far as no mental consciousness element;",
      "en-trans": "yi kyi nampar shepé kham kyi bardu yang mé do"
    },
    {
      "bo": "མ་རིག་པ་མེད། མ་རིག་པ་ཟད་པ་མེད་པ་ནས་རྒ་ཤི་མེད།",
      "en": "There is no ignorance, no extinction of ignorance up to no old age and death,",
      "en-trans": "marikpa mé | marikpa zepa mepa né gashi mé"
    },
    {
      "bo": "རྒ་ཤི་ཟད་པའི་བར་དུ་ཡང་མེད་དོ། །",
      "en": "No extinction of old age and death;",
      "en-trans": "gashi zepé bardu yang mé do"
    },
    {
      "bo": "སྡུག་བསྔལ་བ་དང༌། ཀུན་འབྱུང་བ་དང༌།",
      "en": "No suffering, no origin,",
      "en-trans": "dukngalwa dang | künjungwa dang"
    },
    {
      "bo": "འགོག་པ་དང༌། ལམ་མེད། ཡེ་ཤེས་མེད། ཐོབ་པ་མེད།",
      "en": "No cessation, no path, no wisdom, no attainment,",
      "en-trans": "gokpa dang | lam mé | yeshe mé | tobpa mé"
    },
    {
      "bo": "མ་ཐོབ་པ་ཡང་མེད་དོ། །",
      "en": "And no non-attainment.",
      "en-trans": "matobpa yang mé do"
    },
    {
      "bo": "ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོབ་པ་མེད་པའི་ཕྱིར།",
      "en": "Therefore, Śāriputra, since bodhisattvas have no attainment,",
      "en-trans": "sharibu detawé na changchub sempa nam tobpa mepé chir"
    },
    {
      "bo": "ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ཅིང་གནས་ཏེ།",
      "en": "They rely on and abide by the perfection of wisdom.",
      "en-trans": "sherab kyi parol tu chinpa la ten ching né té"
    },
    {
      "bo": "སེམས་ལ་སྒྲིབ་པ་མེད་པས་སྐྲག་པ་མེད་དེ།",
      "en": "Since their minds are unobscured, they have no fear.",
      "en-trans": "sem la dribpa mepé trakpa mé dé"
    },
    {
      "bo": "ཕྱིན་ཅི་ལོག་ལས་ཤིན་ཏུ་འདས་ནས་མྱ་ངན་ལས་འདས་པའི་མཐར་ཕྱིན་ཏོ། །",
      "en": "They completely transcend error and reach the ultimate nirvāṇa.",
      "en-trans": "chin chi lok lé shintu dé né nya ngen lé depé tarchin to"
    },
    {
      "bo": "དུས་གསུམ་དུ་རྣམ་པར་བཞུགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ནས།",
      "en": "All the buddhas throughout the three times",
      "en-trans": "dü sum du nampar zhukpé sangye tamché kyang sherab kyi parol tu chinpa la ten né"
    },
    {
      "bo": "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །",
      "en": "Fully awaken to unsurpassable, true, complete enlightenment by means of the perfection of wisdom.",
      "en-trans": "lana mepa yangdakpar dzokpé changchub tu ngönpar dzokpar sangye so"
    },
    {
      "bo": "དེ་ལྟ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔགས།",
      "en": "Therefore, the mantra of the perfection of wisdom—",
      "en-trans": "detawé na sherab kyi parol tu chinpé ngak"
    },
    {
      "bo": "རིག་པ་ཆེན་པོའི་སྔགས། བླ་ན་མེད་པའི་སྔགས།",
      "en": "The mantra of great insight, the unsurpassed mantra,",
      "en-trans": "rigpa chenpö ngak | lana mepé ngak"
    },
    {
      "bo": "མི་མཉམ་པ་དང་མཉམ་པའི་སྔགས། སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སྔགས།",
      "en": "The mantra that equals the unequalled, the mantra that pacifies all suffering—",
      "en-trans": "minyampa dang nyampé ngak | dukngal tamché rabtu zhiwar jepé ngak"
    },
    {
      "bo": "མི་བརྫུན་པས་ན་བདེན་པར་ཤེས་པར་བྱ་སྟེ།",
      "en": "Is not false and should be understood as true.",
      "en-trans": "midzünpé na denpar shepar ja té"
    },
    {
      "bo": "ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔགས་སྨྲས་པ།",
      "en": "The mantra of the perfection of wisdom is proclaimed as follows:",
      "en-trans": "sherab kyi parol tu chinpé ngak mepa"
    },
    {
      "bo": "ཏདྱ་ཐཱ། ཨོཾ་ག་ཏེ་ག་ཏེ་པཱ་ར་ག་ཏེ། པཱ་ར་སཾ་ག་ཏེ། བོ་དྷི་སྭཱ་ཧཱ།",
      "en": "tadyathā | oṃ gate gate pāragate | pārasaṃgate | bodhi svāhā",
      "en-trans": "teyata | om gaté gaté para gaté | para samgaté | bodhi soha"
    },
    {
      "bo": "ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་བསླབ་པར་བྱའོ། །",
      "en": "Śāriputra, a bodhisattva and great being should train in the profound perfection of wisdom in this way.”",
      "en-trans": "sharibu changchub sempa sempa chenpö detar sherab kyi parol tu chinpa zabmo la labpar ja o"
    },
    {
      "bo": "དེ་ནས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ།",
      "en": "Thereupon, the Blessed One arose from that absorption",
      "en-trans": "dené chomdendé ting ngé dzin dé lé zheng té"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས།",
      "en": "And commended Avalokiteśvara, the bodhisattva and great being:",
      "en-trans": "changchub sempa sempa chenpo pakpa chenrezik wangchuk la lek so zhejawa jin né"
    },
    {
      "bo": "ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།",
      "en": "“Excellent, excellent, O son of noble family, that is how it is. That is just how it is.",
      "en-trans": "lek so lek so | rik kyi bu de dezhin no | rik kyi bu de dezhin té"
    },
    {
      "bo": "ཇི་ལྟར་ཁྱོད་ཀྱིས་བསྟན་པ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་སྤྱད་པར་བྱ་སྟེ།",
      "en": "One should practise the profound perfection of wisdom just as you have taught",
      "en-trans": "jitar khyö kyi tenpa dezhindu sherab kyi parol tu chinpa zabmo la chepar ja té"
    },
    {
      "bo": "དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་རྗེས་སུ་ཡི་རང་ངོ་། །",
      "en": "And then even the tathāgatas will rejoice.”",
      "en-trans": "dezhin shekpa nam kyang jesu yi rang ngo"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།",
      "en": "When the Blessed One had said this,",
      "en-trans": "chomdendé kyi deké ché katsal né"
    },
    {
      "bo": "ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང༌།",
      "en": "Venerable Śāriputra, and",
      "en-trans": "tsé dang denpa sharibu dang"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང༌།",
      "en": "Noble Avalokiteśvara, the bodhisattva and great being,",
      "en-trans": "changchub sempa sempa chenpo pakpa chenrezik wangchuk dang"
    },
    {
      "bo": "ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དང༌། ལྷ་དང༌། མི་དང༌།",
      "en": "Together with the whole assembly and the world of gods, human beings,",
      "en-trans": "tamché dang denpé khor dedak dang | lha dang | mi dang"
    },
    {
      "bo": "ལྷ་མ་ཡིན་དང༌། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།",
      "en": "Asuras and gandharvas rejoiced and praised",
      "en-trans": "lha mayin dang | drizar chepé jikten yi rang té"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །",
      "en": "The speech of the Blessed One.",
      "en-trans": "chomdendé kyi sungpa la ngönpar tö do"
    },
    {
      "bo": "བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།  །།",
      "en": "Thus concludes the Mahāyāna Sūtra of the Blessed Mother, the Heart of the Transcendent Perfection of Wisdom.",
      "en-trans": "chomden dema sherab kyi parol tu chinpé nyingpo zhejawa tekpa chenpö do dzok so"
    },
    {
      "bo": "༈ ཏདྱ་ཐཱ། ཨོཾ་ག་ཏེ་ག་ཏེ་པཱ་ར་ག་ཏེ། པཱ་ར་སཾ་ག་ཏེ། བོ་དྷི་སྭཱ་ཧཱ།",
      "en": "tadyathā | oṃ gate gate pāragate | pārasaṃgate | bodhi svāhā",
      "en-trans": "teyata | om gaté gaté para gaté | para samgaté | bodhi soha"
    },
    {
      "bo": "༈ ན་མོ་བླ་མ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Namo! Homage to the Guru!",
      "en-trans": "namo, lama la chaktsal lo"
    },
    {
      "bo": "སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Buddha!",
      "en-trans": "sangye la chaktsal lo"
    },
    {
      "bo": "ཆོས་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Dharma!",
      "en-trans": "chö la chaktsal lo"
    },
    {
      "bo": "དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Saṅgha!",
      "en-trans": "gendün la chaktsal lo"
    },
    {
      "bo": "ཡུམ་ཆེན་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Great Mother, Prajñāpāramitā!",
      "en-trans": "yum chenmo sherab kyi parol tu chinpa la chaktsal lo"
    },
    {
      "bo": "ཁྱེད་རྣམས་ལ་ཕྱག་འཚལ་བའི་མཐུ་དང་ནུས་པ་ལ་བརྟེན་ནས།",
      "en": "Through the power and strength of paying homage to you,",
      "en-trans": "khyé nam la chaktsalwé tu dang nüpa la ten né"
    },
    {
      "bo": "བདག་ཅག་གི་ཚིག་འདི་འགྲུབ་པར་གྱུར་ཅིག །",
      "en": "May these words of ours come true!",
      "en-trans": "dakchak gi tsik di drubpar gyur chik"
    },
    {
      "bo": "ཇི་ལྟར་སྔོན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཡུམ་ཆེན་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཟབ་མོ་ཡིད་ལ་བསམ་ཞིང་ཚིག་ཁ་ཏོན་དུ་བྱས་པའི་མཐུ་དང་ནུས་པ་ལ་བརྟེན་ནས། །",
      "en": "Just as, long ago, the king of the gods Indra, by the power and strength of contemplating the profound meaning of the perfection of wisdom, the Great Mother, and reciting its words,",
      "en-trans": "jitar ngön lhé wangpo gyajin gyi yum chenmo sherab kyi parol tu chinpé dön zabmo yi la sam zhing tsik khatön du jepé tu dang nüpa la ten né"
    },
    {
      "bo": "བདུད་སྡིག་ཅན་ལ་སོགས་པ་ཕྱིར་བཟློག་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཡུམ་ཆེན་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཟབ་མོ་ཡིད་ལ་བསམ་ཞིང་ཚིག་ཁ་ཏོན་དུ་བྱས་པའི་མཐུ་དང་ནུས་པ་ལ་བརྟེན་ནས། །",
      "en": "Was able to avert the demonic forces of negativity, so in the very same way, may we too, through the power and strength of contemplating the profound meaning of the Perfection of Wisdom, the Great Mother, and reciting its words,",
      "en-trans": "dü dikchen lasokpa chir dokpa dezhindu dak gi kyang yum chenmo sherab kyi parol tu chinpé dön zabmo yi la sam zhing tsik khatön du jepé tu dang nüpa la ten né"
    },
    {
      "bo": "བདག་འཁོར་དང་བཅས་པའི་དམ་པའི་ཆོས་སྒྲུབ་པའི་སྤང་བྱ་མི་མཐུན་པའི་ཕྱོགས་ཐམས་ཅད་ཕྱིར་བཟློག་པར་གྱུར་ཅིག །",
      "en": "Avert all the negative influences which prevent us and those around us from accomplishing the Noble Dharma!",
      "en-trans": "dak khor dang chepé dampé chö drubpé pangja mitünpé chok tamché chir dokpar gyur chik"
    },
    {
      "bo": "མེད་པར་གྱུར་ཅིག །",
      "en": "May they be annihilated!",
      "en-trans": "mepar gyur chik"
    },
    {
      "bo": "ཞི་བར་གྱུར་ཅིག །",
      "en": "May they be rendered harmless!",
      "en-trans": "zhiwar gyur chik"
    },
    {
      "bo": "རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །",
      "en": "May they be completely pacified!",
      "en-trans": "rabtu zhiwar gyur chik"
    },
    {
      "bo": "༈ གང་གིས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་། །",
      "en": "Everything that arises interdependently",
      "en-trans": "gang gi ten ching drelwar jung"
    },
    {
      "bo": "འགག་པ་མེད་པ་སྐྱེ་མེད་པ། །",
      "en": "Is unceasing and unborn,",
      "en-trans": "gakpa mepa kyé mepa"
    },
    {
      "bo": "ཆད་པ་མེད་པ་རྟག་མེད་པ། །",
      "en": "Neither non-existent nor everlasting,",
      "en-trans": "chepa mepa tak mepa"
    },
    {
      "bo": "འོང་བ་མེད་པ་འགྲོ་མེད་པ། །",
      "en": "Neither coming nor going,",
      "en-trans": "ongwa mepa dro mepa"
    },
    {
      "bo": "ཐ་དད་དོན་མིན་དོན་གཅིག་མིན། །",
      "en": "Neither multiple nor single.",
      "en-trans": "tadé dön min dön chik min"
    },
    {
      "bo": "སྤྲོས་པ་ཉེར་ཞི་ཞི་སྟོན་པ། །",
      "en": "To this teaching that pacifies all concepts and duality,",
      "en-trans": "tröpa nyerzhi zhi tönpa"
    },
    {
      "bo": "རྫོགས་པའི་སངས་རྒྱས་སྨྲ་རྣམས་ཀྱི། །",
      "en": "The most sacred speech of the fully enlightened Buddha,",
      "en-trans": "dzokpé sangye ma nam kyi"
    },
    {
      "bo": "དམ་པ་དེ་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "We pay homage!",
      "en-trans": "dampa dé la chaktsal lo"
    },
    {
      "bo": "རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པ་ལ། །",
      "en": "May all obstacles,",
      "en-trans": "dzokpé changchub drubpa la"
    },
    {
      "bo": "ཕྱི་དང་ནང་གི་འཚེ་བ་ཡི། །",
      "en": "Outer and inner,",
      "en-trans": "chi dang nang gi tsewa yi"
    },
    {
      "bo": "བར་དུ་གཅོད་པ་ཐམས་ཅད་ཀུན། །",
      "en": "To our attaining complete enlightenment,",
      "en-trans": "bardu chöpa tamché kün"
    },
    {
      "bo": "ཉེ་བར་ཞི་བར་མཛད་དུ་གསོལ། །",
      "en": "Be totally pacified!",
      "en-trans": "nyewar zhiwar dzé du sol"
    },
    {
      "bo": "གཞན་ཡང་སྐྱེ་བ་འདི་ཉིད་དུ། །",
      "en": "Also, in this very life,",
      "en-trans": "zhenyang kyewa dinyi du"
    },
    {
      "bo": "མི་མཐུན་ཕྱོགས་ཀུན་ཞི་བ་དང༌། །",
      "en": "May everything inharmonious be pacified, and",
      "en-trans": "mitün chok kün zhiwa dang"
    },
    {
      "bo": "ཚེ་རིང་ནད་མེད་ཕུན་སུམ་ཚོགས། །",
      "en": "May we always enjoy peace and happiness, long life,",
      "en-trans": "tsering nemé pünsum tsok"
    },
    {
      "bo": "རྟག་ཏུ་བདེ་དང་ལྡན་གྱུར་ཅིག།  །།",
      "en": "Good health, prosperity and success!",
      "en-trans": "taktu dé dangden gyur chik"
    }
  ]
}