{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/indian-masters/vajrayudha/praise-to-manjushri",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །དཔལ་ཡེ་ཤེས་ཡོན་ཏན་བཟང་པོ་ཞེས་བྱ་བའི་བསྟོད་པ།",
    "en": "The Praise to Mañjuśrī: Glorious Wisdom’s Excellent Qualities"
  },
  "text": [
    {
      "bo": "བཅོམ་ལྡན་འདས་འཇམ་པའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to the Lord Mañjughoṣa!",
      "en-trans": "chomden dé jampé yang la chaktsal lo"
    },
    {
      "bo": "གང་གི་བློ་གྲོས་སྒྲིབ་གཉིས་སྤྲིན་བྲལ་ཉི་ལྟར་རྣམ་དག་རབ་གསལ་བས། །",
      "en": "Yourwisdomis brilliant and pure like the sun, free from the clouds of the two obscurations.",
      "en-trans": "gang gi lodrö drib nyi trindral nyi tar namdak rabsalwé"
    },
    {
      "bo": "ཇི་སྙེད་དོན་ཀུན་ཇི་བཞིན་གཟིགས་ཕྱིར་ཉིད་ཀྱི་ཐུགས་ཀར་གླེགས་བམ་འཛིན། །",
      "en": "You perceive the whole of reality, exactly as it is, and so hold the book of Transcendental Wisdom at your heart.",
      "en-trans": "jinyé dön kün jizhin zik chir nyi kyi tukkar lekbam dzin"
    },
    {
      "bo": "གང་དག་སྲིད་པའི་བཙོན་རར་མ་རིག་མུན་འཐུམས་སྡུག་བསྔལ་གྱིས་གཟིར་བའི། །",
      "en": "You look upon all beings imprisoned within saṃsāra, enshrouded by the thick darkness of ignorance and tormented by suffering,",
      "en-trans": "gangdak sipé tsönrar marik mün tum dukngal gyi zirwé"
    },
    {
      "bo": "འགྲོ་ཚོགས་ཀུན་ལ་བུ་གཅིག་ལྟར་བརྩེ་ཡན་ལག་དྲུག་བཅུའི་དབྱངས་ལྡན་གསུང༌། །",
      "en": "With the love of a mother for her only child. Your enlightenedspeech, endowed with sixty melodious tones,",
      "en-trans": "dro tsok kün la bu chik tar tsé yenlak drukchü yangden sung"
    },
    {
      "bo": "འབྲུག་ལྟར་ཆེར་སྒྲོགས་ཉོན་མོངས་གཉིད་སློང་ལས་ཀྱི་ལྕགས་སྒྲོགས་འགྲོལ་མཛད་ཅིང༌། །",
      "en": "Like the thundering roar of a dragon, awakens us from the sleep of destructive emotions and frees us from the chains of karma.",
      "en-trans": "druk tar cher drok nyönmong nyi long lé kyi chak drok droldzé ching"
    },
    {
      "bo": "མ་རིག་མུན་སེལ་སྡུག་བསྔལ་མྱུ་གུ་ཇི་སྙེད་གཅོད་མཛད་རལ་གྲི་བསྣམས། །",
      "en": "Dispelling the darkness of ignorance, you wield the sword of wisdom to cut through all our suffering.",
      "en-trans": "marik münsel dukngal nyugu jinyé chödzé raldri nam"
    },
    {
      "bo": "གདོད་ནས་དག་ཅིང་ས་བཅུའི་མཐར་སོན་ཡོན་ཏན་ལུས་རྫོགས་རྒྱལ་སྲས་ཐུ་བོའི་སྐུ། །",
      "en": "Pure from the very beginning, you have reached the end of the ten bhūmis and perfected all enlightened qualities. Foremost of the Buddha’s heirs,",
      "en-trans": "döné dak ching sa chü tar sön yönten lü dzok gyalsé tuwö ku"
    },
    {
      "bo": "བཅུ་ཕྲག་བཅུ་དང་བཅུ་གཉིས་རྒྱན་སྤྲས་བདག་བློའི་མུན་སེལ་འཇམ་པའི་དབྱངས་ལ་འདུད། །",
      "en": "Yourbodyis adorned with the hundred and twelve marks of enlightenment. To Mañjughoṣa, the ‘Gentle-voiced’, I prostrate, and pray: dispel the darkness from my mind!",
      "en-trans": "chu trak chu dang chunyi gyen tré dak lö münsel jampé yang la dü"
    }
  ]
}