{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/mipham/verses-eight-noble-auspicious-ones",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །འཕགས་པ་བཀྲ་ཤིས་བརྒྱད་པའི་ཚིགས་སུ་བཅད་པ།",
    "en": "The Verses of the Eight Noble Auspicious Ones"
  },
  "text": [
    {
      "bo": "ཨོཾ། སྣང་སྲིད་རྣམ་དག་རང་བཞིན་ལྷུན་གྲུབ་པའི། །",
      "en": "Oṃ! Homage to the Buddha, Dharma and Noble Saṅgha—",
      "en-trans": "om, nangsi namdak rangzhin lhündrubpé"
    },
    {
      "bo": "བཀྲ་ཤིས་ཕྱོགས་བཅུའི་ཞིང་ན་བཞུགས་པ་ཡི། །",
      "en": "All that dwell in the auspicious realms of the ten directions,",
      "en-trans": "tashi chok chü zhing na zhukpa yi"
    },
    {
      "bo": "སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་འཕགས་པའི་ཚོགས། །",
      "en": "Where appearance and existence is completely pure, its nature spontaneously perfect,",
      "en-trans": "sangye chö dang gendün pakpé tsok"
    },
    {
      "bo": "ཀུན་ལ་ཕྱག་འཚལ་བདག་ཅག་བཀྲ་ཤིས་ཤོག །",
      "en": "May everything be auspicious for us all!",
      "en-trans": "kün la chaktsal dakchak tashi shok"
    },
    {
      "bo": "སྒྲོན་མེའི་རྒྱལ་པོ་རྩལ་བརྟན་དོན་གྲུབ་དགོངས། །",
      "en": "King of Lamps, Steadfast and Powerful One Whose Vision Fulfils All Aims,",
      "en-trans": "drönmé gyalpo tsalten döndrup gong"
    },
    {
      "bo": "བྱམས་པའི་རྒྱན་དཔལ་དགེ་གྲགས་དཔལ་དམ་པ། །",
      "en": "Glorious Ornament of Love, Sacred Splendour Renowned for Virtue,",
      "en-trans": "jampé gyen pal gedrak paldampa"
    },
    {
      "bo": "ཀུན་ལ་དགོངས་པ་རྒྱ་ཆེར་གྲགས་པ་ཅན། །",
      "en": "The One Whose Concern for All Brings Him Universal Renown,",
      "en-trans": "künla gongpa gyacher drakpa chen"
    },
    {
      "bo": "ལྷུན་པོ་ལྟར་འཕགས་རྩལ་གྲགས་དཔལ་དང་ནི། །",
      "en": "Glorious One as Renowned as Mount Meru in Eminence and Might,",
      "en-trans": "lhünpo tar paktsal drakpal dang ni"
    },
    {
      "bo": "སེམས་ཅན་ཐམས་ཅད་ལ་དགོངས་གྲགས་པའི་དཔལ། །",
      "en": "Glorious One Renowned as Caring for All Sentient Beings,",
      "en-trans": "semchen tamchela gong drakpé pal"
    },
    {
      "bo": "ཡིད་ཚིམ་མཛད་པ་རྩལ་རབ་གྲགས་དཔལ་ཏེ། །",
      "en": "Glorious One Renowned as Most Powerful in Satisfying Wishes—",
      "en-trans": "yitsim dzepa tsal rab drakpal té"
    },
    {
      "bo": "མཚན་ཙམ་ཐོས་པས་བཀྲ་ཤིས་དཔལ་འཕེལ་བ། །",
      "en": "Homage to you, the Eight Sugatas,",
      "en-trans": "tsen tsam töpé tashi pal pelwa"
    },
    {
      "bo": "བདེ་བར་གཤེགས་པ་བརྒྱད་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Merely hearing your names increases auspiciousness and success!",
      "en-trans": "dewar shekpa gyé la chaktsal lo"
    },
    {
      "bo": "འཇམ་དཔལ་གཞོན་ནུ་དཔལ་ལྡན་རྡོ་རྗེ་འཛིན། །",
      "en": "Youthful Mañjuśrī, glorious Vajrapāṇi,",
      "en-trans": "jampal zhönnu palden dorjé dzin"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་དབང་མགོན་པོ་བྱམས་པའི་དཔལ། །",
      "en": "Lord Avalokiteśvara, protector Maitreya,",
      "en-trans": "chenrezik wang gönpo jampé pal"
    },
    {
      "bo": "ས་ཡི་སྙིང་པོ་སྒྲིབ་པ་རྣམ་པར་སེལ། །",
      "en": "Kṣitigarbha, Sarvanīvaraṇaviṣkambhin,",
      "en-trans": "sa yi nyingpo dribpa nampar sel"
    },
    {
      "bo": "ནམ་མཁའི་སྙིང་པོ་འཕགས་མཆོག་ཀུན་ཏུ་བཟང་། །",
      "en": "Ākāśagarbha, and Samantabhadra noblest of all—",
      "en-trans": "namkhé nyingpo pakchok kuntuzang"
    },
    {
      "bo": "ཨུཏྤལ་རྡོ་རྗེ་པད་དཀར་ཀླུ་ཤིང་དང་། །",
      "en": "Utpala ﬂower, vajra, white lotus, nāga-tree,",
      "en-trans": "utpal dorjé pekar lushing dang"
    },
    {
      "bo": "ནོར་བུ་ཟླ་བ་རལ་གྲི་ཉི་མ་ཡི། །",
      "en": "Jewel, moon, sword and sun—",
      "en-trans": "norbu dawa raldri nyima yi"
    },
    {
      "bo": "ཕྱག་མཚན་ལེགས་བསྣམས་བཀྲ་ཤིས་དཔལ་གྱི་མཆོག །",
      "en": "Gracefully holding your emblems, and supreme in granting auspiciousness and success,",
      "en-trans": "chaktsen lek nam tashi pal gyi chok"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Homage to you, the Eight Bodhisattvas!",
      "en-trans": "changchub sempa gyé la chaktsal lo"
    },
    {
      "bo": "རིན་ཆེན་གདུགས་མཆོག་བཀྲ་ཤིས་གསེར་གྱི་ཉ། །",
      "en": "The most precious umbrella, the auspicious golden fishes,",
      "en-trans": "rinchen duk chok tashi ser gyi nya"
    },
    {
      "bo": "འདོད་འབྱུང་བུམ་བཟང་ཡིད་འོང་ཀ་མ་ལ། །",
      "en": "The wish-fulﬁlling vase of goodness, the exquisite kamala flower,",
      "en-trans": "dö jung bum zang yi ong kamala"
    },
    {
      "bo": "སྙན་གྲགས་དུང་དང་ཕུན་ཚོགས་དཔལ་བེའུ། །",
      "en": "The conch of fame and glory, the glorious knot of prosperity,",
      "en-trans": "nyendrak dung dang püntsok pal be'u"
    },
    {
      "bo": "མི་ནུབ་རྒྱལ་མཚན་དབང་བསྒྱུར་འཁོར་ལོ་སྟེ། །",
      "en": "The eternal banner of victory and the all-powerful wheel:",
      "en-trans": "minub gyaltsen wanggyur khorlo té"
    },
    {
      "bo": "རིན་ཆེན་རྟགས་མཆོག་བརྒྱད་ཀྱི་ཕྱག་མཚན་ཅན། །",
      "en": "Holding these eight most precious emblems",
      "en-trans": "rinchen tak chok gyé kyi chaktsen chen"
    },
    {
      "bo": "ཕྱོགས་དུས་རྒྱལ་བ་མཆོད་ཅིང་དགྱེས་བསྐྱེད་མ། །",
      "en": "Are the creators of delight, making offerings to the buddhas of all directions and times.",
      "en-trans": "chok dü gyalwa chö ching gyé kyema"
    },
    {
      "bo": "སྒེག་སོགས་ངོ་བོ་དྲན་པས་དཔལ་སྤེལ་བའི། །",
      "en": "Homage to you, the Eight Auspicious Goddesses—Beauty, Garlands, Song, Dance, Flowers, Incense, Light and Perfume—",
      "en-trans": "gek sok ngowo drenpé pal pelwé"
    },
    {
      "bo": "བཀྲ་ཤིས་ལྷ་མོ་བརྒྱད་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Merely thinking of you makes success grow more and more!",
      "en-trans": "tashi lhamo gyé la chaktsal lo"
    },
    {
      "bo": "ཚངས་པ་ཆེན་པོ་བདེ་འབྱུང་སྲེད་མེད་བུ། །",
      "en": "Mighty Brahmā, Śiva1and Viṣṇu,",
      "en-trans": "tsangpa chenpo dejung semebu"
    },
    {
      "bo": "མིག་སྟོང་ལྡན་དང་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་། །",
      "en": "Indra the thousand-eyed, the kings Dhṛtarāṣṭra,",
      "en-trans": "mik tong den dang gyalpo yulkhor sung"
    },
    {
      "bo": "འཕགས་སྐྱེས་པོ་དང་ཀླུ་དབང་མིག་མི་བཟང་། །",
      "en": "Virūdhaka, Virūpakṣa the lord of nāgas,",
      "en-trans": "pak kyepo dang luwang mikmizang"
    },
    {
      "bo": "རྣམ་ཐོས་སྲས་ཏེ་ལྷ་རྫས་འཁོར་ལོ་དང་། །",
      "en": "And Vaiśravaṇa—each one holding your divine emblem:",
      "en-trans": "namtösé té lhadzé khorlo dang"
    },
    {
      "bo": "ཏྲི་ཤཱུ་ལ་དང་མདུང་ཐུང་རྡོ་རྗེ་ཅན། །",
      "en": "Wheel, trident, lance, vajra,",
      "en-trans": "trishula dang dungtung dorjé chen"
    },
    {
      "bo": "པི་ཝཾ་རལ་གྲི་མཆོད་རྟེན་རྒྱལ་མཚན་འཛིན། །",
      "en": "Vīṇā, sword, stūpa and banner of victory—",
      "en-trans": "piwam raldri chöten gyaltsen dzin"
    },
    {
      "bo": "ས་གསུམ་གནས་སུ་དགེ་ལེགས་བཀྲ་ཤིས་སྤེལ། །",
      "en": "Homage to you, the Eight Guardians of the World,",
      "en-trans": "sa sum né su gelek tashi pel"
    },
    {
      "bo": "འཇིག་རྟེན་སྐྱོང་བ་བརྒྱད་ལ་ཕྱག་འཚལ་ལོ། །",
      "en": "Who make auspiciousness and positivity grow in the three realms!",
      "en-trans": "jikten kyongwa gyé la chaktsal lo"
    },
    {
      "bo": "བདག་ཅག་དེང་འདིར་བྱ་བ་རྩོམ་པ་ལ། །",
      "en": "With all obstacles and harmful influences paciﬁed,",
      "en-trans": "dakchak deng dir jawa tsompa la"
    },
    {
      "bo": "གེགས་དང་ཉེ་བར་འཚེ་བ་ཀུན་ཞི་ནས། །",
      "en": "May the work we are now about to begin",
      "en-trans": "gek dang nyewar tsewa kün zhi né"
    },
    {
      "bo": "འདོད་དོན་དཔལ་འཕེལ་བསམ་དོན་ཡིད་བཞིན་འགྲུབ། །",
      "en": "Meet with ever-growing fulﬁlment and success, and",
      "en-trans": "dödön pal pel samdön yizhin drub"
    },
    {
      "bo": "བཀྲ་ཤིས་བདེ་ལེགས་ཕུན་སུམ་ཚོགས་པར་ཤོག །",
      "en": "Bring good fortune, prosperity, happiness and peace!",
      "en-trans": "tashi delek pünsum tsokpar shok"
    }
  ]
}