{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-jampa-kunga-tendzin",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཁྱབ་བདག་རྡོ་རྗེ་འཆང་བྱམས་པ་ཀུན་དགའ་བསྟན་འཛིན་ལ་གསོལ་བ་འདེབས་པ་བྱིན་རླབས་མྱུར་འཇུག"
  },
  "text": [
    {
      "bo": "ན་མོ་གུ་རུ་ཝེ།"
    },
    {
      "bo": "སྲས་བཅས་རྒྱལ་བ་ཡོངས་ཀྱི་ཡེ་ཤེས་ཀྱི།    །"
    },
    {
      "bo": "སྤྱི་གཟུགས་ཁྱབ་བདག་དཔལ་ལྡན་རྡོ་རྗེ་འཆང་།    །"
    },
    {
      "bo": "སྙིགས་དུས་ངུར་སྨྲིག་འཛིན་པའི་ཁྱུ་མཆོག་ཆེ།    །"
    },
    {
      "bo": "མཁན་ཆེན་ཐམས་ཅད་མཁྱེན་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཕྱི་ལྟར་སོ་སོར་ཐར་པས་རྒྱུད་སྡོམ་ཤིང་།    །"
    },
    {
      "bo": "ནང་དུ་བྱང་ཆུབ་སེམས་གཉིས་ནོར་གྱིས་ཕྱུག  །"
    },
    {
      "bo": "གསང་བ་གྲུབ་པ་ཆེན་པོ་མངོན་དུ་མཛད།    །"
    },
    {
      "bo": "བྱམས༵་ལྡན་འདྲེན་པ༵་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "མཁས་ཀུན༵་དགའ༵་བའི་འཕགས་ནོར་འབྱོར་པ་དང་།    །"
    },
    {
      "bo": "འཆད་རྩོམ་ཟླ་བྲལ་བསྟན༵་འཛིན༵་སློབ་ཚོགས་རྒྱས།    །"
    },
    {
      "bo": "དྲི་མ་མེད་པའི་གཟི་བརྗིད་དང་ལྡན་པ།    །"
    },
    {
      "bo": "ཐུབ་དབང་གཉིས་པའི་ཞབས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཁྱེད་སྐུ་མཐོང་དང་གསུང་གི་ཆ་ཤས་ཀྱིས།    །"
    },
    {
      "bo": "མཐོང་ཐོས་གྲོལ་བ་ཆེན་པོའི་དཔལ་སྟེར་ཞིང་།    །"
    },
    {
      "bo": "ཀུན་དགའི་རིང་ལུགས་ཕྱོགས་བརྒྱར་སྤེལ་བ་ལ།    །"
    },
    {
      "bo": "རྣམ་ཐར་མཚུངས་པ་མེད་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཟག་མེད་ཚུལ་ཁྲིམས་གཞོན་ནུ་རིང་དུ་འཕྲོ།    །"
    },
    {
      "bo": "ཏིང་འཛིན་བདེ་ཆེན་བདུད་རྩིའི་སྟོབས་རྒྱས་ཤིང་།    །"
    },
    {
      "bo": "ཤེས་རབ་ཟབ་མོས་ཆོས་ཀུན་ཇི་བཞིན་གཟིགས།    །"
    },
    {
      "bo": "བསླབ་གསུམ་དབང་ཕྱུག་ཆེན་པོར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "ཕྱི་ནང་གསང་བའི་དེ་ཉིད་བཅུ་དང་ལྡན།    །"
    },
    {
      "bo": "བསྐྱེད་དང་རྫོགས་པའི་རྣལ་འབྱོར་མཐར་ཕྱིན་ཅིང་།    །"
    },
    {
      "bo": "དབང་བཞིའི་ལམ་གྱིས་འགྲོས་བཞི་ཐིམ་པར་ལས།    །"
    },
    {
      "bo": "བཅུ་གསུམ་ས་མཆོག་བརྙེས་ལ་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་སྤྲོ་བསྡུའི་བྱེད་པོ་ནི།    །"
    },
    {
      "bo": "ཁ་སྦྱོར་མཆོག་ཏུ་མི་འགྱུར་བདེ་བ་ཆེ།    །"
    },
    {
      "bo": "སྙིང་རྗེའི་ཡོངས་གང་རང་བཞིན་བརྗོད་བྲལ་ཆེ།    །"
    },
    {
      "bo": "བླ་མ་འཁོར་ལོ་སྡོམ་པར་གསོལ་བ་འདེབས།    །"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་བརླབ་ཀྱིས།    །"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་བླ་མ་མཆོག་དེ་ཡིས།    །"
    },
    {
      "bo": "རྗེས་བཟུང་རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་འགྲུབ།    །"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་ལ་ཕན་བདེའི་དཔལ་སྟེར་ཤོག  །"
    }
  ]
}