{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/thangtong-gyalpo/bhikshu-padma-karpo-prayer-to-avalokiteshvara",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །རྗེ་གྲུབ་ཐོབ་ཆེན་པོ་དགེ་སློང་པདྨ་དཀར་པོ་སྐྱེ་བ་བཞེས་པའི་ཚེ་འཕགས་པ་སྤྱན་རས་གཟིགས་ལ་གསོལ་བ་བཏབ་པའི་རྡོ་རྗེའི་གསུང་བཞུགས་སོ།།",
    "en": "Vajra Speech of the Prayer to Noble Avalokiteśvara from the Great Siddha Thangtong Gyalpo's Life as Bhikṣu Padma Karpo"
  },
  "text": [
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བླ་མ་སྤྱན་རས་གཟིགས། །",
      "en": "To you I pray, guru Avalokiteśvara.",
      "en-trans": "solwa deb so lama chenrezik"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་ཡི་དམ་སྤྱན་རས་གཟིགས། །",
      "en": "To you I pray, yidam Avalokiteśvara.",
      "en-trans": "solwa deb so yidam chenrezik"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་འཕགས་མཆོག་སྤྱན་རས་གཟིགས། །",
      "en": "To you I pray, sublime noble Avalokiteśvara.",
      "en-trans": "solwa deb so pakchok chenrezik"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་སྐྱབས་མགོན་སྤྱན་རས་གཟིགས། །",
      "en": "To you I pray, lord of refuge Avalokiteśvara.",
      "en-trans": "solwa deb so kyab gön chenrezik"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་བྱམས་མགོན་སྤྱན་རས་གཟིགས། །",
      "en": "To you I pray, loving protector Avalokiteśvara.",
      "en-trans": "solwa deb so jam gön chenrezik"
    },
    {
      "bo": "ཐུགས་རྗེས་ཟུངས་ཤིག་རྒྱལ་བ་ཐུགས་རྗེ་ཅན། །",
      "en": "Hold me in your compassion, caring and victorious one.",
      "en-trans": "tukjé zung shik gyalwa tukjé chen"
    },
    {
      "bo": "མཐའ་མེད་འཁོར་བར་གྲངས་མེད་འཁྱམས་གྱུར་ཅིང་། །",
      "en": "For us beings who wander endlessly throughout saṃsāra",
      "en-trans": "tamé khorwar drangmé khyam gyur ching"
    },
    {
      "bo": "བཟོད་མེད་སྡུག་བསྔལ་མྱོང་བའི་འགྲོ་བ་ལ། །",
      "en": "And are subjected to intolerable pain and suffering,",
      "en-trans": "zömé dukngal nyongwé drowa la"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་ལས་སྐྱབས་གཞན་མ་མཆིས་སོ། །",
      "en": "Protector, we have no other refuge but you.",
      "en-trans": "gönpo khyé lé kyab zhen ma chi so"
    },
    {
      "bo": "རྣམ་མཁྱེན་སངས་རྒྱས་ཐོབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Inspire us to attain omniscience and awakening.",
      "en-trans": "namkhyen sangye tobpar jingyi lob"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "ཞེ་སྡང་དབང་གིས་དམྱལ་བར་སྐྱེས་གྱུར་ཏེ། །",
      "en": "Beings who are overcome with hatred take birth in the hells,",
      "en-trans": "zhedang wang gi nyalwar kyé gyur té"
    },
    {
      "bo": "ཚ་གྲང་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །",
      "en": "Where they suffer the torments of intense heat and cold:",
      "en-trans": "tsadrang dukngal nyongwé semchen nam"
    },
    {
      "bo": "ལྷ་མཆོག་ཁྱེད་ཀྱི་དྲུང་དུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in your presence, O supreme of deities!",
      "en-trans": "lha chok khyé kyi drung du kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "སེར་སྣའི་དབང་གིས་ཡི་དྭགས་གནས་སུ་སྐྱེས། །",
      "en": "Beings who are overcome with miserliness take birth in the preta realm,",
      "en-trans": "serné wang gi yidak né su kyé"
    },
    {
      "bo": "བཀྲེས་སྐོམ་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །",
      "en": "Where they suffer the torments of intense hunger and thirst:",
      "en-trans": "trekom dukngal nyongwé semchen nam"
    },
    {
      "bo": "ཞིང་མཆོག་པོ་ཏཱ་ལ་རུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in your supreme Potala pureland!",
      "en-trans": "zhing chok potala ru kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "གཏི་མུག་དབང་གིས་དུད་འགྲོར་སྐྱེས་གྱུར་ཏེ། །",
      "en": "Beings who are overcome with folly take birth as animals,",
      "en-trans": "timuk wang gi düdror kyé gyur té"
    },
    {
      "bo": "གླེན་ལྐུགས་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །",
      "en": "And experience the misery of verbal incapacity and confusion:",
      "en-trans": "lenkuk dukngal nyongwé semchen nam"
    },
    {
      "bo": "མགོན་པོ་ཁྱེད་ཀྱི་དྲུང་དུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in your presence, O protector!",
      "en-trans": "gönpo khyé kyi drung du kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "ཕྲག་དོག་དབང་གིས་ལྷ་མིན་གནས་སུ་སྐྱེས། །",
      "en": "Beings who are overcome with jealousy take birth in the asura realm,",
      "en-trans": "trakdok wang gi lhamin né su kyé"
    },
    {
      "bo": "འཐབ་རྩོད་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །",
      "en": "Where they suffer the torments of conflict and dispute:",
      "en-trans": "tabtsö dukngal nyongwé semchen nam"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in the Potala pureland!",
      "en-trans": "po ta la yi zhing du kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "ང་རྒྱལ་དབང་གིས་ལྷ་ཡིས་གནས་སུ་སྐྱེས། །",
      "en": "Beings who are overcome with pride take birth in the deva realm,",
      "en-trans": "ngagyal wang gi lha yi né su kyé"
    },
    {
      "bo": "འཕོ་ལྟུང་སྡུག་བསྔལ་མྱོང་བའི་སེམས་ཅན་རྣམས། །",
      "en": "Where they suffer the torments of transmigration and fall:",
      "en-trans": "po tung dukngal nyongwé semchen nam"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in the Potala pureland!",
      "en-trans": "po ta la yi zhing du kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "ཐོག་མེད་དུས་ནས་ལས་ངན་བསགས་པའི་མཐུས། །",
      "en": "Through the force of negative karma, accumulated throughout beginningless time,",
      "en-trans": "tokmé dü né lé ngen sakpé tü"
    },
    {
      "bo": "འདོད་ཆགས་དབང་གིས་མི་ཡི་གནས་སུ་སྐྱེས། །",
      "en": "Beings who are overcome with passionate desire take birth in the human realm,",
      "en-trans": "döchak wang gi mi yi né su kyé"
    },
    {
      "bo": "སྐྱེ་རྒ་ན་འཆིའི་སྡུག་བསྔལ་མྱོང་བ་རྣམས། །",
      "en": "Where they suffer the torments of birth, old age, sickness and death:",
      "en-trans": "kyé ga na chi dukngal nyongwa nam"
    },
    {
      "bo": "པོ་ཏཱ་ལ་ཡི་ཞིང་དུ་སྐྱེ་བར་ཤོག །",
      "en": "May they all be reborn in the Potala pureland!1",
      "en-trans": "po ta la yi zhing du kyewar shok"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྂ།"
    },
    {
      "bo": "བདག་ནི་སྐྱེ་ཞིང་སྐྱེ་བ་ཐམས་ཅད་དུ། །",
      "en": "May I, in this and all my future lives,",
      "en-trans": "dak ni kyé zhing kyewa tamché du"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་དང་མཛད་པ་མཚུངས་པ་ཡིས། །",
      "en": "Through activity like that of Avalokiteśvara,",
      "en-trans": "chenrezik dang dzepa tsungpa yi"
    },
    {
      "bo": "མ་དག་ཞིང་གི་འགྲོ་རྣམས་སྒྲོལ་བ་དང་། །",
      "en": "Liberate the beings of impure realms,",
      "en-trans": "ma dak zhing gi dro nam drolwa dang"
    },
    {
      "bo": "གསུང་མཆོག་ཡིག་དྲུག་ཕྱོགས་བཅུར་རྒྱས་པར་ཤོག །",
      "en": "And transmit the supreme speech of the six syllables throughout the ten directions!",
      "en-trans": "sung chok yik druk chok chur gyepar shok"
    },
    {
      "bo": "འཕགས་མཆོག་ཁྱེད་ལ་གསོལ་བ་བཏབ་པའི་མཐུས། །",
      "en": "Through the force of invoking you, the supremely noble,",
      "en-trans": "pakchok khyé la solwa tabpé tü"
    },
    {
      "bo": "བདག་གི་གདུལ་བྱར་གྱུར་པའི་འགྲོ་བ་རྣམས། །",
      "en": "May all those whom I must discipline and guide,",
      "en-trans": "dak gi duljar gyurpé drowa nam"
    },
    {
      "bo": "ལས་འབྲས་ལྷུར་ལེན་དགེ་བའི་ལས་ལ་བརྩོན། །",
      "en": "Take interest in cause and effect, strive to act virtuously,",
      "en-trans": "lé dré lhurlen gewé lé la tsön"
    },
    {
      "bo": "འགྲོ་བའི་དོན་དུ་ཆོས་དང་ལྡན་པ་ཤོག །",
      "en": "And come to possess the qualities that may benefit all.",
      "en-trans": "drowé döndu chö dang denpa shok"
    }
  ]
}