{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/nyoshul-lungtok/prayer-to-avalokiteshvara",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །སྤྱན་རས་གཟིགས་ལ་གསོལ་འདེབས།",
    "en": "Prayer to Avalokiteśvara"
  },
  "text": [
    {
      "bo": "སྐྱབས་གནས་ཀུན་འདུས་ངོ་བོ་བཀའ་དྲིན་ཅན། །",
      "en": "In essence you are the embodiment of all sources of refuge,",
      "en-trans": "kyabné kündü ngowo kadrin chen"
    },
    {
      "bo": "བླ་མ་སྤྱན་རས་གཟིགས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Gracious lama—Avalokiteśvara, to you I pray!",
      "en-trans": "lama chenré zik la solwa dep"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "རྗེ་བཙུན་བླ་མར་བྱིན་གྱིས་རློབས། །",
      "en": "Venerable master, grant your blessings!",
      "en-trans": "jetsün lamar chin gyi lop"
    },
    {
      "bo": "ཐུགས་རྗེ་ཆེན་པོས་བྱིན་གྱིས་རློབས། །",
      "en": "Great compassionate one, grant your blessings!",
      "en-trans": "tukjé chenpö chin gyi lop"
    },
    {
      "bo": "སྤྱན་རས་གཟིགས་ཀྱིས་བྱིན་གྱིས་རློབས། །",
      "en": "Avalokiteśvara, grant your blessings!",
      "en-trans": "chenré zik kyi chin gyi lop"
    },
    {
      "bo": "འགྲོ་བའི་མགོན་པོས་བྱིན་གྱིས་རློབས། །",
      "en": "Protector of beings, grant your blessings!",
      "en-trans": "drowé gönpö chin gyi lop"
    },
    {
      "bo": "འཇིག་རྟེན་དབང་པོས་བྱིན་གྱིས་རློབས། །",
      "en": "Lord of the world, grant your blessings!",
      "en-trans": "jikten wangpö chin gyi lop"
    },
    {
      "bo": "རྒྱལ་སྲས་མཆོག་གིས་བྱིན་གྱིས་རློབས། །",
      "en": "Supreme among Buddha's heirs, grant your blessings!",
      "en-trans": "gyalsé chok gi chin gyi lop"
    },
    {
      "bo": "ཡིད་བཞིན་ནོར་བུས་བྱིན་གྱིས་རློབས། །",
      "en": "Wish-granting jewel, grant your blessings!",
      "en-trans": "yizhin norbü chin gyi lop"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "བདག་སོགས་མ་རྒན་སེམས་ཅན་ཐམས་ཅད། །",
      "en": "For me and all beings, my very own mothers,",
      "en-trans": "dak sok ma gen semchen tamché"
    },
    {
      "bo": "ངན་སེམས་གདུག་རྩུབ་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so malice and savagery may be assuaged!",
      "en-trans": "ngen sem duk tsub zhiwar chin gyi lop"
    },
    {
      "bo": "བསམ་སྦྱོར་དགེ་བར་འགྱུར་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so intentions and actions are made virtuous!",
      "en-trans": "samjor gewar gyurwar chin gyi lop"
    },
    {
      "bo": "ནད་གདོན་བར་ཆད་ཞི་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so illness, harmful influences and obstacles are pacified!",
      "en-trans": "né dön barché zhiwar chin gyi lop"
    },
    {
      "bo": "སྡིག་སྒྲིབ་ཉེས་ལྟུང་དག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so misdeeds, obscurations, faults and downfalls are purified!",
      "en-trans": "dik drip nyé tung dakpar chin gyi lop"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་མཆོག་འབྱོངས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so we may master the supreme mind of bodhicitta!",
      "en-trans": "chang chub sem chok jongpar chin gyi lop"
    },
    {
      "bo": "རྒྱལ་སྲས་སྤྱོད་ལ་འཇུག་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so we may carry out bodhisattva activity!",
      "en-trans": "gyalsé chö la jukpar chin gyi lop"
    },
    {
      "bo": "འབྲེལ་ཚད་དོན་དང་ལྡན་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so all our relationships become meaningful!",
      "en-trans": "dreltsé dön dang denpar chin gyi lop"
    },
    {
      "bo": "བདེ་ཆེན་ཞིང་དུ་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so we may be reborn in the land of perfect bliss!",
      "en-trans": "dechen zhing du kyewar chin gyi lop"
    },
    {
      "bo": "གཞན་དོན་སངས་རྒྱས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །",
      "en": "Grant your blessings, so we may attain buddhahood for others' sake!",
      "en-trans": "zhen dön sangyé drubpar chin gyi lop"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    },
    {
      "bo": "ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ།"
    }
  ]
}