{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/khenchen-ngawang-palzang/nyoshul-lungtok-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ལུང་རྟོགས་བསྟན་པའི་ཉི་མའི་གསོལ་འདེབས།",
    "en": "A Prayer to Lungtok Tenpé Nyima"
  },
  "text": [
    {
      "bo": "ན་མོ་ཀུན་མཁྱེན་བླ་མ་སྒྱུ་འཕྲུལ་རོལ་བའི་གར། །",
      "en": "Namo! All-knowing teacher, dramatic expression of magical illusion;",
      "en-trans": "namo künkhyen lama gyutrul rolwé gar"
    },
    {
      "bo": "ལྔ་བརྒྱའི་འགྲོ་བའི་མགོན་གཅིག་བསྟན་པའི་དཔལ། །",
      "en": "Splendor of the teachings, sole protector of beings in these final five-hundred years;1",
      "en-trans": "ngabgyé drowé gön chik tenpé pal"
    },
    {
      "bo": "གསང་ཆེན་བསྟན་པའི་བདག་པོ་བླ་མ་རྗེ། །",
      "en": "Master of the teachings of the Great Secret, foremost guru;",
      "en-trans": "sang chen tenpé dakpo lama jé"
    },
    {
      "bo": "བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Sun of the Teachings, Tenpé Nyima,2at your feet I humbly pray!",
      "en-trans": "tenpé nyimé zhab la solwa deb"
    },
    {
      "bo": "འོད་གསལ་རྫོགས་པ་ཆེན་པོའི་གསང་ལམ་ནས། །",
      "en": "Through the secret path of luminous Great Perfection,",
      "en-trans": "ösal dzogpachenpö sang lam né"
    },
    {
      "bo": "ཚེ་གཅིག་ཆོས་ཟད་གདོད་མའི་དབྱིངས་སུ་གཤེགས། །",
      "en": "In one life, you reached the primordial expanse of reality's exhaustion.3",
      "en-trans": "tsé chik chö zé dömé ying su shek"
    },
    {
      "bo": "གདོད་མའི་མགོན་དང་ཞལ་མི་གཉིས་པ་ཡི། །",
      "en": "Your face and that of the primordial protector4are one and the same—",
      "en-trans": "dömé gön dang zhal mi nyipa yi"
    },
    {
      "bo": "བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Sun of the Teachings, Tenpé Nyima, at your feet I humbly pray!",
      "en-trans": "tenpé nyimé zhab la solwa deb"
    },
    {
      "bo": "པཎ་ཆེན་དྲི་མེད་བཤེས་གཉེན་འགྲོ་བའི་མགོན། །",
      "en": "Manifestation of the great paṇḍita Vimalamitra, protector of beings;",
      "en-trans": "penchen drimé shenyen drowé gön"
    },
    {
      "bo": "མངོན་སྣང་ཐེག་མཆོག་གསལ་བའི་སྒྲོན་མེ་ཆེ། །",
      "en": "Splendid torch elucidating the Supreme Vehicle;",
      "en-trans": "ngön nang tek chok salwé drönmé ché"
    },
    {
      "bo": "ཐུགས་རྗེ་རླབས་ཆེན་གཞན་དང་མཚུངས་མེད་པའི། །",
      "en": "You whose mighty waves of compassion have never been matched—",
      "en-trans": "tukjé lab chen zhen dang tsungmé pé"
    },
    {
      "bo": "བསྟན་པའི་ཉི་མའི་ཞབས་ལ་གསོལ་བ་འདེབས། །",
      "en": "Sun of the Teachings, Tenpé Nyima, at your feet I humbly pray!",
      "en-trans": "tenpé nyimé zhab la solwa deb"
    },
    {
      "bo": "གསོལ་བ་འདེབས་སོ་དགོངས་པའི་རྩལ་ཆེན་གྱིས། །",
      "en": "Rinpoche, I beg you! Through the magnificent energy of your enlightened intent,",
      "en-trans": "solwa deb so gongpé tsal chen gyi"
    },
    {
      "bo": "བྱིན་བརྒྱུད་བུ་ལ་སྩོལ་ཅིག་རིན་པོ་ཆེ། །",
      "en": "Please grace me, your child, with the transmission of blessings.",
      "en-trans": "jin gyü bu la tsol chik rinpoche"
    },
    {
      "bo": "རྩོལ་མེད་གནས་ལུགས་ལྟ་བའི་རང་ངོ་མཐོང༌། །",
      "en": "Bless me5to see my own true face in the view of the effortless natural condition;6",
      "en-trans": "tsolmé neluk tawé rang ngo tong"
    },
    {
      "bo": "འཛིན་མེད་སྒོམ་པ་གོལ་ས་དབྱིངས་སུ་ཆོད། །",
      "en": "Bless me that deviations from non-grasping meditation resolve in basic space;",
      "en-trans": "dzinmé gompa golsa ying su chö"
    },
    {
      "bo": "ཞེན་མེད་སྤྱོད་པའི་གེགས་འཕྲང་རང་སར་ཞི། །",
      "en": "Bless me that the stumbling blocks to conduct with no fixations fall away in their natural place;7",
      "en-trans": "zhenmé chöpé gek trang rang sar zhi"
    },
    {
      "bo": "གདོད་མའི་གྲུབ་མཐའ་སྙོགས་པར་བྱིན་གྱིས་རློབས། །",
      "en": "And bless me to reach the primordial outlook!8",
      "en-trans": "dömé drubta nyokpar jingyi lob"
    }
  ]
}