{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/sera-khandro/hook-of-compassion",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "དག་སྣང་ལས༔ སྐྱེས་ཕྲེང་གསོལ་འདེབས་ཐུགས་རྗེའི་ལྕགས་ཀྱུ་བཞུགས༔",
    "en": "A Prayer to the Garland of Successive Rebirths"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "བདེ་གཤེགས་སྙིང་པོའི་ངང་མདངས་ཆུ་ཟླའི་གར༔",
      "en": "Radiating from the sugata-essence, like the illusory reflection of the moon in water,",
      "en-trans": "deshek nyingpö ngang dang chudé gar"
    },
    {
      "bo": "སྣ་ཚོགས་ཐབས་ཀྱིས་བསྟན་འགྲོའི་དཔལ་ཤར་བ༔",
      "en": "You arose through various means as a splendour for the teachings and beings.",
      "en-trans": "natsok tab kyi ten drö pal sharwa"
    },
    {
      "bo": "ཐུབ་པའི་སྤྱན་སྔར་དགེ་སློང་ཨུཏྤལ་མ༔",
      "en": "In Śākyamuni's presence, you were the nun Utpali,",
      "en-trans": "tubpé chen ngar gelong utpal ma"
    },
    {
      "bo": "རྡོ་རྗེ་གདན་དུ་རོ་ལངས་བདེ་རོལ་མ༔",
      "en": "At Bodhgayā, the Vajra Seat, you were Rolang Derolma,",
      "en-trans": "dorjé den du rolang dé rol ma"
    },
    {
      "bo": "པདྨས་རྗེས་བཟུང་ཤེལ་དཀར་ཞི་བ་མཚོ༔",
      "en": "Cared for by Padma, you were Shelkar Shiwatso,",
      "en-trans": "pemé jezung shel kar zhiwa tso"
    },
    {
      "bo": "བཻ་རོ་ཙ་ནས་བྱིན་བརླབས་སྨིན་གྲོལ་མཛད༔",
      "en": "Vairotsana granted you blessings, ripening empowerments and liberating instructions.",
      "en-trans": "bairo tsa né jinlab mindrol dzé"
    },
    {
      "bo": "སྒྲོལ་མས་ཞལ་གཟིགས་མཆོག་གི་དངོས་གྲུབ་བརྙེས༔",
      "en": "You saw Tārā face to face and received the supreme attainment.",
      "en-trans": "drolmé zhalzik chok gi ngödrub nyé"
    },
    {
      "bo": "ལི་ཡུལ་བྱང་ཆུབ་ཆོས་སྒྲོན་དཔལ་མོ་དང༔",
      "en": "In Khotan, you were Changchub Chödrön Palmo,",
      "en-trans": "liyul changchub chö drön palmo dang"
    },
    {
      "bo": "སྣེལ་མོ་ཤོད་དུ་ཀུན་དགའ་འབུམ་མ་དང༔",
      "en": "In the Nelmo valley, you were Kunga Buma,",
      "en-trans": "nelmo shö du künga bum ma dang"
    },
    {
      "bo": "གཙང་རོང་ཉེ་ཆར་རྟ་མགྲིན་དབང་མོར་གྲགས༔",
      "en": "In Tsang valley, most recently, you were renowned as Tamdrin Wangmo,1",
      "en-trans": "tsang rong nyechar tamdrin wangmor drak"
    },
    {
      "bo": "བོད་ཡུལ་དབུས་སུ་སུ་ཁ་བཛྲ་རྩལ༔",
      "en": "In Central Tibet you are Sukhavajra Tsal,",
      "en-trans": "böyul ü su sukha benza tsal"
    },
    {
      "bo": "མ་འོངས་མདོངས་ཆུར་བདེ་བའི་འབྱུང་གནས་ཞེས༔",
      "en": "And in future, in Dongchu, you will be Dewé Jungné—",
      "en-trans": "ma ong dong chur dewé jungné zhé"
    },
    {
      "bo": "སྐུ་ཕྲེང་རིམ་པར་བརྒྱུད་པར་གསོལ་བ་འདེབས༔",
      "en": "To you in these, your successive lives, I pray!",
      "en-trans": "ku treng rimpar gyüpar solwa deb"
    },
    {
      "bo": "དེང་ནས་བཟུང་སྟེ་ཇི་སྲིད་བྱང་ཆུབ་བར༔",
      "en": "Inspire me with your blessings, so that from this moment on, until I attain awakening,",
      "en-trans": "deng né zung té jisi changchub bar"
    },
    {
      "bo": "རྗེ་བཙུན་རྣལ་འབྱོར་ཁྱེད་དང་མི་འབྲལ་ཞིང༔",
      "en": "I may never part from you, O noble yoginī,",
      "en-trans": "jetsün naljor khyé dang mindral zhing"
    },
    {
      "bo": "ཟབ་ཆོས་བདུད་རྩིའི་དཔལ་ལ་ལོངས་སྤྱོད་ཅིང༔",
      "en": "And I may enjoy the splendid nectar of your profound teachings,",
      "en-trans": "zab chö dütsi pal la longchö ching"
    },
    {
      "bo": "ས་དང་ལམ་བསྒྲོད་རིམ་པར་མི་ལྟོས་པར༔",
      "en": "Without gradually progressing through the stages and paths,",
      "en-trans": "sa dang lam drö rimpar mi töpar"
    },
    {
      "bo": "འོད་གསལ་རྫོགས་ཆེན་དགོངས་པ་མངོན་གྱུར་ཅིང༔",
      "en": "I may realize the intent of the clear light Great Perfection,",
      "en-trans": "ösal dzogchen gongpa ngöngyur ching"
    },
    {
      "bo": "ཐོད་རྒལ་སྣང་བཞིའི་ཉམས་ལེན་མཐར་ཕྱིན་ནས༔",
      "en": "Perfect the practice of Tögal's four visions,",
      "en-trans": "tögal nang zhi nyamlen tarchin né"
    },
    {
      "bo": "འཇའ་ལུས་ཆོས་སྐུ་འགྲུབ་པར་བྱིན་གྱིས་རློབས༔",
      "en": "And accomplish the rainbow body dharmakāya!",
      "en-trans": "jalü chöku drubpar jingyi lob"
    },
    {
      "bo": "བདག་དང་བདག་ལ་འབྲེལ་ཐོགས་སེམས་ཅན་ཀུན༔",
      "en": "May I and those who are connected to me—all sentient beings—",
      "en-trans": "dak dang dak la drel tok semchen kün"
    },
    {
      "bo": "མི་གནས་ཆོས་སྐུའི་གཏན་སྲིད་ཟིན་པར་ཤོག༔",
      "en": "Seize the stronghold of the non-abiding dharmakāya!",
      "en-trans": "mi né chökü tensi zinpar shok"
    }
  ]
}