{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jigme-lingpa/dzogchen-rinpoche-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །མདོ་ཁམས་རྫོགས་ཆེན་པའི་སྐྱེ་ཕྲེང་གསོལ་འདེབས་བཞུགས།",
    "en": "Prayer to the Garland of Rebirths of the Dzogchenpas of Eastern Tibet"
  },
  "text": [
    {
      "bo": "དུས་གསུམ་སྐྱེ་འགག་མེད་པའི་ཆོས་ཉིད་ཀྱང་། །",
      "en": "Thedharmatānature is beyond arising and ceasing and past, present and future,",
      "en-trans": "dü sum kyé gak mépé chönyi kyang"
    },
    {
      "bo": "སེམས་ཅན་ཁམས་ལ་གཟུགས་སྐུ་རྣམ་གཉིས་སུ། །",
      "en": "Yet still you appear in the two formkāyas1within the realms of sentient beings—",
      "en-trans": "semchen kham la zuk ku nam nyi su"
    },
    {
      "bo": "སྣང་བའི་ངོ་མཚར་བདེ་གཤེགས་གཙུག་ཏོར་ཅན། །",
      "en": "Marvellous buddha Ratnaśikhī,",
      "en-trans": "nangwé ngotsar deshek tsuk tor chen"
    },
    {
      "bo": "མཚན་གྱིས་ངན་སོང་སྒྲོལ་ལ་གསོལ་བ་འདེབས། །",
      "en": "Whose name alone liberates from the lower realms: to you I pray!",
      "en-trans": "tsen gyi ngen song drol la solwa dep"
    },
    {
      "bo": "རྒྱུད་སྡེ་རྒྱ་མཚོའི་མངའ་བདག་ཀུ་ཀུ་རི། །",
      "en": "Kukkurīpāda, master of infinite classes of tantra,",
      "en-trans": "gyü dé gyamtsö ngadak ku ku ri"
    },
    {
      "bo": "འཕོ་ཆེན་རྡོ་རྗེའི་ས་བརྙེས་བི་མ་ལ་། །",
      "en": "Vimalamitra, who achieved the vajra state of great transference,",
      "en-trans": "pochen dorjé sa nyé bi ma la"
    },
    {
      "bo": "སྤྲོས་བྲལ་ཕྱག་རྒྱ་ཆེན་པོ་ས་ར་ཧ། །",
      "en": "And Saraha, who realized the Great Seal beyond conceptual elaboration,",
      "en-trans": "trödral chakgya chen po sa ra ha"
    },
    {
      "bo": "བསྟན་པའི་ཆུ་འགོ་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three fountainheads of the teachings, I pray!",
      "en-trans": "tenpé chu go sum la solwa dep"
    },
    {
      "bo": "ལྷ་སྲིན་བྲན་འཁོལ་རླངས་པ་ཤྲཱི་སེང་། །",
      "en": "Śrī Siṃha, who bound gods and spirits into servitude,",
      "en-trans": "lha sin dren khöl lanpa shiri sing"
    },
    {
      "bo": "འཁྲུལ་སྣང་བྲག་རི་བསྙིལ་བ་དཀོན་མཆོག་འབྱུང་། །",
      "en": "Könchok Jungné,2who destroyed the delusory appearances of rocks and mountains,",
      "en-trans": "trul nang drak ri nyilwa könchok jung"
    },
    {
      "bo": "རྒྱལ་བསྟན་ཉིན་མོར་བྱེད་པ་ཁྲི་རལ་ཞབས། །",
      "en": "And Tri Ralpachen, who caused the buddha’s teachings to shine like the sun,",
      "en-trans": "gyal ten nyinmor chepa tri ral zhap"
    },
    {
      "bo": "བསྟན་པའི་རྩ་ལག་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three allies of the teachings, I pray!",
      "en-trans": "tenpé tsa lak sum la solwa dep"
    },
    {
      "bo": "གཏི་མུག་ལམ་སླང་གྲུབ་མཆོག་ཕག་ཚང་བ། །",
      "en": "Paktsangwa,3who attained realization through bringing ignorance onto the path,",
      "en-trans": "timuk lam lang drup chok paktsang wa"
    },
    {
      "bo": "མི་ལ་བཞད་པའི་སྲས་གྱུར་བྱང་ཆུབ་རྒྱལ། །",
      "en": "Changchub Gyalpo,4who became a heart-son of Mila Shyepe Dorje,",
      "en-trans": "mi la zhépé sé gyur chang chub gyal"
    },
    {
      "bo": "དྲུག་པ་སེང་གེའི་སྒྱུ་འཕྲུལ་དུས་གསུམ་མཁྱེན། །",
      "en": "And Düsum Khyenpa,5illusory manifestation of Senge, the sixth guide,",
      "en-trans": "drukpa sengé gyutrul düsum khyen"
    },
    {
      "bo": "གྲུབ་པ་མཆོག་བརྙེས་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three supremely accomplished ones, I pray!",
      "en-trans": "drubpa chok nyé sum la solwa dep"
    },
    {
      "bo": "རྟོགས་པས་བདག་རྒྱུད་གྲོལ་བ་གླིང་རས་རྗེ། །",
      "en": "Lingjé Répa,6who freed his mind through realization,",
      "en-trans": "tokpé dak gyü drolwa ling ré jé"
    },
    {
      "bo": "བླ་མར་མོས་གུས་མཐར་ཕྱིན་སྟག་ལུང་བ། །",
      "en": "Taklung Thangpa,7who perfected devotion for the guru,",
      "en-trans": "lamar mögü tarchin taklung wa"
    },
    {
      "bo": "བརྟུལ་ཞུགས་གྲུབ་པ་ཨོ་རྒྱན་རང་བྱུང་བ། །",
      "en": "And Orgyen Rangjungpa,8who mastered yogic discipline:",
      "en-trans": "tulzhuk drubpa orgyen rangjung wa"
    },
    {
      "bo": "སྒྲུབ་བརྒྱུད་བསྟན་འཛིན་གསུམ་ལ་གསོལ་བ་འདེབས། །",
      "en": "To these three holders of the teachings from the practice lineage, I pray!",
      "en-trans": "drubgyü tendzin sum la solwa dep"
    },
    {
      "bo": "གཞི་གསུམ་རྩ་བ་བརྟན་པ་བློ་གྲོས་བཟང་། །",
      "en": "Stable in the three foundational practices and with excellent intellect,",
      "en-trans": "zhi sum tsawa tenpa lodrö zang"
    },
    {
      "bo": "རྙིང་བསྟན་མདོ་སྨད་སྤེལ་ལ་སྨོན་ལམ་གྱི། །",
      "en": "You perfected the force of aspirations to spread the Nyingma teachings in Kham,",
      "en-trans": "nying ten do mé pel la mönlam gyi"
    },
    {
      "bo": "མཐུ་གྲུབ་པདྨའི་རིག་པ་འཛིན་པ་དང་། །",
      "en": "Pema Rigdzin,9holder of awareness in Padma’s line,",
      "en-trans": "tu drup pemé rigpa dzinpa dang"
    },
    {
      "bo": "འགྱུར་མེད་ཐེག་མཆོག་ཅེས་ལ་གསོལ་བ་འདེབས། །",
      "en": "And Gyurme Thekchok Tendzin Pal Zangpo,10to you I pray!",
      "en-trans": "gyurmé tekchok ché la solwa dep"
    },
    {
      "bo": "སྔ་འགྱུར་བསྟན་པའི་རྩ་བ་མདོ་སྒྱུ་སེམས། །",
      "en": "And Ngedön Tendzin Zangpo,11who established traditions",
      "en-trans": "ngagyur tenpé tsawa do gyu sem"
    },
    {
      "bo": "ཡང་ཕུར་སངས་རྒྱས་མཉམ་པར་སྦྱོར་ལ་སོགས། །",
      "en": "Of great accomplishment-practices for the Kama traditions,",
      "en-trans": "yang pur sangyé nyampar jor la sok"
    },
    {
      "bo": "བཀའ་མའི་སྒྲུབ་ཆེན་ཕྲིན་ལས་སྲོལ་བཏོད་པའི། །",
      "en": "Such as the fundamental teachings of the Early Translations: the Sūtra, Illusory Web and Mind,12",
      "en-trans": "kamé drupchen trinlé söl töpé"
    },
    {
      "bo": "ངེས་དོན་བསྟན་འཛིན་བཟང་པོར་གསོལ་བ་འདེབས། །",
      "en": "And Yangphur (Viśuddha and Vajrakīlaya) and Sangye Nyamjor—to you, I pray!",
      "en-trans": "ngédön tendzin zangpor solwa dep"
    },
    {
      "bo": "ངེས་འབྱུང་རྒྱུད་བརླན་བྱང་ཆུབ་སེམས་གཉིས་ཀྱི། །",
      "en": "Inspire us with your blessings, so that we may prepare our minds with renunciation,",
      "en-trans": "ngé jung gyü len chang chub sem nyi kyi"
    },
    {
      "bo": "ཤིང་རྟས་དྲངས་པའི་སྨིན་གྲོལ་ལམ་མཆོག་ལ། །",
      "en": "And then, drawn along on the chariot of twofold bodhicitta,",
      "en-trans": "shingté dranpé min drol lam chok la"
    },
    {
      "bo": "རྟག་ཏུ་བསྟེན་གོམས་བགྱིས་པའི་དངོས་གྲུབ་ཀུན། །",
      "en": "Realize, in this very lifetime, all the accomplishments born of stable familiarity",
      "en-trans": "taktu tengom gyipé ngödrup kun"
    },
    {
      "bo": "ཚེ་འདི་ཉིད་ལ་མཐོང་བར་བྱིན་གྱིས་རློབས། །",
      "en": "With the supreme path of ripening and liberation!",
      "en-trans": "tsé di nyi la tongwar chin gyi lop"
    }
  ]
}