{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/shabkar/garland-of-rebirths-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཞབས་དཀར་བའི་སྐྱེ་རབས་ཉུང་འདུས་བཞུགས་སོ།།",
    "en": "Short Prayer to Shabkar’s Various Incarnations"
  },
  "text": [
    {
      "bo": "བསྐལ་པ་དཔག་ཏུ་མེད་པའི་སྔོན་རོལ་ནས། །",
      "en": "Countless aeons ago,",
      "en-trans": "kalpa pak tu mepé ngön rol né"
    },
    {
      "bo": "མྱུར་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སྟེ། །",
      "en": "You swiftly attained perfect enlightenment,",
      "en-trans": "nyurdu ngönpar dzokpar sangye té"
    },
    {
      "bo": "རྒྱལ་བའི་བསྟན་དང་འགྲོ་ལ་ཕན་པའི་ཕྱིར། །",
      "en": "And in order to benefit beings and the Victorious One’s teachings,",
      "en-trans": "gyalwé ten dang dro la penpé chir"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་སྐུར་བསྟན་འགྲོ་དོན་མཛད། །",
      "en": "Manifested in various forms, as appropriate, for beings’ sake.",
      "en-trans": "gang la gang dul kur ten dro dön dzé"
    },
    {
      "bo": "སངས་རྒྱས་དུས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས། །",
      "en": "At the time of the Buddha you were Ārya Avalokiteśvara,",
      "en-trans": "sangye dü su pakpa chenrezik"
    },
    {
      "bo": "རྒྱ་གར་ཡུལ་དུ་འཇམ་དཔལ་བཤེས་གཉེན་མཆོག །",
      "en": "In the land of India you were the sublime Mañjuśrīmitra,",
      "en-trans": "gyagar yul du jampal shenyen chok"
    },
    {
      "bo": "བོད་ཡུལ་དབུས་སུ་དྲན་པ་ནམ་མཁར་གྱུར། །",
      "en": "In the heart of Tibet you were Drenpa Namkha,1",
      "en-trans": "böyul ü su drenpa namkhar gyur"
    },
    {
      "bo": "བཀའ་བརྒྱུད་བསྟན་ལ་མི་ལ་རས་པ་དངོས། །",
      "en": "In the Kagyü tradition you were Milarepa himself,",
      "en-trans": "kagyü ten la mi la repa ngö"
    },
    {
      "bo": "བཀའ་གདམས་དུས་སུ་རྒྱལ་སྲས་ཐོགས་མེད་དཔལ། །",
      "en": "During the Kadam era you were the glorious Gyalse Tokme,2",
      "en-trans": "kadam dü su gyalsé tokmé pal"
    },
    {
      "bo": "དགའ་ལྡན་བསྟན་ལ་བློ་གྲོས་རྒྱལ་མཚན་རྗེ། །",
      "en": "In the Ganden tradition you were the noble Lodrö Gyaltsen,3",
      "en-trans": "ganden ten la lodrö gyaltsen jé"
    },
    {
      "bo": "རིས་མེད་འགྲོ་ངོར་ཐང་སྟོང་རྒྱལ་པོར་སྤྲུལ། །",
      "en": "For followers of nonsectarianism, you manifested as Thangtong Gyalpo.",
      "en-trans": "rimé dro ngor tangtong gyalpor trul"
    },
    {
      "bo": "ད་ལྟའི་དུས་འདིར་འགྲོ་མགོན་ཞབས་དཀར་བ། །",
      "en": "Now, at the present time, you are Shabkar, protector of beings.",
      "en-trans": "danté dü dir dro gön zhab karwa"
    },
    {
      "bo": "མ་འོངས་མངོན་དགའ་ལ་སོགས་རིགས་ལྔ་ཡི། །",
      "en": "In future, in Abhirati and other pure-lands of the five families,",
      "en-trans": "ma ong ngönga lasok rik nga yi"
    },
    {
      "bo": "ཞིང་དུ་རིགས་ཀྱི་བདག་པོ་དེ་བདག་གི །",
      "en": "You will appear as the foremost heir",
      "en-trans": "zhing du rik kyi dakpo dé dak gi"
    },
    {
      "bo": "དྲུང་དུ་སྲས་ཀྱི་ཐུ་བོ་རེ་རེར་གྱུར། །",
      "en": "Of each of the lords of buddha families,",
      "en-trans": "drung du sé kyi tuwo rerer gyur"
    },
    {
      "bo": "འབྲེལ་ཚད་གང་འདོད་ཞིང་དུ་འདྲེན་པར་འགྱུར། །",
      "en": "And lead anyone with a connection to their chosen realm.",
      "en-trans": "dreltsé gang dö zhing du drenpar gyur"
    },
    {
      "bo": "འདས་དང་མ་འོངས་ད་ལྟ་དུས་གསུམ་དུ། །",
      "en": "Throughout the three times of past, present and future,",
      "en-trans": "dé dang ma ong tanda dü sum du"
    },
    {
      "bo": "གང་ལ་གང་འདུལ་སྣ་ཚོགས་སྐུར་བསྟན་ནས། །",
      "en": "You display various forms according to what is needed.",
      "en-trans": "gang la gang dul natsok kur ten né"
    },
    {
      "bo": "བསྟན་དང་འགྲོ་དོན་མཛད་པའི་ཐུགས་རྗེ་ཅན། །",
      "en": "Compassionate one, who serves the teachings and beings,",
      "en-trans": "ten dang dro dön dzepé tukjé chen"
    },
    {
      "bo": "སྐྱབས་མགོན་ཡིད་བཞིན་ནོར་བུ་ལ་གསོལ་བ་དེབས། །",
      "en": "Lord of refuge, wish-fulfilling jewel, to you I pray.",
      "en-trans": "kyab gön yizhin norbu la solwa deb"
    },
    {
      "bo": "ཕྱོགས་བཅུའི་ཞིང་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་རུ། །",
      "en": "A wish-granting jewel is hard to find even when sought",
      "en-trans": "chok chü zhingkham jewa trak gya ru"
    },
    {
      "bo": "བསྐལ་པ་རྒྱ་མཚོར་བཙལ་ཀྱང་རྙེད་དཀའ་ཞིང་། །",
      "en": "Through oceans of aeons in billions of realms of the ten directions,",
      "en-trans": "kalpa gyatsor tsal kyang nyé ka zhing"
    },
    {
      "bo": "རྙེད་པ་དོན་ཆེན་ཡིད་བཞིན་ནོར་བུ་ལས། །",
      "en": "And its discovery is an event of vast significance.",
      "en-trans": "nyepa dön chen yizhin norbu lé"
    },
    {
      "bo": "ལྷག་པའི་བླ་མ་མཇལ་བ་སྐལ་པ་བཟང་། །",
      "en": "Yet to meet the guru is even greater still, the most excellent fortune!",
      "en-trans": "lhakpé lama jalwa kalpa zang"
    },
    {
      "bo": "བདག་ནི་དེང་ནས་ཚེ་རབས་ཐམས་ཅད་དུ། །",
      "en": "From now on, throughout all my lives to come,",
      "en-trans": "dak ni deng né tserab tamché du"
    },
    {
      "bo": "མགོན་པོ་ཁྱོད་དང་ནམ་ཡང་མི་འབྲལ་ཞིང་། །",
      "en": "May I never be separated from you, O protector,",
      "en-trans": "gönpo khyö dang namyang mindral zhing"
    },
    {
      "bo": "གསུང་གི་བདུད་རྩིས་བདག་རྒྱུད་སྨིན་གྲོལ་ནས། །",
      "en": "May the nectar of your speech mature and liberate my mind,",
      "en-trans": "sung gi dütsi dak gyü mindrol né"
    },
    {
      "bo": "རང་གཞན་དོན་གཉིས་ལྷུན་གྱིས་གྲུབ་པར་ཤོག །",
      "en": "And may the twofold benefit of self and other be spontaneously accomplished.",
      "en-trans": "rangzhen dön nyi lhün gyi drubpar shok"
    }
  ]
}