{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jamyang-khyentse-chokyi-lodro/treasury-of-blessings-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གངས་ཅན་ལྗོངས་འདིར་བཀའ་དྲིན་ཆེ་བའི་བླ་མ་རྣམས་རྗེས་སུ་དྲན་པའི་གསོལ་འདེབས་བྱིན་བརླབ་གཏེར་མཛོད་ཅེས་བྱ་བ་བཞུགས།"
  },
  "text": [
    {
      "bo": "རབ་འབྱམས་ཕྱོགས་བཅུའི་རྒྱལ་དང་དེ་སྲས་ཚོགས། །"
    },
    {
      "bo": "དགྲ་བཅོམ་གཏད་རབས་གནས་བརྟན་ཆེ་རྣམས་དང་། །"
    },
    {
      "bo": "འཛམ་གླིང་རྒྱན་དྲུག་རྨད་བྱུང་སློབ་དཔོན་སོགས། །"
    },
    {
      "bo": "འཕགས་ཡུལ་པཎ་གྲུབ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྩ་གསུམ་རྒྱ་མཚོའི་ངོ་བོ་པདྨ་འབྱུང་། །"
    },
    {
      "bo": "བྱང་ཆུབ་སེམས་དཔའ་མཁན་ཆེན་ཞི་བ་འཚོ། །"
    },
    {
      "bo": "གངས་ཅན་བཀའ་དྲིན་མཉམ་མེད་ཁྲི་སྲོང་རྗེ། །"
    },
    {
      "bo": "བསྟན་པའི་སྲོལ་འབྱེད་གསུམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བི་མ་ཐོན་མི་སྲོང་བཙན་བཻ་རོ་དང་། །"
    },
    {
      "bo": "རྨ་གཉགས་ཀ་ཅོག་རྒྱལ་སྲས་མཆོག་གྲུབ་རྒྱལ། །"
    },
    {
      "bo": "མཚོ་རྒྱལ་ནམ་སྙིང་ལ་སོགས་རྗེ་འབངས་ལ། །"
    },
    {
      "bo": "བཀའ་དྲིན་དྲན་པའི་ངང་ནས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མངའ་བདག་ཁྲི་རལ་དཔལ་ལྡན་མར་མེ་མཛད། །"
    },
    {
      "bo": "རིན་བཟང་ཡེ་ཤེས་འོད་དང་འབྲོམ་སྟོན་པ། །"
    },
    {
      "bo": "དགོངས་པ་རབ་གསལ་ཀླུ་མེས་ནག་ཚོ་དང་། །"
    },
    {
      "bo": "རྔོག་ལོ་ཆེན་པོའི་ཞབས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འབྲོག་མི་ཁུག་ལྷས་བརྩེ་ཆེན་ཀུན་དགའ་སྙིང་། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བློ་གྲོས་ཁྱུང་པོ་རྣལ་འབྱོར་དང་། །"
    },
    {
      "bo": "སྨྲི་ཏི་ཛྙཱ་ན་ཤཱཀྱ་ཤྲཱི་རི་སོགས། །"
    },
    {
      "bo": "བསྟན་པའི་མངའ་བདག་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སོ་ཟུར་གནུབ་ཉང་དམ་གཙང་བྱམས་གསུམ་དང་། །"
    },
    {
      "bo": "སངས་རྒྱས་བླ་མ་ཆོས་དབང་རྒོད་ལྡེམ་རྗེ། །"
    },
    {
      "bo": "གླིང་པ་ནུས་ལྡན་ལ་སོགས་གཏེར་བརྒྱུད་ཚོགས། །"
    },
    {
      "bo": "བཀའ་གཏེར་རིག་འཛིན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མི་ལ་རས་དང་རས་ཆུང་རྡོ་རྗེ་གྲགས། །"
    },
    {
      "bo": "གྲགས་པ་རྒྱལ་མཚན་རྒྱལ་བ་ཡང་དགོན་པ། །"
    },
    {
      "bo": "རྒོད་ཚང་པ་དང་བརྩོན་འགྲུས་བཟང་པོ་སོགས། །"
    },
    {
      "bo": "གྲུབ་པའི་དབང་ཕྱུག་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དྲི་མེད་འོད་ཟེར་བུ་སྟོན་རིན་ཆེན་གྲུབ། །"
    },
    {
      "bo": "ཆོས་རྗེ་དོལ་པོ་བླ་མ་དམ་པ་དང་། །"
    },
    {
      "bo": "རྒྱལ་སྲས་ཐོགས་མེད་ཀུན་དགའ་བཟང་པོ་སོགས། །"
    },
    {
      "bo": "ཟླ་བྲལ་བསྟན་འཛིན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་ཀྱི་བཟང་པོ་ས་སྐྱ་པཎྜི་ཏ། །"
    },
    {
      "bo": "ཀུན་མཁྱེན་གཡག་སྟོན་ཤེས་བྱ་ཀུན་རིག་དང་། །"
    },
    {
      "bo": "གཞོན་ནུ་བློ་གྲོས་བློ་བཟང་གྲགས་པ་སོགས། །"
    },
    {
      "bo": "རིག་པའི་འབྱུང་གནས་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཆོས་རྒྱལ་འཕགས་དང་བྱང་སེམས་ཀརྨ་པ། །"
    },
    {
      "bo": "ཕག་གྲུ་ཞང་དང་བློ་བཟང་རྒྱ་མཚོ་སོགས། །"
    },
    {
      "bo": "གངས་ཅན་བསྟན་འགྲོའི་བདེ་སྐྱིད་སྤེལ་མཛད་པའི། །"
    },
    {
      "bo": "སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འགོས་ལོ་གཞོན་ནུ་དཔལ་ལྡན་པདྨ་དབང་། །"
    },
    {
      "bo": "བློ་གསལ་རྒྱ་མཚོ་འཇམ་མགོན་གནས་གསར་བ། །"
    },
    {
      "bo": "མཁྱེན་བརྩེའི་དབང་པོ་བློ་གྲོས་མཐའ་ཡས་སོགས། །"
    },
    {
      "bo": "རིས་མེད་བསྟན་འཛིན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ལྟར་མི་ཕྱེད་གུས་པས་གསོལ་བཏབ་མཐུས། །"
    },
    {
      "bo": "དམ་པ་རྣམས་ཀྱིས་བྱིན་བརླབ་འཇུག་པ་དང་། །"
    },
    {
      "bo": "བདག་གཞན་འགྲོ་བའི་སྒྲིབ་གཉིས་ཀུན་བྱང་ནས། །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་གི་གོ་འཕང་མྱུར་ཐོབ་ཤོག །"
    },
    {
      "bo": "བསྟན་འཛིན་མཆོག་རྣམས་ཞབས་པད་བསྐལ་བརྒྱར་བརྟན། །"
    },
    {
      "bo": "བཤད་དང་སྒྲུབ་པའི་བསྟན་པ་ས་སྟེང་ཁྱབ། །"
    },
    {
      "bo": "སྐལ་བཟང་རྫོགས་ལྡན་གསར་པའི་དགའ་སྟོན་ཆེ། །"
    },
    {
      "bo": "ནུབ་མེད་ཡུན་རིང་རྟག་ཏུ་འཆར་གྱུར་ཅིག །"
    }
  ]
}