{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-tri-songdetsen",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཆོས་རྒྱལ་ཁྲི་སྲོང་ལ་གསོལ་བ་འདེབས་པ་ལྷ་ཡི་རྔ་ཆེན་ཞེས་བྱ་བ་བཞུགས།",
    "en": "A Prayer to the Dharma King Tri Songdetsen"
  },
  "text": [
    {
      "bo": "ཨོཾ་སྭ་སྟི།",
      "en": "Oṃ svasti!",
      "en-trans": "om svasti"
    },
    {
      "bo": "བཀྲ་ཤིས་ཀུན་གྱི་ནང་ནས་མཆོག་གྱུར་པ།    །",
      "en": "Through the drum of the renowned Three Jewels,",
      "en-trans": "tashi kün gyi nang né chokgyur pa"
    },
    {
      "bo": "རིན་ཆེན་གསུམ་ཞེས་གྲགས་པའི་རྔ་སྒྲ་དེས།    །",
      "en": "The most perfectly sublime among all that is auspicious,",
      "en-trans": "rinchen sum zhé drakpé ngadra dé"
    },
    {
      "bo": "ཕྱོགས་དུས་ཀུན་ཏུ་བདེ་དགས་ཁྱབ་པ་དང་།    །",
      "en": "Let joy and well-being reign throughout the whole of space and time,",
      "en-trans": "chok dü küntu dé gé khyabpa dang"
    },
    {
      "bo": "དགེ་ལེགས་ཨུ་དུམ་ཝ་རས་ཤིས་གྱུར་ཅིག  །",
      "en": "And theuḍumbaraof virtue and excellence herald bounteous fortune!",
      "en-trans": "gelek udum waré shi gyur chik"
    },
    {
      "bo": "ཤཱཀྱའི་རིགས་མཆོག་ཆོས་རྒྱལ་ལྷ་ཡི་སྲས།    །",
      "en": "Divine heir to the dharma kings of the supreme Śākya line,",
      "en-trans": "shakyé rik chok chögyal lha yi sé"
    },
    {
      "bo": "ཐེག་ཆེན་རིགས་སད་འཇམ་དཔལ་གཞོན་ནུའི་སྐུ།    །",
      "en": "Youthful Mañjuśrī in whom an affinity for Mahāyāna was awakened,",
      "en-trans": "tekchen rik sé jampal zhönnü ku"
    },
    {
      "bo": "སླར་ཡང་བོད་ཡུལ་བསྟན་འགྲོའི་མགོན་དུ་བྱོན།    །",
      "en": "You who came to the land of Tibet as a guardian of the teachings and beings,",
      "en-trans": "lar yang böyul ten drö gön du jön"
    },
    {
      "bo": "ཁྲི་སྲོང་ལྡེའུ་བཙན་ཞབས་ལ་གསོལ་བ་འདེབས།    །",
      "en": "Tri Songdeutsen, at your feet I pray.",
      "en-trans": "trisong detsen zhab la solwa deb"
    },
    {
      "bo": "དཀའ་བ་དུ་མས་ལོ་པཎ་སྤྱན་དྲངས་ཤིང་།    །",
      "en": "With great difficulty and hardship, you invited translators and scholars,",
      "en-trans": "kawa dumé lo pen chendrang shing"
    },
    {
      "bo": "གཙུག་ལག་བཞེངས་ནས་བསྟན་པའི་གཞི་མ་བཙུགས།    །",
      "en": "Supervised the construction of a temple and established a basis for the teachings.",
      "en-trans": "tsuklak zheng né tenpé zhima tsuk"
    },
    {
      "bo": "དགེ་བཅུའི་ཁྲིམས་བཅས་མདོ་སྔགས་དམ་ཆོས་བསྒྱུར།    །",
      "en": "You fostered the ten virtues and arranged for the translation of sūtra and mantra—",
      "en-trans": "gé chü trim ché do ngak damchö gyur"
    },
    {
      "bo": "ཚངས་པ་ལྷ་ཡི་མེ་ཏོག་གསོལ་བ་འདེབས།    །",
      "en": "Tsangpa Lhayi Metok, to you I pray.1",
      "en-trans": "tsangpa lha yi metok solwa deb"
    },
    {
      "bo": "བོད་ཡུལ་མུན་པའི་གླིང་འདི་དཀར་པོར་བསྒྱུར།    །",
      "en": "You transformed the land of Tibet from an island of darkness to a beacon of light,",
      "en-trans": "böyul münpé ling di karpor gyur"
    },
    {
      "bo": "ཁྱད་པར་གུ་རུ་པདྨ་འབྱུང་གནས་ལས།    །",
      "en": "And received from Guru Padmasambhava in particular",
      "en-trans": "khyepar guru pema jungné lé"
    },
    {
      "bo": "བཀའ་བརྒྱད་ལ་སོགས་གསང་སྔགས་རྒྱ་མཚོ་བརྙེས།    །",
      "en": "A vast ocean of Secret Mantra, including the Eight Commands—2",
      "en-trans": "kagyé lasok sang ngak gyatso nyé"
    },
    {
      "bo": "སྣང་སྲིད་དབང་བསྒྱུར་ཆེན་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Great prevailer over appearance and existence, to you I pray.",
      "en-trans": "nangsi wanggyur chenpor solwa deb"
    },
    {
      "bo": "མཁྱེན་རབ་འཇམ་དཔལ་དབྱངས་དང་གཉིས་སུ་མེད།    །",
      "en": "In your perfect wisdom, you are indivisible from Mañjughoṣa,",
      "en-trans": "khyenrab jampal yang dang nyisumé"
    },
    {
      "bo": "བརྩེ་ཆེན་འཕགས་མཆོག་ཕྱག་ན་པདྨོ་དངོས།    །",
      "en": "In your great love, you are none other than noble Padmapāṇi,",
      "en-trans": "tsé chen pakchok chak na pemo ngö"
    },
    {
      "bo": "མཐུ་སྟོབས་གསང་བདག་རྡོ་རྗེ་འཛིན་པ་ཆེ།    །",
      "en": "And in your power, you are the mighty vajra-wielding Lord of Secrets—",
      "en-trans": "tutob sangdak dorjé dzinpa ché"
    },
    {
      "bo": "རིགས་གསུམ་སྤྲུལ་པའི་རྒྱལ་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Sovereign manifestation of the three buddha families, to you I pray.",
      "en-trans": "rik sum trulpé gyalpor solwa deb"
    },
    {
      "bo": "གང་གིས་གསང་གསུམ་བྱིན་གྱིས་བརླབས་པའི་སྲས།    །",
      "en": "Your heirs, infused with the blessings of your three secrets,",
      "en-trans": "gang gi sang sum jin gyi labpé sé"
    },
    {
      "bo": "ཆོས་རྒྱལ་རིམ་བྱོན་རྣམ་འཕྲུལ་ལྔ་ཕྲག་སོགས།    །",
      "en": "Including the five successive emanations of the Dharma king,",
      "en-trans": "chögyal rim jön namtrul nga trak sok"
    },
    {
      "bo": "མཐའ་དབུས་ཀུན་ཏུ་བྱོན་དང་འབྱོན་འགྱུར་རྣམས།    །",
      "en": "Have appeared and will continue to appear throughout the land—",
      "en-trans": "ta ü küntu jön dang jön gyur nam"
    },
    {
      "bo": "སྤྲོ་དང་བསྡུ་བའི་བྱེད་པོར་གསོལ་བ་འདེབས།    །",
      "en": "Master of emanation and absorption, to you I pray.",
      "en-trans": "tro dang duwé jepor solwa deb"
    },
    {
      "bo": "ད་ལྟ་ཆེས་ཆེར་སྙིགས་མའི་དུས་འདིར་ཡང་།    །",
      "en": "Even now, during these increasingly degenerate times,",
      "en-trans": "danta ché cher nyikmé dü dir yang"
    },
    {
      "bo": "བསྟན་པ་རིན་ཆེན་གནས་པ་ཁྱོད་ཀྱི་དྲིན།    །",
      "en": "The fact that the teachings endure is due to your kindness.",
      "en-trans": "tenpa rinchen nepa khyö kyi drin"
    },
    {
      "bo": "ངེས་པ་ཉིད་ལས་གཞན་དུ་མི་སེམས་པའི།    །",
      "en": "Without ever losing sight of this and with firm conviction,",
      "en-trans": "ngepa nyi lé zhendu mi sempé"
    },
    {
      "bo": "ཡིད་ཆེས་དད་པས་གསོལ་བ་སྙིང་ནས་འདེབས།    །",
      "en": "I pray to you, confidently and from the depths of my heart.",
      "en-trans": "yiché depé solwa nying né deb"
    },
    {
      "bo": "ཐུགས་རྗེ་ཆེན་པོའི་རྩལ་ཤུགས་རབ་སྤྲུགས་ནས།    །",
      "en": "May I incite the strength of your great compassion",
      "en-trans": "tukjé chenpö tsalshuk rab truk né"
    },
    {
      "bo": "ནག་ཕྱོགས་བདུད་ཀྱི་སྡེ་ཚོགས་འདུལ་བ་དང་།    །",
      "en": "So as to overcome the dark forces of Māra’s legions,",
      "en-trans": "nakchok dü kyi dé tsok dulwa dang"
    },
    {
      "bo": "མཁན་སློབ་ཆོས་རྒྱལ་གསུམ་གྱི་ཐུགས་བསྐྱེད་རྣམས།    །",
      "en": "And may I and others swiftly fulfil the noble aspirations",
      "en-trans": "khen lob chögyal sum gyi tukkyé nam"
    },
    {
      "bo": "བདག་སོགས་འགྲོ་བས་མྱུར་དུ་འགྲུབ་པར་ཤོག  །",
      "en": "Formed by the abbot, the master and you, the Dharma king!",
      "en-trans": "dak sok drowé nyurdu drubpar shok"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་འཇམ་དབྱངས་ཆོས་རྒྱལ་གྱིས།    །",
      "en": "May all be auspicious so that throughout the course of all my lives,",
      "en-trans": "kyewa küntu jamyang chögyal gyi"
    },
    {
      "bo": "རྗེས་བཟུང་མཁྱེན་ནུས་བརྩེ་བར་དབང་འབྱོར་ཞིང་།    །",
      "en": "I may be cared for by you, the Mañjughoṣa Dharmarāja,",
      "en-trans": "jezung khyen nü tsewar wangjor zhing"
    },
    {
      "bo": "དོན་གཉིས་ལྷུན་གྲུབ་མཐར་ཐུག་ཁྱེད་ཉིད་དང་།    །",
      "en": "Acquire your wisdom, capacity and love, spontaneously accomplish my own and others’ aims,",
      "en-trans": "dön nyi lhündrub tartuk khyé nyi dang"
    },
    {
      "bo": "དབྱེར་མེད་མངོན་བྱང་ཆུབ་པའི་བཀྲ་ཤིས་ཤོག།  །།",
      "en": "And ultimately attain awakening inseparably from you!",
      "en-trans": "yermé ngönjang chubpé tashi shok"
    }
  ]
}