{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/tibetan-masters/gyarong-khandro/vajrakilaya-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཕུར་པའི་གསོལ་འདེབས་དངོས་གྲུབ་ཆར་འབེབས་བཞུགས་སོ༔",
    "en": "A Vajrakīlaya Prayer"
  },
  "text": [
    {
      "bo": "ཨེ་མ་ཧོ༔",
      "en": "Emaho!",
      "en-trans": "emaho"
    },
    {
      "bo": "ཆོས་དབྱིངས་བདེ་བ་ཆེན་པོའི་ཕོ་བྲང་ནས༔",
      "en": "Out of the dharmadhātu palace of great bliss,",
      "en-trans": "chöying dewa chenpö podrang né"
    },
    {
      "bo": "ཆོས་སྐུ་ཀུན་བཟང་ཡབ་ཡུམ་ལ་གསོལ་བ་འདེབས༔",
      "en": "The dharmakāya Samantabhadra and consort, to I pray:",
      "en-trans": "chöku kunzang yabyum la solwa deb"
    },
    {
      "bo": "གདོད་མའི་གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས༔",
      "en": "Grant your blessings so I may realise the primordial nature!",
      "en-trans": "dömé neluk tokpar jingyi lob"
    },
    {
      "bo": "ངེས་པ་ལྔ་ལྡན་ལོངས་སྐུའི་ཞིང་ཁམས་ནས༔",
      "en": "Out of the sambhogakāya realm of the five certainties,",
      "en-trans": "ngepa ngaden longkü zhingkham né"
    },
    {
      "bo": "ལོངས་སྐུ་དགའ་རབ་རྡོ་རྗེ་ལ་གསོལ་བ་འདེབས༔",
      "en": "The sambhogakāya Garab Dorje, to you I pray:",
      "en-trans": "longku garab dorjé la solwa deb"
    },
    {
      "bo": "འོད་གསལ་རྒྱུན་ཆད་མེད་པར་བྱིང་གྱིས་རློབས༔",
      "en": "Grant your blessings so that clear light is uninterrupted!",
      "en-trans": "ösal gyünché mepar jing gyi lob"
    },
    {
      "bo": "རྔ་ཡབ་ཟངས་མདོག་དཔལ་རིའི་ཕོ་བྲང་ནས༔",
      "en": "Out of the glorious Copper-Coloured Mountain of Chāmara,",
      "en-trans": "ngayab zangdok palri podrang né"
    },
    {
      "bo": "སྤྲུལ་སྐུ་པདྨ་འབྱུང་གནས་ལ་གསོལ་བ་འདེབས༔",
      "en": "The nirmāṇakāya Padmākara, to you I pray:",
      "en-trans": "tulku pema jungné la solwa deb"
    },
    {
      "bo": "འཆི་མེད་ཚེ་དབང་ཐོབ་པར་བྱིང་གྱིས་རློབས༔",
      "en": "Grant your blessings so I may be empowered with immortal life!",
      "en-trans": "chimé tsewang tobpar jing gyi lob"
    },
    {
      "bo": "གྲུ་གསུམ་མཐིང་ནག་འབར་བའི་གཞལ་ཡས་ནས༔",
      "en": "Out of the blazing palace of the dark blue triangle,",
      "en-trans": "drusum tingnak barwé zhalyé né"
    },
    {
      "bo": "ཁྲོ་མཆོག་རྡོ་རྗེ་གཞོན་ནུ་ལ་གསོལ་བ་འདེབས༔",
      "en": "The supreme wrathful one, Vajrakumāra, to you I pray:",
      "en-trans": "tro chok dorjé zhönnu la solwa deb"
    },
    {
      "bo": "བསྟན་དགྲ་དམ་སྲིས་འདུལ་བར་བྱིན་གྱིས་རློབས༔",
      "en": "Grant your blessings so I may subduedamsidemons and enemies of the teachings!",
      "en-trans": "ten dra damsi dulwar jingyi lob"
    },
    {
      "bo": "སྐུ་བཞི་ཡེ་ཤེས་ཆེན་པོའི་ཀློང་ཡངས་ནས༔",
      "en": "Out of the vast expanse of great four kāya wisdom,",
      "en-trans": "ku zhi yeshe chenpö long yang né"
    },
    {
      "bo": "སྲས་མཆོག་རིགས་བཞིའི་ཚོགས་ལ་གསོལ་བ་འདེབས༔",
      "en": "The supreme sons of the four families, to you I pray:",
      "en-trans": "sé chok rik zhi tsok la solwa deb"
    },
    {
      "bo": "ཕྲིན་ལས་ཐོགས་མེད་འགྲུབ་པར་བྱིང་གྱིས་རློབས༔",
      "en": "Grant your blessings so I may accomplish enlightened action without hindrance!",
      "en-trans": "trinlé tokmé drubpar jing gyi lob"
    },
    {
      "bo": "དུར་ཁྲོད་རྩུབ་འགྱུར་ཞིང་བཅུའི་གདན་སྟེང་དུ༔",
      "en": "In the Pāruṣika charnel ground upon the ten fit for liberating,",
      "en-trans": "durtrö tsub gyur zhing chü den tengdu"
    },
    {
      "bo": "རང་བྱུང་ཁྲོ་བོ་བཅུ་ལ་གསོལ་བ་འདེབས༔",
      "en": "The ten self-arisen wrathful ones, to you I pray:",
      "en-trans": "rangjung trowo chu la solwa deb"
    },
    {
      "bo": "འགྲོ་དོན་ཐོགས་མེད་འབྱུང་བར་བྱིན་གྱིས་རློབས༔",
      "en": "Grant your blessings so that beings welfare may come about without hindrance!",
      "en-trans": "dro dön tokmé jungwar jingyi lob"
    },
    {
      "bo": "རི་རྒྱལ་རྩེ་མོའི་གནས་མཆོག་དམ་པ་ནས༔",
      "en": "From the supreme sacred place at the peak of the king of mountains,",
      "en-trans": "ri gyantsé mö né chok dampa né"
    },
    {
      "bo": "བྱ་ཁྱུང་ཁྲོ་བོའི་རྒྱལ་པོ་ལ་གསོལ་བ་འདེབས༔",
      "en": "Garuḍa, the king of the wrathful, to you I pray:",
      "en-trans": "jakhyung trowö gyalpo la solwa deb"
    },
    {
      "bo": "སྡེ་བརྒྱད་ཟིལ་གྱིས་གནོན་པར་བྱིན་གྱིས་རློབས༔",
      "en": "Grant your blessings so that the eight classes may be overcome!",
      "en-trans": "dé gyé zil gyi nönpar jingyi lob"
    },
    {
      "bo": "གྲུ་གསུམ་ཁྲག་ཞག་འཁྲུགས་པའི་གཞལ་ཡས་ནས༔",
      "en": "From the palace of the triangle of swirling blood and fat,",
      "en-trans": "drusum trak zhak trukpé zhalyé né"
    },
    {
      "bo": "གཏེར་སྲུང་མ་གཟའ་དམ་གསུམ་ལ་གསོལ་བ་འདེབས༔",
      "en": "Terma guardians, Ekajāṭī, Rāhula and Damchen, to you I pray:",
      "en-trans": "tersung ma za dam sum la solwa deb"
    },
    {
      "bo": "ཕྱི་ནང་བར་ཆད་ཞི་བར་བྱིན་གྱིས་རློབས༔",
      "en": "Grant your blessings so that outer and inner obstacles may be pacified!",
      "en-trans": "chi nang barché zhiwar jingyi lob"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་བྱིན་རླབས་ཀྱིས༔",
      "en": "Through the blessings of praying in this way,",
      "en-trans": "detar solwa tabpé jinlab kyi"
    },
    {
      "bo": "འཇིག་རྟེན་འཁོར་བའི་བྱ་བ་རབ་སྤངས་ནས༔",
      "en": "May I utterly renounce all worldly, samsaric action,",
      "en-trans": "jikten khorwé jawa rab pang né"
    },
    {
      "bo": "གསང་གསུམ་རྣམ་དག་བསླུ་མེད་ལམ་ཞུགས་ཏེ༔",
      "en": "Set out upon the pure, undeceiving path of the three secrets,",
      "en-trans": "sang sum namdak lumé lam zhuk té"
    },
    {
      "bo": "མཐར་ཐུག་རྡོ་རྗེའི་གསང་བ་མཆོག་ཐོབ་ཤོག༔",
      "en": "And obtain the supreme, ultimate vajra secret!",
      "en-trans": "tartuk dorjé sangwa chok tob shok"
    }
  ]
}