{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jedrung-jampa-jungne/streams-of-sapphire-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གྲུབ་ཆེན་བརྒྱད་ཅུ་རྩ་བཞིའི་གསོལ་འདེབས་བཻཌཱུརྱའི་རྒྱུད་མང་ཞེས་བྱ་བ།"
  },
  "text": [
    {
      "bo": "དཔལ་རྡོ་རྗེ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ལོ། །"
    },
    {
      "bo": "བརྟན་གཡོའི་དངོས་པོ་ཀུན་ལ་ཁྱབ་པའི་བདག །"
    },
    {
      "bo": "རྣམ་ཀུན་མཆོག་ལྡན་ཟུང་འཇུག་བདེ་བ་ཆེ། །"
    },
    {
      "bo": "ཁྱབ་བདག་རྡོ་རྗེ་འཆང་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་པའི་གོ་འཕང་བརྙེས་པའི་རིག་པ་འཛིན། །"
    },
    {
      "bo": "ཞིང་རྡུལ་རྒྱ་མཚོའི་གྲངས་དང་མཉམ་པ་ལ། །"
    },
    {
      "bo": "སོ་སྐྱེ་བློ་ཡི་མཚོན་པར་ནུས་མིན་ཀྱང་། །"
    },
    {
      "bo": "དཀྱིལ་འཁོར་འཁོར་ལོའི་ཚོགས་ཀྱི་འདུ་བ་རུ། །"
    },
    {
      "bo": "གཤེགས་པའི་རྣལ་འབྱོར་དབང་ཕྱུག་བརྒྱད་ཅུའི་བཞིའི། །"
    },
    {
      "bo": "རྣམ་ཐར་དྲན་པའི་སྒོ་ནས་གུས་ཕྱག་འཚལ། །"
    },
    {
      "bo": "རྟོག་མེད་ཉ་ཤས་འཚོ་བའི་ལུ་ཡི་པ། །"
    },
    {
      "bo": "དྲན་པ་གཅིག་པར་ཡོངས་གྲུབ་ལ་ཝ་པ། །"
    },
    {
      "bo": "བརྟུལ་ཞུགས་གྲུབ་པའི་མངའ་བདག་བི་རུ་པ།"
    },
    {
      "bo": "རང་བྱུང་རྡོ་རྗེའི་སྐུ་གྱུར་ཌ་་པ། །"
    },
    {
      "bo": "རྣམ་རྟོག་རི་དགས་བསད་པའི་ཤ་བ་རི། །"
    },
    {
      "bo": "མཁའ་སྤྱོད་དབང་པོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཆོག་གི་དངོས་གྲུབ་བརྙེས་པ་ས་ར་ཧ། །"
    },
    {
      "bo": "རྡོ་རྗེ་བདག་མེད་མངོན་གྱུར་ཀཾ་ཀ་ལི། །"
    },
    {
      "bo": "ཐུན་མོང་གྲུབ་པ་མཆོག་བརྙེས་གོ་ར་ཥ། །"
    },
    {
      "bo": "འཆི་མེད་དངོས་གྲུབ་བརྙེས་པའི་རྩེ་རིང་ག །"
    },
    {
      "bo": "པི་ཝཾ་སྒྲ་ལས་དོན་རྟོགས་ཝི་ན་པ། །"
    },
    {
      "bo": "གྲུབ་བརྙེས་གཙོ་བོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཆོག་གི་དངོས་གྲུབ་བརྙེས་པའི་ཤནྟི་པ། །"
    },
    {
      "bo": "བཅུ་དྲུག་གཞོན་ནུའི་ལུས་འཆང་ཏན་དད་པ། །"
    },
    {
      "bo": "ལྷུན་གྲུབ་ཆོས་སྐུའི་དོན་རྟོགས་ཙ་མ་རི། །"
    },
    {
      "bo": "ཡེ་ཤེས་རལ་གྲིའི་བདག་ཉིད་ཁཌྒ་བ། །"
    },
    {
      "bo": "རྒྱལ་བས་ལུང་བསྟན་འཕགས་པ་ཀླུ་སྒྲུབ་ཞབས། །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་དབང་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་པའི་གཙོ་བོ་ནག་པོ་སྤྱོད་པའི་ཞབས། །"
    },
    {
      "bo": "མཁས་ཤིང་གྲུབ་པའི་གཙོ་བོ་འཕགས་པ་ལྷ། །"
    },
    {
      "bo": "སྐྱེ་འགགས་མེད་པར་རྟོགས་པའི་ཐ་ག་པ། །"
    },
    {
      "bo": "བཀའ་བ་སྤྱད་པས་མཆོག་བརྙེས་ན་རོ་པ། །"
    },
    {
      "bo": "རང་གྲོལ་འཇིགས་པ་མེད་པའི་ཤ་ལི་པ། །"
    },
    {
      "bo": "སྤྱོད་འཆང་དབང་པོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཁོར་ལོ་སྡོམ་པ་དཔལ་ལྡན་ཏེ་ལོ་པ། །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་དཔལ་ལྡན་ཙ་ཏྲ་པ། །"
    },
    {
      "bo": "སྟོང་ཉིད་དོན་རྟོགས་རྣལ་འབྱོར་སྦ་ཏྲའི་ཞབས། །"
    },
    {
      "bo": "ལྷ་སྔགས་ཆོས་གསུམ་དབྱེར་མེད་དྷུ་ཁན་དྷི། །"
    },
    {
      "bo": "སྟེང་སྒོའི་ལམ་ལས་མཆོག་བརྙེན་ཨ་ཛོ་ཀི། །"
    },
    {
      "bo": "རྣལ་འབྱོར་དབང་ཕྱུག་རྣམ་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ངེས་དོན་རྟོགས་པས་མྱོས་པའི་ཀ་པ་ལ། །"
    },
    {
      "bo": "མ་དག་དྲི་མ་འཁྲུད་པའི་ཌོམྦི་པ། །"
    },
    {
      "bo": "འདོད་ཡོན་ཞེན་པ་བྲལ་བའི་ཀཾ་ཀ་ན། །"
    },
    {
      "bo": "སྣང་སྲིད་སྒྱུ་མར་རྟོགས་པའི་ཀཾ་པ་ལ། །"
    },
    {
      "bo": "བདེ་མཆོག་འཁོར་ལོའི་རང་བཞིན་དེངས་ཀ་པ། །"
    },
    {
      "bo": "གྲུབ་པའི་དབང་པོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱག་རྒྱ་ཆེན་པོའི་མཆོག་བརྙེས་ཤནྟི་པ། །"
    },
    {
      "bo": "སྣང་སྲིད་བདེ་ཆེན་མེད་རྟོགས་པའི་ཤིན་པ། །"
    },
    {
      "bo": "དངོས་གྲུབ་མཆོག་བརྙེས་དཔལ་ལྡན་ཀུ་ཀུ་རི། །"
    },
    {
      "bo": "གསང་བ་འདུས་པའི་བདག་ཉིད་ཀུ་ཅི་པ། །"
    },
    {
      "bo": "དུ་མ་ར་ཅིག་རྟོགས་པའི་དྷ་མ་པ། །"
    },
    {
      "bo": "ཧེ་རུ་ཀ་པ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཟུང་འཛིན་ཡུལ་མེད་རྟོགས་པའི་མ་ཧི་ལ། །"
    },
    {
      "bo": "མི་ཟད་འདོད་རྒུའི་གཏེར་འཆང་ཨ་ཙིན་ཏ། །"
    },
    {
      "bo": "བྱང་སེམས་བདུད་བརྩི་རང་བཞིན་བ་བྷ་ཧི། །"
    },
    {
      "bo": "མ་དག་འཁྲུད་པའི་དྲི་སྦྱངས་ན་ལི་ན། །"
    },
    {
      "bo": "མཁས་པའི་གཙུག་རྒྱན་དཔལ་ལྡན་ཞི་བ་ལྷ། །"
    },
    {
      "bo": "འཁོར་ལོས་བསྒྱུར་བ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་པའི་གཙོ་བོ་ཨན་བྷཱུཏྟིའི་ཞབས། །"
    },
    {
      "bo": "གནས་ལུགས་འགྱུར་མེད་དོན་རྟོགས་མེ་ཀོ་པ། །"
    },
    {
      "bo": "བདེ་ཆེན་གཉུག་མའི་ལམ་བགྲོད་ཀོ་ཏ་ལི། །"
    },
    {
      "bo": "ཨ་བ་དྷུ་ཏི་ཀཾ་པ་རི་པའི་ཞབས། །"
    },
    {
      "bo": "ཟུང་འཇུག་གྲུབ་བརྙེས་ཛ་ལེན་དྷ་རའི་མཚན། །"
    },
    {
      "bo": "འཁོར་ལོས་དབང་ཕྱུག་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རླུང་སེམས་དབུ་མར་ཚུད་པའི་ར་ཧུ་ལ། །"
    },
    {
      "bo": "རྟོགས་པའི་ཡེ་ཤེས་མངོན་གྱུར་དྷ་མ་པ། །"
    },
    {
      "bo": "དབྱིངས་རིག་དབྱེར་མེད་གུ་རུ་དྷེ་ཀ་རི། །"
    },
    {
      "bo": "སྐུ་གཉིས་འབྲས་བཟང་སྨིན་པའི་མི་དྷི་ནི། །"
    },
    {
      "bo": "འཕགས་པས་རྗེས་བཟུང་གུ་རུ་ལངྐ་ཛ། །"
    },
    {
      "bo": "རྡོ་རྗེའི་འཛིན་པ་རྣམས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གྲུབ་པའི་མཆོག་བརྙེས་དཔལ་ལྡན་དྲིལ་བུ་པ། །"
    },
    {
      "bo": "དགྱེས་པ་རྡོ་རྗེ་གུ་རུ་ཛོ་ཀི་པ། །"
    },
    {
      "bo": "ཕྱག་རྒྱ་ཆེན་པོའི་མཆོག་བརྙེས་ཙུ་ལུ་ཀི། །"
    },
    {
      "bo": "གྲགས་སྟོང་དབྱེར་མེད་རྟོགས་པའི་གོ་ཏི་པ། །"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་ལས་མཆོག་བརྙེས་ལི་ཙི་ཀ །"
    },
    {
      "bo": "གྲུབ་པའི་ཁྱུ་མཆོག་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འོད་གསལ་གྲོང་འཇུག་རྟོགས་པའི་ན་གུ་ཎ། །"
    },
    {
      "bo": "གཟུངས་འཛིན་དགྲ་བཅོམ་ཛ་ཡཱ་ནནྟའི་ཞབས། །"
    },
    {
      "bo": "སྟོང་ཉིད་དབྱེར་མེད་དོན་རྟོགས་པ་ཙ་རི། །"
    },
    {
      "bo": "བདེ་ཆེན་འབྲས་བུ་མངོན་གྱུར་ཙམ་པ་ཀ །"
    },
    {
      "bo": "ཟུང་འཇུག་གོ་འཕང་བརྙེས་པའི་བྷི་ཀྵ་ན། །"
    },
    {
      "bo": "གྲུབ་མཆོག་དབང་པོ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟག་མེད་བདེ་བས་གང་བའི་མེ་བྷི་ལི། །"
    },
    {
      "bo": "འཁྲུལ་པའི་དྲི་དག་གུ་རུ་ཀུ་མ་རི། །"
    },
    {
      "bo": "བདེ་ཆེན་རྡོ་རྗེའི་བཅུད་ལེན་ཙ་རི་པ། །"
    },
    {
      "bo": "འདུས་བྱས་དོན་རྟོགས་མ་ཎི་བྷ་དྲའི་ཞབས། །"
    },
    {
      "bo": "སྤྲོས་མེད་བརྡ་ཡི་རང་གཟུགས་ལི་ཁ་ལི། །"
    },
    {
      "bo": "རྡོ་རྗེ་འཆང་དབང་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དབྱིངས་རིག་ཟུང་འཇུག་ཀ་ན་ཁ་ལའི་ཞབས། །"
    },
    {
      "bo": "ཡུལ་སྣང་རང་གྲོལ་ཀ་ལ་ཀ་ལའི་མཚན། །"
    },
    {
      "bo": "ཆོས་རྣམས་བདེན་མེད་རྟོགས་པའི་ཀན་ལི། །"
    },
    {
      "bo": "སྣང་སེམས་དབྱེར་མེད་ཕྱེད་པའི་དྷ་ཧུ་ལི། །"
    },
    {
      "bo": "གསང་བ་འདུས་པའི་མཆོག་གྲུབ་ཨུ་དྷི་ལི། །"
    },
    {
      "bo": "གྲུབ་བརྙེས་རྒྱལ་བ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དགྱེས་པ་ཆེན་པོའི་དཔལ་ལྡན་ཀ་པ་ལ། །"
    },
    {
      "bo": "རྟོག་པ་རང་སར་གྲོལ་བའི་ཀི་ར་བ། །"
    },
    {
      "bo": "མཚོ་སྐྱེས་དབང་པོ་གུ་རུ་ས་ཀ་ར། །"
    },
    {
      "bo": "སྣང་སྟོང་ཟུང་འཇུག་སརྦ་བྷ་ཀའི་ཞབས། །"
    },
    {
      "bo": "མངོན་ཞེན་རང་གྲོལ་ན་ག་བྷོ་དྷིའི་མཚན། །"
    },
    {
      "bo": "མཆོག་གི་སློབ་དཔོན་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དངོས་གྲུབ་མཆོག་བརྙེས་དྷ་རི་ཀ་པའི་ཞབས། །"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་གོམས་གུ་རུ་པུ་ཏ་ལི། །"
    },
    {
      "bo": "མཐོང་སྤངས་དྲི་དག་དཔལ་ལྡན་ས་ན་ཧ། །"
    },
    {
      "bo": "རང་གྲོལ་རྣལ་འབྱོར་ཤིན་ཏུ་ཀོ་ཀི་ལི། །"
    },
    {
      "bo": "ཚོགས་དྲུག་རང་གྲོལ་གུ་རུ་མ་ནི་ག །"
    },
    {
      "bo": "ཟུང་འཇུག་གྲུབ་པ་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རྡོ་རྗེའི་བཙུན་མོ་ལ་ཀླུ་མ་ཀ་ར། །"
    },
    {
      "bo": "དགའ་བཞིའི་དོན་རྟོགས་གུ་རུ་ས་མུ་ད། །"
    },
    {
      "bo": "བདེ་ཆེན་རྡོ་རྗེའི་བཅུད་ལེན་བྱ་ལི་པ། །"
    },
    {
      "bo": "མཁའ་སྤྱོད་དབང་ཕྱུག་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དེ་ལྟར་གསོལ་བ་བཏབ་པའི་མཐུ་བྱིན་གྱི། །"
    },
    {
      "bo": "སྐྱེ་བ་ཀུན་ཏུ་གྲུབ་བརྙེས་རིག་པ་འཛིན། །"
    },
    {
      "bo": "རྡོ་རྗེ་བཙུན་མོར་བཅས་པས་རྗེས་བཟུང་ནས། །"
    },
    {
      "bo": "རིམ་གཉིས་ལམ་ལས་མཆོག་གི་དངོས་གྲུབ་ནི། །"
    },
    {
      "bo": "དཀའ་བ་མེད་པར་ཚེ་འདིར་འགྲུབ་གྱུར་ཅིག །"
    }
  ]
}