{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/jigme-lingpa/jowo-rinpoche-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །ཇོ་བོ་རིན་པོ་ཆེར་གསོལ་འདེབས་སྨོན་ལམ་དང་འབྲེལ་བར་དབང་བཞི་ལེན་ཚུལ་བཞུགས།"
  },
  "text": [
    {
      "bo": "རྒྱལ་བ་ཐུབ་དབང་ཉིན་བྱེད་ནི། །"
    },
    {
      "bo": "མི་མཇེད་ཞིང་གི་སྒྲོན་མ་སྟེ། །"
    },
    {
      "bo": "སྤྲུལ་པས་འཛམ་བུའི་གླིང་འདུལ་བ། །"
    },
    {
      "bo": "གང་ལ་སྙིང་ནས་སྐྱབས་སུ་མཆི། །"
    },
    {
      "bo": "ཁྱོད་སྐུ་རིག་གྲོལ་ཉིས་ལྡན་ཏེ། །"
    },
    {
      "bo": "གསུང་ནི་འགོག་ལམ་བདེན་གཉིས་ཆོས། །"
    },
    {
      "bo": "ཐུགས་ནི་བླ་མ་ཆོས་སྐུའི་ཞལ། །"
    },
    {
      "bo": "དཀྱིལ་འཁོར་རྒྱ་མཚོའི་བདག་ཉིད་ལ། །"
    },
    {
      "bo": "རྣམ་དག་བདུན་དང་ཆབ་གཅིག་ཏུ། །"
    },
    {
      "bo": "ལུས་དང་ལོངས་སྤྱོད་ལྟོས་མེད་འབུལ། །"
    },
    {
      "bo": "ལས་ཀྱིས་གཞན་དབང་ཅི་མཐོང་ཡང་། །"
    },
    {
      "bo": "ཁྱེད་ཤེས་དམ་བཅའ་བརྟན་པོ་འཛིན། །"
    },
    {
      "bo": "ཁྱོད་ཞལ་མཐོང་བའི་མོས་ཉིད་ལ། །"
    },
    {
      "bo": "མོས་གུས་བཟོད་གླག་མེད་པ་དེ། །"
    },
    {
      "bo": "བུམ་པའི་དབང་གི་ངོ་བོ་ཉིད། །"
    },
    {
      "bo": "ལུས་སྒྲིབ་དག་ནས་སྐུ་རྡོ་རྗེ། །"
    },
    {
      "bo": "ད་ལྟ་ཉིད་དུ་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཁྱོད་གསུང་སྒྲ་ཚིག་རང་ཚན་ལས། །"
    },
    {
      "bo": "འདས་པ་གསང་བ་དམ་པའི་དབང་། །"
    },
    {
      "bo": "བདག་གི་ངག་ལ་ཞུགས་པའི་མོད། །"
    },
    {
      "bo": "གསུང་གི་རྡོ་རྗེའི་དངོས་གྲུབ་སྩོལ། །"
    },
    {
      "bo": "ཐུགས་ནི་ཟབ་ཞི་སྤྲོས་དང་བྲལ། །"
    },
    {
      "bo": "བདེ་ཆེན་བྱང་ཆུབ་ཤེས་རབ་དབང་། །"
    },
    {
      "bo": "བདག་གི་རྣམ་ཤེས་ཚོགས་བརྒྱད་ལ། །"
    },
    {
      "bo": "འདྲེས་ནས་ཐུགས་ཀྱི་རྡོར་རྗེར་སྩོལ། །"
    },
    {
      "bo": "རྒྱལ་བའི་མཛོད་སྤུ་ལས་སྐྱེས་པའི། །"
    },
    {
      "bo": "འོད་ཟེར་ཆེན་པོའི་དབང་མཆོག་གིས། །"
    },
    {
      "bo": "ཤེས་བྱའི་སྒྲིབ་པ་རབ་སྤངས་ནས། །"
    },
    {
      "bo": "ཀུན་ཏུ་འོད་ཀྱི་ས་ནོན་ཤོག །"
    },
    {
      "bo": "བདག་ལ་སྨོད་དམ་གཤེ་ཡང་རུང་། །"
    },
    {
      "bo": "སེམས་ཅན་ཕ་མའི་རང་བཞིན་ལ། །"
    },
    {
      "bo": "བྱས་པ་གཟོ་བའི་སྙིང་རྗེ་ཡིས། །"
    },
    {
      "bo": "འཁོར་བ་དོང་ནས་སྤྲུག་པར་ཤོག །"
    }
  ]
}