{
  "source": "lotsawahouse",
  "source_url": "https://www.lotsawahouse.org/bo/tibetan-masters/longchen-rabjam/constant-flow-nectar-prayer",
  "copyright": "https://creativecommons.org/licenses/by-nc/4.0/",
  "title": {
    "bo": "༄༅། །གསོལ་འདེབས་བདུད་རྩིའི་ཆུ་རྒྱུན་བཞུགས།"
  },
  "text": [
    {
      "bo": "ཨོཾ་ཨཱཿཧཱུྃ།"
    },
    {
      "bo": "བྱིན་རླབས་བདུད་རྩིའི་སྤྲིན་འཁྲིགས་ཤིང༌། །"
    },
    {
      "bo": "དངོས་གྲུབ་རྒྱ་མཚོའི་ཆར་འབེབས་པའི། །"
    },
    {
      "bo": "བླ་མ་ཀུན་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཅི་བསམ་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་བཞིན་གདོད་མའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "སྐུ་དང་ཡེ་ཤེས་འདུ་འབྲལ་མེད། །"
    },
    {
      "bo": "ཀུན་བཟང་ཡབ་ཡུམ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞི་ཐོག་གྲོལ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བདེ་ཆེན་འོག་མིན་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "རིགས་ལྔ་བདེ་གཤེགས་རྡོ་རྗེ་འཆང༌། །"
    },
    {
      "bo": "རྡོ་རྗེ་སེམས་དཔར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ལྷུན་གྲུབ་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མེ་རི་འབར་བའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཐབས་མཁས་ཐུགས་རྗེའི་སྤྲིན་ཚོགས་ཅན། །"
    },
    {
      "bo": "དགའ་རབ་རྡོ་རྗེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རིག་འཛིན་ཐོབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྩུབ་འགྱུར་ཚལ་གྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཡེ་ཤེས་ལྔ་ལྡན་འགྲོ་བའི་ཡབ། །"
    },
    {
      "bo": "ཤྲཱི་སིངྷ་ར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གནས་ལུགས་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སོ་ས་གླིང་གི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "མཆོག་དང་ཐུན་མོང་དངོས་གྲུབ་བརྙེས། །"
    },
    {
      "bo": "པདྨ་ཐོད་ཕྲེང་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "སྐུ་གསུམ་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཨོ་རྒྱན་ཡུལ་གྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "མཁའ་འགྲོ་དཔག་མེད་ཀུན་གྱི་གཙོ། །"
    },
    {
      "bo": "ཡེ་ཤེས་མཚོ་རྒྱལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བདག་རྒྱུད་གྲོལ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་བྱུང་ཡེ་ཤེས་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "སྙིང་པོའི་དོན་རྟོགས་བྱིན་རླབས་ལྡན། །"
    },
    {
      "bo": "དྲི་མེད་འོད་ཟེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཇའ་ལུས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཆོས་སྡིངས་དཔལ་གྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཐེག་མཆོག་ཆོས་འཁོར་ཀུན་གྱི་བདག །"
    },
    {
      "bo": "ཆོས་ཀྱི་གྲགས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཞན་དོན་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གྲོག་རི་ཨོ་རྒྱན་ཡང་དབེན་དུ། །"
    },
    {
      "bo": "བསླབ་གསུམ་ནོར་བུའི་རྒྱལ་མཚན་འཛིན། །"
    },
    {
      "bo": "ཉི་མ་འོད་ཟེར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "དགོས་འདོད་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དཀར་པོ་ཆོས་ལུང་དགོན་པ་རུ། །"
    },
    {
      "bo": "རྡོ་རྗེ་སྙིང་པོའི་དངོས་གྲུབ་བརྙེས། །"
    },
    {
      "bo": "ཀུན་དགའ་རྒྱལ་མཚན་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟབ་ལམ་མཐར་ཕྱིན་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཀུན་བཟང་གླིང་གི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཟབ་དོན་རྒྱ་མཚོའི་བསྟན་པ་འཛིན། །"
    },
    {
      "bo": "ཆོས་དབྱིངས་གྲགས་པར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཐམས་ཅད་མཁྱེན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྤྱི་གཙུག་ཉི་ཟླའི་གདན་སྟེང་དུ། །"
    },
    {
      "bo": "སྨིན་གྲོལ་མཆོག་གི་དངོས་གྲུབ་བརྙེས། །"
    },
    {
      "bo": "རྩ་བའི་བླ་མར་གསོལ་བ་འདེབས། ། །"
    },
    {
      "bo": "སྐུ་ལྔ་ལྷུན་གྲུབ་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཁྲ་མོ་བྲག་གི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཚེ་གཅིག་སངས་རྒྱས་འགྲུབ་པའི་མཆོག །"
    },
    {
      "bo": "མཁའ་འགྲོ་སྙིང་ཏིག་གསོལ་བ་འདེབས། ། །"
    },
    {
      "bo": "ལྷག་མེད་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལས་ཅན་འདུ་བའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "མཐུ་སྟོབས་རྫུ་འཕྲུལ་ཐོགས་པ་མེད། །"
    },
    {
      "bo": "གཏེར་སྲུང་རྣམས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བར་ཆད་ཞི་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གར་བཞུགས་ཆོས་ཀྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "བསླབ་གསུམ་སྒྲུབ་པའི་རྒྱལ་མཚན་འཛིན། །"
    },
    {
      "bo": "ཆོས་མཛད་ཡོངས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "བསྟན་པ་གནས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རང་ལུས་ལྷ་ཡི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "སྟོང་གསལ་ཡེ་ནས་ལྷུན་གྱིས་གྲུབ། །"
    },
    {
      "bo": "ཞི་ཁྲོ་རབ་འབྱམས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འོད་གསལ་འབྱོངས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གྲགས་སྟོང་གསུང་གི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "རྩ་གནས་ཡི་གེའི་འཁོར་ལོ་ཉིད། །"
    },
    {
      "bo": "རང་བྱུང་ཡེ་ནས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཚངས་དབྱངས་ཐོབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སེམས་ཉིད་དོན་གྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཐམས་ཅད་མ་སྐྱེས་མཉམ་པ་ཉིད། །"
    },
    {
      "bo": "རིག་སྟོང་ཆོས་སྐུར་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "རང་ཤར་རང་གྲོལ་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྣང་སྲིད་སྣོད་བཅུད་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཐམས་ཅད་ཡེ་ནས་སངས་རྒྱས་ཞིང་། །"
    },
    {
      "bo": "སྲིད་གསུམ་ཡོངས་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "མཉམ་ཉིད་རྟོགས་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "མཐའ་གྲོལ་ཀློང་ཡངས་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "མཐའ་བྲལ་གཉིས་མེད་ནམ་མཁའི་དོན། །"
    },
    {
      "bo": "ལྟ་བ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཕྱོགས་ལྷུང་མེད་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "འོད་གསལ་དོན་གྱི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "གསལ་སྟོང་གཉིས་མེད་གཉུག་མའི་དོན། །"
    },
    {
      "bo": "སྒོམ་པ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གསལ་འགྲིབ་མེད་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བླང་དོར་མེད་པའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "ཐམས་ཅད་ཡེ་ཤེས་སྒྱུ་མའི་ངང་། །"
    },
    {
      "bo": "སྤྱོད་པ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "གཉིས་འཛིན་ཞིག་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རེ་དོགས་མེད་པའི་ཕོ་བྲང་དུ། །"
    },
    {
      "bo": "རང་རིག་འོད་གསལ་འཕོ་འགྱུར་མེད། །"
    },
    {
      "bo": "འབྲས་བུ་མཆོག་ལ་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "ཟད་སར་འཁྱོལ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "དུས་གསུམ་བདེ་གཤེགས་ཐམས་ཅད་དང་། །"
    },
    {
      "bo": "མཆོད་འོས་རྣམས་ལ་དུས་ཀུན་ཏུ། །"
    },
    {
      "bo": "སྙིང་ནས་གུས་པས་གསོལ་བ་འདེབས། །"
    },
    {
      "bo": "འཕྲིན་ལས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "བྱམས་དང་སྙིང་རྗེ་འབྱོངས་པ་དང༌། །"
    },
    {
      "bo": "ངེས་འབྱུང་སྐྱོ་ཤས་སྐྱེ་བ་དང་། །"
    },
    {
      "bo": "ཉིན་མཚན་ཆོས་ཀྱི་འདའ་བ་དང་། །"
    },
    {
      "bo": "བློ་སྣ་ཐུང་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "སྣང་སྲིད་བླ་མར་རྟོགས་པ་དང་། །"
    },
    {
      "bo": "བྱིན་རླབས་རྒྱུན་ཆད་མེད་པ་དང་། །"
    },
    {
      "bo": "དག་སྣང་ཕྱོགས་མེད་འཆར་བ་དང༌། །"
    },
    {
      "bo": "མོས་གུས་སྐྱེ་བར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "རྟག་ཏུ་དབེན་པར་གནས་པ་དང༌། །"
    },
    {
      "bo": "རྣམ་གཡེང་འདུ་འཛི་མེད་པ་དང་། །"
    },
    {
      "bo": "དངོས་འཛིན་འཁྲུལ་པ་ཞིག་པ་དང་། །"
    },
    {
      "bo": "ལམ་སྣ་ཟིན་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚེ་འདི་ཆོས་ཀྱི་འདའ་བ་དང་། །"
    },
    {
      "bo": "རྟག་ཏུ་བླ་མ་མཉེས་པ་དང་། །"
    },
    {
      "bo": "སྒྲུབ་པ་མཐའ་རུ་ཕྱིན་པ་དང་། ། །"
    },
    {
      "bo": "གཞན་དོན་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ལས་དང་ཉོན་མོངས་ཟད་པ་དང་། །"
    },
    {
      "bo": "བྱང་ཆུབ་ལམ་ལ་བརྩོན་པ་དང་། །"
    },
    {
      "bo": "ས་དང་ལམ་རྣམས་རྫོགས་པ་དང༌། །"
    },
    {
      "bo": "སངས་རྒྱས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "ཚེ་འདིར་འོད་ལུས་འགྲུབ་པ་དང་། །"
    },
    {
      "bo": "བར་དོ་རང་ངོ་ཤེས་པ་དང་། །"
    },
    {
      "bo": "རང་བཞིན་སྤྲུལ་པར་སྐྱེ་བ་དང་། །"
    },
    {
      "bo": "དོན་གཉིས་འགྲུབ་པར་བྱིན་གྱིས་རློབས། །"
    },
    {
      "bo": "གསོལ་འདེབས་བདུད་རྩིའི་ཆུ་རྒྱུན་གྱི། །"
    },
    {
      "bo": "དགེ་བས་སྲིད་པའི་སེམས་ཅན་ཀུན། །"
    },
    {
      "bo": "འཁོར་བའི་རྒྱ་མཚོ་རབ་བརྒལ་ཏེ། །"
    },
    {
      "bo": "ཕྱམ་ཅིག་སངས་རྒྱས་འགྲུབ་པར་ཤོག །"
    }
  ]
}